{
   "1gks0cd": {
      "title": "Donald Trump is Elected 47th President of the United States ",
      "text": "",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "What a resounding rejection of leftist ideology. Looking forward to the next four years.",
         "LETS GET THE POPULAR VOTE",
         "[removed]",
         "I love seeing all the heads explode over on r/politics.",
         "MAGA",
         "Everyone looking at the results don’t get complacent! Go vote!!!!\n\n/s",
         "We did it!!!!",
         "Nail biter…. Not! What a landslide",
         "“First, they will ignore you, then they will laugh at you, then they will fight you, then you will win.” - Mahatma Gandhi",
         "Let’s fucking gooooo",
         "Like a fucking Phoenix. God bless America.",
         "Winning the popular vote and the electoral college is  incredible.",
         "What a nail-biter. What a bigly win in the senate too",
         "1- im thrilled 🤗\n\n2- someone give me the over under on hours until aoc makes a public statement that the reason they lost is bc they were \"too centrist\"",
         "I legit feel bad for all the people out there who think democracy is now dead and we’re going to turn into some sort of 1984/handmaidens tale type of dystopia. Some people are just so far removed from reality",
         "Talk about a natural high right now. This is so amazing. Please don’t be a liberal and be hateful right now. We won and don’t have to act like dicks. We will do a lot better being the bigger people and trying to unite and prove them wrong about us.",
         "I'm happy I don't have to look at Biden and Kamala's face every time I go to the VA anymore.",
         "God protect this man.",
         "I really don't know how to react right now. As much as I'd hoped for a win, almost all media institutions were in the bag for Harris so I refused to accept the possibility of a trump win. Even now, I still worry that they will find a a way to fuck me over. ",
         "This speaks volumes about what the people want. Random celebrities endorsements do not change elections, getting out and voting does.",
         "Goodbye Merrick Garland, \n\nGoodbye Antonio Mayorkas, \n\nGoodbye Admiral Rachel Levine, \n\nGoodbye Majority Senate Leader Chuck Shumer",
         "The country is healing.  Let’s make America normal again.",
         "Sanity prevailed.",
         "He won the popular vote with 51%. Fuck yes. Too big to rig.",
         "KAMALA—YOU’RE FIRED!",
         "I can go to sleep peacefully tonight",
         "I can't wait for him to appoint more SCOTUS judges",
         "I went to bed around 10:30 pm feeling hopeful but restless. I had the worst sleep ever but refused to check my phone until the morning. Waking up to a Trump presidency again is an indescribable thing",
         "Simple equation:  45 - 46 = 47",
         "A victory of historic proportions.",
         "![gif](giphy|jm4nsAWdCV4Lm)",
         "Has anyone cruised through r/Politics?  Do we have enough grief counselors on hand?",
         "So glad he also won the popular vote so we don’t have to listen to the annoying electoral college haters",
         "I think I pulled something smiling so hard this morning.",
         "They’re still trying to say they have a chance over at the Kamala Harris subreddit. 🤣 I tried to comment “no it’s over.” And it literally wouldn’t let me.",
         "Congratulations MAGA Army!! \n\n\nYou guys worked so hard with people like Charlie Kirk challenging kids to thought provoking civil debates, to Vivek and Tulsi patiently and kindly and non condescendingly, doing their part to explain to people what Trump is about. \n\n\nAnd Trump himself who is one hell of a machine to be able to do so many interviews and rallies just to get his words out there! And was able to refrain from insulting the left too much and focus more about his policies. \n\n\nAnd all the people that show up to vote and all the minorities on YouTube who spoke up for Trump!!!! \n\n\nYou All deserve this!!! \n\n\nI am so happy for ya all!! \n\n\nCongratulations!!!! ",
         "GO TRUMP!",
         "God bless this beautiful country!",
         "Congratulations America! 🇺🇸🤝🇨🇦",
         "Not only did he WIN, he increased margins in every state. He lost in the strong blue states  yeah but comparing results to 2020 and even 2016, he closed the gap hugely! Illinois was only 9 point difference. Could we be entering a new time in American history where we move red? One can only hope",
         "**Giant** middle finger to the AWFL agenda.  Love to see it.",
         "Dudes a legend. Let’s goooo! 🇺🇸",
         "Complicated business.",
         "Congrats from a Aussie",
         "Grover Cleveland no longer the only President elected to nonconsecutive terms",
         "BACK IN BLACK BABY!!!",
         "What a victory this has been! I came into this election optimistic, but very concerned that the Dems were going to find a way to cheat again. They said this was a razor thin election and that it was going to come down to the wire. The Dems, the liberal media, and the polls could not have been more wrong! \n\nIt was a decisive win and a return to normalcy for our country. One of the best (and hilarious) things starting today.. Kamala and Joe have two months left with each other in the White House. You know Lyin’ Joe probably thinks she ruined his and the Dem Party chances at retaining control and Cacklin’ Kamala blames Biden for ruining her campaign. You love to see it!",
         "Mr. Two Numbers 45-47",
         "DON'T CARE! GO VOTE! \n\n/s",
         "HALLELUJAH 🙏🏼🇺🇸❤️",
         "Thank you everyone in this community. I began posting over a year ago out of grave concern for our country. As a PA resident, I will strongly advocate for Mr. Trump the next few years. We won, but the work has just begun!",
         "all the trump nay says in the sub, get to eat crow this morning..",
         "Prayers have been answered.  Thank God!",
         "I'm so happy to be on the right side of history. What a momentous event and I'm so thankful I could contribute to it!",
         "That’s crazy. I joined the Marines back in Nov. 2016 right after Trump won the 1st time. I got separated last year but its crazy to think that if I woulda got out when my contract is up it would be right after he is inaugurated.",
         " LFG",
         "God bless America",
         "Well done guys. We've won.",
         "The main thing i feel is relief. We did it. \n\nNow the real work begins for Trump. And good luck to him.",
         "I wonder how quickly reddit will ditch Kamala.",
         "Flipped the senate and hopefully keeps control of the house it would be amazing!",
         "It's a beautiful day in the neighborhood! \n\nI want to see the women from The View be carried off the set in straight jackets",
         "Hey there, Democrats in the comments. I just want you to know that you are fundamentally, at your core, not good people. Everything you stand for is regressive, despicable, and wrong. You lost tonight because a solid majority of American voters, distributed evenly across our entire country, understood that fact and voted to reject YOU. I hope this helps to clear up any confusion you may have over what just happened.",
         "We're gonna keep the house right? Right?",
         "We did it folks. And we did it with a landslide.",
         "Nice.",
         "Thank God, the Republic will be spared.",
         "It's morning again in America",
         "What an amazing day to wake up to!",
         "Congratulations, folks. We've officially been unburdened by what was!\n\nNow, first order of business: when are these lovers who said they're leaving the country if Trump wins going to fuck off?",
         "Hell yes.",
         "That wasn’t just a knock, that was one of the biggest wins by a republican for president in my lifetime. Currently 5m votes up!",
         "That's the biggest part. Knock them back some, because they were taking a yard.",
         "Yes. I feel…happy. Things feel normal again. America has a fighting chance.",
         "Surely they will learn their lesson and become a better party and not run the same playbook after this election…. Right?",
         "I just don't want the pendulum to swing too hard the other way. I'm a centrist, I don't like extreme conservatism either. I want something in the middle.",
         "Imagine that! SCOTUS, POTUS, House, Senate, AND the fucking Popular Vote? People are fed up with democrats and I don’t blame them",
         "NYT is projecting Trump to win the popular vote by 1.3% 🙏🇺🇸",
         "Holding a solid popular vote margin is literally my dream.\n\nI'm really tired of the electoral college discussion.",
         "Give credit where credit is due. Trump is on the verge of the greatest comeback in political history. For 78 years old he's one tough SOB. He survived an onslaught of attacks -- physical, legal & political -- but never surrendered.",
         "Last post over there is from like 4-6 hours ago, around the same time all the astroturfing discords stopped getting paid.",
         "All the bots are gone. You can see way more conservative comments in there lol. It’s like the storm cleared",
         "Top posts there right now are a governor winning a race, Bernie sanders being reelected, and Harris winning Illinois lol",
         "My university’s subreddit and my dorm is melting over this. Love to see it but honestly scared how many people are brain washed from the democrat party.",
         "It’s soooooo funny",
         "Some of them are actually crying, when Trump lost I went to sleep - woke up and went to work, the grind never stops. The mods are curled up in a ball rn. ",
         "The people have spoken.",
         "We did it dude. This is amazing",
         "*Insert COD Modern Warfare music*\n\nMission complete. Good work.",
         "Went from Trump loss to don’t expect results within a week to calling it overnight with Trump still ahead in all remaining hot races. This is a landslide.",
         "I'd rather believe that Paul rudd and Mark ruffalo handing out water made the liberals need to pee and they got lost on their way back to the line",
         "I don't feel bad. I want them to experience 4 years of Trump to see that they are the ones who are crazy. ",
         "Father, son, Holy Spirit - Amen!",
         "Historical.  First presidential candidate to win three elections!",
         "No more “abolish the electoral college” talk and “democracy is in danger” from the left. We all k is that they’re going to complain but what will it be? They don’t even know, they’ll have to make up something totally new!",
         "I know what you mean. I am emotional. The left makes me feel like the world has gone crazy.\n\n\nAnd I am glad there is enough sane people left out there who just wants common sense to come back again! ",
         "nah they will double, tripple, quadruple down.. it's who they are...",
         "I hope so much they do. This has been a wild 8ish years politically",
         "We have an ongoing invasion of foreigners being funded by our government, dudes playing women's sports & changing in women's dressing rooms, kids being trans'ed, rampant inflation, and a pathetically weak foreign policy.\n\nIt needs to swing hard the other way, just to get back to the center.",
         "What the hell is “extreme conservatism?”",
         "The Dems only have themselves to blame… they’ll scream rAcIsM or some shit, but if they really want to help fix this country, they’d take a deep look inside.",
         "Do we have the house? I’m a little nervous about it. We need it. Hakeem Jeffries and Jamie Raskin cannot be the majority leaders",
         "rEpUbLiCaNs OnLy WiN bCuZ oF tHe ElEcToRaL CoLlEgE!!!",
         "Damn, democrats really liked the popular vote too. Gonna be nice not hearing them cry about it for a while. Right democrats?",
         "Nothing short of **fucking insane** how reddit nearly instantly became a ghost town with virtually no wild radical left wing takes. It was like a switch was flicked and the astroturfing/bots/kamala staffers just shut down completely. The voices of reason suddenly rose to the top and you weren’t bombarded with downvotes for any sort of moderate opinion. The change is real and it can’t be described how truly good it feels.",
         "Yeah I was wondering where their whereabouts were on that sub until now!",
         "That’s why they have their safe spaces, remember? ☠️",
         "Popular vote too lmao. What are their excuses going to be this time?",
         "Democracy has been saved!",
         "Whoda thunk it? I really thought he could actually lose to that cackling hyena.",
         "They already had four years of Trump without seeing it. Crazy people don't know they're crazy.",
         "Technically that goes to Roosevelt, but this is still amazing",
         "Couldn't have said it better myself.",
         "Basic principles that everyone believed in until five minutes ago, essentially.",
         "An abortion ban.",
         "Remember they were trying to make it so the popular vote determined their states electors votes? Where’s that now?",
         "Seriously it’s so wild. This tells me to buy Reddit options because they must have got $$$$ from the DNC which will look great on q4 earnings. \n\nThen I dump it all.",
         "Shareblue just died.",
         "A.billion dollars can buy a lot of shills.",
         "They are slowly coming back now\n\nDamage control and coping en route",
         "“America has always been racist and misogynistic” as much as I enjoyed these results, I absolutely can’t stand to think what the news cycle is going to be for the next 4 years.",
         "I would argue that not wanting  living human beings being terminated at the whim of their mothers is not an “extreme” stance.",
         "They should be prosecuted for violating election law and committing fraud.",
         "It's extreme because a total ban is not what the vast majority of Americans want.",
         "Would you call abolitionists extremists when it wasn’t the popular stance?",
         "I'm not going to get into this today. It's the morning after an election. Trump won. Focus on that for now."
      ]
   },
   "1gks87k": {
      "title": "We did it ",
      "text": "",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "Lmao Reddit corpos are holding back the floodgates. At time of writing, the post lists 48 comments yes only 11 are visible, exactly as you see on debate nights. They must be panicking, because the live-update was still on just an hour ago.",
         "Take the flaired users only thing off. Let in the haters.",
         "Thank God and thank you America for making it possible!!!  47!!!!",
         "#LET'S FUCKING GO!",
         "What a night",
         "Man how fucking bad of a president was Joe Biden that now Trump will probably win the popular vote.",
         "#WE FUCKING DID IT BABY!!!",
         "Apparently, Trump is also going to win the popular vote. That goes to show how unpopular Kamala and Biden are with voters at the moment.",
         "FREEEEEDOMMMMMMMMMMMM",
         "IF we've actually won, that first picture may well be the image that won this election.\n\nFucking iconic.",
         "An American comeback",
         "I just woke up. \n\nI logged in.\n\nI see this. \n\nI want to go to bed and log in again to see it.\n\n🇺🇸 I'm so effin' proud!",
         "I was having a debate with a liberal via private messaging the past day or two. I told him I would speak tomorrow to see how he is holding up after a Trump win. I checked this morning and his account was deleted. It feels so good!",
         "I'm glad America saw through the left's insane rhetoric.",
         "What an absolutely epic campaign he ran. The results are dramatic. Massive swings for Trump",
         "Mark Cuban just congratulated Trump and Elon on X!!!",
         "You ready to get tired of winning!!! I am!!!!  I dont care who you are, life is gonna be better, even if you dont appreciate it.",
         "trump defeated two candidates in one election. Legend.",
         "YOU GUYS DID IT",
         "Thank you to everyone that went out to vote.",
         "Right now he's even got a four million vote lead in the popular vote. \n\nSuck on that lefties!",
         "I’m so happy and ready to see some meltdowns. Then we need to show them we can come together, MAGA, and move forward with what is best for Merica!",
         "And there was no way this boss was going to lose this one—not after defeating *every single obstacle* they hurled at him. Well done, America. 🇺🇸",
         "“If you (try to) strike me down,  l shall become more powerful than you could possibly imagine…”\n\nProphetic, those words…the Dems never learned.",
         "I’m going to sleep so soundly the next 4 years knowing that TRUMP IS BACK BABY!!!",
         "What a great thing to wake up to. My state is blue, but the country is red.\n\nOne thing I noticed is that Dems put down Hispanic, Mexican, and Latino voters for wanting to vote for Trump. Huge mistake.",
         "Also, don't forget to report the hordes of leftists who are all over the site explicitly calling for violence against Trump and all Republicans.",
         "#LET'S FUCKING GO!",
         "What a night! I’m exhausted and have work soon, but I don‘t care. The amount of crying I’m going to hear today will energize me.",
         "Do they still have those mail-in ballots? Bring them in, it doesn't matter.",
         "That was a hell of a campaign by Trump and his team.",
         "Congrats from Canada!  \n\nI'm hoping Trump's win will cause our narcissist Trudeau to call an election so he can \"run against Trump.\"",
         "What a crazy ride these past four years have been. At least now we are on the road to recovery.",
         "Wooooooooo",
         "Feels like a 50 LB weight has been listed off my shoulders. God Bless America",
         "Same thing as 2016, I woke up at 1am to seeing him speak and Fox say he won!",
         "We fought, fought, fought. Now we need to fix this mess, put together the dream transition team",
         "Let the salt flow, I may not be a yank but I gotta say the are going be some very very funny days ahead of us.",
         "YEZZIR! Michigan voter in the house! We made a difference! Trump led by a pretty significant amount, not as much as I wanted because I feel that more people should have thought, but the indoctrination did not win this time!!! America is finally going to be put on a better path. The true dictatorship is over!",
         "This was the greatest campaign ever!!! President Trump is going down in history as the G.O.A.T.!!! he overcame so much opposition, and the odds were heavily stacked against him but logic and reasoning triumphed this time! I'm so happy because this country was going to be so screwed if these blue dictators got in there. now, the fight is not over, trust me, they are going to try something again and people have to be ready! Let's see how the Democrats act.",
         "Gonna be drinking liberal tears for years!",
         "What about the House? Last I looked, it looks iffy. Losing the House will greatly impede whatever positive change Trump can make.",
         "Let's not forget that he also got the popular vote. remember, to Dems this should be the metric.",
         "Yesterday, about half of the posts on my start page were from users I'd already  tagged as \"Election Shill.\"\n\nThis morning, there are two tagged users.\n\nThousands of Reddit user accounts just went dark.",
         "Right on. Open the gates!",
         "Time to dust off those liberal tears mug. \n\nI can’t believe we flipped senate and could possibly keep the house",
         "This is the first time in 4 years I’ve enjoyed getting on Reddit",
         "Seriously, this sub gatekeeps so much they keep out the legit casuals. It's not like everyone with a stealth account can't ask for flair",
         "Cheers, patriots 🍻",
         "Their pay cheques seem to have run dry anyway",
         "LET FREEDOM RING 🔔",
         "Even funnier if he surpasses the 81 million.",
         "[deleted]",
         "C'mon man, I've never heard such MaLaRkEy in my life!!!!!",
         "I didn't sleep at all.  Watching it unfold all night was more energizing than coffee made out of Red Bull.",
         "it's a relief",
         "LOL he's an ass kisser through and through",
         "Oh, don't kid yourself. They will resist any and all efforts to unite. This is when they prepare to terrorize Trump in whatever ways they can come up with.",
         "👍👍",
         "Yes!!!!! 👍👍👍",
         "It honestly hasn’t even fully set in yet…",
         "Amen amen AMENNNNN🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸",
         "Many people also hate trump but couldn't bring themselves to vote for Kamala so just didn't show up at all. Completely shocking that the candidate no one voted for didn't perform well!",
         "lol you are correct!  I really laughed when I saw it.",
         "I agree but I’ll be nice until I am forced to be an asshole."
      ]
   },
   "1gkqr0l": {
      "title": "Republicans take U.S. Senate ",
      "text": "",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "And Kamala's path to victory is growing more narrow than Hank Hill's urethra.",
         "You love to see it",
         "#LET'S FUCKING GO!",
         "This is our redemption from the red wave that never really came to fruition. But people came to their senses when a woman who didn’t even win a primary - who Kanye West got more votes than in the 2020 primary - who has zero personality, like-ability, zero actual policies and absolutely NO CARE FOR OUR BORDER CONTROL OR LAW AND ORDER and just runs on abortion and actually erasing women and the gains made over decades for them, in place of trans “rights” bullshit. I am still holding my breathe but am feeling calmer and stronger and giddier as I keep refreshing my screens. The NYT needle keeps moving RIGHT and Trump has the electoral and popular vote at the moment. The people are speaking and we are SICK OF THIS SHIT and SHOWING UP TO SHOW THEM OUT!",
         "Praise God!",
         "This is the red wave that wasn't in 2022.  We're going to take the entirety of DC, and hopefully install new conservative SCOTUS members.",
         "Please stop! I can only handle so much winning!",
         "Am I blind? So many comments that I Can’t see",
         "The people have spoken:\n\nNO MORE NONSENSE! Time to fix what they broke.",
         "Unburdened by what has been!",
         "USA USA USA Freedom and Human Rights Win the Day!",
         "I went to bed early last night.  What a way to wake up this morning. \n\nWhiney Reddit posts about Trump winning? ✅\nOh we took the senate? ✅\nIt’s gonna be a good day? ✅\n\nHIGH ENEGRY, BABY THE TRUMP TRAIN IS BACK IN DC",
         "The question now is by how much.",
         "Anyone got the link to the reddit thread of the dude betting 10k on Harris?",
         "Liberal Tears taste great in my tea this morning!!",
         "LFG!",
         "That means republicans approve the judges.  Thank heaven.",
         "The work is not done! Time to make deals. I'm very hopeful Trump will get stuff done.",
         "Nice!",
         "Next, the house.\n\n\n\nCome on!!!!",
         "Now Kamala really needs to certify the elections results!",
         "While the tears are decision I am scared of the domestic terrorists.",
         "Lfg",
         "By the time this is over, the only job she could get is selling propane and propane accessories. ",
         "I tell ya what!",
         "Haha, but don't underestimate the cheats. It looked good for Trump early on election in 2020 too.",
         "Kamala: \"I lost\"\nMe: \"OMG, I love that for you!\" ",
         "WE OUT HERE",
         "Trump got more votes in the Dem primary than she did, haha.",
         "like i said to someone over on /r/politics - its like kamala harris, herself, the woman, did not want to win and did everything she could to sabotage it",
         "People realized, after 2022, how much this matters.\n\nWe told people \"Make it too big to rig\", and people understood the assignment this time.",
         "Amen.",
         "God had mercy on our country tonight.",
         "Amen! God is good, and the battle between good and evil is here, and we are prevailing 🙌🏼",
         "Clarence Thomas is the oldest at 76. By Trump's last year in office, Thomas would be older than Scalia was when Scalia died. Not sure if Thomas is a dead-ender too or if he'd rather retire. He's safe to retire now without being replaced by a liberal.\n\nAlito is only 2 years younger, but he hasn't been on the court as long as Thomas. So I'm not sure if he'd be as likely to retire.\n\nSotomayor is the next oldest at 70. Obviously she won't be retiring during Trump's term.\n\nRoberts is a year younger than her.\n\nThen Kagan is 5 years younger still, followed by Kavanaugh, Gorsuch, Jackson and Barrett, who is 52.",
         "This post is for flared users only - every other comment is hidden",
         "Right now Fox has him at 277.  And he's in the lead in all the remaining states.   He has about a 5 million vote lead.  The AP still refuses to call it.",
         "Democrat true believers still think that he is going to prison.  That should calm down any rioters.",
         "Why would anyone trust her with handling propane?",
         "She can always see if McDonald's will hire her back.",
         "Maybe she’ll finally land that job at McDonald’s",
         "Maybe selling cosmetics in a mall kiosk.",
         "Google just called WI a few minutes ago, crossing the 270 barrier.  Final result very likely to be 312-226.  It's finally over.",
         "*hwhat",
         "Choosing to remain positive for two reasons.\n\n1). Might be too many eyes on this one, after the previous theft.\n\n2). Margins starting to look \"too big to rig\".",
         "Can we have one fucking election where anyone isn’t being a sore loser and screaming “cHeAteRs”",
         "It’s like the democrats as a whole didn’t want to win either. They nominated someone that never won a single primary and only got the vice president position because of the color of her skin. What did they expect?",
         "They put up a shit candidate that nobody voted for and now, not enough people are voting for the shit candidate. ‘Blue no matter who’ doesn’t really work after all. Vice President Harris wanted it just people didn’t want Vice President Harris",
         "I've said that a few times about her too. As her ex-staffers have said, she's a lazy woman. And because of DEI, her race and gender, Willie Brown launching her career, and Democrats being automatic rubber stamp winners in California, she's never had to work for ANYTHING in her career. Biden picked her for DEI reasons, not because she did a good job in the primary. She was too lazy to study for the bar the first time and failed that too. She's not a hard worker. She expected to coast to victory in this election like she has in everything else she's done. She tried to win without even doing media appearances, but eventually got pushed out to do those when her poll numbers dropped. She only wanted this job IF IT WAS GOING TO BE HANDED TO HER, like everything else she's ever gotten. She had no desire to work for it.",
         "Arizona 2022 was a travesty.",
         "Let them.  The longer they wait the less legitimacy they display.",
         "Sadly i do not think they will let him live until inauguration. They tried fucking up the election  but thankfully that was too much of a  blowout. Their last chance is assassination before inauguration.",
         "The only thing anybody has trusted her to handle is Willie Brown's balls.",
         "Because she grew up in a middle class family. If she thought that was a good enough argument to be President, then it should be for propane.\n\n\nPlus, she's good at getting on her knees to get what she wants.",
         "\"Try this, I call this sample...coconut tree. HAAAAAHAHAHAHAAAAA!\"",
         "Landslide you say?",
         "You got a point. Also there's no flu-19 to save dems(and let them cheat as much) this time around🤣",
         "Nah I guarantee liberals are gonna have a meltdown and claim \"hacked election\" when they lose very soon",
         "To be fair all the coincidences last election were strange",
         "No. It's tradition.",
         "i honestly think they thought the \"woke\" movement was strong enough to carry someone empty of policy by using her as a proxy for their own\n\nit didnt end up working and i dont honestly know what was expected",
         "Did you see  Baron the kids like 8 feet tall no ones getting near Don. ",
         "This comment wins.",
         "You won.",
         "Wearing a mask now would just make them more noticeable.  Also Twitter became X.  That was so huge in this election.",
         "Russia.  Russia.  Russia.  The FBI just put out a report about election interference, suggesting it is coming from Russia and Iran.",
         "Democrats and Republicans equally included",
         "It's a classic case of white guilt and wokeness being self-defeating. They knew she wasn't a good candidate, but they couldn't pass her over because they didn't want to look racist or sexist. Leftism destroyed itself tonight.",
         "Trump should hire him for the Secret Service, LOL.",
         "It's looking really good right now. All blue cities are are cloudy rn, with 95% chance of liberal tears 🤣",
         "And X is now totally safe from persecution for 4 years, at least from the U.S. And Elon Musk is safe from losing government contracts in retaliation, except in California or other blue states.",
         "Lmao they are claiming same as they did in 2016, which was [proven wrong](https://theintercept.com/2023/01/10/russia-twitter-bots-trump-election/)"
      ]
   },
   "1gkrfb1": {
      "title": "Vice President Harris will not talk tonight",
      "text": "Just announced that they are shutting down for the night.  Just like 2016 when Hillary was losing to Trump",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "A man came out to address the crowd.\n\nShe really took the Hillary Clinton playbook and just RAN WITH IT!",
         "Every mainstream media outlet:\n\n55% trump\n45% kamala harris\n\n99% of the vote in\n\nTOO CLOSE TO CALL",
         "We have been unburdened by what has been.",
         "Lmao, she’s cooked. This is an admission of defeat.\n\nWe did it, boys. We fucking did it.",
         "I honestly wonder if she'll call Trump at any point to concede. I think she will literally refuse to talk to the man.",
         "If I had a nickel for every time a Democrat Presidential candidate refused to talk to her audience who worked so hard for her campaign, I'd have two nickels. Which isn't a lot, but it's weird that it happened twice.\n\nLosing to Trump messes with you, apparently",
         "She already tortured the nation enough.",
         "*sad cackling noises*",
         "She spent the entire campaign not talking. Why should this shock anyone?",
         "Georgia has just been called by Fox News for Trump. His first swing state flip.",
         "Kamala: You see, I am from a middle class family. Therefore I know how to watch people mow my lawn. After tonight’s election results, we won’t be getting electric busses. That’s a bummer. A bus that is electric that runs on electricity would have been a great bus. Okay, that’s all folks. Good night *cackles as she exits stage*\n\n\nThere I gave her speech for her hahahah",
         "Donald Trump is the only President in history besides Grover Cleveland to serve 2 non-consecutive terms in the oval office. God Bless America we made it happen.",
         "Now it's time for her to fade into obscurity as an example of why DEI is not a good thing.",
         "And to think this woman would be commander-in-chief of our military. She crawls in a corner when things go south. Good riddance.",
         "She really is Hillary 2.0. [They learned nothing from 2016](https://www.youtube.com/watch?v=GLG9g7BcjKs).",
         "But, I wanted a word salad with my Trump steak.",
         "Anyone see it? A total rinse and repeat of 2016 but even better 😁",
         "She’s drunk.",
         "She is hogging Biden's basement lmao",
         "Things are looking great for Trump. He’s over performing his 2020 numbers, and flipped Georgia back. With GA back in the red column and NC secured again, all Trump needs to 270 is Pennsylvania.",
         "Lmaooooo",
         "We are so back",
         "She’s probably getting hammered in a hotel bar.",
         "I’ve been waiting 4years for this….I drove my family crazy",
         "Tampon Tim lost all the joy.",
         "Hopefully this will end her political career",
         "And it’s over. She has no choice but to concede. Real 2016 vibes with this one lol",
         "How wasted is she? Rumors were that Hillary was sloshed in 2016",
         "This race needs to be called tonight. We don't need another overnight surprise. Trump is winning in every swing state except for one. This election needs to be called.",
         "I don't really care. Time to turn the page on Biden/Harris.",
         "It's 2016 all over again, I'm loving it.",
         "Shades of 2016",
         "Here comes the phobic/fascists/misogynists accusations",
         "I’m not going to bed until this shit is called.",
         "I heard PA was just called for Trump",
         "Hey can someone show r/politics the super hilarious smug meme face she made during the debate? Sure seems apropos now.  >!/s!<",
         "This race needs to be called tonight. We don't need another overnight surprise. Trump is winning in every swing state except for one. This election needs to be called.",
         "That's how entitled I believe she is, she is probably screaming and blaming someone for her failure behind the scenes",
         "She will concede tomorrow morning. I'm sure Joe won't even be up yet lol",
         "We did it folks!",
         "She's a coward and a phony. I expected nothing less.",
         "no wonder, she thought she was going to win.  Must be drunk off her ass after that beatdown.",
         "Watching everyone stream out and the media say maybe tomorrow maybe Thursday was hilarious.",
         "Not a good sign. I saw video of Kamala supporters leaving looking very disappointed",
         "Such a childish, pathetic move. I expected nothing less from her.",
         "What would she say? \n\nZERO days! We have zero days to get it done! I've worked all my life to fight for people who harm other people! I'm from a middle class family! And that family is today! Which is the context of all that we exist in the coconut tree! The passage of time on yellow school bus is like a venn diagram! <cackle cackle cackle>",
         "She is just doing what she did most of the campaign.  Go take a nap.",
         "SHE IS FINALLY UNBURDENED",
         "Next thing you know they are going to open an investigation into Trump beating two women on live television then giving a speech about it.",
         "She’s too drunk lol",
         "I have PTSD from Biden shutting down for the night.  It's not over yet.",
         "So that means that keeps the streak alive that no Democrat has conceded defeat on the night of the election in this century.   \n\nAnd we are the election deniers...",
         "Of course she's not going to speak.\n\nShe's not even literate. She'll need at least 24-48 hours to work with her team to help her sound out all the parts of her concession speech phonetically.",
         "Teleprompters broken?",
         "Downvote me please",
         "#F",
         "We did it ladies and gentlemen!",
         "If Harris was honest about this whole travesty, she's probably relieved that she didn't win. [Hopefully Trump gets three more EC votes. It'a 2:53am]\n\nShe had a very ignoble start to her adult career and it was continuing on how she became the Dem Party nominee.\n\nNot exactly a shinning record to be proud of.\n\nWillie Brown is probably happy also.",
         "Maybe she’s busy turning pages.\n\nBut seriously, I hope we never hear from her again.",
         "Can she not talk for the rest of the year? Perhaps the decade?",
         "Can't wait for Kamala to copy Killary's followup of 4+ years of \"I should have won!\" and \"the election was stolen/it was the Russians blah blah blah!\"",
         "Of course not!!!",
         "We did it!!!!!!",
         "Absolutely cooked",
         "Sounds like we just keep winning.",
         "Has she ever really talked?",
         "Does anyone even want to see her talk? Let’s just skip all that and get to the Trump cheated part that’s sure to come",
         "Will she succeed  on the phone I don’t want to hear her speak that voice",
         "Glad we dont have to hear anything from her",
         "![gif](giphy|IQBk8kjeueJW3DLiNJ|downsized)",
         "that's so weird....",
         "Zero class.",
         "so she will not concede the election. hmmm, what about democracy???",
         "this has pretty much been the biden answer for everything now for 4 hours. give  us that shit eating grin and walk off stage...",
         "lol no chet",
         "Lolololololololololololololololololololololololololololololololololololololololol",
         "She’s being unburdened by what has been",
         "A lot of those people, who worked the \"ground game\" for Harris/Walz, they worked really hard. I might disagree with most of their politics, but to leave all those people who put in so much effort for you, to leave them hanging like that, it's shameful.",
         "Can’t even _lose_ in an original fashion. Every step of her “campaign” was fake and lies. Only the unbelievably naive believed her.",
         "WHERES THE JOY",
         "Two sides of the same coin.",
         "In some states it was closer than that though to be fair - but yeah major news didn’t want to call it lol",
         "We have been unburdened but what might have been.  ",
         "We’re unburdened from a has been",
         "I won’t relax until all the fuckery on votes is over, I expect 3Am results.",
         "I'll celebrate when he's literally in office lol",
         "God bless America.",
         "She'll have to acknowledge this loss when she personally has to certify the election",
         "As far as I know, the only time they talked to each other directly was the debate, and the 9/11 memorial 1 day later",
         "Edit, I made a bad joke about her calling him Hitler. \n\nMy point: she can choke on every nasty word she called us, like she choked on Willie Brown’s d*ck",
         "I think she will. She shook is hand at the debate and at another event. They seam cordial.",
         "Trump should refuse to take the phone call of whomever calls his campaign and have them speak to one of his aids while he addresses the nation.",
         "If she does, it will only be after her speech writers have prepared a statement and set up a teleprompter for her to read it from.",
         "At the end of the day, there’s no requirement to concede, but I wouldn’t think she would anyway.",
         "Democratic presidential *woman candidate",
         "She only has 1 speech. They don’t know what to say for this situation.",
         "Can this be on murdered by word or whatever sub it is?",
         "Lmao I’m imagining it",
         "And they both have cool-sounding names with first names shared by famous children's characters.",
         "Amen",
         "She's basically the worst parts of Hillary and Obama put together. As if they had a child that's slower, dumber, lazier and less talented than both of them.",
         "I never saw this the first time, incredible. And so realistic even know.",
         "ha ha",
         "The shock and awe on CNN was the best part of 2016, when they were trying to make sense of the results. It was much more clear this time around",
         "It was worth it.",
         "He can now go back to full time coaching.",
         "He’s now winning in all 7 iirc",
         "Disagree. Let it play out in full and legally.",
         "By Fox,  New York Times has not called it yet",
         "But she won’t like what can be!",
         "That coconut finally got her?",
         "Sad cackling and crying engaged",
         "Through the grace of God, we are my friend! We are all finally unburdened 🇺🇸💕",
         "Trying to unburden from what will not be.",
         "I hope Trump says this at the inauguration",
         "We’ve all been unburdened by what has been",
         "She's unburned by what IS, now.",
         "Back stage feasting on her word salad?",
         "So, so many Harris signs everywhere. If there was one Trump sign, you’d see 2 or more Harris signs. Funny that..the loudest in the room loses bigly.",
         "Agreed. \n\nI want the video of them crying.",
         "Just wait the Dems in the house will refuse to certify the election",
         "Too big to rig. They definitely tried but you could see them realize they wouldn't be able to pull it off.",
         "Trump winning this big pretty much shut all of the chances of fuckery down.",
         "I FORGOT ABOUT THAT! Oh man. That will be television gold! I can't wait.",
         "That's why VP's shouldn't run for president",
         "I wonder if she'll resign as Vice President in protest. Actually, Congress approved [new election rules in 2022](https://www.pbs.org/newshour/politics/congress-approves-new-election-certification-rules-in-response-to-jan-6) that say the Vice President's role is purely ceremonial and can't change the winner. So she could just refuse to show up, and it wouldn't stop the process from going forward. If she is planning some kind of political life in the future as a figure to appeal to the hard left, she might go that route.",
         "They'll probably be running into each other at the White House over the next few months during the transition process. She won't be able to forget about him that easily\n\nMust be great to be in Trump's position right now",
         "That was an attempt at a strategic power move either for him or for the audience. There's absolutely no way that was a genuine moment.",
         "Yet she calls him a fascist, nazi, Hitler, etc. If they're cordial, that shows just how fake she is.",
         "No he should be the bigger person and speak with her. Act presidential and try to unite our country",
         "Democratic presidential woman candidate \\*who launched her career by sleeping with a male politician",
         "She and her teleprompter knows what’s up",
         "This is the one time I will agree if she blames Trump",
         "She’s trying to figure out how to work in that she’s from a middle class family.",
         "Their mods are probably on suicide watch now.",
         "They won’t let it!",
         "That video of it sinking in for the Young Turks is Youtube gold!",
         "Looking forward to watching TYT meltdown 2.0",
         "will be* ftfy",
         "I think even they lack the boldness to do that.  Hopefully they know many will call to break out the gallows if they try any such thing.",
         "It’s too big to steal. Polymarket is a hidden god send in this election as it’s basically over there and so much money is in. \n\nThere are WAY more eyes on this election than 2020, people will absolutely not accept a steal this time, especially when they have millions of dollars on the line",
         "I will be laughing and laughing. ",
         "I'll make a huge bowl of popcorn for this one 😈",
         "Al Gore had to certify G. W. Bush's election, so, that's about as extreme a version of this situation as we'll ever have. Just found a clip of it and Gore handled it well actually, with some humor.",
         "Exactly. How are people still falling for this? Democrats had eight years to be cordial they were exactly the opposite. I do hope they finally do some self reflection though. For the good of themselves and the country.",
         "That’s true. But guarantee he’s thinking \n\nhttps://youtu.be/kDuLHEoS45s",
         "ididthatsticker.png",
         "when will Bono drive off a cliff, and where can I watch it?",
         "Nice job Deplorable Garbage",
         "I said it like that cause it fit her \"catchphrase\" but I like your edit better!",
         "I think you underestimate the power of TDS.  They tried to impeach him twice -- the second time after he'd lost a re-election bid, and after the Chief Justice refused to countenance the sham proceeding by overseeing it.\n\nThey tried to bankrupt him & jail him.  They tried to have him removed from state-wide ballots by unilateral diktats from partisan Dem Sec-States.  They mobilized the FBI, CIA, DOJ and media against him.\n\nI'll bet the farm several Dems refuse to certify.",
         "I get it, it must be very stressful.  After all, it's entirely up to them to protect their democracy from the will of the people."
      ]
   },
   "1gktlf7": {
      "title": "Not a single post about the us presidential election on the popular page of Reddit. Wow. ",
      "text": "There’s not a single post about trump winning the election. Which is funny because for over three months they’ve been pushing hardcore leftist propaganda. It’s funny how quickly that propaganda machine shuts the fuck up when they lose. \n\nAlso the next few months are going to suck for Kamala lol ",
      "comments": [
         "It really is incredible. I sincerely hope, for a select few, this will be extremely eye-opening. To just be embattled every single day, pumped full of so much hate and disdainful rhetoric. For what? And what now? Surely, more than a few lucky ones will come to a realization.",
         "All the bots are malfunctioning lmao",
         "First, they are all crying and fearing for their lives somehow (lol). Second, Biden is still president, not Kamala. \n\nKamala Harris will disappear from the spotlight forever after the next couple of weeks. Her political career is pretty much over. The nation emphatically rejected her.",
         "Why are all my notifications just..not working right now? I had so many Harris voters reminding themselves of my trump posts and I wanted to see how they were doing. And so many Harris posts deleted. Bots and cowards, methinks. Trump trump trump wooooo!",
         "It's *their* space, really. They're just letting us use the subreddit.",
         "I have so many subs muted it’s basically kittens gifs and memes.",
         "Hahaha.  Liberal Tears are wonderful in the morning!!  Goes well in my tea.",
         "Not only that, but in my local sub there's actually a post demanding us to \"be quiet.\" It's wild.",
         "Every discussion I have tried to post of the left subreddits has been deleted. Lol",
         "Yep. Just went there. Crazy that there are 8hr old Democrat posts still on the front page.\n\nI'm loving this.",
         "And I've checked several powermod accounts and they've all been silent for 8+ hours. Funding was cut, is my guess.",
         "AP has not called it for Trump. They are ridiculous.",
         "I’ve muted and blocked so many subs that showed up as “you may be interested in”. Most were r/somelocaltownnearme. All of the posts I was shown were anti-Trump and would have insane amount of upvotes.\n\nI’m convinced they were Reddits way of trying to influence me to change by saying “hey look how people in Summerville, SC or Wilmington, NC, your neighbors, feel about Trump” you should too.",
         "The censorship is real. But we won’t let that stop us.\n\nMAKE AMERICA GREAT AGAIN!!!!\n\n🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸",
         "The international bots working hard while America sleeps.",
         "You mean like daily passive aggressive posts on pics that endlessly tried to drag on Trump, for idk, the last year or more? Or not just pics but basically all the main subs?",
         "[removed]",
         "Just shows the level of political BS on Reddit.",
         "To be fair, popular is most likely calculated from total upvotes. They're downvoting all the posts in the pro-Trump subreddits.",
         "Really wild how the topic invaded even unrelated spaces on this platform and now just nothing. Reddit doesn't care about the election all fo a sudden",
         "This is about as significant a repudiation of leftist politics as we could have hoped or dreamed for",
         "They'll attempt to crack down even harder on \"misinformation\"",
         "I thought it would be eye opening for people after seeing how quickly the kamala bots/vote manipulation/astroturfing was",
         "Sadly I think people are so far dragged down the disreality hole that self-actualization is not something they can do. They've been told they're right and everyone else is wrong for 8+ years now, why stop? A change in facts to the contrary has never been enough to override that.",
         "It's just going to be like 2016-2020 all over again. 4 years of trying to go after him again",
         "The silent majority, tired of being mocked and discriminated against, took a stand against tyranny. Justice prevailed, at least for a short while. Groundwork must be laid in the next four years to keep the Dems from going right back to bulldozing the US with Marxism if they win in 2028.",
         "And clearly the bots have been disabled.  Given the numbers we usually see, we’d expect to see more crying and whining posts.",
         "No, they just aren't being funded anymore.",
         "She’ll slink back to CA and be involved with their politics. Hopefully at the state level.\n\nI never want to hear that whiny, nasally, shrill voice ever again.",
         "I just love that the first time she had to rely somewhat on merit instead of giving BJs or DEI she miserably failed.",
         ">  they are all crying and fearing for their lives somehow (lol)\n\nThey are the goddamn weakest people on earth. Literally living in the most privileged, richest country on earth yet they think they are oppressed.",
         "How much you want to bet Biden either resigns or gets 26th’d sometime between now and January and Kamala still gets to claim first female president",
         "The country and party rejected her the first time, but she was a token African American/ \nAsian minority female pick for VP, so that’s all they had to run with.",
         "She can write a book, \"What Happened Again.\"",
         "Mine too, I can’t see any of the people who replied to me.",
         "Sipping a cup right now to Trump, I’ll pour another cup for you! ☕️",
         "Well I hope liberals and conservatives can work together. Nothing is accomplished in this country without bipartisan support.",
         "More than that. People will begging to question their echo chambers and hopefully begin to seek the truth ",
         "The sudden realization that the various echo chambers on Reddit are actually not reality is really interesting to watch unfold. If it was winning the electoral college but losing the popular vote, they would have that to cling to. But they have neither. And it’s “interesting”.",
         "100% It’s a beautiful thing to witness",
         "Her voice and the way she speaks is like nails on a chalk board. You could play just her speaking over a loud speaker as torture; I’d tell you absolutely anything you wanted.",
         "I wouldn’t hire to be in charge of the dog catchers but hey that’s just me.",
         "...only with a big fat ✳\n\nTRUMP 2024 ❤🇺🇸",
         "Why would Biden do her the favor?",
         "Technically she already was when he had surgery or something like that (for a day or two).",
         "It feels so damn good",
         "They'll hold onto the fact that 15 million less people voted for the Left than last time and overall turnout was down from 2020. I'll call it right now that's what they go after instead of looking at themselves.",
         "So quiet!",
         "Because he has no clue what’s going on and their handlers dictate everything",
         "Yup, now the only way they can \"save democracy\" is to force mass mail in voting because suddenly the normal way will be disenfranchizenent or something",
         "I think he’s lucid enough to be unhappy about his treatment.\n\nHe definitely has some days that are better than others though. Most of them seem to have been post force out though."
      ]
   },
   "1gkrq8n": {
      "title": "NYT: Trump Projected to Win the Electoral College AND the Popular Vote",
      "text": "",
      "comments": [
         "Mfw the nyt and i agree, jill biden is in a full maga pantsuit, and djt pulls off the biggest comeback in human history all in the same day 👀",
         "Now the House please...",
         "Juan Williams is pulling the “racist” card on why trump is winning on Fox News 😂😂😂😂😂 cope harder Juan!!",
         "Love him or hate him, Trump goes down as one of the most influential figures in human history. Easily top 50.",
         "TOO BIG TO RIG",
         "Fox News just projected PA for Trump!!! We won!!!! Alaska is for sure going Red and clinching it",
         "It’s over. It is fucking over.\n\nBig tech censorship is done \n\nIllegal migration is done\n\nAmerica is about to be back baby!!!!",
         "NYC oligarchs. Get your helicopters on the ready.",
         "![gif](giphy|FbiL9rsmZN3ib2JSGo)",
         "legitimately amazing if he wins the popular. When was the last time a Republican won it? You can tell people are just truly dissatisfied with the direction of the country. Trump is the most divisive candidate who has ever run and he's still getting this many votes. This is a turning point.",
         "#FJB",
         "I’m so happy today! Let’s win this!",
         "Cue YMCA",
         "I live in Europe and woke up at 2:30 am to watch the coverage. I got 2 hrs and 45 minutes of sleep. It is going to be an AMAZING day!",
         "That’s why he campaigned in blue states. You still need to help the down ballot candidates, and energize the conservatives in states you’ll lose.",
         "One of the greatest Presidential Campaigns in history. And after an assassination attempt.\n\nWhat a time to be alive.",
         "Too big to rig!",
         "They got the trifecta in 2020, let's get it back in 2024!!!",
         "Did **not** expect this",
         "Now will come the inevitable leftist turn on Kamala as well. They get really ugly when they implode like this.",
         "I wanted this to happen, i didnt think it would, but it has.",
         "All credit where it's due. I genuinely didn't think Trump could pull it off, but here we are. Let's hope we can use this win to make some lasting gains for the American people.",
         "President Trump pulled the greatest political comeback in history. After all, he wrote The Art of the Comeback.",
         "It doesn’t get much better. Electoral College and popular vote. The lefts can’t blame the electoral college this time.  The house will be the icing on the cake.",
         "Ignore this.\n\nJust VOTE!\n\n/s",
         "BEST. DAY. EVEEEEEEERRRR. 🥳😅❤️❤️❤️❤️",
         "Really happy he won the popular vote. I know it is how it works, but it’s better for the country when the winner also gets the popular vote. ",
         "gg ez",
         "How sweet it is\n\nWas it too big to steal or would they have not cheated anyway? We'll never know but I feel it's the former even in victory",
         "Red Wave is in effect",
         "So Glorious! MAGA!",
         "The first GOP candidate since Reagan. This is a mandate.",
         "Now do you think the left and their media minions are going to say that we need to get rid of the Electoral College AND the popular vote?  Just wondering out loud...",
         "It's going to be a great day for America tomorrow morning! God bless America! MAGA!",
         "Put her on the cover of Vogue again, I'm sure that'll turn this around for them",
         "The House always wins",
         "Houe is going to be close. If we win all the races we are currently winning in and lose all the races we are currently losing in, we will have a 221 majority Houe (majority is 218, so we will have a \\~6 vote buffer). But as we learn with any cycle, with that many people, all it takes are a few to be sick, pass away, resign in disgrace and suddenly the majority is no more. Unless some shocking late results come in, control is going to be razor thin.\n\nThe Senate, however, I figured was most likely to go 51-49 before the election, but the fact that we are now 52-48 and *leading* in 3 yet-to-be-announced races is astounding, and 2 we are losing in that still hasn't been called (Arizona and Wisconsin). The fact that we could pick up another 1-4 (5 in our wildest dreams), but even just 1, is amazing to me. Each one of those additions will add security for the 2026/2028 elections to make it harder for democrats to regain control in those cycles.",
         "Yeah, that was hilarious",
         "Reddit bubble in shambles. Talking about crying and pointing blame and name-calling",
         "Oh my god, what was with Fox tonight? He was rambling for like 10 minutes, I turned it on at 10 and couldn't make heads or tails of the results!!",
         "Out of the three campaigns I liked him the most on this one.",
         "Agree that he is at least a most influential man in American history.\n\nWhat ordeals he’s had to overcome to get to this point: lawsuits, lawfair, trials, two assassination attempts and possibly a third one, and that doesn’t even include all of the other stuff in the background like the biased legacy media and big tech constantly going at him and calling him Hitler. He didn’t need to run again, but he did. What a fighter and what resolve.\n\nTruly a great American!",
         "The Greatest President in sports entertainment history!",
         "He did what I said he should be doing for the prior 8 years. He learned to stop running his mouth so much. Good for him!",
         "He's the most famous person in the world. And his greatest achievement as president has been waking people up to the fake news.",
         "With this, he surpassed Reagan, Lincoln, and Jefferson. Time to add him to Mount Rushmore.",
         "Deportations need to start January 21st",
         "Bush won the popular in 2004 - last time the GOP candidate won it!",
         "This is as much a referendum on the mainstream media as it is Joe Biden, Kamala Harris, and the Democrat party. It was Trump himself who was divisive in 2016. But it was the mainstream media who have kept it that way ever since. It's safe to say they are no longer the mainstream media.",
         "The reality compared to 2020 is that he got 3 million less popular votes...Harris lost 15 million popular votes compared to Biden.",
         "> legitimately amazing if he wins the popular. \n\nHe did, from what I'm seeing. 51.0% to 47.3% on RCP as I write this.  Truly an amazing win.",
         "I actually would love to hear what he (and his handlers) are saying in private now. Sure, their fault for getting Harris in the first place in 2020, but he's gotta be rubbing it in their faces that he could have done a better job even with his dementia.",
         "Same man",
         "TWO assassination attempts.",
         "This was huge for the program. EC, popular vote, senate, and likely the house too. No margins for complaint, they’re just on the wrong side of history.",
         "This is how we got here, though. \n\nJust going out there and VOTING.",
         "He seems on track to get close to his 2020 vote total, mysteriously millions of Biden’s votes have not materialized.  It’s so strange, wonder why……😏",
         "Tomorrow’s gonna be a great day",
         "Watching /r/politics implode last night is going to be a treasured memory of mine.",
         "Same. The coalition we’ve put together is pretty impressive. Such a positive message",
         "He was different. Yes he went on and on with the rhetoric, but overall his message was always about unity, growth, and patriotism. I am proud that my wife and I have caught nearly every rally since Butler, PA, and watched this man remain consistent and positive.\n\nHe came off as a grandpa, *America's Grandfather*",
         "The last few weeks were great. While he was out having fun, and making jokes, the other party was trying to explain themselves nervously. It didn't look good for Kamala",
         "Yeah, what he's had to overcome is nothing short of immense adversity. The lawfare was crazy, and the assassination attempts (on both his body AND his character) were just unceasing. It's absolutely absurd how frequently and vehemently the mainstream media painted him as Hitler, or a fascist, or a racist, or a phobe, or whatever else, or all of them at once.",
         "Nah, Washington and Lincoln clear. But Trump is a close third.",
         "But then who will clean our toilets? -kelly osbourne ",
         "Bushy was more popular than we thought at the time. Too bad he and Cheney turned into Mitten the kitten",
         "And that was by a ghost of a hair, Trump is going to win by millions.",
         "Yup. The mainstream media needs to die. It's obsolete, disingenuous, and full of shill garbage. It's time for it to end.",
         "I look forward to if he slips any snide comments in during any future press meetings they let him have. Or are they just going to make it official that he hasn't been the president for the last few months?",
         "Actually it is entirely possible for Kamala to 25th amendment him, become the 47th, and make Trump technically 48th before he gets sworn in. He will most likely give quiet remarks in private, but he's not going to do anything too big in public.",
         "I also wouldn't be surprised if this happens given how little we've seen Biden in the last few months."
      ]
   },
   "1gkt12n": {
      "title": "Donald Trump is Elected 47th President of the United States ",
      "text": "",
      "comments": [
         "Thank god we don’t have to listen to cackles for 4 yrs.",
         "This is the best day ever. Seriously",
         "God bless the US fucking A",
         "We got it all! We got the president, the senate, the popular vote and most likely the house. The people have spoken, and we’re not backing down. They fucked around and found out 🤣",
         "Best part is, Kamala has to sign off of the election results as part of her duties as VP. Oh to be in that room and see the look on her face as she signs off on it!!",
         "ABC cbs nbc cnn are still talking path to victory",
         "Best fucking cake day ever!",
         "TikTok is full of people crying. \n\nMy generation is so lost. \n\nFunny thing is, young voters came out for us! Including me! \n\nYAY!",
         "#HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA *gasp* HAHAHAHAHAHAHAHAHAHAHAHAHAHA!!!\n\n#🤣\n#😂\n#🤣\n#HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH!",
         "💯🇺🇸",
         "I live in a blue state, can't wait for tears to flow\\~",
         "LFG ya'll. CANNOT WAIT for the next 4 years.",
         "Congratulations USA 🇺🇸🤝🇨🇦\nNext it's time to get Trudeau out!",
         "Komunistla.... You're Fired!!",
         "I dunno, I'm kinda of this morning re-thinking my values.\n\nin honor of Biden, next year, lets expand the Supreme Court. It is what they wanted to do.",
         "And her idiotic laugh.",
         "Like all leftist democrats and the MSM, they’re delusional. There’s no chance Kamala can win now."
      ]
   },
   "1gkvs6p": {
      "title": "The AP has declared Trump the 47th President",
      "text": "",
      "comments": [
         "We did it, Peanut, we did it.",
         "Good work. Scott Presler is an American hero",
         "The world is healing. Thank you ameribros ",
         "Congrats to everyone who waited 4 years for this, and voted to bring it about.",
         "They called us deplorable, they called us garbage. Well this is what they get. \n\nMAGA!",
         "We did it boys! God bless America!\\~",
         "they're going to stop calling *over half* of the country nazi's now, right?",
         "TRUMP TRAIN 🇺🇲",
         "Well deserved! President Trump is the most hardworking President I've ever seen.\n\nThis was the greatest political comeback in history, brought by the man that wrote The Art of the Comeback.",
         "Impossible. Reddit told me the Selzer poll portended a Harris landslide.",
         "Too big to rig!",
         "I'm of course excited to get the white house back. But I'm actually excited to see RFK Jr, Elon, Tulsi, vivek and JD in this administration.\n\nThere is genuinely good ideas and good people in trumps corner this time and it'll be fun to see what they can accomplish.",
         "BREAKING: Donald Trump is elected as the 47th president of the United States, ABC News projects\n\nhttps://x.com/ABC/status/1854115127794045269",
         "PRAISE GOD! PRAISE ALL YOU - AND US - PATRIOTS! I am so THANKFUL and GRATEFUL TODAY! I will do my personal best not to gloat, and it will be hard, but man I am finally feeling the love and energy and synergy that we conservatives know we have, and that we have been talking about and planning for a long time now. God bless you all and may we enter a new phase of power, prosperity, moral restoration, conservatism, and overall positive momentum for our country! May God bless you and your families over the next 4 years and beyond. THIS IS A GOOD DAY! Let us REJOICE AND BE GLAD IN IT!",
         "God bless America!",
         "So did we get the popular vote, house and senate too?",
         "![gif](giphy|ExVqsLgEsODNwi68C6|downsized)",
         "It still feels like the Democrats wanted to lose. Like they know after all the shit Biden has allowed to happen is all gonna catch up and make the next 4 years awful.",
         "I love you all. In 2016, we memed a man into the White House. In 2024, we built a coalition. It's time to govern like champions.",
         "Oh, man, this line from their [\"election takeaways\" article](https://apnews.com/article/trump-harris-presidential-election-takeaways-d0e4677f4cd53b4d2d8d18d674be5bf4) is just plain insulting: \"He talked right past the facts and through relentless repetition convinced voters.\" Sounds like an MSDNC editorial. They're claiming that there is no problem with inflation or immigration, and Trump just made it up. 😆",
         "Happy to be on the right side of history!",
         "Canada is next my friends to the south.",
         "I'm just happy we can all claim to have lived through and survived Joe the Usurper's reign of incompetence.\n\nHistory will not be kind to those who foisted those last 4 years on us.",
         "I can’t wait to see what the hosts of The View are going to do today!!!????   🤣🤣🤣🤣🤣",
         "For Peanut. For Harambe.",
         "Peanut’s death shall not be in vain.",
         "Tails out for Peanut.",
         "The red wave is here! After everything they threw at him, he pulled through. A true, American hero.",
         "It's always darkest before the dawn.",
         "So glad that I can say that I voted for Trump thrice in a historic win.",
         "They called him \"Hitler\". That was sick.",
         "Anakin looking",
         "Hopefully. The Dems SERIOUSLY need to take a step back and look at the type of rhetoric they constantly espouse.",
         "Do they seem like the type who learn lessons?",
         "Can't stop won't stop!",
         "It's like a movie. The phoenix has arisen from the ashes.",
         "r/politics is an absolute DUMPSTER 🔥 right now.",
         "That's right! A clean sweep of all 7 swing states. Can't get any more decisive than that.",
         "This is genuinely the happiest and most excited I've been in a long time. Today is a happy day.",
         "Amazing.",
         "Hallelujah, hallelujah, God is good.",
         "Let freedom ring, let freedom ring 🔔",
         "According to the AP as of right now (excluding any shenanigans), yes.",
         "Nah brah gotta keep it positive. Trump is gonna MAGA.",
         "Time to put America first!",
         "Everything the Democrats say about Trump is just projection.",
         "We narrowly dodged (metaphorically and literally) a potentially very, very dark timeline. The future of America is bright now. She is saved.",
         "We can only pray.",
         "Just makes you wonder what fuckery really went on in the 2020 election. Harris is down like 15 MILLION votes compared to Joe. It's glorious.",
         "Me either. Time to grab some popcorn tho. Salty lib tears never tasted so good.",
         "and Fred",
         "For Fred as well. Those little fellows didn't deserved what happened to them.",
         "Dicks out for Harambe, nuts out for Peanut.",
         "Happy Reddit cake day!",
         "The right wave across the globe begins!",
         "Before the Don. 😉",
         "Lucky for them he's just a badass grandpa.",
         "Uuuuuumm...",
         "Amen brother (or sister lol) And oh man, and it’s your cake day?!? The sweetest cake day EVER!!! Happy and Blessed one to you good patriot! Enjoy every minute of it!!",
         "Everything that has happened in the past year leading up to this moment has been absolutely insane.",
         "There is a study, strictly stats and probability, that analyzed the vote dumps that gave Biden the election in 2020.  I'll dig up a link to it later this morning but the authors summarize sections trying to relate the statistical improbability of each vote dump by relating it to things we might be able to grasp.\n\nThings like (these will be inaccurate in terms of numbers because I can't recall exactly) \"winning the Powerball lottery 13 times in a row\" or \"drawing a royal flush 25 times in a row\"...that sort of thing.\n\nWhat went down in 2020 was massive cheating...all to elevate a man that Obama could control to do...whatever it was he tried to do to our country for 4 years.",
         "Thank you! It's cake day and also a glorious day to be an American.",
         "Loool 🤣🤣🤣",
         "That should have been a campaign tshirt: \"Remember kids: it's always darkest before the Don\".\n\nWoulda sold like hotcakes.",
         "Truth is stranger than fiction.",
         "I'd love to see that link. I swear when I went to sleep on November 5th, 2020, Trump was winning handedly. Then I woke up to a nightmare. I was like how the fuck???"
      ]
   },
   "1gkt9nm": {
      "title": "Yes",
      "text": "",
      "comments": [
         "It felt so good voting for Trump in deep blue misery.",
         "I apologize on behalf of Virgina and the morons that surround me.  I voted correctly for 47!!!",
         "Voting for Trump in MA is unfortunately a snowball’s chance in hell but I tried",
         "Don't let your memes be dreams.",
         "I'm in California and I'm with Pepe on this one.\n\nWork today is gonna be hilarious.",
         "Maybe if Trump breaks up the federal gravy train in NoVA there can be hope for the state again.",
         "You helped bring up the popular vote! Now they have nothing to whine about."
      ]
   },
   "1gkrzai": {
      "title": "BREAKING: Donald J. Trump will be the 47th president of the United States after winning Pennsylvania",
      "text": "",
      "comments": [
         "![gif](giphy|3QxDwj4gh8ia01aeWA|downsized)",
         "r/politics in shambles",
         "Decision Desk just called Nevada and Wisconsin for Donald Trump!",
         "I might actually watch The View this week on purpose to watch Whoopi collapse in on herself like a dying star.",
         "Reddit is about to have the biggest meltdown ever",
         "These are going to be some tasty days on Reddit",
         "LFG!\n\n![gif](giphy|1dLuQ7C54cwGk)",
         "r/politics users are downvoting the shit out of this post",
         "GOP NOW A 65% FAVORITE FOR THE HOUSE - DDHQ\n\nWe might have a trifecta\n\nPer CNN: Harris hasn’t outperformed 2020 numbers by 3% or more in a single county",
         "It’s honestly insane how this election is getting called so fast",
         "Dear r/politics\n\nIt’s not that we don’t want a woman or PoC president\n\nIt’s that you put up *Kamala Harris*\n\nOh wait, no you didn’t. The DNC did and you pretended like you had a say in the matter. Oops.",
         "The election is basically over and Arizona are still at 51% like absolute morons. Way to go guys!",
         "Moderate here. \n\nHope Trump has a successful second term. Democrats should be studied on how to lose by picking the worst candidate possible. Kamala didn’t inspire any confidence in me, I also didn’t like some of her ultra liberal views. I am not the only one, her underperforming is proof of this. \n\nPraying for our country and future.",
         "2020 still haunts me. I'm not going to sleep until it's absolutely offical.",
         "Trump walking out right now!!!",
         "![gif](giphy|UPm8BqL6igDUPZ29ik|downsized)\n\nTHANK YOU JESUS!!!!",
         "CNN finally called Trump the winner of the 2024 election",
         "the amish won this for us\n\nremember them",
         "Guys, maybe we don’t understand the significance of this victory: \n- Trump won\n- Trump beat the polls for the THIRD time \n- Trump over-performed **everywhere**\n- Trump won despite three assassination attempts, constant media slander and being prosecuted left and right. \n- Trump won after losing in 2020\n- Trump won despite spending less \n- Trump likely won the popular vote \n- Republicans won the senate \n\nThis is one of, if not, the greatest political achievements and comebacks in history, anywhere.\n\nWhat’s more, is he will preside over the lunar landings, Mars landings, olympics, soccer World Cup and more. We have a bright future here in America, best days ahead of us!",
         "omfg he won PA\n\nthis is done. omg wow\n\n*sorry for sounding like a shiba inu, im a bottle of red into this night and yeah",
         "Grover Cleveland in shambles rn",
         "Mark Cuban conceded on behalf of Harris lol",
         "To think this dude was only an inch away from being shot in the head is insane.",
         "It's somehow even sweeter than 2016..",
         "Remember to be gracious winners. Take the high road. God bless America.",
         "r/Philadelphia can stop calling us all nazis now as we win the electoral AND THE POPULAR VOTE",
         "![gif](giphy|tsFs4w3ExMwFXVo5JV|downsized)",
         "We did it. America is great again.",
         "For real, moving on, Trump and Vance need iron clad SS protection now. I'm afraid that the attempts on his life aren't over.",
         " The ABSOLUTE MADMAN. He did it again.\n\n Leftists - don't fret, you finally defeated the party of Darth Halliburton.",
         "This is what reddit gets for spamming so much Harris bias",
         "Well, fair and square. Im liberal, but enjoy the night. You all went out and made it happen. Congratulations. This is what democracy is all about.",
         "As a liberal I’m just done with the Democratic Party now. Their heads are so far up their asses.\n\nMan, I have a huge personal dislike for Donald Trump, so I voted Harris. But dem leadership is utterly moronic. I like Michelle Obama, but she was an idiot calling trump supporters racists last week. Just because I dislike trump doesn’t mean all his supporters are racist.\n\nRunning Biden in the first place was an utterly moronic move. Should have had a primary in the first place. I get why they didn’t when Biden dropped out, but they’re idiots for getting in that situation in the first place. Ignoring the border, bringing up gun control, ignoring inflation.\n\nI make (low) six figures and I struggle to support myself and my gf who has medical issues. There’s something broken there. Ivory tower liberalism with no introspection is a huge part of why the Dems lost. It’s a bunch of academics with no real world experience who are so stuck in their own bubbles that they can’t change or realize how out of touch they are with reality. I saw those types a lot when I was getting my masters. Don’t call everyone racist and stop trying to fit everything into some intersectionality framework, it drives away so many independents.",
         "2016: A New Hope\n\n2020: The Empire Strikes Back\n\n2024: Return of the Jedi",
         "me when im elected the 47th president of the united states:\n\n![gif](giphy|S43RIQ4OtWGKMTyU8q|downsized)",
         "![gif](giphy|3QxDwj4gh8ia01aeWA|downsized)",
         "Hi r/Conservative, Democrat here who voted for Trump. The magnitude of schadenfreude that I am experiencing right now is something I’ve never felt. Had to come here because I was banned from the politics sub because I disagreed with them on something one day. \n\nI am so much more hopeful for the future of this country. God bless America",
         "Highlights from AP VoteCast / Fox News Voter Analysis\n\nMen Trump 54-44\nWomen Harris 53-45\n\nNot a historic gender gap.\n\nEdit: NYT now expects Trump to achieve 312 electoral votes",
         "God bless America. Let's go!!!",
         "Good job, everyone.",
         "Huzzah!",
         "❤️🇺🇲🙏🎉🙌🍻✊️😁",
         "I got to witness a non-consecutive president who survived two assassination attempts. And so did you.\n\n#AMERICAN HISTORY\n\n#YOU SAW A MIRACLE",
         "I think I’m happier that the far left got a heavy dose of reality.",
         "Popular vote and EC, from the looks of it. So there will be no mistake about it. The aftermath will be just increasing the name calling and parroting the same tired old social media posts and whipping each other into a frenzy over perceived persecutions. \n\nThe sun will still rise tomorrow. People will get up and go to work. The country will be just fine.",
         "Yes!!! My brothers and sisters GET IN HERE!",
         "Bunch of election deniers over on r/politics",
         "Donald \"The Glass Ceiling\" Trump does it again",
         "Hail to the King, baby!",
         "Donald can’t go outside at all. We have to protect him at all costs😂",
         "We did it!! I voted in PA earlier today and they had my nerves shot waiting. 🇺🇸🇺🇸🇺🇸🇺🇸",
         "DEI based hires out, merit based hires in.  Hell, even California repealed their soft on crime law tonight.  Maybe America is on the path to normalcy again.",
         "🇺🇸",
         "Hell fuckin’ yeah 🇺🇸🇺🇸🇺🇸",
         "MAKE AMERICA GREAT AGAIN",
         "Move over Grover Cleveland. There's a new nonconsecutive in town.",
         "It has been an honor lurking /r/politics with all of you this evening.",
         "Don’t care what people say but I strongly feel that Elon buying twitter actually changed everything",
         "I'm not from the USA but I'm happy lol go conservatives!",
         "Our Father who art in heaven,  \nhallowed be thy name.  \nThy kingdom come.  \nThy will be done  \non earth as it is in heaven.  \nGive us this day our daily bread,  \n**and forgive us our trespasses,**  \n**as we forgive those who trespass against us,**  \nand lead us not into temptation,  \nbut deliver us from evil.  \nFor thine is the kingdom and the power, and the glory,  \nforever and ever.\n\nAmen.",
         "Shockingly, calling half the country Nazis and Garbage is not a winning strategy. \n\n\nTrump ran a great campaign, and JD clearly was an amazing VP pick. \n\n\nWe've got the Senate as well.  Hopefully we can get the House next.",
         "I’m so relieved thank goodness",
         "Oprah and the rest of the Diddycrats along with the Predditors are terrified now",
         "We’re gonna win so much, you might even get tired of winning. And you’ll say, “No, no, it’s too much winning.”",
         "As expected. Remember this.",
         "This comes to show that Reddit does not represent the US as a whole",
         "Go drink all the tears over at politics…. It’s so so amazing",
         "KAMALA!\n\n![gif](giphy|piOnnuk59UuwnssvOJ|downsized)",
         "CNN exit poll projects Donald Trump won 50% of the suburban vote as opposed to Kamalas 48%.\n\nIn 2020, Biden won this demographic.\n\nTrump has improved his margins amongst *every* single demographic (rural, urban, suburban, black, white, Asian, etc)\n\nThe Republican Party is officially a multi-racial working class party",
         "Joe and Jill Biden are the happiest people in America tonight.",
         "CNN just called PA for Trump",
         "270towin HAS CALLED WISCONSIN FOR TRUMP!",
         "I’m so happy right now! We are taking our country back!🇺🇸",
         "Beta liberals: aBoLiSh ThE eLeCtOrAl CoLlEgE!\n\nChad Trump: Ok, I'll go win the popular vote too.",
         "GEOTUS. I LOVE YOU!!!!",
         "![gif](giphy|6901DbEbbm4o0)",
         "Reminder: Trump still leading in Wisconsin and Michigan as votes are still being counted.",
         "Weird r/politics is suppose to be about US Politics but it’s only showing states where Harris won or gov/senate races Democrats won and nothing about Trump.",
         "Why has Kamala not conceded yet? Insurrectionist!!!!!!!!",
         "I can’t wait to hear which accent Kamala uses in her losing speech.",
         "We all owe peanut a huge thank you.  Thanks lil guy.",
         "![gif](giphy|26BRKssrY9o905X3y|downsized)",
         "My wife's gonna get lucky tonite.",
         "🖕🖕🖕 r/politics",
         "so proud of the US right now",
         "Kamala ghosting her supporters and not conceding shows you exactly who this charlatan is.  Some of us already knew it, but it should be clear to everyone now.",
         "Godspeed patriots",
         "Boyyyy reddit is awfully fucking quiet. How beautiful is this",
         "👏👏👏👏👏👏👏👏👏👏",
         "The salt mines will be plentiful!!",
         "![gif](giphy|3o6ZsVbs2GzgKNvVpS|downsized)",
         "HAHAHHAHAHAHAHAHAHAHHAHAJAAHAHHAHAHAHAHHAHAHAHAHAHAHAHAHHAHAHAHAHA TOTAL LEFTIST ANNIHILATION",
         "I got classes off and papers delayed for a week when he won in 2016 because my professors were so distraught…not counting on my boss feeling the same way at work here in 2024 but we can hope :)",
         "I’m so proud of our American people tonight",
         "Rest now, for the work begins tomorrow.",
         "![gif](giphy|C1L8yq5ZEz0cg|downsized)",
         "We can finally be unburdened by what has been!!! Lfg!!! 💪🏼💪🏼",
         "Don’t mind me hate reading every last comment in r/politics after thinking they were going to win for months",
         "The reactions on twitter and reddit are hilarious, some of these people got a lot of pent up anger they need to let out.",
         "Trump sure knows how to lead a campaign. Or the dnc shit the bed. I guess both can be true",
         "It's been a pleasure, this community is so pleasant and real compared to the rest of reddit.",
         "#WE DID IT YALL! WE FREAKING DID IT WE SAVED AMERICA! GOOD NIGHT LOVE YOU ALL",
         "Someone check on r/politics, r/mademesmile, r/blackpeopletwitter, and r/- wait who am I kidding, FUCK EM",
         "I’m gonna cum",
         "CNN TALKING ABOUT THE 1 ELECTORAL VOTE IN NEBRASKAA\n LOOOOOL",
         "The madman actually did it again. Took the popular vote too. Huge rebuke of Biden, Harris, Obama, the Mainstream Media, and more.",
         "He has earned this more than any president in modern day. \n\nTrump is the G.O.A.T.",
         "Remember that time they thought they could win Iowa lmao",
         "Independent who voted Kamala. \n\nBall is in your court guys.\n\nIf we got it this wrong, gotta be open to what else we were wrong about. \n\nAll I ask is that you push your guys to deliver what made you vote for them.\n\nHappy governing.",
         "Now we know Trump actually won in 2020. Too big to rig this time",
         "What will r/pics do now?\n\nWill they keep posting propaganda for the next 4 years? Lol.\n\nI‘m not even american, but it was annoying af to open reddit and see this propaganda. Every. Single. Day.\n\nEDIT: Just go there today, every single post is pure propaganda an cringe. Jesus.",
         "I voted Democrat, but I’m humbled by the vote and am happy to see democracy in effect. I agree there is a lot to be learned here from and for both sides, and if Trump is the person majority believe to be the right person leading us Americans to a brighter future, then I’m all in. No tears, no whining - just curiosity at this point.\n\nIf anything, I’ve learned much more from this election than any other one from before. I absolutely don’t believe in the media’s portrayal of our sides’ most extremes to be the full reality. I’m sure there are MANY moderates on both the Democratic and Republican sides, me included. While I’m not a fan of Trump, I admit I’m impressed with what he’s managed to do and the final call of the American vote at the end of the day.\n\nHarris hasn’t conceded, but not holding my breath. Good luck to us all, and congratulations on the win. Hoping for a better future ahead, all I ask and hope for is that women’s rights are considered and that the new leadership bring compassion into their governance.",
         "DJT will win all the swing states and the popular vote.",
         "MAGA! Let’s bunker down and get to work!",
         "r/politics is seething. I'm excited for America as a non American.  Good luck folks.  Excited to see you get a good president",
         "Call the doctor because my erection is going to last longer than four hours!",
         "I hope I can stop hearing the words rape and incest every 10 minutes now!",
         "im canadian and im feeling so patriotic. i want what happened in America to happen here in Canada. I wanna make Canada great again. or at least Massively better.",
         "NYT has called PA for Trump and estimates he takes it by 2 points.",
         "You know what, you conservatives get to celebrate. You really did win this one. Congratulations, I guess. Can’t even complain about the electoral college.",
         "This is the only post on the front page discussing the results of the election, and by commenting here I was immediately banned from JusticeServed. My beliefs are primarily left-wing, but this sort of censorship surely contributed to the outcome of the election.\n\n\"You have been banned due to participating in a subreddit that celebrates and/or glorifies biological terrorism (conservative).\"",
         "I live in PA and have had to listen to all the self-righteous, entitled, smug Liberals say for months how their votes were changing the course of history. They sure did! This is fantastic. I wanted him to win, but to win PA to is just amazing.",
         "EAT SHIT r/politics",
         "Two scoops, two impeachments, two assassination attempts, thirty-four sham felonies. But most importantly...\n\n#TWO TERMS!!!!!",
         "A post from a liberal on Reddit:\n\n“rip America\n\nA testimony of patriarchy. You don’t love your mothers, sisters, daughters or wifes. You love your political candidate more. The land of the free my ass.”\n\nThis person is literally beyond brainwashed and coping SO hard",
         "WE DID IT!!! THEY LAUGHED AT US!!! THEY SMEARED US!!! THEY CENSORED US!!! THEY TRIED TO FUCKING KILL OUR GUY!!! BUT WE FOUGHT AND WE WON!!!\n\nMAKE AMERICA GREAT AGAIN!!!!\n\n![gif](giphy|HNPXtBS9Qvg49gZgby|downsized)",
         "America...from an Italian who wants to see leftists cry and stability on the world stage, congratulations and a very heartfelt thank you. You might just have saved the world with this vote.",
         "Just a few tips. \n\nNext time, don't run an Abortion Barbie who runs an Obamacare the President platform and hope you win.\n\nAlso, don't forsake 14 million of your own voters because you're worried your Manchurian candidates will  lose to someone like RFK Jr.\n\nAnd stop lying in the face of voters whose pockets are hurting while claiming we have the best economy in history and inflation is transitory.",
         "The real MVP? Barron Trump for getting Don and JD on all those podcasts.",
         "I feel bad trump has to move back to that shithole they call DC after living in Florida the last 4 years",
         "I’m so happy 😭😭😭",
         "![gif](giphy|3o6Zt2Jx3JOjKhxdQI)",
         "Look at this downvote brigade trying.\n\n\nBoys and girls, we've done it. We've taken the third meme war.",
         "Everyone get in here!!",
         "Kamala was right when she said we’re not going back 🤣🤣🤣🤣🤣 Bye Felicia\n\n![gif](giphy|DC5pd0GQoEYIV4TCcu|downsized)",
         "Totally prepared for the media to blame this blowout on misogony and sexism",
         "Trumps win tonight was a fuck you.\n\nIt’s a fuck you to the media that gaslit us about Covid and inflation.\n\nIt’s a fuck you to academia that twist the meanings of the words genocide and racism to further leftist narratives\n\nIt’s a fuck you to protestors that burn down business and tare down American flags.\n\nIt’s a fuck you to the neocons that dragged us into forever wars\n\nIt’s a fuck you to neoliberals that refuse to acknowledge how mass immigration and globalization destroyed the middle class\n\nIt’s a fuck you to progressives that call everyone who disagree with them fascist\n\nIt’s a fuck you to illegal immigrants that don’t learn English and don’t respect our values or laws.\n\nIt’s a fuck you to Europeans that don’t want to pull their weight in NATO\n\nIt’s a fuck you to all the forces that have been dragging America in the wrong direction for too long.",
         "This is excellent news but I want to call attention to something I think is important here.\n\nI don’t think we won this election.  \n\nI think democrats lost this election.\n\n1) Kamala is a terrible candidate.  I think anyone even mildly articulate and coachable from the D pool in congress would have won.  I think AOC would have beaten trump.  Trump deactivated as many Rs as he activates.\n\n2) the media wildly overplayed their hand.  Had they been more casual about pushing the lies, had they been more gracious towards Trump when he was right, he would’ve had less fuel for his side.\n\n3) The VP pick by the dems was awful.  I think this hurt them more than anything else.\n\nOur ground game is still really weak and we needed a lot of people to come together to make this happen.  While we are likely winning all of congress, we still lost a lot of really winnable races.\n\nMonths ago many people said NJ was in play.  They were right.  NJ could have added 3 red reps and a red senator had the NJGOP not fucked around.  There were at least a dozen other races I can rattle of that should have been Ws for us but we made some bad choices.  \n\nLong story short we still have tons of rot internally we need to clean out.  We seriously need to build a bench, a marketing plan and execute.  Right now, we have neither.",
         "People on r/politics going crazy wondering where all the people are that voted Biden in 2020 \n\nThey just can’t make the connection",
         "I love every fucking one of you 😣\nThanks for voting, thanks for doing your bit in making America great again, and in extension, the world great again. ❤️",
         "We're gonna have some great content this week folks",
         "God did this and don't you forget it.\n\nLosing in 2020 seemed like the lowest valley. Why let him win in 2016 if only to take it away from him in 2020? Makes no sense... but I don't know the mind of God. He has a plan. The team around Trump now vs 2020 is night and day better. A true \"save America\" coalition.\n\nTonight, God blessed America.",
         "Psalm 107:1 Oh give thanks to the LORD, for he is good, for his steadfast love endures forever!\nMake America Great Again!",
         "As a Canadian, it’s comforting knowing at least America still has some common sense left. This left wing mainstream media coordinated censorship, disinformation and propaganda campaigns have made western democracies more divided than ever, gender/identity politics have become an insanity, we need to bring back people together and bring back common sense",
         "What an absolute landslide victory. Glad to see that people were able to see right through the left's fear mongering tactics. They tried every dirty trick they could. \n\n- Bringing up Project 2025 numerous times when Trump straight up refused to endorse it and kept disavowing it\n- Telling gays, minorities, and anyone else who would listen that Trump would exterminate them all and calling them race-traitors if they didn't tow the party line\n- Trying to convince women that they were fighting for their rights while simultaneously sweeping stories of illegal immigrants r*ping women under the rug, forcing women to share their locker rooms and bathrooms with perverted men, and allowing men to dominate in women's spaces (like sports)\n- Claiming that Trump will be a fascist (for real this time guys!) and that his last term didn't count\n- Pretending like Trump was a \"threat to democracy\" even though the Dems choose an unelected nominee, jailed their political oppositions, forced big tech to censor stories on their behalf, and borderline won the 2020 using that method of censorship and restriction of information\n\nThey had no plan, no platform, nothing other than \"reeeee orange man fascist nazi bigot\" and trying to garner as much fear as they could. I'm glad people were able to see through the bullshit. Kudos and fuck r/politics.",
         "What I'd say to any enranged lefties is \"You did this.\"\n\nPeople like me who started off left wing and over the last few years went Conservative \n\nTheir lunacy, their abstract ideas and schools of thought defying common sense, caused this. They got Trump in because everyone in real life with any common sense knew this was the right option.\n\nSo thanks, you pink haired screaming babies, you pushed the sane liberals who want peace to this. Let's go, Trump!",
         "Can’t wait for the Diddy Party list to drop. I haven’t been excited for a list of to be made since Christmas in 1997",
         "Finally, after 4 years...\n\n...\n\nUnburdened by what has been",
         "TOO BIG TO RIG BOYS LFG",
         "One of these days CNN can project Trump winning",
         "Fight! Fight! Fight!",
         "We did it!!!!!!!!!",
         "r pol doesn't even have a post up yet lmfaoooo. Cope and seethe.",
         "God bless America!\n\nLet's make America great again!\n\nThe world is counting on us!",
         "GOD BLESS AMERICA!! MY HOME SWEET HOME!!",
         "Its so much sweeter because he lost in 2020. God this is great.",
         "##SORRY TO KEEP YOU WAITING, COMPLICATED BUSINESS",
         "How big of a fit does the left throw in the coming weeks?",
         "Can we all just say...Latinos are the fucking bros. Some of the hardest working motherfuckers Ive ever worked with and it doesn't surprise me in the slightest they wouldn't vote for Kamala",
         "BREAK OUT THE RED PANTIES",
         "![gif](giphy|d2Z4rTi11c9LRita)\n\nIt’s been a long election but we did it",
         "We Did it guys\n\n![gif](giphy|ExVqsLgEsODNwi68C6|downsized)",
         "Lesson for reddit\n\n\nThe <removed> and the <deleted> vote",
         "The bubble Democrats have been in just burst.",
         "I miss r/thedonald",
         "This feels so good for our country!\n\nThis also feels amazing after being called racist, fascist, and the worst person on this planet for MONTHS on this site outside this sub.\n\nI am so fucking happy.",
         "YESSSSSS!!! SUCK IT LIBS. A total rejection of what you’ve done over the last 4 years and all the insanity you stand for.",
         "I'm not entirely sure how i'm going to get to sleep now. Work is going to suck tomor.. *looks at clock*... later today...",
         "Congrats to JD motha fuckin Vance too!",
         "all quiet on the reddit front",
         "Yeah maybe swapping the old geriatric guy for the lady with the personality of a cardboard box 4 months before the election wasn't the greatest idea",
         "Republicans are on track to win the Senate, House, and popular vote for the first time. Anything Republicans want to pass they will be able to without any hindrances.",
         "I may lean left but congratulations this is a insane comeback ngl",
         "The left being completely blindsided by this is hilarious. The pendulum has swung back, the people have spoken.",
         "Reddit in an absolute shambles. 😂😂😂",
         "Til there is a conservative sub. Till today I was never suggested this sub ever. Call it what you want",
         "This man rode a garbage truck to a presidential victory.\n\n\nHonestly? That's badass.",
         "We did it joe",
         "I have to say… this is about the best result I dare dreamed possible. (Here’s hoping Republicans take the House, though that remains to be seen.)\n\nI love that Trump played go big or go home—holding rallies in New York City, Virginia, New Mexico, etc., made it evident he was leading a movement, not just a surgical strike in a few localities. And now he’s probably won the popular vote!\n\nThat this has happened after all the internecine lawfare, the bullsh*t felony convictions, the assassinatiom attempts, the slander heaped upon his supporters—labeled “Nazis” for attending the MSG rally, being called garbage by the sitting president—oh, it’s just so delicious!\n\nMore than anything, I love that it’s decisive. This will take the wind out of the sails of anyone who says he’s not a legit president or that he’s not a “patriotic” choice. And maybe we can turn the chapter on these awful past four years…",
         "I'm glad this thread exists, seeing as the rest of reddit is apparently too fucking scared to have a thread about something which is a Pretty Big Deal",
         "Just wanna say how I love how this sub is open to all people, even those with different beliefs.\n\nMeanwhile any of the many left subs just ban you if you have even the slightest conservative viewpoint lmao",
         "According to Reddit trump was elected because like we hate women or something lmao",
         "r/TwoXChromosomes on life support lmao",
         "If people just followed Reddit we would be in a mess",
         "Huh, calling half the country Nazis was not a winning strategy, who would have guessed!",
         "Dang!",
         "You’re fired!",
         "Trump loves his family. The left hates families.",
         "Vladimir Putin has no plans to congratulate Donald Trump per CNN",
         "We did it!",
         "LETS GOOOOO",
         "We did it :)",
         "WE DID IT! WE TOOK OUR COUNTRY BACK! GREAT JOB EVERYONE!",
         "WE DID IT PRAISE GOD",
         "WE ARE SO BACK GOOD JOB EVERYONE",
         "LETS FUCKING GOOOO",
         "FUCK YES!! THIS VICTORY WAS ESSENTIAL!",
         "VICTORRRYYYY",
         "We won Joe we did it!!!!",
         "A beautiful and historic day for any true American.",
         "Prepare to watch in awe as Elon accelerates our space ambitions.",
         "Allan Lichtman lost. \n\nAnd it turns out Trump only beats women candidates. \n\nYEAH WE WON.",
         "Someone check on Liz Cheney! Must hurt to know that she has been kicked to the curb for good!",
         "Congrats, American friends!",
         "TRASH AND GARBAGE CAME TOGETHER TO UNITE THE COUNTRY IN OVERWHELMING FASHION. IT HAS BEEN QUITE THE RIDE WITH YOU ALL, GOODNIGHT. TONIGHT IS TURNING THE PAGE INDEED.",
         "At least Hildawg kept it close. This was over when the polls closed. It wasn't close. Kamala is the worst candidate.",
         "Free at last free at last thank God we're free at last.",
         "I feel to my knees in the Mar-a-Largo parking lot when Trump won PA",
         "Scott Pressler played a big role in this. He is awesome.",
         "![gif](giphy|F6B9HJltcbckwiUHV4|downsized)",
         "ABC has called Pennsylvania for Trump.  And has admitted Harris has no path to victory.",
         "We did it friends.\n\n  \nr/politics and r/economy are on suicide watch.",
         "Back over here after salt mining in the politics sub. I'm ready to get to work.",
         "Ladies and gentlemen… we did it",
         "Trump now at 280 on 270 To Win by way of WI",
         "Defenders of democracy shadow banning everywhere!\n\nPeople saw through the lies of the media and are tired of being gaslit by the Democrat party about the “threat against democracy” Trump represented. They saw through a candidate in Kamala who flailed in interview after interview. They rejected terrible policy ideas like higher corporate taxes, price caps (!) and taxes on unrealized capital gains. They rejected the extension of an administration that has led to a huge spike in crime, $12,000/yr in increased living expenses, global military conflicts, illegal immigration and migrant crime, and totalitarianism (censorship, 1st amendment violations, collusion with the media, lawfare). Trump gained with almost every demographic. He has taken a political and legal beating like no one in history and people saw it for what it was… a fraud perpetrated against democracy.",
         "As a Democratic socialist, I really hope y’all are right. With every fiber of my being I hope y’all are correct.",
         "I will watch the left’s meltdown with great amusement.",
         "He never stopped through all sorts of adversity.   He is what America should be.",
         "USA USA USA",
         "I’m so ready to be tired of winning again",
         "I love schadenfreude. I don’t care whether it hurts dems or reps. I enjoy watching the democrats be in pain right now for bellying up to corporations, and I will enjoy watching the erosion of poor states soon for the same reason.",
         "God bless Trump and the USA! Thank you fellow conservative voters!",
         "Honestly, in retrospect, there's a silver lining to losing in 2020.\n\nTrump 47 will have better people around him and the benefit of lessons learned form the first time around. Trump 47 is going to be WAY more effective at moving our ideals forward than a second term of Trump 45 would have been.",
         "The haters here saying trump can't win for months...  What do you say now, Well we're waiting..",
         "One of if not the greatest political comebacks in modern American history if not all American history. Im in shock. This will be studied for generations.",
         "Amazing",
         "Soooo I work in college basketball and I'm not gonna lie, I thought the barron trump height thing was a meme. \n\nHe is 6'9 and eastern European give this man a basketball PLEASE",
         "FATALITY",
         "bubble burst moment for redditors, i have been seeing this sub being spammed with i voted for democrats for actually months, looks like it was all bots huh??  \nTrump for WWW",
         "Where is Hulk Hogan",
         "I slightly sensed Trump would mop the floor with Kamala this morning. I never bought the \"dead heat\" nonsense. She was an underwhelming and frankly unimpressive candidate and overall personality. Opinion polls and other political noise mean squat until the results are in.",
         "Dems on reddit are silent",
         "So fucking satisfying seeing Reddit in shambles after all the shit they have talked on even the non political subs. They brought this on themselves",
         "\nHopefully this helps prepare JD Vance for 2028 :)",
         "I never gave up on him. I wanted him to have one more shot after 2020, I felt he was owed that much.\n\nNow he’s completed the most improbable comeback in US political history, survived an assassination attempt, and is likely winning the popular vote, House, and Senate. You couldn’t write a better script.",
         "Now let’s watch how all the liberals start going to @offmychest to talk about how they’re going to off themselves",
         "What a night! I'm not a US citizen (just starting the process to get my Green Card) but I hope that for all of us that live in this great country that President Trump is able to unite the country and work for the benefit of all Americans. He has an amazing opportunity to correct the mistakes he did during his first term and build upon the successes he had.\n\nEven-tough I'm scared that with his immigration stance that my Green Card process might be in jeopardy (I've worked so hard for almost 10 years to get to this point), I like to stay hopeful for the future. Congratulations to all you Republicans out there. Wishing the best for your country and hopefully mine too in the near future.",
         "Congrats conservatives, heres to hoping for a prosperous and safe 4 years.",
         "We're so fucking back.",
         "LETS FUCKING GO! I WOKE UP TO HIS VICTORY SPEECH.",
         "Maybe the people over at r/politics will realize reddit and the internet isn't reality. Blue wave? Didn't happen, instead we DOMINATED.",
         "i'm not republican (nor a democrat, i'm british), but the democrats have nobody to blame but themselves here. they put up an inept candidate at last minute.\n\ncongratulations on the win. america has spoken today.",
         "We got our reddit back. Bots have been deactivated.",
         "Redditors when real life isn’t what it appears to be on a liberal platform.",
         "Reddit is about to lose a lot of users.",
         "I tried to tell people she was so disliked that there was no way she would win. I ended up getting banned and shadowbanned from multiple subreddits.\n\n\nThese people are literally living the south park episodes where Kyle's parents move to California and all they do is smell their own farts and treat it like fine wine.\n\n\nTheir heads are so far up their asses.",
         "What's crazy is how much the country swung to the right by like 5 or so points in pretty much every state. In new York state Trump is at 45% versus Kamalas 55. That's crazy. Even in California he's approaching 40% of the vote",
         "I’m not a fan of either side, but it’s funny to see the meltdown. Democrats had to hold their tongues regarding Kamala’s shortcomings, and if she won, MSM would never discuss it. Now that she’s lost, we can finally criticize all the bad decisions they have made to lead us here and I’m all for it.",
         "Get in loser we're freedoming",
         "Biden calling half the country garbage probably didn't help them.",
         "its... so... *quiet* over there",
         "The entirety of Reddit is in shambles. 😂\n\n![gif](giphy|7A4zkWeMXlZqgnTKtJ|downsized)",
         "So much salt in there",
         "Real shame Jerome can’t play in the women’s division anymore",
         "dont forget r/pics",
         "Ohhhh those tears are so....DELICIOUS!!!!",
         "Not stopping them from coming here and downvote brigading.",
         "The top comments are literally how we don’t want to vote woman as President.  If that’s your defense for Harris you’ve already lost.  The two females they’ve put up have been horrendous, and they ran out Gabbard who would have actually had a chance at winning.  Incredible how “smart” they declare themselves but can’t see past their own facade",
         "After what I’ve seen the Reddit user base is, I’m actively trying to see if X can replace Reddit for me. What an awful experience it has been to use this app for the past few months.",
         "Fuck r/politics",
         "Turns out mods don’t have powers outside the basement. They couldn’t ban the voters in real world.",
         "Thus, a great day!",
         "They've also just called Wisconsin for Trump",
         "Wow Nevada too?!! The message is clear",
         "I’m still waiting for Whoopi to leave America like she said last time!",
         "That is going to be the saltiest supernova in the history of the universe.",
         "I will always associate her with Theodore Rex and thus never take her opinion seriously",
         "Can’t wait to see it. Past few months Reddit would have everybody convinced 99% of America was voting for Kamala. I used to hate Trump too and I’m glad to see it lol",
         "![gif](giphy|7k2LoEykY5i1hfeWQB)",
         "Here for it",
         "the left will say 66million people are terrible and wonder why they lost",
         "Time to unmute half of Reddit. We’re eating good",
         "It's fucking delicious",
         "Almost better than Trump winning.",
         "We’ve earned it after the last four years..",
         "Grab the popcorn",
         "I've seen so many comments lately referring to how \"If we went by the popular vote then Republicans would never win\". And Trump of all people is on track to win the popular vote. Absolutely wild.",
         "Honestly what’s shocking is the popular vote. I did not expect him to beat Kamala in that.\n\nLFGGG",
         "Congrats from Australia. The trials, the mugshot, the McDonalds, the garbage truck, the multiple assassination attempts, the famous \"FIGHT FIGHT FIGHT\" picture. Surely one of the most exceptional paths to the White House in US history",
         "LETS GO TRUMP",
         "LFG! MAGA 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸",
         "Downvotes lol. We got the votes.",
         "Nobody here cares....  Heads are exploding all over Reddit.",
         "They downvote to compensate for the lost elections",
         "They already downvote me because I told them that they lost Pennsylvania by margins not seen since Obama. Sad",
         "Lol every single post about a democrat winning… none whatsoever for GOP.",
         "What’s crazy is instead of taking a step back and trying to think why more than half the country voted for someone different than them, they just default to calling us racists and bigots. \n\nI just want to cut spending, secure the border, and keep the government out of my life.",
         "It is so beyond that. \n\nElectoral college with 300+ votes. \n\nPopular vote with 5+ million vote margin. \n\nSenate with 54-55 votes. \n\nMajority in House, majority of Governors Mansions.\n\n1-2 Supreme Court appointments over next 4 years. \n\nJust wow.",
         "Can you explain for a non-American what this means in practical terms?",
         "DDHQ now has it at 65.7%! The momentum is strong!",
         "He won Florida by 13.3%. Texas by 14.6%. Ohio by 11.4%. These numbers are staggering",
         "too big to rig brother",
         "Yep, that CNN's people responded to criticism's of Kamala's anointment with \"the DNC has no obligation to have a primary,\" should have been received as a smack in the face to any Democrat voter who has respect for the election process. There's nothing but dishonor in the act of calling for democracy's saving while spitting on the people's opportunity to choose their candidate.",
         "Exactly. Sorry I will never take anybody who votes purely democratic or republican no matter who the candidate is seriously. Picking the right candidate is always the right call and that wasn’t Kamala",
         "r/politics will get a female president soon\n\nOnly problem for them will be that she will be a Republican lol",
         "They’ll be at 51% for another week 😭",
         "Oh hey moderate here too, I was browsing reactions here out of curiosity. I’m interested to see how his second term goes.",
         "That's not their only problem. Even people who lean left are tired of rampant issues with homelessness, crime, illegal immigrants, etc. \n\nThat's not a candidate issue; that's a platform issue.",
         "Bernie 2016 and Bernie 2020 supporter here. Not only did they pick the worst candidate, they also did it in the worst possible way (coronation instead of primary) and at the last possible moment, with no policies to speak of.",
         "3 times in a row. Somehow Biden managed, but to be fair, he didn't seem quite as bad as Clinton (evil) and Harris (incompetent). But Democrats keep anointing the worst people. My advice for them is to have an honest primary for once.",
         "“Let’s save democracy! (By circumventing democratic processes)”",
         "For me it's not even her views being too much one way or another. It's how wildly incoherent and private they are. No stance on so many issues, and then of the ones we know she can be overlapping Bernie on some but then exactly like Trump on others.\n\n\nTo me that screams that her stances are all about gaining votes, and I can't vote for someone whose promises are seemingly completely detached from their real intentions. Yes there's the typical promises that are in no way realized even when able to, but this goes one step further in that the promises seem to merely be campaign ads from the start.\n\n\nIf Trump says he wants to do X, it tells me he's probably leaning towards X. If Kamala says she wants to do Y, it tells me it polls well in key demographics in swing states, but has no bearing on where she leans.",
         "[deleted]",
         "If it hadn’t been for a once in a lifetime worldwide pandemic, Trump was on track to win easily",
         "Me too!!!",
         "Between that and the videos I just saw of them hauling in boxes into detroit polling buildings at 11pm, I'm not celebrating until Kamala officially concedes.",
         "Commenting for history sake- I was here watching Trump walk up to give this speech. First thing he said was he will work on our country healing. Amen and MAHA",
         "TRUMP PERFORMS SEX ACT ON FLAG + a lot more gaslighting 🤣",
         "Yeah. The AP just called Wisconsin for Trump",
         "The amount of people saying we won based off misinformation instead of admitting they ran on a terrible candidate and platform… CNN in denial too",
         "Gold Bless Scott Presler 💜",
         "Trump did even better than 2016 because he's projected to win Nevada this year, which he lost in 2016.",
         "Winning the popular vote is huge. Just another talking point to take away from Liberals. So glad I don't have to hear them whine about it for four years.",
         "I wasn’t on your side with the election, but I hope your guys will use your power sensibly and stay true to your goals about making things better. I hope you can prove the left wrong, despite all the nasty rhetoric from both sides.",
         "Agreed on all fronts.",
         "Poor guy's one claim to fame was being the only president to serve nonconsecutive terms. And evil orange man took that away from him!",
         "I don't even know if you joking or not.",
         "No fr I truly believe that dude is being saved for some future purpose, because this comeback is insane",
         "We went from meme magic sneaking in a cheeky win to rising victorious over all of the machine's dirty tricks. The lawfare, the mugshot, the assassination attempts, the censorship, everything we've dealt with makes this moment sweeter.",
         "He’s going to win the popular vote bro. This is 100% sweeter",
         "It's not sweeter than 2016 IMO. The sheer shock and live reactions made that night unforgettable.\n\nBut it is very tasty.",
         "Their boos mean nothing, I’ve seen what they cheer for (the Eagles)",
         "hes absolutely cooking",
         "Greatest comeback in history hands down everthing this man has been through",
         "Lets make it even greater!",
         "I'm from Aus and definitely noticed the far learn in on Harris and anti Trump posts rising to the top the last few months consistently on Reddit haha",
         "Reason i left /rpics. It’s full of harris trash and anti trump propaganda instead of cool random pics like it used to",
         "Cheers to you, it’s just politics at the end of the day we should remember we’re all Americans working towards one goal ",
         "This is what I’m saying! The Democratic Party is in such a bubble that they thought running Biden (who nobody wanted) was a good idea, then pivoted to the VP (who nobody wanted) last second was a decent optic. Like no brother! Give the Democratic Party a Barack Obama type candidate and this isn’t a blowout, but they picked their “ideal” candidate and told Democratic voters to ignore anything of substance and vote for her because “they should”.",
         "There are plenty of conservatives who don’t like Trump as a person.  It came down to who did people believe could keep this country afloat for the next four years.  The democratic policies of the past four years had put us on a bad trajectory.  Harris lacked any substance. She had no plan, never directly answered a question, in fact her answers sounded like a kid doing a book report on a book she never read.",
         "Together we can rebuild this country",
         "The REAL Democrat bros that push for progress, diplomacy and accountability are the people I get along with most. I’m a registered independent and cannot be happier with this result as well as the manner of this result. It shows most of the country is on the same track and wants the same goals. Welcome to the true United States.",
         "Lmao AND the popular vote??",
         "What about the house?",
         "About fucking time 🎉",
         "I know I am. The fucking non stop division and grand standing is shut the hell down for 4 more years.",
         "“Reality has a liberal bias” lol.",
         "The thought of them losing the Popular Vote. Jesus, how bad could they get?",
         "For real, bubble wrap that man until January lol",
         "Harris did not improve on a *single* county in the entire country compared to Biden in 2020.\n\nAbsolutely baffling statistic.",
         "Do not come. Do not come.",
         "This is how Democrats want to control your speech.\n\nReddit was astroturfed by the Harris campaign",
         "The amount of reach out Trump did to the young voters will be studied for years.",
         "When I registered as a Democrat when I was eighteen the Democratic Party was nothing like it is now. It is unrecognizable. I left a couple of years ago for the Republican Party. I don't agree with everything they stand for, but they're merely eccentric. The Democrats are Jeff Goldblum in *The Fly*.",
         "Good, don’t want his congratulations.",
         "psychologists going to make bank next few months lol",
         "![gif](giphy|tsFs4w3ExMwFXVo5JV|downsized)\n\nI’ll bring the fries",
         "This is the one 🙌🏼",
         "Watch a lot of the obvious astroturfing disappear overnight now that they've lost.",
         "All the bots got deactivated I guess",
         "They literally rage quit their own sub lmao",
         "The bots haven't gotten their new orders yet.",
         "The crickets are in full force",
         "Finally",
         "r/Texas locked basically every thread on their front page lol",
         "All the bots are turned off.",
         "So quiet",
         "all the bots are fired",
         "That’s what happens when people get too comfortable with their own echo chambers 🤣 \n\nBring on the downvotes, but Donald J Trump is still your US President whether you like it or not",
         "It's a dark day for Jerome",
         "The top posts newest comments are so good",
         "The best tears\n\nNancy Pelosi -  I decided a while ago that Donald Trump will never set foot in the White House again as president of the United States or in any other capacity 🤡",
         "It’s happening both ways let’s be fair lol",
         "MSNBC is still trying to find a path for Kamala.",
         "While we’re at it, let’s get ALL OF THE OTHER FUCKING DEMOCRATS AND CELEBRITIES WHO SAID THEY’D MOVE LAST TIME TO ACTUALLY DO IT.",
         "And take Cher, DeNiro, Clooney, Oprah, and Cardi B with her!  Throw in Alec Baldwin too!",
         "They truly can’t see any fault in their actions. I’m from Finland and our country has been fully indoctrinated to hate Trump. They made a poll and 80% of the people hoped Harris would win. And they acted accordingly bashing anyone with a conservative opinion. I enjoy Trumps win so much right now.",
         "\"Everyone get out and vote, this is to save democracy!\"\n\n#\"No not like that!!\"",
         "Womp womp 😂",
         ">the left will say 66million people are terrible\n\n*nazis and fascists",
         "Exactly!! I was just saying this to some people on the politics sub. They don’t realize they have to persuade potential Trump voters to win the election. Calling them literal Nazi’s isn’t going to work.",
         "They are already on it. Also, Mods are posting suicide prevention hotlines. Folks - don’t ever let politics drive you to suicide.",
         "This is what happens when you run a campaign based on identity politics and hate",
         "Not only that, but by 5M+ votes seemingly.",
         "This was the only way it could happen to avoid huge problems i.e. leftist violence.  Trump winning the popular vote gives us the \"will of the people\" argument.  Hopefully this settles things down.",
         "The raid on his residence is what started it all. \n\nIf Biden and the Democrats had just left him alone he wouldn’t have generated the popularity he developed.",
         "Trump will never ever be forgotten",
         "And they can’t even complain about democracy this time around",
         "yeah right lol\n\nonly liberals think reddit matters",
         "They really thought Reddit was reality. Weirdos",
         "One of the biggest political tsunamis ever! Crazy! I had hopes for Presidency but didn't think that everything would go our way! Now can I admit to being a Trump voter?",
         "This is a good old fashioned blowout",
         "Trump is likely to come into power with a Republican controlled House of Representatives and Senate.\n\nAlong with that, the Supreme Court is 6-3 Conservative majority. Essentially, the GOP will control the entirety of the federal government for at least 2 years now.",
         "A trifecta is when a Politican Party wins the Presidency, the House, and the Senate. And in this case SCOTUS too.",
         "He steamrolled her.",
         "It means that Trump will be able to get his agenda passed and implemented without opposition. Americans had enough and went for the clean sweep.",
         "For the first part, the Republican Party is expected to take more control over one of the chambers of our legislative branch, the House of Representatives.\n\nFor the second part, Trump won the election and Republicans took control of the other chamber of our legislative branch, the Senate. If Republicans get the majority in the House of Representatives, all 3 parts of the federal government will be under Republican control.\n\nFor the third part, each state has subdivisions called counties. In each county, Harris has done at most 3% better than Biden did in 2020. She did worse in most counties, but the small number that she did better in are at most 3% better",
         "No Plandemic, no mass mail-in votes, no possible way for them to pull shenanigans. That and she's the worst candidate they've put up in 100 years, and she chose Tim Walz over Josh Shapiro. She was DOOMED from the start.",
         "I believe there was a lawsuit in Florida when they canceled their primary and the Court ruled that the Democrats don't have to have one. \n\nI'm pretty sure this is true all the way around, both major parties are private entities and can nominate anyone they want to without asking anyone's opinion.",
         "I don’t even play sides, but I’m so glad I don’t have to hear the phrase “vote blue no matter who” anymore",
         "I can’t wait to vote for Tulsi.",
         "The reactions have been crazy on /r/Politics. I feel bad for them lmao.\n\nI really hope Trump is careful with the Tariff talks tho. I’m trying to build a new gaming pc in a couple months.\n\n![gif](giphy|yiADANv89n7UQuS5kJ)",
         "Independent here who leans democrat.  \n\nI'm tired of being called a fascist or nazi when I express my concerns with allowing homeless encampments and their drug abuse and pollution go unenforced.  \n\nI'm tired of being called a fascist or nazi when I express my concerns about men who change gender to women and want to tell us they are full blown women with all those rights.\n\nI'm tired of being called a fascist or nazi when I express my concerns about immigration and  how our community resources are exhausted in supporting it all when all along we can't care for those already here. \n\nIt's time to start having discussions again, but I don't know where that is an option anymore.  Not here or r/politics or anywhere on reddit or social media.",
         "I feel like Bernie would have done very well in a 24 Trump matchup, we shall never know. He is very good at inspiring voters, something Kamala failed at. Regardless praying for the best for our country.",
         "Amazing how many leftists just ignore this.\n\nAlso, amazing how many people conveniently ignore that time when the DNC rigged the primary against Bernie in favor of…. Fucking Hillary. And everyone fucking knows it.",
         "Democrats after tonight will need to regroup. It’s clear that pushing the ultra liberal agenda in America doesn’t work. \n\nI got nothing against some of the agenda, but some of the extreme stuff is unappealing to a moderate like me.",
         "Its like if republicans had Trump win the primary but then decided to send Jeb in the ring tbh. What did the DNC expect?",
         "CNN just called PA for Trump",
         "CNN called it for PA. This election is over. Just need to see how the other races pan out. Trump winning the popular vote by 5M+ is just delicious.",
         "AP called for Trump!!",
         "Agreed! They pushed super hard in 2020, now they face the consequences",
         "Oh how I hope you’re wrong… can you please give a source so we can see it?",
         "Don't worry; they'll find something else to cry about.",
         "I mean, he was still the first and only for almost a hundred and fifty years, that's nothing to sneeze at!  And he only has one opponent now lol, which probably won't be increased for another century and a half.",
         "https://x.com/mcuban/status/1854046994345382034?s=46\n\nENJOY",
         "Holy shit I forgot about the meme magic days on the r/the_donald.\nGood times",
         "And Nevada. Trump lost Nevada in 2016.",
         "*shudders*",
         "It really is historic. Can't deny that, whether you love him or hate him.\n\nGuy was impeached, guy was harassed, guy was slandered for 8 years, and he missed death by less than an inch during the campaign... and he was running against an unelected nominee who replaced the incumbent partway through the campaign because the incumbent has dementia. All those \"first time ever\"s and \"unprecedented circumstances\" in just that campaign. It's amazing.",
         "Absolutely. I’ll be here in the next votes and I hope to see you too.",
         "Exactly.",
         "Isn't it awesome?",
         "95% chance",
         "Full sweep. And we got a super majority on the Supreme Court.\n\nMuch needed major changes will be coming to this country.\n\nThe deportations start next year.",
         "if you think that’s going to stop because Trump won… I have news from 2016-2020 for you",
         "The last time a Republican won the Popular vote was in 2004 with George W Bush.  \nBut since George Bush lost the popular vote in 2000, if you don't count 2004 then the last popular vote was George H. W. Bush in 1988. Truely a historical election.",
         "I got downvoted to hell recently saying that Kamala needs to go on JRE urgently and exactly as Trump did (in studio, full time) otherwise people will give her shit for not being able to do such an interview. I didn’t say it because I think JRE is so important (it is lol) but because she’s running an election and needs to appeal to every single voter she can.",
         "Russian collusion!!!!!!!!",
         "I'm curious how the pics subreddit will be",
         "yeah definitely",
         "We just saw the Harris social media outreach campaign get laid off in real time 😆\n\nI hope someone's recording this. I don't have the expertise or the interest or the sobriety at the moment 😆 but it would be hilarious to see in statistics just how abruptly the rate of posts and comments on r/politics  declined over the course of the night, and how many power users and frequent posters suddenly stopped posting.\n\nIn fact, I imagine when Cabinet member Elon Musk and the Republican  House hold hearings next summer to investigate Reddit's, lets say, \"undisclosed campaign contributions\" to Democrat Party politicians, they'll *demand* to see those statistics.",
         "Actually insane, suddenly theres hardly any comments and its all right wing. I knew a large part of them were bots, but was it ALL of them!?",
         "It has actually been so preposterous. I almost feel bad for the average redditor who doesn’t understand that they have unwittingly become a part of that machine",
         "I remember when that happened in 2016, also reddit wide. It's because after the loss they cut the funding of all the overseas astroturfers they hired. 2024 mostly AI bots.",
         "It's fucking crazy how obviously unbiased they are. Top posts are only \"Harris won this state\" and \"random democrat wins their local election\". \n\nInsane.",
         "No one is writing the check now that the election is over.",
         "The bots deactivated like the battle droids in ep 1.",
         "Why pay for them when it's not useful anymore?",
         "i mean, really, thats how it feels",
         "The bots broke. \n\nIt's the only real people there - all 40 of them",
         "Bots don't rage quit. The democrats shut them off once they realized they lost the election.",
         "beep...boop...orange man bad",
         "I hope he sticks his head in her office door and says hi!!",
         "Is this a joke? In what world lol",
         "Ship of that fucking Jimmy Kimmel also",
         "When will they realize identity politics don’t work",
         "Yeah exactly like that",
         "Americans saw the abuse of power. Americans saw the manufactured lawfare.\n\nAmericans in general like playing fair.",
         "This is definitely an underrated narrative that I think will be further explored decades from now. After 2020, if they would’ve fucked off and ignored him I strongly would bet he simply would have left the scene. \n\nBut after spending literally the entire 4 years trying to bury the guy to a shockingly nonexistent degree, nobody should be surprised he was essentially goaded into running again.",
         "Chris Rock warned them about this, he said if you go after Trump you will just reignite his popularity.  They were determined to destroy him though.",
         "Oh but they will lmfao",
         "Of course they will. They'll just pivot to 'democracy is the problem' and the need to re-educate people. Communist playbook shit.",
         "Over 90% of this site are deranged liberals. They are kicking rocks right now and I’m all for it. Liberal tears for the next 4 years.",
         "I'm hopping on a comment towards the top. Can we recognize how biased and rigged this site is? If Kamala won, it would be the top post on r/all right now. There isn't a single post on r/all about this result. It's absolutely pathetic, especially when the majority of America SPOKE tonight and the entire point of the site is to represent the people.\n\nEdit: getting a lot of responses that this isn't accurate... I'm not sure. For me, I don't see any posts on the top of r/all that have to do with these results yet see countless posts about Kamala. My B.",
         "If we hold all of our current senate leads, we'll end up with 54 or 55 seats, which means he will have the senate majority for his entire term. There are not enough viable flips on the 2026 senate map for Democrats to take a majority. Hell, 54 seats pretty much guarantees a RINO-proof majority for four years.",
         "Cool thanks.\n\nCould it also be the \"quadfecta\" if he gets the popular vote too? lol",
         "No excuse not to campaign this time either. She tried to use the Biden basement strategy without the pandemic.",
         "> the Court ruled that the Democrats don't have to have one\n\nIt's not about if they are obligated to have one. It's that they paired terrible optics with a terrible candidate.",
         "I just hope he picks up an Austrian economics book, seriously if he just cuts regulations and doesn’t overspend the economy will fix itself in no time.",
         "Yep, 100%. I live in a very liberal area that has seen a surge in homelessness, crime and migrant encampments. Yet, you’ll be ostracized very quickly here for highlighting problems with any of that",
         "2020 was his one chance but then dems rigged the primaries against him. He's a very healthy 83 year old in 2024 but it would still have been a big ask to have him run this year. Also on what ticket? There was an opening in 2020 but this time there wasn't even a primary.",
         "I love Trump, but I would have loved to see him and Bernie go toe to toe, which would have elevated the entire race.",
         "I’ve got a lot against the agenda. I don’t want the government forcing me to do, say, or believe anything I don’t want to.",
         "Part of the issue is also how left wing people behave in general online and offline which the leadership can't control. It's going to require a cultural shift.",
         "The new trend I see arising is \"it's the fault of the uneducated and the rednecks\". I guess some animals are more equal than others.",
         "shit he's got tegrity than kamala.",
         "Good on him for being classy",
         "They’ll ban anything political instantly.",
         "every single post on the front page there is praising Kamala wtf",
         "Whole page just pictures of liberals crying.",
         "I’ve been on Reddit since 2012. Its always gets spammed with left wing political photos during elections. However this is the first time it’s felt artificial instead of organic. Reddit in general leans left wing but these last 4 or 5 years every subreddit other than this one has felt like you can’t go against the hive mind without getting deleted.",
         "Reddit didn't became profitable for the first time on its own",
         "They won’t. They’re now saying Kamala lost soley because she’s not a cis, straight, privileged, upper class, white, born-male. They’re gaslit into thinking identity politics is the be all-end all and they can’t do anything wrong.",
         "Never?",
         "Dude it’s fine, I’m wrong. Turns out my ideology is the minority, and that makes me sad",
         "i mean, yeah i know, but its weird that theres no denial or crying\n\nits just... quiet",
         "I have been looking for it all over. Just nothing. It's so weird.",
         "I'm here from /all actually. I didn't even notice this was the conservative sub, so I only clicked into this thread expecting crying before being pleasantly surprised.",
         "Yeah but we all know how insane Reddit is lol",
         "Bro that means we get to replace Thomas and Alito and replace them with 30 year olds.\n\nThe Supreme Court is ours for generations.",
         "Popular vote has no effect on the electoral college but I guess you could say this was a Trump sweep in every possible version",
         "Just a cherry on top. No Dems crying about the EC being terrible.",
         "I think the Dems should have gone with a brokered convention. Simply going to Kamala was a huge mistake. A brokered convention would have added drama and excitement to a base that needed an adrenaline shot after that disastrous Biden debate. \n\n\nA brokered convention could have led to a possible Bernie ticket, or another more appealing candidate. It, simply boggles my mind why they chose Kamala.",
         "I really hope so, reddit was awful the last few months.",
         "Some of the state subreddits have been locking threads",
         "Unless it’s bashing trump, like always",
         "I literally just checked and they are hahaha holy fuck",
         "Tried posting trump wins and it's already been submitted",
         "That's because dead internet theory is true on reddit's front page.",
         "There's no way anyone with a nick of common sense actually believes she ever had a chance.",
         "Yeah, polymarket has annonced Trump the winner. \n\nEven without finishing the counts in PA and GA, there's no way she could even start to get close. \n\nTerrible performance and policy decisions by the Democratic party. They really no longer understand what the American people want.",
         ">Supreme court is ours\n\nAs a foreigner this concept is wild to me. You want the Supreme Court to be impartial surely? US politics are completely unhinged for me 😂.",
         "My brother, it is over\n\n![gif](giphy|3oEduLiXJfAh0ynigM)",
         "In Texas, their top 20 posts are locked. Anything not directly ‘I’m disappointed in Texas’ is getting locked. \n\nSore losers.",
         "If they were smart they'd do the opposite and stop doubling down on evil failed and wrong.",
         "Every state and city subreddit is controlled by the same type of idealogue. My thinking is: \n\n1. Only a leftist goon would consider being a janny for an internet forum for no money and only digital pats on the back\n\n2. It's been engineered that way by state propogandists.\n\nI'm leaning towards 1, but it's a true conundrum.",
         "These people are shameless and weak.",
         "I'd wager that legit 80% of reddit content is bots",
         "Take screenshots of the sub right now to show how fucking fake it is, all of the hot posts are hours old with no updates now",
         "how and why did *so* many people vote for her then? im legitimately curious to their thoughts. i really want to know WHY someone would vote for an empty suit",
         "There is nothing impartial about the US Supreme Court.",
         "Same for Georgia.\n\nShits so pathetic. The left being such pussies is what made me lean so right this time around.",
         "Most social media at this point. At the very least like/dislike or analogous metrics can't be trusted anywhere and bots that manipulate them are the most common form of manipulation.",
         "thats why /r/politics shut *down* after PA was called",
         "Can confirm, am bot"
      ]
   },
   "1gkte80": {
      "title": "We did it, Peanut. ",
      "text": "",
      "comments": [
         "If only Peanut could have lived to see his dream realized",
         "Love this",
         "I don't know why, but this brought tears to my eyes.",
         "Amazing.",
         "rip peanut",
         "RIP furry fellows. This win is for you also.",
         "Harambe is there too.",
         "![gif](giphy|pVUSHu2T3TRWPj96Xt)",
         "[removed]",
         "Don't worry boys, Franklin is going to avenge you too. (iykyk)",
         "What if Donny walked out during inauguration with his nuts out for Peanut? No one would even question it. ",
         "Because you have a heart and value life! ❤️"
      ]
   },
   "1gkr4ki": {
      "title": "Trump is currently leading the popular vote!",
      "text": "It's been 20 years since a Republican has won the popular vote!  Trump would hit a record if he ends up winning it!",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "No excuses for the Dems. They ran an awful candidate and they got their butts kicked.",
         "It's more likely than not that he wins the popular vote.",
         "If he ends up winning the popular vote, then not only will he be the first Republican since George W. Bush to do so, but it will also silence the numbnuts on Reddit that bark about Republicans not being able to win elections without the Electoral College.",
         "Looks like we have the Senate and probably the house too",
         "Trump always said if it was about the popular vote, he could win even more easily by campaigning in blue cities. They tried to discredit him. Instead, he rolled up his sleeves and filled up Madison Square Garden 10 TIMES over and proved them wrong!\n\nAnd oh yeah, he still KILLED them on the electoral college for good measure. This is what a LANDSLIDE looks like! 🇺🇸🇺🇸🇺🇸\n\nCONSERVATIVE VALUES ARE UNIVERSAL",
         "California is only 43% complete…popular vote can change quickly.",
         "Hes gonna win it 😁",
         "A statement victory. This is on par with Reagan’s win against Mondale if not better considering how both Neo libs and neo cons were against him.\n\nWhat a legend!",
         "That means the libs can’t complain about the EC and how the majority of Americans didn’t want Trump for the next 4 years.",
         "Update: we won!",
         "Greatest day ever.",
         "It's going to be very close. I think Trump can take it. Only lib ca can claw it back at the last second.",
         "He’s currently on pace to win by 1.4%. Absolutely huge",
         "Would be nice!",
         "This is trumps kiss me I'm Irish moment!",
         "Serves them right.",
         "They didn't just run an awful candidate. Kamala was a suit for their entire agenda on every level. This was a rejection of their blatant authoritarianism.",
         "Their entire lets oust Biden for Harris didn't work after all",
         "You think they’ll shut up… how cute.  Facts don’t matter to these people.",
         "As of the moment 4:31AM EST, the NYT is predicting that Trump won the popular vote by 1.4%.",
         "What site is good for seeing the latest count? Mostly I'm looking at polymarkets for a general sense",
         "You wouldn’t know it from the media, though. They did everything they could to run interference for her.",
         "But, but, California is a big state. Maybe they should decide for the country. Because then we’d win. But if that doesn’t work we’ll find some metric that spins it in our favor.       /s",
         "I’m just looking at Google who uses AP"
      ]
   },
   "1gkvzx0": {
      "title": "When do we start deporting the r politics mods?",
      "text": "",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "I've noticed my feed doesn't have individual state subreddits bashing Trump with 40k up votes anymore.",
         "Right after we IMPLEMENT PROJECT 2025. 😆",
         "A lot of them will be deporting themselves… from this plane of existence",
         "Did that sub go private yet?",
         "Now that will be a real transition team!",
         "harris-walz coordinated bot discord server got nuked",
         "LETS GOOO and don’t forget, we need to also rebrand the GOP as THE NAZI PARTY because as they said, trump is LITERALLY HITLER",
         "No yet, the mods are all locked in their cucksheds."
      ]
   },
   "1gkomd6": {
      "title": "BREAKING: Donald Trump Wins North Carolina",
      "text": "",
      "comments": [
         "Thank you North Carolina garbage people!",
         "Fox is laggin behind or red state calling early?",
         "Too big to rig, mothertruckers!!",
         "Is red state reliable?",
         "Screen shot the Reddit meltdowns!",
         "That's a whole lotta garbage.",
         "Let's go!",
         "I feel like gloating on left leaning subs lol",
         "Boo ya! Cast my vote about 2 weeks back and glad to be in good company with this result. Feeling good about taking the whole enchilada at this point, but the night is still young. Let’s hope and pray for no overnight BS ballot dumps.",
         "Nah there’s like half a million votes outstanding in Charlotte this is too early to call",
         "Fox is garbage. They are calling all states tied. X seems more realtime.",
         "AP hasn't called it yet, but I think they should.",
         "Looking good so far.",
         "Thank you North Carolina! You guys rule! ",
         "You fakin garbage bags!",
         "Ahhhh Sweet Chin Music komrade kamala",
         "CNN is still blabbering about NC.",
         "He hasn't won NC according to the latest. Why have you posted this?",
         "THIS GARBAGE LADY VOTED IN MECK COUNTY TODAY 😁☠️",
         "I love my garbage workers, just saying. You MVPs.",
         "Being in N.C., this is one of the few times that I really felt like my vote mattered. I lived in an ice blue state for years prior to this where my vote was like trying to throw a paper airplane against a stormy wind.",
         "THAT’S ME! ",
         "News networks are being very cautious calling early.  No one wants to repeat Florida in 2016 where you have to pull a state back",
         "Multiple sources are calling NC. The main broadcasts are avoiding it. \n\nDailywire coverage broke down the county performance and Trump is performing extremely well compared to 2020. Mainly in predominately black counties where he’s seeing a +5% swing compared to 2020.\n\nThis plus increased voter turnout in favor of him all indicate a NC win.",
         "Go on X. That is where the real data is being released.",
         "Newsmax declared him winning NC 10 Mins ago",
         "Yes, check out the conversation on X. It is legit.",
         "Oh yes",
         "It’s beautiful rn. I’m in Heaven",
         "Especially the NC sub. It has been a cesspool of \"Orange Man Bad\" hate for weeks. I'd really like to do an NFL-worthy victory dance there.",
         "I'm already racking up downvotes on r/politics lol",
         "For now, I'm cautiously optimistic. I saw what happened to the Bears. I don't want to taunt the crowd just yet.",
         "Maths...",
         "Fox declared it",
         "One man's trash is another man's treasure! God bless you!",
         "This trash man did also! See you in the dumpster. 😉",
         "Ah gotcha. Ty.",
         "I don’t have X. Is there anywhere else I can get reliable information?",
         "this this this\n\ndont trust any search engine or news site. x is the place",
         "What thread or account? I don't use X so mine is behind by 30mins at the minimum",
         "Good idea. Maybe I’ll go to every state that Trump won.",
         "id really suggest making an account. this isnt the twitter of 2016",
         "sign up. It takes 2 minutes.",
         "Follow the War room and Jack Probosiec to start. You'll see hundreds of conservatives. We have built a community.",
         "Edit: NC resident of a blue county. I've had to put up with this crap for an entire year! I'm positively giddy.",
         "[deleted]",
         "At least you’re lucky you live in a red state. I live in Illinois which has been blue in recent years. The commies in Chicago absolutely sickening and each subsequent mayor goes further and further left.",
         "I'll make a list. Seems like there is interest within our community.",
         "I’d appreciate it. I would reactivate my account if it meant I could see what I wanted to see.",
         "Trust me. That is where I obtain the majority of information. Tons of great minds/content.",
         "I should have worded that differently. Not what I *want* to see, but things that are relevant to me. I’m sure you know what I mean, but people like to twist words on this platform.",
         "i hated twitter, but x is a different thing entirely"
      ]
   },
   "1gkrj8n": {
      "title": "Harris will not speak on Election Night ",
      "text": "",
      "comments": [
         "Shes drunk and doest have a script for her meltdown.",
         "Desperately searching for a way to ratfuck their way to a win.",
         "She’s piss drunk",
         "The teleprompter isnt ready",
         "Hillary Clinton 2016 Deja vu hitting right now",
         "She can’t fake chuckle her way through these results.",
         "Wonder if she's copying Hillary's drunken tantrum.",
         "It’s hard not to feel extremely optimistic. This election is all but won. ",
         "Thank god, fuck.",
         "She's pulled a Killary, she's too drunk to speak.\n\nNot that it's stopped her before though.",
         "We did it everyone!! Big middle finger to the establishment!",
         "Aww, what happened to all that joy and brat energy she was peddling?",
         "She can't speak in the regular world either...  At least we agree on something!",
         "Classy, just like Hillary. Admit you lost.",
         "Democrats are in denial. The wikipedia page on the election still doesn't say Trump won and his page doesn't mention he's president elect. I remember how quickly they put that label on Biden as soon as the race was called for him in 2020.",
         "Hey this sounds familiar",
         "Womp womp",
         "🤣",
         "Smart move. She can say something gracious tmw. Too frazzled now",
         "WHERE IS MY JOYFUL WARRIOR!?",
         "Thank God!  Don't need to hear any more cackling.",
         "To be fair—did this woman ever really have anything to say?",
         "She's had too many Magaritas🍹",
         "Sounds like a sore loser, that’s what that is.",
         "Lame.",
         "Why start now?",
         "I wonder how much blow she did tonight.",
         "Exhausted.",
         "Thank the lord she didn’t win. Trump train can’t be stopped, you cackling phoney! Red waaaaave!",
         "![gif](giphy|eJLvKAHS1PtDSiyRCY)",
         "God damn coward",
         "Never go full Crooked.",
         "Lmao",
         "Sour grapes.",
         "She has no use for her own voters anymore. Her loyalty stopped the second victory was called into question. \n\nNot good president material. Not that she ever was.\n\nTRUMP OFFICIALLY AT 267 ELECTORAL VOTES!!!!!",
         "Hillary 2.0?",
         "What's crazy is that this is actually the most likely scenario",
         "She’ll sober up when she has to certify Trumps win.",
         "Has an early interview at McDonald’s",
         "This comment wins.",
         "I almost understand 2016. It was considered a guaranteed win by many. This time harris could have foreseen it and prepared.",
         "Maybe she'll do that Rogan podcast now 👀",
         "It’s over. It’s in the bag. 🇺🇸",
         "That's gotta sting.",
         "Today she moppin floors next week it’s the fries"
      ]
   },
   "1gks59d": {
      "title": "And just like that, America is now unburdened by what has been!",
      "text": "Super big congrats to Trump for the victory. He pulled off the biggest political comeback campaign ever.\n\nHere’s to the ensuing meltdown from the media and the Left. 🥂\n\nEdit: I’m going to relish seeing this campaign, from the mugshot booking to the lawfare persecution to the assassination attempts, go down in the history books. 🇺🇸",
      "comments": [
         "Holy shit, this finally makes sense.",
         "Fucking glorious.  I will be quoting this line for the next week solid just to watch the seething.",
         "He needs to take that slogan now 🤣",
         "https://x.com/TheBabylonBee/status/1854047850881040733",
         "We're unburdened by the has-been.",
         "I am so happy I don’t even have words",
         "Thank God and Greyhound she’s gone!",
         "We have come full circle. Comrade Kamala has fulfilled her prophecy."
      ]
   },
   "1gkqfvn": {
      "title": "BREAKING: GOP Wins Control of U.S. Senate",
      "text": "",
      "comments": [
         "This is BIG! Now let’s get the HOUSE!",
         "We like it we love it 🎉🇺🇲",
         "RED WAVE",
         "Popcorn for the r/politics meltdowns! MAGA",
         "It's a good day.",
         "From Canada, I love you all.  This is very good for my country and yours.  <3",
         "#LET'S FUCKING GO!",
         "Bye Bye Chuck Schumer",
         "Mitch McConnell is out, so be glad to see new leadership in the Senate.",
         "Regardless of what happens with the Presidency (which right now is looking good), claiming the Senate is a massive win. Judicial, cabinet, and major legislation initiatives of a Harris admin would be difficult to pass with the projected majority. ",
         "Only matters if they actually do something this time. Last time we had both, they got nothing done.",
         "Jim Justice will receive much gratitude.",
         "Now get the house and don’t be useless like 2016",
         "![gif](giphy|FbiL9rsmZN3ib2JSGo)",
         "Yes, That’s great news.",
         "Thank God. Even if Kamala somehow pulls off a win, as long as the GOP controls the Senate the country is still salvageable. They can't abolish the filibuster, they can't stack the courts, and they can't legalize 20 million illegal migrants. The Supreme Court will stand a few more years to protect our rights.\n\nWe are safe, for now.",
         "This is good!",
         "There we go! Love to see it",
         "We’re on pace to make it 56",
         "Mitch McConnell needs to Vacate!",
         "More like a Trump wave.",
         "They’re brigading so hard and I just don’t give a fuck. We fucking won, bigly. Suck it up.",
         "I'm going to be busy in the salt mine er r/politics today",
         "Thank you Americas hat!^",
         "Now kick that dirty communist Trudeau out of office.",
         "As a fellow Canadian, why do you think as such exactly? Lol. I'm Conservative myself but low oil prices and tariffs aren't exactly great for Canada.",
         "We can solidify a conservative Supreme Court for decades.",
         "MAGA",
         "We will.  Polling supermajority for the last 18 months.",
         "Exactly. I've been saying that, if Trump wins and has the Senate, then Thomas and Alito should retire. That way Trump can appoint two more, fairly young, justices. The only way the D's could regain the Court is to expand the Court. \n\n\nI love Thomas, and adore Alito. I will forever be grateful for them. But we cannot have an RBG situation.",
         "This is so incredibly huge.  We will finally be able to dismantle the federal bureaucracy and let people decide for themselves on a state and local level.",
         "4D Chess"
      ]
   },
   "1gkrkkd": {
      "title": "The politics subreddit ",
      "text": "...has gone awfully quiet. The state of total shock and disbelief is hilarious.",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "You're misinterpreting it.  The propaganda money is finished so all those bots and paid astroturfing is offline.  That sub has been dead for a while",
         "Sub is just in meltdown",
         "Total meltdown. Theyre not handling anything well. Im not a great person, so ive been having a little fun over there 🤣",
         "Cheques from the astroturf campaign have stopped clearing.",
         "Most subs in this liberal cesspool will go quiet or push that President Trump will eat babies.",
         "Did they remove the live thread?",
         "I've been refreshing it for a while. It's hilarious.",
         "Theyre trying to find out a way to bring in mysterious votes overnight ",
         "Turns out i was just arguing with bots this whole time lol",
         "Remember that Reddit is more right than the majority of voters who voted red today.",
         "The bots are oiling up for round 2",
         "![gif](giphy|qOLT5C2SxNINSREyx9)\n\nLet's go guys Elected the sane guy into office so Thank you guys for saving democracy",
         "It’s going to be hard all Trump needs is Pennsylvania and Nevada and he wins.",
         "Wonder what they'll complain about once the remaining states call their electors and he gets the popular vote too.",
         "Vindication! Oh this is soooo sweet!!\n\nOrange man bad won more biggly than his first time!! Freaking hilarious!!!\n\nAmerica has awakened from the woke nightmare they themselves created.\nThis country ALWAYS rights itself whenever it goes too right OR left. \n\nThank God!!!!!",
         "It’s great",
         "Right makes Might, once again.",
         "Probably took the rope meme literally",
         "Everybody on Reddit is so baffled at the fact that a candidate that wasn’t picked by the people and has less charisma than a bag of white rice had bad voter turnout. It’s like… yeah, what did you expect?",
         "It’s weird how inactive it is. Goes to show it was 100% astroturfed with bots",
         "The state subs are in meltdown mode. r/texas can't handle that state didn't flip.",
         "Reality has a conservative bias",
         "I love to see it!",
         "r/pics is going wild",
         "Exactly this. There has been a rapid decline ever since she first announced. It’s very clear less and less money is being spent to push social media propaganda",
         "It's like 2016 all over again",
         "The entirety of Reddit is in meltdown.",
         "Honestly, I’m all for not piling on, but these people need a reality check. They look down on everyone, call them uneducated bigots, and act like complete children",
         "Same. They can downvote me *all they want*, it doesn't change what happened tonight and I am so thrilled to share this moment with all of you.\n\nIt's time to fix the damage the Dems have done.",
         "And then they claw back the money from the braindead leftists who did their dirty work.",
         "Bidens the one eating babies if anything",
         "oh, they dgaf about babies",
         "I don’t know why my comment didn’t come as a reply. Trump is up in all swing states. He just needs Nevada and Pennsylvania to win. He flipped Georgia, so that was a big win.",
         "Philly is working overtime to find a way to print 230k ballots!😂",
         "Fing PA has been at 90% for like 3 hours.  I live in PA and it’s pissing me off!  I wanna go to sleep!",
         "Every post I try and make gets deleted. I have made sure I am following all rules.",
         "i haven't visited that sub in years, it's worse than i remember. what ever happened to voting being a private matter? literally every single post is some half-assed photo of a sticker saying \"bTw i VoTeD FoR HARRIS\" and gets 30 thousand upvotes. What a bunch of fucking losers.",
         "Yo every post is +50 dem bias",
         "None of it was new. It's been like this from Trump's first run. The admin and power mods are literally the DNC.",
         "I’m here for it.  Let the salty tears flow!",
         "Losing the popular vote should also be the biggest reality check for the Dems.",
         "All they need is to ship it from NY",
         "Probably Philadelphia playing games.",
         "The gas cost and tolls are just too much in this economy to bring those ballots over!",
         "The super rich will pay for it.",
         "They’re on a plane out of the country!  Their name is on the Epstine/PDiddy lists!"
      ]
   },
   "1gkmz7c": {
      "title": "Miami-Dade is RED!!!!",
      "text": "I knew Trump would take Florida, but being a Florida native, I never thought I'd see Miami-Dade county vote conservative! And with a 10% lead!",
      "comments": [
         "That is a big deal",
         "I suspect there will be other counties in America he flips. These kind of wins are key",
         "They already voted DeSantis back in 2022 so this is an expected win for Trump!\n\nAlso explains why Miami is my favorite major city in the US, alongside the Latin American influence, coming from a Latino myself.",
         "Keep em coming",
         "There is around a 3% swing to him in heavy blue areas in Texas like Houston, Dallas, Austin and San Antonio. He gets the 3% swing in blue stronghold like that it's all over red rover. A landslide coming",
         "He’s going to win all of Florida by about 1.5 million votes. Amazing",
         "Much love to Florida from a Canadian.  My favourite place to vacation.",
         "I was SHOCKED, and I live in Florida. It hasn’t happened for a Republican since 1988, so Trump winning Miami-Dade is badass 😝",
         "This switch is STUNNING. WOO HOO!",
         "Shout out to our Cuban-American friends!",
         "I was shocked Hillsborough county went red too. (Tampa) People really went to work to win this.",
         "Solid margin.",
         "[removed]",
         "I was too! I just didn’t feel like editing the post lol. Huge win. People who aren’t from Florida won’t really understand. Duval, Hillsbourough, and Miami-dade were such strongholds. Now only Orange County needs to be toppled."
      ]
   },
   "1gktlb8": {
      "title": "Anyone else just feeling a relief?",
      "text": "I am honestly feeling like I personally have accomplished something. \n\nJust when election started I saw a restaurant with cardboards of both Harris and Trump outside as I was picking up some sushi and the next thing I saw driving home is some unhinged left person kicking the Trumps cardboard as everyone’s watching eating out in the patio at the restaurant, I honestly just could not believe the point we have gotten.\n\n I am so relieved of this pressure constantly from media, influencers/celebrities, the left Reddit trying to convince people their way of brainwashing and I’m saddened on how many people still are, but at the end of the tunnel we did it and we did it with record numbers!!!  \n\nWith that said, there’s literally absolutely no reason or pleasure for me to even lurk over at politics anymore because none of the stuff on there is real as we saw in tonight’s election results. \n\nI do hope that left does change their point of view as our next president cleans up the mess this administration have done to us all.\n\nLastly and most importantly, I HOPE WE WILL COME ALL TOGETHER CLOSER AS A NATION AND NOT SO DIVIDED THAT WE HAVE BECOME DURING CURRENT ADMINISTRATION.\n\nCheers!",
      "comments": [
         "My dude, I wanna unburden myself from what has been. This was literally 2016 again for me. Woke up and found my man Donald Trump has won",
         "We gotta protect him now.",
         "Like I can breathe for the first time in 4 years",
         "I'm a little nervous about this gap of time between now and Jan 20th. \n\nI'm also nervous about all the fuckerey that the deep state is going to do to ensure it can't be rooted out after Trump takes office.",
         "It feels good to be unburdened by what has been..",
         "Something compelled me to vote. There was no way I was not voting.",
         "Oh yeah\nCan't sleep though",
         "I’m looking forward to economic growth and potentially to finally own a home.",
         "Yes, mixed with a shitload of WTF? for the rest of the country voting for Harris.  I mean, really?",
         "We feel the relief all the way in Israel :) congrats, my American brothers and sisters!",
         "I've been hoping for a Trump win but always had a fear (I would always have had it) but now that it's over and secured, I feel such relief.\n\nWhat a feeling!",
         "I think we are just getting started",
         "When I realized around 7:30pm eastern time that it was a guaranteed win, I felt relief for a while.\n\nNow I'm focused on 2026/2028. 4 years is nothing when the uniparty still exists to block every meaningful change. We have to look forward and keep the momentum going.",
         "Yeah I woke up and looked at my phone and I was like oh my God 😍",
         "Did anyone check on FakeNews. Did they have enough tissues and paper bags to get through.",
         "The relief is insane! I feel so much better about the future of America!",
         "I didn't follow any of the coverage overnight. Couldn't bring myself to do it. I watched a movie and a couple YouTube videos from some creators I liked and slept great.\n\nThen got woke up by the Google news AP notification that Trump won.",
         "[removed]",
         "You know they’re already spying on him"
      ]
   },
   "1gkt9tp": {
      "title": "The dramatic change on Reddit is 👌unbelievable👌",
      "text": "This is one of the most illuminating nights of my life. The entire ethos of an era, a literal decade+ of lies, stripped naked by the will of the people. ",
      "comments": [
         "I'm overjoyed to have taken part helping this happen by voting for my first time today.",
         "We’re so fucking back!",
         "r/politics has zero moderation, all the bots have been turned off and it's a ghost town. \n\nFirst time I've seen this",
         "#LET'S FUCKING GO!",
         "As a wise man once said:\n\n'The more that a broken system tells you that you are wrong, the more certain you should be that you must keep pushing ahead'\n\nDon the Teflon",
         "God saved Trump for a reason",
         "I always felt the Democrat marketing campaigns labeling Trump supporters as ‘weird’, Nazis and fascists at various times over past few months came from testing on Reddit and not the real world.  Democrats employ younger marketing people from largely Ivy League universities that don’t understand working class people. That recent campaign to get women to lie in the voting booth was so out of touch.",
         "Let's go!",
         "It's as if a million bots cried out  and suddenly had their funding yanked.",
         "Now we have people saying that Harris was bound to lose anyway. These are same people who kept saying that Harris was going to win.",
         "We never left",
         "I fuckin love it, it’s like there’s real people on there and not bots parroting a leftist narrative",
         "Yup. You can post whatever you want like you should have been able to in the first place. Same with r/pics. All the leftist BS is gone.",
         "Wow it’s full cope mode over there. “Kamala wins DC” yeah. Yeah she did buddy.",
         "That’s fucking wild.",
         "I mean they are not being paid anymore to run the bot farm. \n\nI bet though they are being retooled to spew the most vile misinformation and propaganda they can thing of and be back online in short order",
         "Kamala's campaign gave up",
         "Turns out that labeling the majority of voters as “Nazis” isn’t a winning strategy.  Color me shocked 😐.  Will they learn anything from this?  No."
      ]
   },
   "1gknx6l": {
      "title": "Amish turn out for Pennsylvania vote in 'unprecedented numbers': source",
      "text": "",
      "comments": [
         "They go trump. All of them. They want the govt to leave them alone. \n\nPs the amish showed up in DROVES in western nc to help rebuild. This is GREAT news for us 🙏🇺🇲",
         "Do you think those Amish women saw that commercial from Harris about women not telling their husband how they voted?",
         "SHOULDNT HAVE FUCKED WITH AMOS MILLER!!’\n\nMAKE AMERICA GREAT AGAIN!!!!!",
         "What about the Mennonites and Pennsylvania Dutch?",
         "Hopefully Washington gets the message and leaves our raw milk and pet squirrels alone.",
         "Raw Milk for everyone!!",
         "That is so awesome. Wouldn’t it be crazy if they decided this election?",
         "Scott Presler. He’s the reason",
         "As I walk through the valley where I harvest my grain",
         "Amish Paradise theme music for the victory speech?",
         "Any data on how many of them voted or are registered to vote? ",
         "Barns barns everywhere up in a day! \n\nBut seriously that’s awesome to hear!",
         "They dont watch tv. If they did see it its an even bigger plus for us. Im from the burbs of philly about 2 hours east of amish country. Went all the time to the outlets in Lancaster. If they vote its solid trump country. The amish are possibly THE most family oriented group of people on the planet. Talk about traditional family values. Any hint of the amish busting voting records is nothing but EXCELLENT news for us. They are an isolated, closed society, and they hate the govt.",
         "Aren’t the Pennsylvania Dutch the Amish?",
         "\\>They dont watch tv.\n\nI don't either, and in fact I go out of my way to avoid hearing whatever sloganeering the mainstream throws at me *as a long time habit.*\n\nThere's a flip side to this though - we mustn't assume they've never heard of it. I can see how they wouldn't have bothered to vote for countless earlier politicians but at the same time I can see how their way of life is threatened by the *system* the left is voting for while their nominee is running a nothing campaign.\n\nBiden made everybody poorer, and not everybody had a margin to dig into. SF & NYC lefty strongholds keep acting like taking more and more of people's money away is no big deal, because *they* have plenty of surplus to cut into. Their style of politics pretends there's nothing wrong with cutting into the farmers and factory workers who never had their big city comforts in the first place.",
         "It was a joke.",
         "Not even the Mennonites??",
         "While there are alot of problems within the Amish community specifically certain churches they are over all a wonderful and god fearing peoples.",
         "Oh sorry, whoosh. A lot of people (on the left) are taking that super seriously thinking those commercials are going to create a glut of new trump voters lol.",
         "But they are prodigious breeders\n And that is no joke"
      ]
   },
   "1gkt7fk": {
      "title": "Greatest campaign in history ",
      "text": "",
      "comments": [
         "When I saw that new garbage truck with a fresh Trump logo on the tarmac within 12 hours of Biden's comment I knew the election was over. Trump understands the American people.",
         "I don’t know how I can even try to sleep when I’m too busy swimming in the tears of the other 99% Reddit hivemind.",
         "He made that shit happen FAST",
         "I'm right there with you!"
      ]
   },
   "1gkorfz": {
      "title": "Ted Cruz wins third term, defeating Dem Colin Allred",
      "text": "",
      "comments": [
         "Well I guess all those Reddit Posts that said he was going to lose were wrong. 🤔",
         "/r/Texas is a ghost town. It's been astroturfed for months.",
         "Let’s gooooo… to Cancun.   /s 😂",
         "80 million dollars the Dems spent in ads for Allred in Texas. Did my part in voting for Trump and Cruz.",
         "Dems dumped a shit ton into this race only for Allred to get his shit kicked in by about 10 points. Reminds me of the Lindsey Graham race last time around",
         "It’s a wild realization he’s been in congress for 14 years now. Good for him, glad he won he’s a solid conservative which we need in Congress, but wow. ",
         "The DNC dumped a metric f-ton of money into that guy. His next few months are not going to be a good time. \n\nThat said, congrats to Cruz.",
         "So glad he pulled it off again!",
         "Looks like a decisive win for Teddy boy. Good result for Texas!",
         "Good job beating Soros/Schumer plant.",
         "The Dem's grin looks worryingly unnatural, beware of politicians with fake smiles and this one looks about as real as an infinity-cubed dollar bill.\n\nSmiling with both rows of teeth is a Washington DC smile not a regular person smile, but what this guy is doing is more like a canine *'bearing teeth'* gesture.",
         "I’m in Texas. I needed that so much. Now I just need a senate majority and I can relax a bit.",
         "Good.",
         "I did my part.",
         "Wow the left gaslighting is insane!! They made me believe Ted Cruz was truly in trouble!\n\n\nGlad he kept his seat too! ",
         "He won by 8.5%… so I guess it wasn’t that close after all.",
         "I predicted he'd win by 6, he's winning by 9. What a mollywhopping",
         "I remember once when I tried to be active in that community. I very quickly realized that I was not very welcome there. Sad state of affairs.",
         "100%, you can see the massive drop in engagement today",
         "Lmao fuck those people bro. The vast majority of actual Texans are deep red, pure delusion. Handing them yet another L after all the hype for Robert Beta O Rourke",
         "I'm really intrigued to see what happens to Reddit in the coming months. After all of the news about astrotufing the site for Harris, you'd kind of assume the election already would lead to less liberal engagement. If Trump wins, Harris is basically a nobody to the Democrats, and her brigade of lackeys have no incentive to keep up their engagement.",
         "“Castroturfed”",
         "His ads were so lame too lol",
         "Same. First time voting in Texas, did my duty.\n\nI didn't relocate here for no reason. Keep Texas Texas!!!",
         "Same",
         "They just called Moreno the winner over Sherrod Brown in Ohio. That's the flip that gives the GOP the senate with Vance being the tie breaker if Trump wins. It's early in MT but that seat looks like a flip as well in favor of the GOP.",
         "All of the local subs are like this.\n\nr/austin is hilarious cause it's filled with vote blue no matter who people complaining about crime and lawlessness they voted for",
         "To be fair... they could be crying themselves to sleep",
         "The top posts saying Texas will be blue and Cruz will lose, my sides😂",
         "They will spam conspiracy theories about how Trump only won cause of Russia or something and that he’s about to go to prison at any moment",
         "Just got the 51st! Senate is a lock!",
         "Yup. If they tried to take it from him in 2016, they'll try with every last ounce of their power to stop him from becoming pres on Jan 20th. It might be in the form of some radical progressive congressmen or another 3 letter agency hoax but they'll try whatever they can to keep him out."
      ]
   },
   "1gkrrwn": {
      "title": "Kamala abandons her own watch party as path to victory fades ",
      "text": "",
      "comments": [
         "Lol!",
         "![gif](giphy|26ufcVAp3AiJJsrIs)\n\nKamala supporters be like",
         "Im not gonna say i dont feel bad for them. Bc i remember being sorely disappointed just like that in 2008 and 2020 as well. But theyll get over it. Theyll be fine. The world is not ending. Maybe these next 4 years will be good for letting ppl get some perspective and a freaking grip.",
         "She’s so lazy and doesn’t give a shit!",
         "Not very joy of her",
         "She is currently on the phone with Hillary.",
         "full cam newtown",
         "Worst campaign ever run. It was flatline from the get go.",
         "Pussy hats on Inauguration Day is gonna be epic",
         "This is not surprising about Kamala. She seems like the type of person that can't handle pressure or defeat well. It was a true glass menagerie.",
         "Sad!",
         "Looking forward to the 2024 meltdown supercut videos. The schadenfreude is and will be delicious.",
         "Honestly though, what a shitty thing to do to your supporters, many of whom may have travelled far and you couldn’t even speak to them.\n\nA final omen exemplifying how she would be a terrible leader.",
         "I agree. The MSM has made them absolutely insane. My sister in law told me that she had a librarian friend who thought Trump would throw her in jail if she didn't ban books 🙄 in what universe did he even imply such a thing??",
         "I don't feel bad for them.  They're a bunch of lying, thieving hypocrites.",
         "I don't feel bad for them. They'll get to reap the benefits just like the people who did vote for him.\n\nRepublican voters would have to feel disappointed on election day \\*and\\* live through economic turmoil afterwards.",
         "I think she’s throwing the tantrum of the century calling everyone she blames and screaming at them.",
         "How a candidate acts on election night, particularly when they're losing, is one of those moments where you get a genuine look at their character or lack thereof.\n\n\nA lot of Kamala's supporters are learning who she really is tonight. ",
         "Solidarity lol",
         "On the phone or on the camera?",
         "Hillary did the exact same thing in 2016 when she lost.",
         "And has it ever been done at Howard before? It would have been historic!",
         "So sad. A bunch truly believe hes bringing back gas chambers for his enemies and trans ppl. Its horrifying to know ppl actually believe this.",
         "Oh, I'm sure they can hear her screaming all the way in Fairfax.",
         "A weak willed sore loser.",
         "Apparently, Hillary lost her shit and had to be restrained.  They should have brought her on stage anyway just for the entertainment value.",
         "Warrenton!"
      ]
   },
   "1gko18o": {
      "title": "Texas declared",
      "text": "Great news and looks like a 3% increase making it a safe hold. Teddy up by about 400k in the senate race too. Well done Texas. ",
      "comments": [
         "Can’t be./s  R/Texas told me the state was going blue. ",
         "R/Texas in shambles. FUCK EM. Red state subs are fucking pathetic",
         "Cruz wins!!!",
         "The 5 subreddits i muted today from Texas must not be happy about that",
         "VERY NICE 😎🇺🇲",
         "God bless Texas!",
         "Thank God, nice to see all the Californians need to wait another two years to try fucking it up again.",
         "Dear /r/Texas,\n\nDo you like CDs or Tapes? CDs nuts in your mouth.",
         "Look how many bans they are handing out over there 😂😂😂",
         "![gif](giphy|VjzHEo2kXOxtJOJRCS|downsized)",
         "Why thank you. I did my best! (First time presidential election for me after leaving California 2.5 years ago)!",
         "If Colin had only visited all 254 counties and road a skateboard in a Whataburger parking lot, maybe he could have picked up a point or two.\n\nIYKYK Beto's playbook.",
         "![gif](giphy|9WjjPWisZdN2IiVmFl)",
         "They lied",
         "And now Ted Cruz is reported to have won. LoL they were so confident.",
         "Lol they were crazy to think that. Californians already ruined Colorado, I hope they won't do the same to TX",
         "It only goes blue in spring when the bluebonnets are in season.",
         "Turns out they are colorblind",
         "It might go blue, in 2044…",
         "I had to read that a couple times before I got it, thought you were trolling. Yes, I believe you are correct, all the red state sub reddits are probably losing their minds. Hopefully more red flips tonight, PA is not looking that great right now, but still a tight race any way you look at it.",
         "Just peeked in to see the shitshow, and it is rather glorious.  One post about Texas turning blue posted at 1 PM is now locked.  \n\n🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣",
         "I screenshotted the picture of a blue Texas with fucking flowers and cartoon characters all over it lol\n\nThese people are delusional",
         "As a Texan, I don't know how those assholes view themselves as an accurate resprentation of the state. Embarassing.",
         "R/Florida is crying right now. Let them whine.",
         "See, bad things do indeed happen to bad people.",
         "He and Rick Scott were seemingly in tight races with the news trending that they were losing support.",
         "My thoughts and prayers are with those poor folks in R/Texas struggling with mental illness as a result.",
         "Reddit's subreddit recommendation algorithm is awful. I open one post related to Texas and suddenly start getting subreddit posts from 10 different Texan cities in my feed. I had to mute all of them.",
         "It's what they do.",
         "'Member Iowa's Selzer poll?",
         "Most of r/texas does not live in Texas.",
         "by 10 points!",
         "We are primarily getting the conservative Californians - the ones who are running away from CA. The Californians I met in CO were typical West Coast from LA to Portland. The ones I meet here in Texas are more like those in Orange County.",
         "Local subreddits are awash in bots",
         "Look again. Trump is only 11,000 behind in Pennsylvania",
         "Plenty of time to manufacture ballots, just like 4 years ago. 🤷‍♂️",
         "They only know Austin",
         "I don't think they can help themselves.",
         "Yep",
         "Selzer just shredded her credibility.",
         "Oh good!! I hope Texas never changes. I grew up in CO and had to move away because I couldn't afford it anymore. ",
         "I just did, now he is 2k ahead!!!",
         "I think what she actually did was put a fork in phone polls entirely. Spam calling has all but ensured that Americans that are actually productive members of society don't answer unknown calls. It seems like Atlas Intel nailed it again though. Not sure what their process is but it works.",
         "Almost 50K ahead right now",
         "ABC says that PA is still a toss up, even though Trump went from 11k down to now 50k up in less than an hour. They may he in denial, but they are saying good things about trumps performance so far, which shocked me to hear.",
         "The Amish are really pulling through for us."
      ]
   },
   "1gkh9af": {
      "title": "Kamala Harris pretends to have a phone call with a voter. Unfortunately it shows she only opened her camera app.",
      "text": "",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "She's just so fucking fake it's unreal\n\nShe makes Mark Zuckerberg look downright human",
         "lol no fuckin way",
         "Her entire campaign is like a reality show.   Nothing real about it.   All lies, deceit, and fakeness.  All because she hates Trump.",
         "TBF, you can run your camera app and be on a call at the same time.",
         "I can understand why people vote Democrat, even if I don't agree with it. But the fact that her thorough and routine exhibits of being out of touch and inauthentic don't turn off so many of her supporters, I'll ever understand.",
         "You can open your camera while on a call though, right?",
         "Harris: most fake person alive?\n\nHell, if she loses, maybe she would be a great actress! She can muster up plenty of referrals in that business. I mean, we wouldn’t pay to see her but Dems would",
         "What if it rang mid fake calls? 🤣",
         "Amazing how she was prosecutor. <slurp>",
         "Any other video of this other than a video on Reddit? Not doubting OP but I’d like to see multiple\nsource because we can’t even trust what we see anymore..",
         "*”Hello human, I am a fellow human. Let us engage in activities that us humans do. Would you like to play the human activity with me of hopscotch or perhaps something else?”*\n\nI can’t get over how much Trumps rise really put the magnifying glass on how inauthentic these people are.",
         "It's sad to think people would vote for that.",
         "Yeah idk. Maybe it's fake but you can certainly have your camera open while on a call. Honestly we're not starved for verifiable examples of her being fake. This is just a nothing burger at this point, and even if it is proven she wasn't on a call at all, it's just another day for her. Nothing surprising regardless.",
         "This is hilarious; I would have thought that they'd at least stage a phone call, but not only are they liars, they're extremely lazy liars.",
         "She and her Hollywood celebrity supporters are fake. After all they are actors!",
         "If you swipe up from the wrong corner it goes to camera, I'm not much of a smartphone person and I do this all the time too.\n\nOn the other hand, better smartphone skill might be expected from someone who is actively running a campaign. (might)",
         "I tried to do this with my iPhone and yeah, if you try to use the camera you can bring up the app, but not use it. Unless it's an Android, or if she's on another iOS version, she wasn't on the phone with anyone.",
         "Is there an enhance screenshot of 0:10? It looks like there's something on the opposite end of the take picture button?",
         "The most bizarre person I’ve ever seen. She just can’t be normal lol",
         "I still very strongly believe that her initial phone call with Biden and Obamas was also fake and produced by GPT-4o as there were pretty clear glitched voice cracks and Biden was talking as eloquently as 20 years ago. Their whole campaign was based on lies and Trump hate.",
         "😂 Not surprised. Everything about her is fake.",
         "![gif](giphy|5PvdsQmoZQx9Ej4xaJ)",
         "Is anything real from the Democrats?",
         "Even in the 11th hour shes still flubbing this shit. Unreal.",
         "It was on the camera. Lol",
         "She called her self",
         "Lmao 🤣",
         "Ahahahaha",
         "Zuckerberg started working out and doing combat sports, got his testosterone up. It literally turned him from a flaming lib to a borderline conservative. Same exact thing is happening to Bezos.\n\nFunny how that works 😂",
         "She is fake!\n\n**However... It is not impossible to be on phone and camera at the same time.**\n\nYou don't see on the notch you're on a call, just the green dot indicating the camera and mic are on. \n\nSo, it isn't impossible. Nothing concrete here. Don't jump on it.",
         "Ow! Gonna need some Bactine for that. Jeepers.",
         "The voices in her head giving her false realities",
         "she pays people to attend lol and many are invite only.   lol",
         "Ironic considering Trump was the one on a reality show back in the day.",
         "This is true, and a lot will depend on what model iPhone.\n\nIf she’s using the newest iPhone, there’s a camera control button that if pressed will launch the camera app. I’ve done it accidentally.\n\nIn all, it’s too hard to definitively tell from a video at that distance what was going on.",
         "You can. But it will show the phone call icon at the top along with another icon saying the mic is in use. So no she wasn’t making a call lol",
         "Look at the top. There’s no green signifying she’s on a call.",
         "Anyone would agree, but at the same time, I really cannot find any indication of Apple's phone call icon in the corner of her phone indicating she isn't calling anyone.\n\nI could be wrong though. I like my Google Pixel so I'm no expert. For someone attempting to be our president though, I hope I'm wrong and she was actually calling someone lol.",
         "I want someone to zoom in on the phone screen. If there's a call going on it should show on the top",
         "But you’ll have an indication that you’re on a call.",
         "My thoughts, also. \n\nRepublicans laughing at this like it validates how fake as fuck she is. \n\nThis is a non story.",
         "The easy answer here is she opened up her camera reel, bumped it back to the camera with her face or something.  She may have intended to show a screenshot of a phone call, simple mistake.  These sort of \"spontaneous\" moments are always planned.",
         "i mean it was against her ear the whole length. and just check the way she talks, you could’ve guessed it’s fake even without the camera thing it’s so bad",
         "Only on iPhones. This is an android",
         "Actresses have to be convincing, or at worst pretty. ",
         "Joe\nUnlisted",
         "Bruh, it was against her ear the whole time. ",
         "Your claim was debunked on X already.  Enhanced photo shows no green dot on top of screen to indicate there was an active phone call.",
         "You would see the call banner at the top of the screen. There is no call banner",
         "Not to mention that the screen turns off while its up to your ear and does not instantly snap back on when removed, theres a slight delay. \n\nYou dont see that here, its just the front camera the whole time.",
         "I simply said swiping wrong, the rest is not included in my post.\n\nThis fireball of anger is uncalled for and inexplicable, whatever though. Just because my statement is not the same as your statement does not mean I am your enemy.",
         "iPhone > Make a call > Open Camera > No banner. \n\nJust a green dot in Dynamic Island.\n\nWhoever upvoted you, go back to r/Politics.",
         "Well I'll be damned you are right. The screen when went dark when she held it up to her face which probably means she was on a call."
      ]
   },
   "1gkpy83": {
      "title": "Donald Trump showing early signs of winning election",
      "text": "",
      "comments": [
         "The 2016 map looks pretty similar to this one so far.",
         "I went to bed in 2020 happy Trump was going to win. I’m not going to make the same mistake until it’s called. But I’m very cautiously optimistic right now.",
         "Too big to rig! Crossing fingers.",
         "Nice to see that he won states he lost last time in 2020",
         "![gif](giphy|7A4zkWeMXlZqgnTKtJ|downsized)",
         "I’m wishing and praying and hoping and BELIEVING that this is it. No repeats, TOO BIG TO CHEAT!",
         "You love to see it. This was my third time voting for him",
         "He's up by 3% in PA now according to real clear politics with 76% reporting. If he manages to take Pennsylvania, I think it's a 95% chance for a Trump victory, but I still remember 2020... I went to bed thinking Trump won, but they somehow found hundreds of thousands of votes that were all for Biden sometime after midnight...",
         "He deserves it",
         "Here comes the REEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE",
         "Do not celebrate prematurely. Harris is acting like Hillary did, but that doesn't mean the election is over. There is still a window for fuckery.",
         "The map looks similar to 2020 before the 3am ballot drops.",
         "If you look around the % is looking better.",
         "Can’t believe they pulled out the same playbook and expected different results. This honestly feels just like how 2016 went except Hillary was a much better candidate than Kamala.",
         "I feel the same way. Watching Crowder's stream, and James Woods put it very eloquently: \"I went to sleep with a Trump lead in 2020, and then they found 300 thousand votes in a crocodile's @$$. Didn't even have a crease in them.\"",
         "I thought he lost. This time it looks great for him.",
         "I still have a doubt that he actually lost them in 2020.",
         "Same ✊️🇺🇲",
         "It was my 6th if you count Primaries.",
         "If he takes PA, it’s 100%\n\nNot a single doubt in my mind",
         "Fight Fight Fight!!!",
         "![gif](giphy|3o7WIPku0tmvhunqwg)",
         "Oh I know but I'm just saying",
         "I know. I hear you."
      ]
   },
   "1gkuggu": {
      "title": "Republicans Flip Michigan State House ",
      "text": "",
      "comments": [
         "This is awesome. A Republican in the White House, Senate control, and house control. An absolute demolishing of Democrat ideals and policy. The American people wanted nothing to do with that.",
         "HAHAHAHAHHA\n\nWe won it all",
         "Wayne county still at 56% votes counted.  Pathetic. Jocelyn should investigate but we all know what she will do.  Turn another blind eye",
         "Red wave. Liberals are going to lose their mind.",
         "Thank god because the Supreme Court is completely Democrat dominated now"
      ]
   },
   "1gkdq79": {
      "title": "Trump is going to win the election and the far-left lunatics on this site are going to have a complete meltdown ",
      "text": "",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "I saw a post from someone saying that it was pretty possible that Texas was going Harris. These people are delusional. Saw another post of someone terrified that Trump would win and people needed to be ready to flee. Pack a bag and stay in a safe spot, even if it was a hotel. TDS is very real.",
         "Apparently, Joy Reid just exploded on air.",
         "GO VOTE",
         "If that happens, don't rub it in their faces, or do it just a little. The times we are living now require unity. More division will be very detrimental to America.",
         "I know people that are scared of a Trump win. It's like they've never experienced a Trump presidency before.",
         "I mean, i certainly hope so. \n\nId be lying if i tried to say that the *only* reason i want trump to win is because I think he’s the best choice for the country. \n\nThe salt mining in 2016 was some of the best shadenfreud or however its spelled that ive ever felt in my life.",
         "I mean I know we all remember Reddit ‘not working’ after the Trump/Biden debate 🙄 Trump winning will make Reddit implode, and it will be BEAUTIFUL!",
         "Reddits going to be a ghost town after the astroturfers leave",
         "Cant wait to peep at r/politics after he wins",
         "costco in my area (red) already sold out of 'bug out bags' (30 day supply of survivalist food!).",
         "They'll still talk about Trump even if he loses. TDS is real.",
         "Every subreddit is probably going to be locked if he wins which will be a huge bummer.",
         "Stocks in Salt mining going to the moon tomorrow.",
         "Liberal tears are delicious.",
         "This entire site will a salt mine.",
         "Trump will talk so much smack too and he lowkey earned the right to. 2 assassination attempts, conspired attempts to come after him with criminal charges, constant lies from the media. If he wins the popular vote too, I want him to go back on JRE and talk that talk!",
         "Politics aside, I want a Trump win so badly just for this reason lol.",
         "mark my words...   by mid-day Wednesday, the left will be declaring that this was an outright assault by the right on all women because obviously it's all about hate.",
         "![gif](giphy|7zxgpKZBTWDS2DuyH8|downsized)",
         "America is awake",
         "GOOD",
         "rpol is in full insane mode already. You can hear their orgasms over Kamala over the internet. \n\nIt's so nuts how otherwise intelligent people can delude themselves that they are actually supporting someone when all they are doing in indulging thier hate. They truly are children. All they want is a strong parent figure to take care of them. That's why they only talk about identity politics, personality traits, and everything else that has nothing to do with being president. Because they aren;t voting for a president, they are voting for a parent. They don't call her \"Momala\" by accident. They really think that if they vote for her she will take care of their problems and all their failures in life will be swept away cause Mom will take care of it. It's absolutely insane.",
         "I'm saving this thread because it will either be a complete disaster in the next couple days, or a complete disaster in the next couple days.\n\nThe only way to know the actual result is to wait, and the only way to achieve the result is to vote.",
         "I really don't want them to have a meltdown, but the surprise of a loss would lead to violence that would dwarf that of January 6. So I would stay away from downtown metros. They are so, so certain she is going to win, and are so fully convinced that conservatives are evil, that they will lose their minds and start smashing and burning things. Mostly because they want to retain the right to murder infants. \n\nThey will expose their hypocrisy and say that the election was stolen, after making fun of conservatives for doing just that (although I agree with them in regards to the last election - I do think Biden won fair and square, if we are counting a system with massive media manipulation as being fair and square - conservatives were just being sore losers). \n\nI am pretty sure that Trump is going to win. The dems are going to be complacent and not vote, due to their arrogance. I expect continual violence throughout Trump's presidency.\n\nCould be wrong, but that's how I see things.",
         "It's going to be glorious.",
         "Go vote. I can handle 4 years of her laugh",
         "I can’t wait!!!",
         "Especially when it becomes a Reagan landslide",
         "And I am absolutely here for it. LFG!",
         "I went to the Supermarket this afternoon. And the Good Omen that I saw was a man of retirement age with a Maga shirt on. But... not just any Maga shirt, a shirt that said \"MAGA A F.\"",
         "dude remember the meltdown sub? and how it quietly just died after Trump won? ahhhhhh\n\ngood fuckin times man",
         "Nah, they would just melt like the wicked witch. Nuclear energy interferes with their grifting scheme called Green energy.\n\nhttps://www.businessinsider.com/biden-administration-energy-secretary-jennifer-granholm-stock-act-violator-2022-1?op=1",
         "That’s the hope. \n  \nPersonally, I want a 2024 version of the dark-haired “HES A FACIST” girl in the car and the RBG freak out girl. Those are my faves from Trumps first run in office.",
         "I truly hope so but hearing all the stupidity going around, I don't know. I have spoken to so many people and they have made me lose even more faith. It's really crazy how indoctrinated many are.",
         "From your keyboard to God's ears.",
         "I can’t wait 😂.",
         "I feel bad for the brainwashed, governed by hatred and cognitive dissonance they are.",
         "[removed]",
         "IF YOU KNOW ANYONE IN PA NJ VA NC GA AND NH WHO HASN’T VOTED, GET THEM TO THE POLLS PRONTO.\n\nFL NV AZ DATA LOOKS FANTASTIC. WE ARe WITHIN REACH!",
         "There are a couple of people in my life who have attacked me over my decision, totally unprovoked. \n\nI plan to rub it in their fucking face.",
         "Maybe when they stop calling us a threat to democracy and literally Hitler.",
         "If they win, the first thing they intend to do is lock up Trump and begin persecuting anyone who supported them. \n\n\nF them.\n\n\nIf they lose they deserve every ounce of misery that comes with their evil.",
         "Screw that, they have shown zero grace or compromise over the last 8 years and wouldn’t think twice to rub salt in the wounds.",
         "This.\n\nTreat reddit like a museum and just observe and move on. At the end of the day we are all Americans and we want unity, not further division.",
         "Agreed. If we lost, God forbid, we should act right, too. (Assuming there isn't any fuckery going on.)",
         "Very well said, hopefully they realize it is not as bad as everyone said it would be. I doubt it but rubbing it in will not help. At the same time I’ll love seeing the meltdowns.",
         "I won't rub it into real life people's faces that I know. But reddit users... Guh ya.",
         "Rub it in whose face?  They wouldn't hesitate to do another covid again, and they wouldn't hesitate to take your rights.  They believe you're garbage.  Now is the time to show them that we aren't the minority voice, and their ideas are built on lies.",
         "Tell what? I'll do unity next week.",
         "Nah I'm going to get their asses for a few days",
         "Schadenfreude",
         "Not to mention the riots and countless Democrat representatives that will refuse to certify the election. We will never have to hear about January 6th ever again if Trump wins because it will be just as bad, if not worse. All of a sudden denying elections without proof will be acceptable.",
         "Just me and the bots",
         "Legit - believe my math was ~170 posts per day (& associated comments / votes - per the recent Federalist expose')...\n\n>Over the course of 15 days, this group of volunteers, directed by official Harris-Walz campaign staff, was able to make 2,551 posts to Reddit. So far, they have received more than 5.7 million upvotes and 418,000 comments on those posts, according to their own data...",
         "or r/pics or r/facepalm",
         "They've been saying she won for awhile now lol",
         "I mean, survivalists are mostly conservative. This is right wingers thinking the steal is gonna happen again and everything will go to shit.",
         "[removed]",
         "Goddamn it’s true.. my *best friend* of 17 years said Dick Cheney was a “better person than Donald Fucking Trump” and then followed the message with “I can’t believe anyone would vote for Donald Trump.” \n\nEven though a week ago she had openly admitted that she had 0 information on either of their policies because she (quote) “gets too burnt out to care to follow politics.” \n\n🫠",
         "Yep. I fully expect this one will be locked regardless what happens. r/Pol is going to absolutely flood this place when the results are announced, win or lose.",
         "Bad for high blood pressure though",
         "These people need to pay a visit to r/raisedbynarcissists then because that's what kind of parental relationship they're going to receive from her.",
         ">They don't call her \"Momala\" by accident. They really think that if they vote for her she will take care of their problems and all their failures in life will be swept away cause Mom will take care of it. It's absolutely insane\n\nLove her or hate her, Meghan McCain has been bringing this point up a lot on her podcast. Between the \"Momala\" stuff and trying to paint Walz as \"America's Dad\" is really weird. I'm actually kind of worried about the mental health of a lot of politically active people...",
         "I also expect Trump will win.  History is typically not kind to a sitting administration during economic woes.  I think Trump would have easily won re-election in 2020 if not for the pandemic.\n\nI am hoping that there is little to no violence and we don't get riots, but considering how angry people are, I expect there will be some.\n\nI also hope Trump stays safe.  People are unhinged, and all the Nazi/Hitler rhetoric is definitely inflammatory to the mentally unstable.",
         "It will be...\n\n![gif](giphy|8fen5LSZcHQ5O|downsized)",
         "I fucking hope nj turns red. I can't believe how little kamala signs I see around compared to 2016 and 2020...actually see more trump out.",
         "According to the AP AZ and NV haven't shown any results yet. Watching it every 15 minutes on my phone, waiting for new results.",
         "Rubbing it in their face will feel good in the moment but taking the high road will feel better in the long run because it is the right thing to do.  I’m saying this to myself as much as I am to you.",
         "I hope you’re able to. I have friends voting for Kamala and we’re ok with each other.",
         "I know it's hard to let go.",
         "Every time conservatives take the high road they use it against us. They lie, cheat, and steal. They’re sick, rub it in their face all you want. We should never apologize for patriotism and common sense 🇺🇸🇺🇸🇺🇸",
         "I'm going to liberal enclaves and slapping trump stickers on all their cars \n\nWatch em eat their own",
         "I think a lot of the people that say that, would never think of it under normal circumstances. That rhetoric is created by the system that pushes the hate in the society.",
         "If President Trump wins, that will also be due to the extreme hate for him from the other side. So, in a way, they will make that win possible.",
         "I think that people are getting divided by entities that thrive on that. The worst part is that division getting to sustain itself over the time. I think the problem lies in the system that produces the division, not on the other side of the aisle.",
         "Last 16 years",
         "I don't know if unity can be achieved, but I think less division can certainly be done.",
         "I was pretty close!\n\nThe germans call that closenscpelllen",
         "I'll be interested to see how quickly they scramble to incarcerate Trump before he can be sworn in, then claim he's ineligible and try to default it to Kamala.",
         "Before we even get to worrying about if Congress will certify the election, we first have to make sure the electoral college will follow their state's votes (especially if the EC is close).",
         "There are literally no polls closed yet\n\n[Here’s when polls are closing in your state | PBS News](https://www.pbs.org/newshour/politics/heres-when-polls-are-closing-in-your-state)",
         "I feel like a lot of us on the right are concerned about the ~~looting, burning, & rioting~~ **mostly peaceful protests** if Trump wins.",
         "These are the people that enrage me the most.  They're the most insufferable.\n\nOh you admit you never cared about politics prior to 2016 and your whole political worldview started with Trump?\n\nOpinions can be immediately disregarded.",
         "Do they make a low sodium version?",
         "[deleted]",
         "So, don't mail them a poster size L? ",
         "I'm not taking the high road with people who call us deplorables, nazis, and garbage.\n\nI'm gonna do the Floss, then the Griddy, then spike the football!",
         "Yeah, vandalizing is not a good response to your side winning... or losing...  \n'R' is still the party of law and order.",
         "They're still being indoctrinated and it's not cool.\n\nThinking everyone is a Nazi, needs to be punished, etc.\n\nIt's sick",
         "But hey, it will be good to scroll the front page and see subs that have no business posting political stuff (usually just low effort posts running down trump)\n\nReddit has become unsufferable, I’ve had to block so many lefty subs.",
         "Klößenschpellen\n\nSorry, had to.",
         "Best we can do is low testosterone.",
         "No, just start flying a Trump flag in your yard ayt the top of an electrified flagpole. Most of them don't drive vehicles that can knock over the pole, so they'll need to try vandalizing/stealing it by hand which will be when they learn about the live current."
      ]
   },
   "1gkt8o1": {
      "title": "I’m so damn proud to be an American, and I’m so damn proud of the people of this beautiful country for making Trump the 47th President of the USA ❤️🤍💙",
      "text": "God bless the United States of America, God bless President Trump, and God bless our people.\n\nWe did it y’all, and we made our voices heard. We got the president, majority senate, and the popular vote. The house is still up for grabs, but we will likely get that as well. We the people have spoken, and now it’s time to get to work on our country!",
      "comments": [
         "We did it!!! I hope this is the final blow for the propaganda’s media machine. The people have spoken!",
         "I'm glad we no longer have to be \"burdened by what has been\"..",
         "God saved Trump for a reason: to save this country!",
         "Gonna have “God Bless the USA” on full blast windows down on the way to work today",
         "They hammered the coffin shut from the inside.  No sympathy.",
         "The liberals that finally called out the media for the Liz Cheney comments really made me think he had a good chance.  “Ok guys this isn’t helping” lmao"
      ]
   },
   "1gkqi4c": {
      "title": "Trump leading in PA and Wisconsin",
      "text": "This is it folks, trend lines are clear. There is almost no stopping the Trump train now. \n\n",
      "comments": [
         "The Kamala campaign has spent over a billion dollars. And they still lost.",
         "Almost statistically impossible for her to catch pu in PA. \n\nBut they won't call it tonight \n\nKamala won't concede. Jamie raskin has to do his dirty work first .",
         "They are freaking out already over in another subreddit. The victory is happening so far. The Iowa poll was wrong. Counties are flipping. So far so good",
         "Choo choo",
         "What is going on in Georgia?",
         "It's almost a certainty that Trump wins pa.",
         "Do not celebrate prematurely. There is still time for fuckery.",
         "#LET'S FUCKING GO!",
         "Right now the Democrat governors of WI and PA are doing everything they can to find Dem votes in car trunks and under park benches. They will do everything in their power to deliver the election for Kamala.",
         "Pa will be his. I am SO INCREDIBLY HAPPY my 2 important home states went the way i hoped ❤️🇺🇲 \n\nShit sry guy is mean his not hers. Yay home states of PA and NC! Were drinking and celebrating give me leniency pls lmao 🎉",
         "Video of trucks of ballots arriving at polling places.",
         "You can't polish tennis shoes.",
         "A billion dollar sure can fund a lot of Teachers in under-funded districts but Dems thought this was more important",
         "I swear to God... If I wake up and they have magically found the right number of votes for Harris when nobody is watching...",
         "She is getting decimated as of now. She will have to concede in about an hour from what I can see.",
         "Trump is going to win Georgia. From what I heard on ABC, the state has declared Trump as the winner but ABC is going to wait for a bit before calling it for him.",
         "It will not be hers...",
         "You can polish tennis shoes better then you can polish Kamala 😆",
         "I think the Trump lead is durable enough that won't happen. I'm more worried about 4 years of frivolous legal challenges thrown at Trump and a hysterical media.",
         "That would be amazing.  Redstate's live feed is reporting the Kamala campaign has stopped responding to requests for comment from the press.",
         "She will make a statement but not concede. Sorry but that is how it will go.\nI would love to be wrong.",
         "I edited it. I fucked up, were drinking and waiting to celebrating over here lol",
         "No problem. I figured you weren't a commie lol",
         "Just the thought is repulsive. Cheers mate lets gooo! 🥂🇺🇲"
      ]
   },
   "1gks76j": {
      "title": "With the Fox call, Trump is once again president.",
      "text": "No threads saying that clearly enough. It. Happened.",
      "comments": [
         "Please can someon Make a compilation of the liberal meltdowns",
         "Not an American \n\nBut Congratulations and Thanks for Voting Trump.",
         "It turns out only lying about your rival candidate and insulting half the country won’t win you the election",
         "God bless America.",
         "God Bless. Just call it AP. Let us rest. Fox isn't just calling it because they're biased.",
         "I called for a battleground sweep, and a narrow popular vote win. Only thing it's looking like I was wrong about was the narrow popular vote win as it stands now he has a 2.8 percent lead. That's massive we're about to witness the Democrat party tear itself apart.",
         "![gif](giphy|FbiL9rsmZN3ib2JSGo)",
         "![gif](giphy|UPm8BqL6igDUPZ29ik|downsized)",
         "Reality trumped all the BS.  God Bless America.",
         "#ThirdTimesACharm  #BestOuttaThree #ThreesCompany",
         "the only day that I will ever enjoy scrolling on the front page of reddit. Tis glorious. \n\nMy blood pressure is gonna spike from drinking all these leftist tears",
         "AP refuses to make call on Pennsylvania.",
         "More specifically, with Trump winning Pennsylvania, it is now impossible for Harris to have any chance of winning the election.",
         "The Murdochs must be seething, kek. I'm so happy Rupert and Soros lived to see this victory.",
         "It’s 12:30 am pacific and NYT won’t call it even though the have called PA. They won’t call Alaska, lol.",
         "Its 12:30am on the west coast, and CNN still hasn't called it.",
         "By no means a Trump fan but congrats from your neighbour up North. \n\nHopefully he serves you Americans to the best of his abilities.",
         "I pray they're not as rabid on the streets as they are online and law and order prevents more Floyd level riots.",
         "J20 will be interesting."
      ]
   },
   "1gktc1e": {
      "title": "Let the meltdowns begin!",
      "text": "Should we have a consolidated thread with all the best public meltdowns that are about to ensue?",
      "comments": [
         "yes, also remove all flair restrictions lol i wanna see the tears",
         "They going crazy on tiktok.",
         "I’m going to be exhausted when I wake up for work in 4 hours but, this is gonna keep me going lol",
         "I’m trying to go to sleep but I keep responding to liberal meltdowns. What a night 🇺🇸🇺🇸🇺🇸",
         "This week will be amazing. I can't wait to watch the compilation videos.",
         "Can't wait to watch Joe Scarborough tomorrow. Have the DVR set to record it.",
         "Yes!!!!!",
         "I really do not want to see meltdown. I genuinely want to see division reduced. I think we are all bone weary of this hyper partisan nation. How about we look and see the faces of our fellow Americans and extend a hand in friendship?",
         "Lot of teens and young 20-something’s who know Jack shit about the real world.",
         "I need compilations ASAP",
         "Because they wouldn't take it lol",
         "We would be better for trying anyway",
         "I know what you mean. And I agree with you. I too wish that we could all be friends. Unfortunately, that's not what they want. They will never see us as anything other than the hateful vitriol they've spat at us for years.\n\nIf anything, Trump's victory tonight has further cemented their hatred."
      ]
   },
   "1gkiieu": {
      "title": "[ Removed by Reddit ]",
      "text": "[ Removed by Reddit on account of violating the [content policy](/help/contentpolicy). ]",
      "comments": [
         "![gif](giphy|Ov7lAOUsu4Yo0|downsized)",
         "I'm liking this generation more and more. These kids are pretty cool. ",
         "![gif](giphy|WrIiyrvaFSeyVlxwtx|downsized)",
         "So pleasantly blown away by the Gen Z Trump voters today. You all are giving me hope for the future! 🇺🇸❤️",
         "Congratulations.... Go vote again... Just kidding 🙄",
         "Conservative girls are always more beautiful! Awesome post!",
         "Awesome, my first president at age 21 in 2016 was also Trump, and I voted for him again today just an hour ago",
         "Awesome! My 18y old  son voted for the first time also !",
         "Thanks for fulfilling your civic duty!",
         "Ladies for Trump!!! 🫶🇺🇸🫶",
         "Awesome!",
         "That is awesome! I am a fellow Gen Zer that also voted for Trump! 🇺🇸",
         "Very fucking cool.",
         "![gif](giphy|Qjmp5vKEERPyw)",
         "And this dooms the Dems to irrelevance for another generation.\n\nThank you for choosing sanity and logic over feelings and continued chaos.",
         "Nicely done!!  PA is proud of you!!!",
         "Thank you",
         "Good choice! I hope he inspires you the same way Ronald Reagan inspired us kids of the '80s. What county or region are you voting in?",
         "Based",
         "Yay!!!",
         "YOU ROCK!",
         "Hi neighbor! Good job! You are sure a lot smarter than I was when I was your age! :)",
         "[removed]",
         "let's go!",
         "Beauty and brains! You will do well in life! Good work today! Hopefully your state of PA comes through!",
         "Cert got that rizz like for real for real. Still that lingo they be dropping be throwin up those beige flags all day tho. But they be bussin’ voting for trump do. No cap. For sure glow up. Let them cook ya know?",
         "My polling place had two VERY young men (couldn't have been more than 20) serving as poll workers and doing a bang-up job. I was so happy to see that!",
         ">Just kidding\n\nBut are you though? 🤔",
         "We don't do that here. Leave that to the (D)ifferent kids.",
         "It helps that they are female.",
         "Normally I would feel bad for the slurry of downvotes from liberal brigadiers, but I think you may have earned these fair and square.",
         "Yes, of course 🤥",
         "Damn lol",
         "NGL I went and looked up gen z phrases and just ad libbed it from there  lol",
         "I figured you were a schoolteacher!"
      ]
   },
   "1gkohf2": {
      "title": "‘More Than a Victory’: Florida’s Miami-Dade County Turns Red for First Time in 30 Years in Presidential Election",
      "text": "",
      "comments": [
         "AMAZING sign for us ❤❤❤",
         "Great sign for everywhere else",
         "I believe this happened in 2022 as well, although obviously it was not a presidential election year.",
         "GOD BLESS MR. TRUMP",
         "#LET'S FUCKING GO!",
         "Too big to rig, morhertruckers!!",
         "And no in 3 and 4",
         "I honestly didn't think something like this was possible lol. Good stuff!"
      ]
   },
   "1gkvp39": {
      "title": "CNN has just predicted that Trump has won the presidency",
      "text": "As of 05:30 EST, CNN has just announced that Trump has won the presidency. Of course, the panelists are whining which makes it even more satisfying. ",
      "comments": [
         "![gif](giphy|LXLgiN2R8YMtdwalWu|downsized)",
         "\"She's done. The race is yours, Jack.\"",
         "That final little “garbage” gift. Joe knew what he was doing. Thanks Joe!"
      ]
   },
   "1gku7yy": {
      "title": "The Greatest Comeback in American History ",
      "text": "",
      "comments": [
         "The Democrats' lawfare campaign will go down as one of the biggest political blunders in history.",
         "Disagree. I'd put Kim Kardashian at number 1."
      ]
   },
   "1gkdqa1": {
      "title": "Meanwhile,  in PA...",
      "text": "The Amish are out in droves. God is not finished with our country. ",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "[This picture is from 2020](https://www.breitbart.com/2020-election/2020/11/03/amish-horse-buggy-trump-train-goes-viral-election-day/)",
         "Vote like it’s 1899!",
         "Thx in advance, Amish!",
         "Say what you want about the Amish. But they are world famous for following through with their beliefs. We need every bit of help we can get to get Pennsylvanias electors for Trump.",
         "Amish are usually not involved with voting.  But some Biden government beauacrats decided to go after some of them for selling farm goods.  I don't know what if any rules they violated but a couple got thrown in jail.  Somewhere around 100k amish in Pennsalvania and they are pissed.  Them coming out to vote is actually something that could make the difference.  The federal government is out of control.  The amish know it and you know it.",
         "If Trump wins, he should host a gathering off these groups that seem to be showing great support for him this time - Muslims, Jews, Amish, Latinos, etc",
         "I know the Amish community was pissed when Amos Miller got raided. I hope they show out to vote today!",
         "\n🎵 As I walk through the valley where I harvest my grain\nI take a look at my wife and realize she's very plain\n\nBut that's just perfect for an Amish like me\nYou know, I shun fancy things like electricity 🎵",
         "A very large community of Hasidic Jews is coming out en masse for Trump in Lakewood, NJ.  No one has ever seen voting lines like this in Lakewood.",
         "I am now hungry for homemade baked goods.\n  \nEspecially a whoopie pie.",
         "The Amish understand the values this country was founded on. I don’t think they usually vote in large numbers, so this could be a huge change for them. They want to protect their way of life.",
         "Amish Army!!!",
         "RIDE OF THE ROHIRRIM",
         "If PA goes red, we know who to thank",
         "Fuckin A, here come the Amish!",
         "Like most other Republicans they just want the government to leave them alone. They know that doesn't happen with a leftist in the White House.",
         "PA FOR TRUMP! PLEASE VOTE!",
         "This is so sick. I love this",
         "The estimated Amish population in PA is over 81,000. LFG.",
         "that is fake.   I know it because Joe, kamala and the entire left said that if people did not take the jab they would 110% die.",
         "I think this picture is from 2020",
         "I live in a different Midwest state and I have heard talks of the Amish population here also exercising their right to vote. Surprising because they are typically so reclusive when it comes to govt affairs.",
         "remember when biden went after the amish for selling food goods!?!?...hopefully their votes increase the red chances!!",
         "This must be really bad if the AMISH are voting 😆 ",
         "They should have a million of those and drive over to Philly or Pittsburgh",
         "Send in the cavalry !",
         "Past weeks I’ve been seeing Dems try to convince people the Amish wouldn’t be voting. They fear this level of turnout.",
         "At the same time, we shouldn't think that the Amish are going to vote in big numbers. Nick Shirley went out and talked to a lot of them. While yes, the ones who are going to vote are for Trump. There still seems to be a good group that just doesn't care about politics and just care about God.",
         "Is this real?",
         "I kind of out of the loop with this one. I’ve seen it mentioned recently but will the Amish be a game changer?",
         "Curious why the Amish are supporting Trump, though.  Aren't they mostly insulated from economic issues?",
         "This picture has been recycled since 2016… that being said yes, yes they are.",
         "Don’t have to worry about running out of gas",
         "Politics aside—this is a fantastic image! Let’s go guys!",
         "That is bad ass🇺🇸",
         "OMG, that's crazy!",
         "Meaningful to note the very insular Orthodox Jewish Satmar Hasidic sect who usually abstain from endorsements, but in the past have endorsed local, New York politicians in state and local levels, has endorsed Donald Trump and instructed his followers some 50,000 strong in New York alone to vote for him. \n\nFor all the antisemites posing as anti-Zionists don’t worry they don’t recognize the state of Israel as a secular state, they await the messiah, so this isn’t a pro Israel endorsement, they just fear the state of Jews under a Harris presidency rightfully so. \n\nIf you rally the Hasidim in New York and the Amish in Pennsylvania, all should be well in the end.",
         "Amish Paradise",
         "Yinz want 1 term or 2?",
         "The Amish are with us.  Hawt.",
         "wait, are they creating a traffic backlog so the loads of Harris voters being bussed in can't make it in time?\n\nthose Amish are so clever!",
         "Gotta love the Amish. That is the best photo I have seen this group today. I love it.",
         "What a beautiful picture!",
         "When the Amish get involved, shit has done got real!",
         "HELL yes! Lets go, we need you all.",
         "I was wondering if the Amish would turn out in droves after I saw a big line of Jewish support for him yesterday. And these good people reached this conclusion without all the medias left leaning bias and propaganda. Good to see!",
         "Everybody on the Trump.... Buggy Caravan!",
         "Ugh early voting does not look good for Trump in PA",
         "CHOO CHOO!!!!! 🚂🇺🇸🇺🇸🇺🇸🇺🇸",
         "We got some real Mennonites up in here\n\nLET'S GO AMISH",
         "This is awesome!",
         "we been spending most our lives living in a leftist paradise\n\ntheir women all look like guys\n\nliving in a leftist paradise\n\nopen borders and fiery nights\n\nliving in a leftist paradise\n\n4 more years we wont survive\n\nliving in a leftist paradise",
         "They came in to save everyone, like the Riders of Rohan. Tolkien could not have written it better himself. Bless the Amish.",
         "Ive churned butter once or twice….",
         "Let’s go Amish!!!!! (What’s funny is they will never read this as they don’t use internet)",
         "That is nice of you, but you know, they very likely won't read that. :-)",
         "Taking \"Don't Tread On Me\" seriously!",
         "The dispute is over selling raw milk and unprocessed meat.  Every Instagram cutie is sucking down raw milk left and right, there is a high demand and the Amish can't sell it.",
         "I've heard they're pissed enough that they're *encouraging* their women to vote too.",
         "Amishgate.",
         "lancaster county is the county to watch,",
         "Amish are of the mindset not to be recognized. But improving the economy so they thrive would be plenty of thanks.",
         "The rainbow coalition for freedom!",
         "[removed]",
         "Sounds like a MAD Magazine fold-out in the making.",
         "This is so interesting-the Hasidic Jews in Monsey NY came out years ago for Hillary Clinton when she ran for the senate.  Do not get on their bad side-they vote as a bloc, and there are a lot of them.",
         "Love to see it. \n\nPeople criticize Jews for being liberal, and by and large American Jews are overwhelmingly so, but if you look at voter maps at all the major *Orthodox* Jewish enclaves, they're the reddest counties you've ever seen. Monsey had between 90-99% of its residents voting Trump in 2020.",
         "So good, right?",
         "Absolutely. This is a meme, but I work with the Amish part time, and can confirm they are absolutely voting Red.",
         "80,000-100,000 voting age in PA alone.",
         "LET'S GO AMISH!!!!!",
         "The Biden admin went after them for drinking and selling raw milk.\n\ntraditionally the amish and government have had a 'hands-off' relationship.",
         "They want freedom of religion, and yes, they still use diesel generators and buy goods like the rest of us.",
         "probably has something to do with the biden admin going after some Amish farmers and jailing one in particular over something about selling their farm goods.",
         "They still have to purchase some goods.",
         "Found the Pennsylvanian...",
         "Yes it does. Actually do comps between 2020 and this cycle. Just looking this cycle and going “trump behind early vote, uh oh” is horrid analysis",
         "lol yes it does. Dems had a 400k lead going into today. That had a million last time.\n\n  \nIf you are referring to today's numbers then there hasn't been any released from PA so how would you know?\n\nIf you are going by ED voting in other states? Well it looks like we are in for a good night.",
         "We sell quilts at discount price...",
         "Livin’ in a MAGA paradise",
         "Nope, i just het pictures of your mom through the mail",
         "No TV or magazines either.  Imagine never seeing a campaign commercial?  The Pennsylvania Amish are upset at the State not letting them sell raw milk and unprocessed meat.",
         "Never know... i live by an Amish community and they order things online and smoke. Not sure *how* but this is in the south so things maybe different from PA.",
         "Haha, many Amish have (secret) phones. As long as the Bishop doesn't know...",
         "r/amish",
         "Not until I fly to PA and sneak them a cellphone and router 😜",
         "Thank you.  I suspected that others knew more than me.  I am all for Instagram cuties sucking down raw milk.",
         "Something Trump can do that other politicians usually can't: go talk to them without announcing it.\n\nNo ceremonial handshake, no limelight, just hearing their concerns so they can be included in the governing. If a DC regular can't make PR out of it then it's stressful wasted time to them, but Trump is more comfortable going to North Korea than a lot of Dems are venturing outside the big city.",
         "Yes. I heard that if you tell them they have something nice, they actually take it as a kind of insult, because of the value they place on humility.",
         "Wow! We have keeping pushing and do what we are supposed to do which is VOTE! 🇺🇸",
         "[removed]",
         "Oh, yeah",
         "Ohioan actually but I've been around a lot of A-mish stores in my area. They grow a mean honey crisp.",
         "First I'll cast a ballot...then I'll cast anudder",
         "and.... you get a free My Pillow!! But hurry, because this deal is only while supplies last!",
         "thanks man...   now I've got that beat playin' in my head.",
         "We lynched Juicy in the snow and ice...",
         "You can only be apolitical so much before it affects you.",
         "Not a single luxury",
         "Somebody else can order for them, just like somebody else can drive them in a car.",
         "Ordering things online probably via prayer. Maybe god actually answers this stuff if you are a good enough Christian.",
         "I lived in Amish country for awhile in my home state ... my general understanding is it's up to the local religious leader(s) to set the rules for the group. So you have more or less conservative groups of Amish. In the area I lived in, some had telephone booths in their driveways, while others wouldn't use rubber tires or buttons.",
         "Yeah, I heard some sneak off to party. And some do leave their community to join the outside world. I think I saw one woman had a YouTube channel who was chronicling her life after leaving.",
         "They don't want that. If you fly there anyways, just thank them in person.",
         "This is America. Instagram cuties have the God-given right to suck down whatever they damn well please!",
         "The religion is based around being humble. So publicly recognizing them, would probably be a bad call.",
         "Many more in WNY also! (just to the north)",
         "Ba dum tiss...😁",
         "Like Robinson Caruso...",
         "That doesn’t really make sense to me. It sounds like similar logic to how some young Mormons will do these things that barely skirt around “no sex before marriage” like inserting but not thrusting and having someone else shake the bed they’re on to simulate sex while *technically* not being sex? Like it seems pretty self evident by rational reasoning that’s not what you’re supposed to be doing but since it passes the “it’s not me it was someone else” test *technically* they can do it.",
         "I am not sure on if it is required or encouraged but they do leave the comunity for a certain amount of time to experience the outside world and decide which world to pick. It is actually a pretty cool practice and I think a surprising amount decide to come back to the Amish comunity but not all.",
         "Some...🤣 They all sneak off to party during Rumspringa. And after they're newly married,  too.  😁",
         "Agreed!",
         "It’s called Rumspringa.",
         "Thank you i knew it had a name but could not think of it. Other than missing the name do you know was the rest at least correct? I am no expert on it so do not want to say anything wrong.",
         "That’s a good interpretation. It’s somewhat easier for boys to make a living while on Rumspringa, they have more needed skills such as carpentry, construction, farming, girls less so, housekeeping and similar, both due to limited education. And yes, most return, they are shunned by their families when on Rumspringa so they miss them, especially brothers and sisters.",
         "It is interesting you mention boys because as I was typing my first comment I was not sure if it was just the boys that do that or both genders. What you said makes a lot of sense. I totally understand it is hard to leave all you know and most return but I still love that it is an encouraged tradition to leave and see the world."
      ]
   },
   "1gkdt3d": {
      "title": "Voted conservative for the first time ever today.",
      "text": "I voted Republican across the board. I've been voting Democrat since 2012 but the definition of insanity is doing the same thing and expecting different results. I want change so it's time to do something different. MAGA!",
      "comments": [
         "WTF is this ballot?",
         "Why do they list the candidates twice. Odd to say the least.",
         "That’s a NY ballot! Glad to have you on our side!",
         "Having Harris listed next to “working families” definitely feels like a bias 🧐",
         "I have so many questions about that ballot. 🤔",
         "Well hello there fellow Western New Yorker",
         "Thank you Patriot for voting and choosing Making America Great Again! \n\nText, call, email, social media friends, family, neighbors to come to the polls and vote.\n\nNO FAT ASS HARRY'S!",
         "Paper ballots for the win!",
         "Fellow New Yorker! Did my part today with you, here's hoping for a good showing and many NYC Jewish voters realizing Trump will be better for them.",
         "I live in a Red State that has zero chance of flipping, so I tend to vote for whichever 3rd party candidate is most popular in order to hold up a finger to the 2 party system.\n\nSadly, the city I live in has enough lefties and democrats that they tend to win local elections, so I can't just protest vote locally and actually need to vote properly.",
         "Do they randomize the order of the parties on these ballots?  Or is it just biased for Harris?  It’s a pretty significant advantage to have the top spot of a ballot",
         "We also need more...more...more! \n\nKylo Ren style\n\nBut, we need more men to turn out so we cancel any Harris women voters!\n\nTime to stand up, go to the door, open the door, walk to your vehicle, go to the polling site and GET IN LINE!",
         "More so in 2020 the GOP ticket has a big tent full of diverse people and ideas. Common sense prevails! 🇺🇸",
         "Thank you",
         "Hell yeah!",
         "Why do both candidates get two different listings?",
         "Is this a real ballot?  I cannot imagine this being real wtf.",
         "How is it legal for Harris and Gillibrand to be on the ballot TWICE?",
         "Looks like you didn't vote for any conservatives, only republicans. Missed it by one line. Oh well, maybe you'll get it next time.",
         "NY\n\nYou should see how the prop one vote on the back is worded.",
         "This is why they call it straight ticket, they used to all be this way or straight down column.",
         "In many states, candidates are allowed to run under multiple parties.",
         "I choked when I saw that, \"working families\" what a crock of shit! If they could have put \"fascists for the wealthy\" for Trump/Vance, they would have.",
         "It's a WNY party! Voted on the conservative party line. Go bills.",
         "State legislation sets the order. Blue states have Dem first,  Red states have Rep first",
         "Yes, it’s usually randomized depending on number or alphabetical draw.",
         "I think this was a joke people... calm down 😉",
         "I just voted. I was shocked by the wording.",
         "For those that don’t know, Ballotpedia is great resource to research props and make an informed decision",
         "LOL she almost get her freaking tagline as her party. Surprised it doesn't say \"Middle-Class Families.\"",
         "That should be illegal on the federal level.",
         "I mean, I think the candidates pick these parties. Trump missed a bet by not going with MAGA Party!",
         "I live in a Red state. Oliver was first.",
         "I don't think so. The law in NY is a party must get 50,000 votes on its line in statewide races in order to keep its access.\n\nIOW if the Republican and Conservative Party have the same nominee, (same with Democrats and Working Families) voters are encouraged to vote on the Third Party line so it can continue to have a place in the ballot.",
         "Vote yes if you think the ny constitution should include a new section saying all people should be treated fairly, vote no if youre a big stinky head. \n\nTranslation: vote yes if you think ny should have a law that boys can play in girls sports. \n\n\nI checked the box indicating im a big stinky head.",
         "It is until you live in some dust bin like Midland, TX. Had no information at all on down ballot races (even state level things).",
         "I've just never seen a ballot like this. I'm thankful my state is short and simple, I've heard the swing states are 4 pages long.",
         "NY has what are called, \"fusion tickets\". This means you can be the nominee of more than one party. The WFP has been around for years and is generally a pró-labor party. The nominee doesn't choose the name.",
         "That's interesting. In Texas, Republican is first because that's how the legislature agreed to have it. If I may ask, what state are you in? I want to research this.",
         "Ahh, still seems so odd when they have the same nominee...\n\n(must be why \"Common Sense\" doesn't have a nominee in NY... /s)",
         "GA we had one that didn’t even mention the upto 4% tax increase",
         "I voted no on both. The other one for me was about allowing a simple majority vote instead of ⅔ vote to raise taxes.",
         "My PA county does voting by Dominion machines. Was a very simple ballot, 9 offices or so to vote for, one screen for each. I heard the poll workers say they heard another state's voting went super slow a while back because they had a lot of ballot initiatives the people had to read.",
         "I have no idea what the law is. Maybe it was random. My state only had Oliver, Harris, and Trump. So RFK was removed, and Stein must not have qualified.",
         "Are you able to fill out paper ballots?",
         "Not that I know of. I prefer it this way. I grew up voting by machine too, but they were the ancient lever machines that I think date back 100 years. This new machine produces a paper print-out that goes into a second machine to be read.",
         "I have never voted on one, I'm old school 😁",
         "I only voted on paper when I was living elsewhere in the state. They had previously had electronic machines too, although they were an older model with a curtain around them. I was shocked and appalled when I showed up one year and we had to vote with a pen and paper. Fine for the Amish but not for me!",
         "😂"
      ]
   },
   "1gko5sq": {
      "title": "NBC Exit Poll: Latino Men Swing for Trump Over Harris by 10 Points",
      "text": "",
      "comments": [
         "Bad Bunny endorsement wasn't enough guys ://",
         "Harris puts on fake accents and panders like the phoney that she is. We know better. Trump 2024!",
         "Almost like calling half the country Nazis and fascists and generally horrible people doesn't play well... ",
         "Too big to rig, mothertruckers!!",
         "That’s YUGE!!",
         "The Future is Male!"
      ]
   },
   "1gku47v": {
      "title": "Just now realizing that Kamala will certify her election loss, just as Al Gore did in 2000",
      "text": "It will take a lot of strength to do that honestly. ",
      "comments": [
         "At least she’ll do one thing right while in power",
         "![gif](giphy|j1XRFLyP8kIjdiy7zO)\n\nThat is a very sweet final blow. As good as seeing Hillary on the stage as Bills +1 during the first inauguration.",
         "Yep! I made this observation on a non-conservative sub earlier today—and for some reason I got downvoted! 😂🤷‍♂️",
         "Her only accomplishment.",
         "Where is Al Gore these days? Still ranting about \"climate change \"? What a loser",
         "They’re not gonna certify",
         "If she doesn't, what could happen?",
         "And Pence in 2020. Wonder if Harris will moderate her tone by that time",
         "![gif](giphy|rKj0oXtnMQNwY)",
         "The new congress is seated on January 3rd. The certification takes place on January 6th. The new congress is the one doing the certification. Republicans won the senate and look like they're keeping the house. She won't be able to stop the certification. This was only ever a possibility if Trump won the presidency but the democrats (and RINOs) controlled house and senate.",
         "They changed that law.",
         "Well Pence certified his loss as the rider on the ticket. Different than actually certifying your presidential loss",
         "We got it all! No more Shumer or Pelosi BS every time Trump tries to make a move like last time. Am I right?",
         "Agreed. But the moment is still awkward",
         "We got it all in 2016 too. The uniparty runs deep. Temper your expectations. We can't have people getting wild expectations and then blaming Trump when they don't happen because of the uniparty, that would set us back decades.",
         ">Am I right?\n\nEhhhhhhhhhhhh.  Almost.  Still going to have to deal with the Senate's legislative filibuster."
      ]
   },
   "1gknm4n": {
      "title": "Virginia is LEANING REPUBLICAN! ",
      "text": "47% reported\n\n1,109,097 (49.7%) Trump \n\n1,093,364 (48.6%) Kamala \n\n38,166 (1.7%) Other \n\nUPDATE:\n\n51% reported \n\n1,216,643 (49.6% Trump)\n\n1,194,590 (48.7%) Kamala \n\n42,972 (1.7%) Other \n\nUPDATE 2:\n\n57% reported\n\n1,360,526 (49.9%) Trump \n\n1,319,922 (48.4%) Kamala \n\nUPDATE 3:\n\n65% reported \n\n1,531,761 (49.5%) Trump\n\n1,508,590 (448.8%) Kamala \n\n50,771 (1.6%) Other ",
      "comments": [
         "I'd love to see it, but I fear Northern VA gonna sink it since so many DC live there.",
         "Honestly, 47% in means nothing...  sorry to be blunt.",
         "We here in VA have lived this scenario enough times to know that the R leads every time and then D rockets past after midnight when NoVA is fully reported. It’s a hard state to flip back.",
         "Means nothing, still long night to go and anything can happened so lets just hope he keeps up.",
         "I hope he flips it. It's close",
         "Why has ap already called this for harris while shes still behind?",
         "VA went to the Dems, but honestly even though they 'won', it's still basically a loss that she only won VA by ~100K votes (Biden won it by ~500K). VA could definitely be a swing state as soon as the next election.",
         "Very close, especially with 448% going to Harris.",
         "r/nova is fuming it's hilarious",
         "The swing is wild there",
         "It’s great for them, they get to pollute Virginia and not have to live in the urban liberal hell that is DC",
         "Really depends on the counties. If Dem countries are leaning red, hooray. If it's just R countries reporting first, uh oh",
         "I’ve never paid much attention to VA before. Is it always this close this early?",
         "It's the northern virginia counties that haven't been called yet.  That's the actual swamp that needs to be drained, they will go to Kamala.",
         "If they expect Harris to take 65% of the last million votes based on where those votes come from, they know they can call it.",
         "The swamp is deep there, too",
         "Sure, but generally it means nothing.  If for some reason all urban votes are in and it's just rural remaining then fine.",
         "Yeah it was this way in 2020 as well",
         "Does it hurt you if we express an optimistic thought? There's been a giant wall of *'STOP ACTING GLEEFUL'* on this sub, as if people look at a towering pile of only one ingredient (\"don't care go vote\") and conclude we have a shortage of that exact thing.",
         "Yes, it's fake like the Kamala campaign.  Proactive celebrations followed by VA going 53/47 to Kamala makes conservatives look like fools.",
         "Some people like to get excited by anything that looks good on the surface, some prefer to only be optimistic when the real numbers actually mean something solid. \n\nYou’re telling them what it feels like from your point of view and they are telling you what it feels like from their point of view. You can’t criticize them too much because you’re both doing the same thing.",
         "> Does it hurt you if we express an optimistic thought?\n\nIt doesn't, but I've watched the last several elections.  The rural counties always report first, the Republicans get a big lead, then the DC suburbs pull it to the Dems."
      ]
   },
   "1gks219": {
      "title": "We did it!",
      "text": "We did it everyone! I am fighting back tears. We fought and we did not give up. We saved our country when the chips were down. Let us rejoice but roll up our sleeves. To quote Ronald Reagan, \"We still have much work to do.\" God bless you all and MAKE AMERICA GREAT AGAIN.",
      "comments": [
         "We did it Joe!",
         "The Boys are back in town again!",
         "So fucking thrilled and relieved!!!!",
         "Someone needs to put a freaking fire under Nevada so we can win this thing tonight!!!",
         "😂🥹🥰😍🥳🤩🇺🇸🥳🙌🏼🫶🏻👍🏻😭😁😆",
         "Why do votes take so long? Dont all states tabulate votes by computer as people vote? In NY i feed ny vote into a scantron"
      ]
   },
   "1gkg8yu": {
      "title": "Voted for Biden in 2020, terrible mistake. Voted to save America and doing my part to turn Michigan red.",
      "text": "",
      "comments": [
         "Welcome to the team!",
         "I'm in SC but was in Detroit this past weekend for a funeral. I couldn't *believe* how many Trump supporters there were... on sidewalks, on corners, driving around with flags out every car window.\n\nI dunno man, I got a feeling Michigan will go red. Been to Detroit many times and never got that sort of feeling.",
         "As michiganders, my wife and I voted today, and despite  the Kamala ad, my wife wasn't scared of me when she voted me she voted for TRUMP!",
         "Sameeee",
         "That's the best sticker I've seen! Ours are so boring",
         "No! Knock it off, thats OUR word!  - Minnesotans.",
         "It takes a big person to admit a mistake!",
         "OPE?",
         "Good for you to have come to your senses. Welcome to the fight!!",
         "Damn my site just had the generic \"I Voted\" stickers left. I wanted to see some of the cool ones that have been in circulation.",
         "our stickers are so lame",
         "Say hi to my home state for me, I miss it! Glad I'm at least in another swing state so my vote still counts!",
         "👏👏",
         "Got me at first",
         "Michigan is going red. The muslim vote is going to screw Harris bad.",
         "Organization of Petroleum Exporting"
      ]
   },
   "1gks7q0": {
      "title": "Politics ",
      "text": "Ok folks, let's be good and gracious winners and not rub 99% of Reddit's nose in this glorious and well deserved victory against their blatant authoritarian fascism..... 🤣",
      "comments": [
         "I need to hear Kamala’s concession call.",
         "Fuck that, those little bitches that have been calling us Nazis for years? Nah fuck them.\n\nIf there’s an HONEST self-reflection from the Dems and they come hat in hand and want to have a convo? Then sure. \n\nBut if they go straight back to the “Not my president” and “Hitler” bullshit, then piss on em.\n\nWe’ll skull fuck them in the next election too and laugh at them again.",
         "Fuck em",
         "This is not little league baseball. Those freaks wanted to destroy OUR country. Take no prisoners and show no mercy. They deserve what they get.",
         "![gif](giphy|pD7YIQoUwgb9cnX3FJ|downsized)",
         "Nah. Let them choke on their own pretension and cry in their vomit.",
         "I voted early this year, I haven't voted since 2016. I prayed, which I've not done in ages. Maybe I need to go to church.",
         "No. Its been pretty much a decade of being called a fascist and a nazi by people who riot, loot and invade cities. They lie, they cheat. Fuck em. I'm not talking about the average democrat, I'm talking about the people who said these things. The people who promote communism. They will never hear the end of this from me. They could kiss my ass if I wasn't afraid of their cold sores.",
         "No we are rubbing it for a month. Then it’s okay.",
         "They havent been nice to me for months. But ok, ill try cause im so happy 😃",
         "I’ve been called a racist, fascist, rapist sympathizer, and every mean word in the book on this site over the last few months. Now I’m not going to go do the same thing to them because I’m better than that, however they do deserve a little teasing. I also want them to understand that it was their own behavior that made this happen. They are just as much to thank for Trump’s victory as anyone who voted for him.",
         "Ahh no actually I'm going to be a dick about it 😆",
         "No mercy for these psychos. I'm tired of giving them grace and dignity they would not give to us ",
         "Nah, they deserve every single bit of it for the absolutely despicable garbage they have spewed. For a couple days at least.",
         "This is an admirable sentiment and a commendable call for personal restraint—quite in the noble spirit and character of William F. Buckley and George H.W. Bush.\n\nBut nah bra! I’m going to go full pig on these little Bolsheviks and relish slurping up every one of their leftist commie tears! Hear this: We’re back baby! 😭😁🇺🇸",
         "Side question: Is anyone else not allowed to see their reddit notifications? Mine just keeps telling me turn on notifications.",
         "But they’re weird.",
         "You get 1 day",
         "#GUILTY!!!  SENTENCED TO 4 YEARS IN THE WHITE HOUSE!",
         "Nah. Let them choke on it. They’re getting what they deserve.",
         "FUCK THE LEFT!! All their (continued) gaslighting and vitriol. They are in full crybaby mode! Love it!!",
         "![gif](giphy|l2YWxKGZ5hOT7BnOw)",
         "r/furry_irl has some of us lol",
         "New ringtone",
         "On repeat!",
         "Yea where is she? In Biden’s basement?",
         "#100%",
         "The left news is already starting to talk about the bomb threats and whatnot that they avoided so hard in the beginning. Nothing will change over there.",
         "Lmao, I love you for this comment!!!! 😅🇺🇸🙏🏼",
         "![gif](giphy|lUAXivqATIe52)",
         "#Let 'er rip!",
         "Aw, I was just lining up to slap hands and say \"good game\" a dozen times.",
         "You're not a gnat are you, Bug?",
         "You should. This victory was granted to us all - not conservatives, not Americans, but the human race - by the grace of God.\n\nI've found that if I ever ask myself, \"do I need to go to church?\" it's better and quicker to just say \"Yes!\" right off the bat. It's about more than community, resolving to overcome your sins, and feeling good about yourself. It's about life itself.",
         "![gif](giphy|3o84sw9CmwYpAnRRni)",
         "#FAIR IS FAIR!",
         "> They are just as much to thank for Trump’s victory as anyone who voted for him.\n\n'Amen' to that!",
         "lol, oh boy, me too!  My boss is Liberal and, my God,  it's gonna be a tough day for him tomorrow 😂",
         "> No mercy for these psychos. I'm tired of giving them grace and dignity they would not give to us \n\nI accept your terms!  \n\n#🤣",
         "> But nah bra! I’m going to go full pig on these little Bolsheviks and relish slurping up every one of their leftist commie tears! Hear this: We’re back baby! 😭😁🇺🇸\n\n#Terms accepted!\n\n#🤣",
         "> Side question: Is anyone else not allowed to see their reddit notifications? Mine just keeps telling me turn on notifications.\n\nI am NOT having problems getting notifications.  Lord have mercy, I should have put a /s at the end of my post 🤣",
         "Yup, Mines fucked.",
         "> But they’re weird.\n\nGood point!  Please ridicule them.... endlessly.  Seriously.  They deserve it!  Hell, they've *earned* it!",
         "![gif](giphy|e2QYPpUe8WmpG)\n\nI just realise you were being sarcastic in the first place lol"
      ]
   },
   "1gktiyw": {
      "title": "Where are the 20 million more votes Joe Biden got in 2020 that Kamala Harris did not get in 2024?",
      "text": "Just a question, I think Joe got 81 million in 2020. Right now she's at 63 mill so might be 10 to 15 million missing votes....?",
      "comments": [
         "The voter registration rolls were unburdened by what has been.",
         "Graveyards?",
         "The most damning stat of the night was that Kamala performed worse than Biden in every single county in America, no hyperbole. ",
         "Well when you mail out hundreds of thousands of ballots to people who don't intend to vote, they are really easy to harvest and fill out.",
         "Still in their envelope waiting to be delivered from all the dead people and scammers.",
         "They couldn’t cheat this year. Simple as that.",
         "Harris was just that bad of a candidate. It's not really that surprising. As of this comment, Harris barely has Clinton's amount of votes. That's how bad she is.\n\nTrump is going to win with around the same amount of votes, maybe even a little less, as 2020. He's most likely going to win the popular vote too. \n\nIf they had run someone even slightly likable and competent there's a decent chance we wouldn't be celebrating right now. I only say this because we don't need to get complacent. We need to start looking ahead to 2028 tomorrow, because we won't be able to rely on Trump next time and no other Republican is as charismatic as Trump.",
         "Did the urban areas turn out?  I don’t find many excited in the urban areas. They may dislike Trump but it’s hard to be excited about Harris and Democrats given the slow decline many of us have experienced under Democrat leadership.",
         "A bunch of states attorney generals fought back, not to mention lawsuits from conservative legal groups. There was some chicanery this election season from the federal government enrolling voters in states. \nYeah, it’s easy to “harvests ballots when they are all set out automatically to whatever adduces they could find for people.",
         "Didn't stop them from voting last time",
         "And she lost the popular vote.",
         "That’s a bingo.\n\nNobody believes the suitcases full of ballots that came in at 3am that propelled Biden into the WH were actually individually filled out by individuals, right?\n\n2020 was an aberration that occurred because of a 100 year pandemic event and a mass censorship campaign by big tech on behalf of the Democratic Party (they tried again this time but weren’t as successful.. thanks Elon)",
         "I feel that the cheating was still there, but not as widespread as 2020 due to the lawsuits and oversight.",
         "If either party had just governed responsibly, Trump never would have been President in the first place",
         "Exactly. They stole the election. I hope Trump investigates and executes for treason all the people involved.",
         "And the Right being completely unprepared and getting caught with their pants down."
      ]
   },
   "1gkwm9v": {
      "title": "Trump Declares Victory: 'God Spared My Life For A Reason'",
      "text": "",
      "comments": [
         "GOD BLESS MR TRUMP",
         "Remember when he said “I’m not supposed to be here”?\n\nYES YOU ARE \n\nYES YOU ARE",
         "God bless this country. And now give us the power to destroy our enemies",
         "As happy as I am today we just have to hope that the secret service is really at their best for the next 2 months.",
         "I’m very worried about it.\n\nI realize this is a dark question, but if something were to happen, does Vance immediately become president elect?",
         "I think that’s how it works, and then he’d select a VP himself but I’m not 100% sure."
      ]
   },
   "1gkp9d6": {
      "title": "Decision Desk - Trump WINS in GA",
      "text": "",
      "comments": [
         "The folks over at r/politics are losing their freaking minds right now and I'm here for it!",
         "https://x.com/DecisionDeskHQ/status/1854002639824093678",
         "surprised they haven't called it.  It's way beyond the margin.  there's no pathway for her to win.",
         "I know people who posted the “Georgia looks so good blue” everywhere in 2020. Is there a “Georgia looks so good red” meme yet?",
         "Associated press hasn’t called Georgia yet",
         "GA is not called yet",
         "Sweet!",
         "Did Fani lose too?",
         "Regrettably, no one else is calling it for him as of right now",
         "Nice to know you guys trust the election process now",
         "Go team r@pe!!!",
         "Twitter is fake news",
         "Not surprised really. They astroturfed so hard, and it didn’t work too well. Looks like Trump is gonna win PA too, and if that’s the case this election is done. \n\nOh and don’t forget NYT predicting he wins EC and Popular Vote.",
         "Is it wrong that I only got on Reddit to be entertained by lefties losing it?",
         "Too early to celebrate. In the words of Chris Webber, Trump must run through the tape.",
         "Hahahahaha I support you brotha. Red prevails!",
         "the best part is half of them probably didn’t even vote or aren’t old enough lmao",
         "They literally downvoted any polls they didn't like and now are shocked at the results? Idiots",
         "LMAO now that's gotta be a sight to behold!",
         "They were so wrong about Iowa turning blue 🤣",
         "It's glorious. Truly. Glorious.",
         "It’s a beautiful thing really. Every comment I leave on that sub is being downvoted to oblivion. The idea of someone sharing an opinion that differs from them is so foreign to them it’s ridiculous.",
         "Liberal tears are soo good!",
         "It’s scrubbed now. I can’t find any posts except states Harris won.",
         "AP is very conservative, they are definitely the gold standard but other outlets call states earlier.",
         "AP is garbage.",
         "Its called by Decision Desk, takes them less time to call a state than AP.",
         "Funny considering how much of a fit you guys threw in 2016 talking about “Russian interference “ and so forth. When you win, it’s perfect. But when you lose, it’s illegitimately. So I guess you guys are about to queue up the racism, sexism, or any other -ism you can .",
         "Remains to be seen if we can,  as we have to wait till 3am for magic ballots to appear in large boxes out of the back of unmarked white vans, out of legal chain of custody and after legal acceptance without poll watchers present.",
         "Cope.",
         "Elon's takeover made Twitter an actual buffet table, if there's something you dislike just unplug from it.",
         "Brigaders not welcome.",
         "AS HE SHOULD ❤️🦅❤️🦅❤️🦅❤️🦅",
         "I keep seeing the PA is Trump yet the links I'm looking at only show 61% in.",
         "Are you serious??",
         "Bro, same. \n\nThey’ve been extremely hostile towards us for the last 4 years and I’m thoroughly going to enjoy watching them implode.",
         "Well hopefully he'll be saying the words of a different Weber later tonight.  \"WHO DO YOU THINK YOU ARE?! I AM!\"",
         "They were decent in the past but partisanship got to them too. Sad.",
         "Only because it doesn’t agree with you you live in a bubble",
         "1) I voted for Trump in 2016 so miss me with that bs\n2) Im just glad the Capitol wont be stormed this time around",
         "And there it is. Its cheating if the other side wins but completely fair and legit if my guy wins",
         "Yeah. It’s going his way now, we will see I guess. 61% in is pretty good actually. Thought it would take them multiple days",
         "Serious about the NYT prediction?",
         "Do you trust the election process?",
         "Yes, and Pennsylvania (I'm in PA)",
         "Yes. Question, if the elections are rigged, does that mean Trump's victory in 2016 is illegitimate? Or is it only questionable when a Democrat wins?",
         "Neither. I don’t think the elections are rigged. I was just curious what your thoughts were."
      ]
   }
}