{
   "1gkdqa1": {
      "title": "Meanwhile,  in PA...",
      "text": "The Amish are out in droves. God is not finished with our country. ",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "Vote like it’s 1899!",
         "Thx in advance, Amish!",
         "Say what you want about the Amish. But they are world famous for following through with their beliefs. We need every bit of help we can get to get Pennsylvanias electors for Trump.",
         "A very large community of Hasidic Jews is coming out en masse for Trump in Lakewood, NJ.  No one has ever seen voting lines like this in Lakewood.",
         "Amish are usually not involved with voting.  But some Biden government beauacrats decided to go after some of them for selling farm goods.  I don't know what if any rules they violated but a couple got thrown in jail.  Somewhere around 100k amish in Pennsalvania and they are pissed.  Them coming out to vote is actually something that could make the difference.  The federal government is out of control.  The amish know it and you know it.",
         "If Trump wins, he should host a gathering off these groups that seem to be showing great support for him this time - Muslims, Jews, Amish, Latinos, etc",
         "I am now hungry for homemade baked goods.\n  \nEspecially a whoopie pie.",
         "I know the Amish community was pissed when Amos Miller got raided. I hope they show out to vote today!",
         "\n🎵 As I walk through the valley where I harvest my grain\nI take a look at my wife and realize she's very plain\n\nBut that's just perfect for an Amish like me\nYou know, I shun fancy things like electricity 🎵",
         "Amish Army!!!",
         "The Amish understand the values this country was founded on. I don’t think they usually vote in large numbers, so this could be a huge change for them. They want to protect their way of life.",
         "Fuckin A, here come the Amish!",
         "RIDE OF THE ROHIRRIM",
         "If PA goes red, we know who to thank",
         "Like most other Republicans they just want the government to leave them alone. They know that doesn't happen with a leftist in the White House.",
         "[This picture is from 2020](https://www.breitbart.com/2020-election/2020/11/03/amish-horse-buggy-trump-train-goes-viral-election-day/)",
         "PA FOR TRUMP! PLEASE VOTE!",
         "This is so sick. I love this",
         "The estimated Amish population in PA is over 81,000. LFG.",
         "remember when biden went after the amish for selling food goods!?!?...hopefully their votes increase the red chances!!",
         "that is fake.   I know it because Joe, kamala and the entire left said that if people did not take the jab they would 110% die.",
         "I live in a different Midwest state and I have heard talks of the Amish population here also exercising their right to vote. Surprising because they are typically so reclusive when it comes to govt affairs.",
         "This must be really bad if the AMISH are voting 😆 ",
         "Send in the cavalry !",
         "Past weeks I’ve been seeing Dems try to convince people the Amish wouldn’t be voting. They fear this level of turnout.",
         "I think this picture is from 2020",
         "I kind of out of the loop with this one. I’ve seen it mentioned recently but will the Amish be a game changer?",
         "Is this real?",
         "At the same time, we shouldn't think that the Amish are going to vote in big numbers. Nick Shirley went out and talked to a lot of them. While yes, the ones who are going to vote are for Trump. There still seems to be a good group that just doesn't care about politics and just care about God.",
         "Politics aside—this is a fantastic image! Let’s go guys!",
         "Curious why the Amish are supporting Trump, though.  Aren't they mostly insulated from economic issues?",
         "we been spending most our lives living in a leftist paradise\n\ntheir women all look like guys\n\nliving in a leftist paradise\n\nopen borders and fiery nights\n\nliving in a leftist paradise\n\n4 more years we wont survive\n\nliving in a leftist paradise",
         "That is bad ass🇺🇸",
         "Yinz want 1 term or 2?",
         "This picture has been recycled since 2016… that being said yes, yes they are.",
         "I was wondering if the Amish would turn out in droves after I saw a big line of Jewish support for him yesterday. And these good people reached this conclusion without all the medias left leaning bias and propaganda. Good to see!",
         "Everybody on the Trump.... Buggy Caravan!",
         "HELL yes! Lets go, we need you all.",
         "CHOO CHOO!!!!! 🚂🇺🇸🇺🇸🇺🇸🇺🇸",
         "Amish Paradise",
         "We got some real Mennonites up in here\n\nLET'S GO AMISH",
         "This is awesome!",
         "Ugh early voting does not look good for Trump in PA",
         "Meaningful to note the very insular Orthodox Jewish Satmar Hasidic sect who usually abstain from endorsements, but in the past have endorsed local, New York politicians in state and local levels, has endorsed Donald Trump and instructed his followers some 50,000 strong in New York alone to vote for him. \n\nFor all the antisemites posing as anti-Zionists don’t worry they don’t recognize the state of Israel as a secular state, they await the messiah, so this isn’t a pro Israel endorsement, they just fear the state of Jews under a Harris presidency rightfully so. \n\nIf you rally the Hasidim in New York and the Amish in Pennsylvania, all should be well in the end.",
         "Ive churned butter once or twice….",
         "Let’s go Amish!!!!! (What’s funny is they will never read this as they don’t use internet)",
         "That is nice of you, but you know, they very likely won't read that. :-)",
         "Love to see it. \n\nPeople criticize Jews for being liberal, and by and large American Jews are overwhelmingly so, but if you look at voter maps at all the major *Orthodox* Jewish enclaves, they're the reddest counties you've ever seen. Monsey had between 90-99% of its residents voting Trump in 2020.",
         "This is so interesting-the Hasidic Jews in Monsey NY came out years ago for Hillary Clinton when she ran for the senate.  Do not get on their bad side-they vote as a bloc, and there are a lot of them.",
         "Taking \"Don't Tread On Me\" seriously!",
         "The dispute is over selling raw milk and unprocessed meat.  Every Instagram cutie is sucking down raw milk left and right, there is a high demand and the Amish can't sell it.",
         "Amishgate.",
         "lancaster county is the county to watch,",
         "Amish are of the mindset not to be recognized. But improving the economy so they thrive would be plenty of thanks.",
         "The rainbow coalition for freedom!",
         "[removed]",
         "Sounds like a MAD Magazine fold-out in the making.",
         "So good, right?",
         "80,000-100,000 voting age in PA alone.",
         "Absolutely. This is a meme, but I work with the Amish part time, and can confirm they are absolutely voting Red.",
         "They want freedom of religion, and yes, they still use diesel generators and buy goods like the rest of us.",
         "The Biden admin went after them for drinking and selling raw milk.\n\ntraditionally the amish and government have had a 'hands-off' relationship.",
         "probably has something to do with the biden admin going after some Amish farmers and jailing one in particular over something about selling their farm goods.",
         "They still have to purchase some goods.",
         "Found the Pennsylvanian...",
         "Yes it does. Actually do comps between 2020 and this cycle. Just looking this cycle and going “trump behind early vote, uh oh” is horrid analysis",
         "lol yes it does. Dems had a 400k lead going into today. That had a million last time.\n\n  \nIf you are referring to today's numbers then there hasn't been any released from PA so how would you know?\n\nIf you are going by ED voting in other states? Well it looks like we are in for a good night.",
         "We sell quilts at discount price...",
         "Livin’ in a MAGA paradise",
         "Nope, i just het pictures of your mom through the mail",
         "No TV or magazines either.  Imagine never seeing a campaign commercial?  The Pennsylvania Amish are upset at the State not letting them sell raw milk and unprocessed meat.",
         "Never know... i live by an Amish community and they order things online and smoke. Not sure *how* but this is in the south so things maybe different from PA.",
         "Haha, many Amish have (secret) phones. As long as the Bishop doesn't know...",
         "r/amish",
         "Not until I fly to PA and sneak them a cellphone and router 😜",
         "Thank you.  I suspected that others knew more than me.  I am all for Instagram cuties sucking down raw milk.",
         "Something Trump can do that other politicians usually can't: go talk to them without announcing it.\n\nNo ceremonial handshake, no limelight, just hearing their concerns so they can be included in the governing. If a DC regular can't make PR out of it then it's stressful wasted time to them, but Trump is more comfortable going to North Korea than a lot of Dems are venturing outside the big city.",
         "Yes. I heard that if you tell them they have something nice, they actually take it as a kind of insult, because of the value they place on humility.",
         "Wow! We have keeping pushing and do what we are supposed to do which is VOTE! 🇺🇸",
         "[removed]",
         "Oh, yeah",
         "Ohioan actually but I've been around a lot of A-mish stores in my area. They grow a mean honey crisp.",
         "First I'll cast a ballot...then I'll cast anudder",
         "and.... you get a free My Pillow!! But hurry, because this deal is only while supplies last!",
         "You can only be apolitical so much before it affects you.",
         "Somebody else can order for them, just like somebody else can drive them in a car.",
         "Ordering things online probably via prayer. Maybe god actually answers this stuff if you are a good enough Christian.",
         "Yeah, I heard some sneak off to party. And some do leave their community to join the outside world. I think I saw one woman had a YouTube channel who was chronicling her life after leaving.",
         "They don't want that. If you fly there anyways, just thank them in person.",
         "This is America. Instagram cuties have the God-given right to suck down whatever they damn well please!",
         "Many more in WNY also! (just to the north)",
         "Ba dum tiss...😁",
         "That doesn’t really make sense to me. It sounds like similar logic to how some young Mormons will do these things that barely skirt around “no sex before marriage” like inserting but not thrusting and having someone else shake the bed they’re on to simulate sex while *technically* not being sex? Like it seems pretty self evident by rational reasoning that’s not what you’re supposed to be doing but since it passes the “it’s not me it was someone else” test *technically* they can do it.",
         "Some...🤣 They all sneak off to party during Rumspringa. And after they're newly married,  too.  😁",
         "I am not sure on if it is required or encouraged but they do leave the comunity for a certain amount of time to experience the outside world and decide which world to pick. It is actually a pretty cool practice and I think a surprising amount decide to come back to the Amish comunity but not all.",
         "Agreed!"
      ]
   },
   "1gka7pw": {
      "title": "Hispanic women for Trump!🇺🇸",
      "text": "\nVoted in honor of the hard work and dedication and the sacrifices my great great grandparents made when they came to America from Mexico.  For my grandfather and uncles who fought and served in WW2, Korea, and Vietnam.  \n\nThey loved America and the fact that they were able to come from nothing and build a brand new life for their family should be a testament to how great our country has been, can be, and will be again.  I’d be ashamed for them to see what America has turned into but I’m confident President Trump can get us back to where we were before. \n\nLove, \nOne Trashy Mexican 🇺🇸🗑️🇺🇸\n\nMAGA!!!!🇺🇸🇺🇸🇺🇸",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "My Abuela has voted for Trump 3 times now. Hispanics, who are here legally, are typically pretty conservative.",
         "Hispanic women love their families and are a lot smarter than the DNC gives them credit for. \n\n\nMy little bro is married to a Mexican woman and she's incredibly based. ",
         "Bienvenidos.",
         "A True Patriot. She is not afraid!",
         "You must of have an abusive husband or you aren't real Latin. /s",
         "Love it, girl!  🇺🇸❤️",
         "Latinos for trump!!",
         "We got this!",
         "Yo voy a votar por Donald Trump!",
         "Beautiful",
         "Good for you!",
         "🙏🙏🙏",
         "Odelay!!!!",
         "Good for you and thank you for taking the time to vote.",
         "Wow!  What a great comment.  Thank you.",
         "Awesome! I'm a pale white woman for trump lol. But I stand in solidarity with you, as do most of my fellow mom friends!",
         "Fantastic! Let’s keep it up gang! 🇺🇸",
         "👀",
         "LFG",
         "Did your husband force you to say that? /s",
         "My great grandma legally immigrated from Mexico to the US around WW2. I asked my mom who was close with her growing up, do you think your Grandma would've voted for Kamala? \"Hell no!\" Also my dad's wife is Hispanic and obviously her family is and they are voting for Trump",
         "Be sure to take that sticker off at midnight.  :-)",
         "People who migrate legally know how hard and tough it is to do so and don't like those who cheat ahead of them by doing so illegally.",
         "[removed]",
         "Spanish people at least in my travels have always been conservative. Conservative women in general are smarter imo tho 😂",
         "Verdadera patriota",
         "He keeps me locked in the closet and lets me out occasionally to make him tacos and enchiladas. 😅🌮",
         "Exactly. According to others we are voting against our best interests. I guess I no longer control my interest and have the state decide what my best interests are.",
         "Hey we stand together no matter what color despite being a bunch of Nazis! 😆\n\nWe all want the best future for our children and families and that’s why we’re all here today. ❤️🇺🇸🫶",
         "😂😂 much respect for you to post here to the unbearable left sided reddit! You have guts!! Lol. I'm a Latino and so is my wife, we both voted Trump. How could we not. This is the worst administration in US history and we're tired of living broke!!!",
         "such an evil man....must be Trump's fault",
         "Horrible. You should divorce him and vote Kamala and go be a single empowered cat lady",
         "I could so go for a taco right now.",
         "The tortillas better be homemade",
         "Lol I was born and raised in the country.  I ain’t scared of some liberal soyboy keyboard warriors.  😂😂",
         "![gif](giphy|3o6ZsVbs2GzgKNvVpS|downsized)\n\nLiterally a Nazi."
      ]
   },
   "1gkdq79": {
      "title": "Trump is going to win the election and the far-left lunatics on this site are going to have a complete meltdown ",
      "text": "",
      "comments": [
         "GO VOTE",
         "I mean, i certainly hope so. \n\nId be lying if i tried to say that the *only* reason i want trump to win is because I think he’s the best choice for the country. \n\nThe salt mining in 2016 was some of the best shadenfreud or however its spelled that ive ever felt in my life.",
         "They'll still talk about Trump even if he loses. TDS is real.",
         "I mean I know we all remember Reddit ‘not working’ after the Trump/Biden debate 🙄 Trump winning will make Reddit implode, and it will be BEAUTIFUL!",
         "If that happens, don't rub it in their faces, or do it just a little. The times we are living now require unity. More division will be very detrimental to America.",
         "costco in my area (red) already sold out of 'bug out bags' (30 day supply of survivalist food!).",
         "Every subreddit is probably going to be locked if he wins which will be a huge bummer.",
         "Reddits going to be a ghost town after the astroturfers leave",
         "Liberal tears are delicious.",
         "Cant wait to peep at r/politics after he wins",
         "Go vote. I can handle 4 years of her laugh",
         "Politics aside, I want a Trump win so badly just for this reason lol.",
         "It's going to be glorious.",
         "I really don't want them to have a meltdown, but the surprise of a loss would lead to violence that would dwarf that of January 6. So I would stay away from downtown metros. They are so, so certain she is going to win, and are so fully convinced that conservatives are evil, that they will lose their minds and start smashing and burning things. Mostly because they want to retain the right to murder infants. \n\nThey will expose their hypocrisy and say that the election was stolen, after making fun of conservatives for doing just that (although I agree with them in regards to the last election - I do think Biden won fair and square, if we are counting a system with massive media manipulation as being fair and square - conservatives were just being sore losers). \n\nI am pretty sure that Trump is going to win. The dems are going to be complacent and not vote, due to their arrogance. I expect continual violence throughout Trump's presidency.\n\nCould be wrong, but that's how I see things.",
         "Nah, they would just melt like the wicked witch. Nuclear energy interferes with their grifting scheme called Green energy.\n\nhttps://www.businessinsider.com/biden-administration-energy-secretary-jennifer-granholm-stock-act-violator-2022-1?op=1",
         "rpol is in full insane mode already. You can hear their orgasms over Kamala over the internet. \n\nIt's so nuts how otherwise intelligent people can delude themselves that they are actually supporting someone when all they are doing in indulging thier hate. They truly are children. All they want is a strong parent figure to take care of them. That's why they only talk about identity politics, personality traits, and everything else that has nothing to do with being president. Because they aren;t voting for a president, they are voting for a parent. They don't call her \"Momala\" by accident. They really think that if they vote for her she will take care of their problems and all their failures in life will be swept away cause Mom will take care of it. It's absolutely insane.",
         "Especially when it becomes a Reagan landslide",
         "That’s the hope. \n  \nPersonally, I want a 2024 version of the dark-haired “HES A FACIST” girl in the car and the RBG freak out girl. Those are my faves from Trumps first run in office.",
         "I feel bad for the brainwashed, governed by hatred and cognitive dissonance they are.",
         "I went to the Supermarket this afternoon. And the Good Omen that I saw was a man of retirement age with a Maga shirt on. But... not just any Maga shirt, a shirt that said \"MAGA A F.\"",
         "dude remember the meltdown sub? and how it quietly just died after Trump won? ahhhhhh\n\ngood fuckin times man",
         "IF YOU KNOW ANYONE IN PA NJ VA NC GA AND NH WHO HASN’T VOTED, GET THEM TO THE POLLS PRONTO.\n\nFL NV AZ DATA LOOKS FANTASTIC. WE ARe WITHIN REACH!",
         "Not to mention the riots and countless Democrat representatives that will refuse to certify the election. We will never have to hear about January 6th ever again if Trump wins because it will be just as bad, if not worse. All of a sudden denying elections without proof will be acceptable.",
         "Schadenfreude",
         "Goddamn it’s true.. my *best friend* of 17 years said Dick Cheney was a “better person than Donald Fucking Trump” and then followed the message with “I can’t believe anyone would vote for Donald Trump.” \n\nEven though a week ago she had openly admitted that she had 0 information on either of their policies because she (quote) “gets too burnt out to care to follow politics.” \n\n🫠",
         "There are a couple of people in my life who have attacked me over my decision, totally unprovoked. \n\nI plan to rub it in their fucking face.",
         "If they win, the first thing they intend to do is lock up Trump and begin persecuting anyone who supported them. \n\n\nF them.\n\n\nIf they lose they deserve every ounce of misery that comes with their evil.",
         "Screw that, they have shown zero grace or compromise over the last 8 years and wouldn’t think twice to rub salt in the wounds.",
         "Agreed. If we lost, God forbid, we should act right, too. (Assuming there isn't any fuckery going on.)",
         "Maybe when they stop calling us a threat to democracy and literally Hitler.",
         "Tell what? I'll do unity next week.",
         "Rub it in whose face?  They wouldn't hesitate to do another covid again, and they wouldn't hesitate to take your rights.  They believe you're garbage.  Now is the time to show them that we aren't the minority voice, and their ideas are built on lies.",
         "LeTs TuRn ThIs StAtE bLuE herrr derrr",
         "I mean, survivalists are mostly conservative. This is right wingers thinking the steal is gonna happen again and everything will go to shit.",
         "The best time to buy a(nother) gun was last weekend. The second best time is right now.",
         "Yep. I fully expect this one will be locked regardless what happens. r/Pol is going to absolutely flood this place when the results are announced, win or lose.",
         "Just me and the bots",
         "Legit - believe my math was ~170 posts per day (& associated comments / votes - per the recent Federalist expose')...\n\n>Over the course of 15 days, this group of volunteers, directed by official Harris-Walz campaign staff, was able to make 2,551 posts to Reddit. So far, they have received more than 5.7 million upvotes and 418,000 comments on those posts, according to their own data...",
         "Bad for high blood pressure though",
         "It will be...\n\n![gif](giphy|8fen5LSZcHQ5O|downsized)",
         "I also expect Trump will win.  History is typically not kind to a sitting administration during economic woes.  I think Trump would have easily won re-election in 2020 if not for the pandemic.\n\nI am hoping that there is little to no violence and we don't get riots, but considering how angry people are, I expect there will be some.\n\nI also hope Trump stays safe.  People are unhinged, and all the Nazi/Hitler rhetoric is definitely inflammatory to the mentally unstable.",
         "These people need to pay a visit to r/raisedbynarcissists then because that's what kind of parental relationship they're going to receive from her.",
         ">They don't call her \"Momala\" by accident. They really think that if they vote for her she will take care of their problems and all their failures in life will be swept away cause Mom will take care of it. It's absolutely insane\n\nLove her or hate her, Meghan McCain has been bringing this point up a lot on her podcast. Between the \"Momala\" stuff and trying to paint Walz as \"America's Dad\" is really weird. I'm actually kind of worried about the mental health of a lot of politically active people...",
         "Before we even get to worrying about if Congress will certify the election, we first have to make sure the electoral college will follow their state's votes (especially if the EC is close).",
         "I was pretty close!\n\nThe germans call that closenscpelllen",
         "These are the people that enrage me the most.  They're the most insufferable.\n\nOh you admit you never cared about politics prior to 2016 and your whole political worldview started with Trump?\n\nOpinions can be immediately disregarded.",
         "I know it's hard to let go.",
         "Rubbing it in their face will feel good in the moment but taking the high road will feel better in the long run because it is the right thing to do.  I’m saying this to myself as much as I am to you.",
         "I'm going to liberal enclaves and slapping trump stickers on all their cars \n\nWatch em eat their own",
         "If President Trump wins, that will also be due to the extreme hate for him from the other side. So, in a way, they will make that win possible.",
         "I think that people are getting divided by entities that thrive on that. The worst part is that division getting to sustain itself over the time. I think the problem lies in the system that produces the division, not on the other side of the aisle.",
         "Last 16 years",
         "I think a lot of the people that say that, would never think of it under normal circumstances. That rhetoric is created by the system that pushes the hate in the society.",
         "I don't know if unity can be achieved, but I think less division can certainly be done.",
         "exactly!",
         "I feel like a lot of us are the right are concerned about the ~~looting, burning, & rioting~~ **mostly peaceful protests** if Trump wins.",
         "As an FFL, I got a notification from my states bureau yesterday the Federal Files are down, ie: the FBI system is not returning results, which means at least a 3 day delay if they don't come back up. I may have missed the notification (I'm currently low volume with no pending transactions), but I haven't seen a message that the system is back up.",
         "Do they make a low sodium version?",
         "Klößenschpellen\n\nSorry, had to.",
         "Yeah, vandalizing is not a good response to your side winning... or losing...  \n'R' is still the party of law and order.",
         "But hey, it will be good to scroll the front page and see subs that have no business posting political stuff (usually just low effort posts running down trump)\n\nReddit has become unsufferable, I’ve had to block so many lefty subs.",
         "They're not wrong, especially if Komrade Harris successfully implements price controls. We will become Venezuela in a very short time if that happens.",
         "But it's they're delicious because they're so salty.",
         "Best we can do is low testosterone.",
         "I don't know... Slapping a bumper sticker on a car doesn't seem like a big deal to me",
         "But the Diabeetus.",
         "BUT I WANT LOW SODIUM TEARS!!!!!!",
         "That comes from sugar, not salt",
         "lol Poor Wilfred."
      ]
   },
   "1gke4eg": {
      "title": "Post your final election day predictions",
      "text": "",
      "comments": [
         "I burst out laughing, thank you lol",
         "Congrats to the Democrats on finally flipping Iowa!",
         "Taking CA was a real surprise! LOL",
         "Jeb comes in from the rafters and sweeps all 50 then picks Trump as his VP is exchange for a lifetime supply of McDonald’s.\n\n![gif](giphy|3o85xvYjl3CwW7BbnW|downsized)",
         "Of course it's the commie stronghold in Iowa. /s",
         "![gif](giphy|VGKtXfGNwH6cLifbDY|downsized)",
         "They really haven’t flipped Iowa, we are pretty sure we are going to be red. The democrats have claimed it as their flip but idk I’ve beeen and Iowan my whole life and it’s going to Trump.",
         "Harris wins with all the electoral votes in a landslide with an unprecedented 101% of the country voting for her!\n\nOh and never mind those burning ballots they're empty I promise!",
         "Lol I love it. This gave me a good laugh, thank you.",
         "If only the mole people of west virginia would stop eating the census people it would be worth at least 20, but its probably best they stay in the dark abandoned mines.",
         "You're right about them getting only one state, but it will be Minnesota not Iowa",
         "LOL 😆 \n\nAnn Selzer would cry tears of joy if this were the case",
         "Holy shit, even flipped Cali",
         "This made me laugh good man nice one",
         "God damn it Iowa",
         "I snorted!  That's hilarious.",
         "As a Californian, I wish lol",
         "Hahahaha, let’s hope😅",
         "Lmfao",
         "I wish 😂 but I'll take a win by 2 votes. A dub is a dub.",
         "Pretty sure if this was the result, Iowans would be so ashamed of themselves that they'd dissolve their own statehood.",
         "if illinois went red, i would go outside , ride my zuma naked down every single street in my town and live stream it",
         "LOL",
         "Damn, this was funny.",
         "💀🤣",
         "I wish this would happen! But I’ll take trump at 270 and be extremely happy!",
         "lol!",
         "Wait, you think California, a state that made it illegal to ask for ID for an election. Is going to vote RED?  That's a bold claim.  Since they past that law they've been bluer than Waltz Balls.",
         "[We will have never seen him coming.](https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2Frso45f8c21x51.png)",
         "Landslide for Jeb!",
         "OK. that one made me smile!",
         "I have trump at 983 and harris at 0.",
         "Nice touch keeping DC blue still",
         "As an Iowan, I did a pretty loud nose snort exhale.",
         "There's always that one state in a 49-state sweep...",
         "They won’t be satisfied unless they can flip Idaho too.",
         "In my dreams. I’m so sad for my state",
         "This is my favorite gif to come out of the 2016 cycle ([close second](https://media0.giphy.com/media/v1.Y2lkPTc5MGI3NjExNHAydHZ6N3I4ZmN1engxb2kxZ3J4bWQwaWZvajh3Znl5NnBmNjlzOSZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9Zw/6L015gMEW3pFC/giphy.webp).) Just the context of Trump verbally abusing Jeb so hard leading up to this debate, the \"Oh he's got more energy tonight, I like that\", Trump offering the five, the way Jeb pounds out that high-five and looks so goofy immediately after, Trump swinging his arm back like, \"dude that kinda hurt what's wrong with you.\"   \nHistorians will point to this moment. I don't know why, but they will.",
         "JEB!",
         "We-owa",
         "Imagine if Trump actually got 100% of the vote, and the whole election was all just a weird hivemind social game everyone was in on but you.  Wednesday morning, all the headlines read 'Speedmaster1776 finally woke up!'.  Looking back, you realize there were little clues everywhere, like common phrases, things people said when you were near, etc.",
         "Ann Selzer has been a disaster for Iowan internet discourse. There's no way we're Harris+3. Every indicator here shows Trump winning big time.",
         "As is tradition",
         "lol it’s meant to be a satirical joke post",
         "woosh",
         "If DC ever voted red i'd become heavily suspicious of the GOP on the spot.",
         "Still can't get DC though 😅",
         "Yeah it’s a shithole that ironically is becoming impossible to live in unless you have inheritance. Our red cities are based though so that’s nice lol.",
         "They'll point to it. Kids will learn about it in school, it will be remembered by pretty much everyone in 2070. Nobody will ever talk about the context and just accept that it happened",
         "Ourwa",
         "Id immediately start taking an antipsychotic 😂",
         "Exactly nearly every poll for the past year has Trump ahead by a comfortable amount. Polls don’t flip like that that quick. Total outlier, completely false. They Cleary don’t live in Iowa",
         "I know, so, I can't joke with you?",
         "Technically, it wouldn’t be hard. Congress has a lot of authority to clean up DC.\n\nDC is only a liberal cesspool because nobody in their right mind wants to live there. It’s true of most ghettos in the country — Republicans don’t live there, because Republicans like nice things.\n\nSo there are two steps to fixing DC:\n\n1. Republicans getting a majority in Congress.\n2. Republican legislators actually caring enough about DC to fix its problems.\n\n2 is actually the biggest hurdle. Even though Congress is a custodian for DC, the people we elect don’t give a damn about maintaining it, because it doesn’t influence their chances of being elected in other parts of the country.\n\nAnd also they don’t have to live there. If we forced Congress to live in DC, the problems would get fixed over night.\n\nIt’s one of the things missing from the Constitution. When the Constitution was written, it wasn’t as easy to travel long distances, so nobody envisioned this as a problem.",
         "It's always that one state plus DC.\n\nFirst thought upon seeing image: *what did THEY do???*",
         "In all seriousness though: why is DC stubbornly Blue?",
         "Well yeah, I was trying to be realistic. No one's going to vote to be unemployed.\n\nThen again, there are a few million Kamala voters floating around...",
         "Someone can correct me if I'm wrong, but a lot of people living there either work for the government or are paid with tax payer money through contracting. ",
         "It's an East Coast city, so it's a mix of highly educated people, diversity, and government workers.  It also probably skews on the younger side.\n\n85% blue is pretty much in-line with the city limits of Baltimore and Philadelphia.",
         "You’re thinking of Northern Virginia (NoVa) and Maryland suburbs.\n\nDC itself is mostly ghetto, one of the most dangerous cities in America. And it got that way because of neglect from Congress, which is in charge of DC but doesn’t have to live there.\n\nForce Congress to live in DC, and DC would become a livable city. That won’t magically flip it red, but it would no longer be 90% Democrat.",
         "DC is mostly ghetto actually. The educated and government workers in DC proper is a minority — most actually live outside DC in Virginia or Maryland suburbs. There’s only like a couple neighborhoods in DC that could be considered gentrified enough for middle class people to live there, and even those neighborhoods are kind of sketchy.\n\nSo it’s more than being an East Coast city. Democrats have a monopoly on pretty much all ghettos in America, because sane people don’t want to live there."
      ]
   },
   "1gk7fwo": {
      "title": "47 just voted for the first time",
      "text": "I not only did this for our freedom but for my mom.  She passed away December 3rd from ALS and she was a huge Trump supporter.   I’ve never voted before and I knew this year I had too. Come on mom, work your magic in heaven ❤️",
      "comments": [
         "Ok, I get it now. I thought this picture depicted a 47-year-old and I was all....WHAT?! 😂\n\nCongrats!",
         "I’m so sorry about your mom! Seems like a great way to honor what she loved.  Welcome to the party!",
         "47 voting for 47 :)\n\nSo sorry for your loss",
         "Welcome to the family OP.",
         "Yes sorry!!  I am 47!!  My mom was 75….RIP my spunky lady! 🪽",
         "I’m sorry for your loss",
         "Sorry about your mom, and good for you for voting and honoring her memory.",
         "i thought that was supposed to be you until  i read the description and was like \"damn, that's a rough looking 47\"",
         "Vote Trump! Do it for Peanut the squirrel!\n\n![gif](giphy|3osxY7eI6enqNBo2mQ|downsized)",
         "Love you! 🙌",
         "Get everyone to the polls and we win",
         "You are our friend. Thank you for being here!",
         "I will say a prayer for your Mother. Thank you for joining us and voting",
         "I'm very sorry about your mom, ALS is such a terrible disease😞\n\nPlease make sure she doesn't vote for the Dems this year",
         "I was just thinking to myself that theres no way youre 47 only to read that the pic is your mom. Lol! Good on ya for getting out to vote!",
         "So sorry for your loss 🙏 And thank you for your Trump vote.",
         "God bless you and tysm",
         "Oh wow, what a bittersweet post. Sorry for your loss, nothing like a mom. Hopefully we'll win to honor her.",
         "Stronger as one nation under GOD!",
         "May she rest in peace 🙏",
         "MAGA!",
         "congrats, your mom would be proud 🇺🇸🇺🇸",
         "Thank you!",
         "Atta girl!!!",
         "Well done.  \n\nThe stakes couldn't be higher.  This is what we're up against:  [https://youtu.be/n4PUhsl8jUc](https://youtu.be/n4PUhsl8jUc)",
         "Same lol. 🤣 helps for me to read the paragraph",
         "I read the paragraph and I still thought that's what it meant.",
         "Same here 😂",
         "Yeah I was freaking out because I'm only 9 years off 😳",
         "Thank you…miss her but know she’s with me always and will work magic tonight! ❤️",
         "Ahhhhh that is a sure fire sign!!! 💪🇺🇸❤️",
         "Thank you!!! Proud to be here!!",
         "Just curious what state are you in? And was there anything in particular that made you apathetic about voting before? Congratulations on joining the fold.",
         "##Peanutlivesmatter",
         "![gif](giphy|3o7TKwOvjlnqQ9KQY8|downsized)",
         "I'm not sure why, but your mom's picture made me feel a whole lot better.  ❤️",
         "My mom didn’t live to see the Trump movement, but as a staunch Conservative, she is likely hanging out in heaven with your mom in a matching MAGA hat solving the world’s problems…",
         "Which state?",
         "MD"
      ]
   },
   "1gkfvjs": {
      "title": "This “we might not know tonight” stuff is a vote suppression tactic, IGNORE IT",
      "text": "Democrats are so desperate right now that they’re trying to scare Republicans into thinking we can’t win. It’s actually the opposite. There can’t be shenanigans if all of us vote. Ignore polls. Ignore the media. Just get in line, stay in line, vote, and report any silliness you see.",
      "comments": [
         "I think it’s going to be pretty obvious as the night goes on. I don’t see 2020 happening.",
         "Vote. Even if it only mean you increase the popular vote for Trump. Its very important.",
         "\"We might not know tonight\" is Dem wishcasting that their *November Surprise* can save them again. \n\nThe fact that ***we might indeed know tonight*** is what's putting them in a sour mood today.",
         "We definitely won't know tonight unless one party is absolutely running away with it in enough swing states to call the election. I just don't see that happening unless the polls are grossly underestimating one of the nominees.",
         "It’s not, it’s just a fact.",
         "I am not expecting a 2000 result.\n\nIt seems to me that since that happened, the media always brings this up each election.",
         "Delays = fraud\n\nThey will attempt to stall, water main breaks, etc.",
         "Dems want to get to the 3am electorate.",
         "We very well may know tonight if either candidate is overperforming polls.",
         "This. That had unlimited mail in votes in every state, people were terrified to vote in person too. This is completely different, as long as everyone votes Trump wins. We have more registered voters this year, so it’s that simple.",
         "If Kamala wins we won’t see 2025 happen.",
         "2020 people were terrified to vote in person+every state mailed ballots to everyone. That’s not the case this time, for those reasons alone this is completely different. If everyone votes today it *should* be an easy win.",
         "We knew Biden won on election night 2020. When Fox called Arizona for Biden it was over. Win or lose, we'll know tonight as well.",
         "Right, and the rules for each state on when they could open the mail-ins were so wonky. It seems that most states, especially in battlegrounds, have tried to come up with a better system. AZ and NV are still a little iffy, but I just heard from someone on Fox that Michigan plans to have results by midnight tonight. \n\nAs much as I dislike Josh Shapiro, he has said PA won’t take that long and should see results tonight, possibly early tomorrow.",
         "What? As in project 2025 or the year?\n\nScrew project 2025",
         "Ohio sends ballots to everyone.  That is the most ridiculous thing I have ever heard.  The only mail in votes should be for the infirm, military and those who are not or have not been in their precinct for early voting.",
         "Haha, the year. No one cares about project 2025, Trump included. \n\nIf Kamala wins we’ll starve to death before we get another birthday.",
         "Ohio does not send ballots to everyone. They send a form for us to get a mail in ballot if we want one. Ohio has their shit together with voting, won’t see magical votes appear here."
      ]
   },
   "1gke38u": {
      "title": "Trump on Election: 'We Want the Answer Tonight'",
      "text": "",
      "comments": [
         "I want that too, but I don’t expect anything finalized until tomorrow morning.",
         "You mean the way it was forever until 2020 for some reason? Makes sense to me. ",
         "Florida, in 2 time zones, will have the election finished tonight. There is zero reason for states to not have it finished tonight.",
         "We don't always get what we want",
         "If he wins WI or MI, he's going to win and we'll know tonight. \n\nIf the election hangs on PA, who fucking knows when. \n\nHe's going to get AZ, NC, GA.",
         "There's no reason to think we won't know tonight. When Fox called Arizona in 2020, we knew then. The official results are never finalized on election night but people like Dave Wasserman that cover elections for a living know the kind of numbers both sides need in certain counties and can call it based on that.",
         "We should, this never was a problem before 2016 really. Ever since Trump won the first time, certain states all of sudden forgot how to count. If any other country can get their election results the day of,  no excuse why we can't do the same.",
         "I would caution Trump- if the results are against him he's going to VERY quickly insist we wait for mail ins.",
         "There is zero reason why every state can't have their final results tonight.  I don't care what their excuse is or what their supposed rationale is.  If you need \"more time\", you are cheating, and I will stand on that hill and defend it.",
         "I do fear the longer we don't know the bigger the chances the democrats cheat",
         "That's because the (d)ems have to check the grave yards for their votes.",
         "And I want a republican candidate who understands how elections work, but as the poet said, “you can’t always get what you want.”",
         "Sounds like Georgia and NC are going to count fast MI PA and WI could be done tomorrow and our desert swing states are snails",
         "And we are going to get it. LFG!",
         "Vote counting will be halted in a few key democrat inner city strongholds due to a water leak, gas leak, fire alarm, bomb threat, medical emergency, technical difficulty with machines. Counting will resume when the number of needed votes is determined and finished once enough fabricated ballots have been introduced. If needed boxes of ballots will be mysteriously found days later.",
         "Helpful reminder that, back when PA was considered \"reliably blue,\" they had their results posted on election night.\n\nIt's only since it has become a swing state that they suddenly forgot how to count.",
         "Seems like a reasonable ask....given almost all (say but one) elections have done so.....what's changed?  lol",
         "Or in 13 days if it depends on Maricopa…",
         "If the votes are as close as the polls, it won't be called tonight.\n\nOnly way that it gets called tonight is if Trump just demolished Harris in every swing state.",
         "I don't think the vote will be close. News & Polls only made it seem that way to keep viewers viewing and to not 'influence the vote'.",
         "If the margins are within half a percent, some of the swing states do automatic recounts, and others let the candidates request them. So, that's another reason the closeness of the vote will determine how long it takes to declare a winner.",
         "It won’t be finalized till an unmarked box truck brings in the rest of the votes at 3am.",
         "Election day is more like election week in some states.",
         "Like in 2000, when it took weeks? Ah, the good old days.",
         "Do you really not know why it took so long? There were almost 40m more mail in votes and most states aren’t allowed to start counting until Election Day",
         "Well, we all know the reason why.",
         "No but you understand now that we have high tech ballot readers and early voting it takes longer than collecting every ballot and hand counting them in a single day. For some reason. But not cheating. Reasons I say!",
         "Same where I live. Probably could go ahead and call it right now but by 7:30 at the latest.",
         "Every state should start counting mail in ballots as they come in. Another example of FL doing it right.",
         "I live in Pittsburgh Allegheny county says they can call it tonight. Its on Philly the rural counties normally call it quick",
         "Yep, but, if it's close, then it takes days to figure out the winner, because you have to count every single ballot before declaring a winner. And it may be close enough to require a recount. It comes up more often in lower ticket races, like the Minnesota Senate race with Al Franken and Norm Coleman. There is no guarantee that a winner is determined on election night, and it is unrealistic to demand that.",
         "In Canada, we aren't allowed to use machines. Everything is done by paid government employees (there's a government elections board that hires/fires staff to run the election each time it happens), and each vote is counted by two scrutineers manually across the entire country, 5000 km wide with about as many people as California.\n\nThe election results are calculated each hour as the votes are being counted as the world rotates to the largest time centres in Ontario, then the results are broadcasted an hour after the last polling station closes on the east end of the country. \n\nNot only can it be done, but it can be done without voting machines, and it can be done quickly. There is no excuse. (Oh, and each voter has to provide ID to ensure they match up with the voter roll on their voting station)",
         "I'll attack your hill! What about cases where voting get's delayed due to some malfunctioning equipment or where turn out was so much higher than usual that they will have to wait until all the people in line got to vote?",
         "Yep. Wait for the other side to post their official numbers -- noted here as variable X -- , then magically \"receive\" a few boxes that total X + 1000 ballots in the wee hours of the night.",
         "That’s a feature not a bug. Democrats started saying a couple years ago that we should stop expecting to have results on the night of an election. I wonder what all of a sudden changed?",
         "Indeed.",
         "Agreed",
         "LFG. Let's Freaking Go?",
         "Yinzer here. My county (Allegheny) is saying they can be done tonight. Its on those weirdos in philly now, the rural counties normally call quick",
         "But only starting in 2020. We've never had to wait for results like this, except for Florida in 2000..",
         "Gotta close the gap.",
         "I don't think any state is ever \"finished\" counting on election night, most don't even have to certify their votes until mid-December, but eventually math becomes impossible to overcome. People that call elections for a living, like Dave Wasserman, know the math at a county level and can confidently call the election when it hits a certain point. \n\nTo not know tonight/tomorrow morning, not only would it need to be incredibly close(closer than 2020), there would need to be some point of contention that can be challenged and possibly changed, like what happened with ballots in Florida in 2000(even though most people knew the challenge ultimately wouldn't change the results). The likelihood of that happening is incredibly small and there's no evidence to think it will happen this year.\n\nI'm fairly confident we will know the next president by 2am eastern time, if not before.",
         "I don't know, I agree that we should be a lot more efficient than we are but Canada's population has to come into play here in comparison to the US when making this point right?",
         "I don't care.  This isn't a surprise, special election. It's been scheduled for four years.  States need to get their shit together, manage issues that arise expeditiously, and count their votes by midnight.  Period.",
         "I would believe that if it wasn't so widespread. The only reason states delay results is to pad the numbers for kamala",
         "Looking For Group?",
         "Liberals fucking gone!",
         "Because of a massive increase in overall votes, as well as mail-in ballots.",
         "Absolutely a factor.\n\nThe main reason it's so efficient is because a non partisan (and I actually mean non-partisan) elections board is hired by the government to execute the elections to a certain standard across the country.\n\nI don't think the US constitution allows the federal government to do that in the US, so you just have to trust that each state is doing it the best possible way.",
         "Yes, but you can't disenfranchise legitimate voters because the corrupt, partisan officials at a voting location engage in tomfoolery. \n\nThat will only spur on *more* corruption (e.g. intentionally sabotaging red/blue voting districts).",
         "I think to say that this is the ONLY reason that it's happening is just as unreasonable as to assume that they NEVER would do that.",
         "Lefties Fail Generally",
         "I don't have a r/ one but have other resources.",
         "Thanks!"
      ]
   },
   "1gkdt3d": {
      "title": "Voted conservative for the first time ever today.",
      "text": "I voted Republican across the board. I've been voting Democrat since 2012 but the definition of insanity is doing the same thing and expecting different results. I want change so it's time to do something different. MAGA!",
      "comments": [
         "WTF is this ballot?",
         "That’s a NY ballot! Glad to have you on our side!",
         "Why do they list the candidates twice. Odd to say the least.",
         "Having Harris listed next to “working families” definitely feels like a bias 🧐",
         "Well hello there fellow Western New Yorker",
         "Thank you Patriot for voting and choosing Making America Great Again! \n\nText, call, email, social media friends, family, neighbors to come to the polls and vote.\n\nNO FAT ASS HARRY'S!",
         "I have so many questions about that ballot. 🤔",
         "Do they randomize the order of the parties on these ballots?  Or is it just biased for Harris?  It’s a pretty significant advantage to have the top spot of a ballot",
         "We also need more...more...more! \n\nKylo Ren style\n\nBut, we need more men to turn out so we cancel any Harris women voters!\n\nTime to stand up, go to the door, open the door, walk to your vehicle, go to the polling site and GET IN LINE!",
         "Hell yeah!",
         "Looks like you didn't vote for any conservatives, only republicans. Missed it by one line. Oh well, maybe you'll get it next time.",
         "NY\n\nYou should see how the prop one vote on the back is worded.",
         "In many states, candidates are allowed to run under multiple parties.",
         "I choked when I saw that, \"working families\" what a crock of shit! If they could have put \"fascists for the wealthy\" for Trump/Vance, they would have.",
         "Yes, it’s usually randomized depending on number or alphabetical draw.",
         "State legislation sets the order. Blue states have Dem first,  Red states have Rep first",
         "I think this was a joke people... calm down 😉",
         "I just voted. I was shocked by the wording.",
         "For those that don’t know, Ballotpedia is great resource to research props and make an informed decision",
         "LOL she almost get her freaking tagline as her party. Surprised it doesn't say \"Middle-Class Families.\"",
         "I mean, I think the candidates pick these parties. Trump missed a bet by not going with MAGA Party!",
         "Vote yes if you think the ny constitution should include a new section saying all people should be treated fairly, vote no if youre a big stinky head. \n\nTranslation: vote yes if you think ny should have a law that boys can play in girls sports. \n\n\nI checked the box indicating im a big stinky head.",
         "I've just never seen a ballot like this. I'm thankful my state is short and simple, I've heard the swing states are 4 pages long.",
         "My PA county does voting by Dominion machines. Was a very simple ballot, 9 offices or so to vote for, one screen for each. I heard the poll workers say they heard another state's voting went super slow a while back because they had a lot of ballot initiatives the people had to read.",
         "Are you able to fill out paper ballots?",
         "Not that I know of. I prefer it this way. I grew up voting by machine too, but they were the ancient lever machines that I think date back 100 years. This new machine produces a paper print-out that goes into a second machine to be read.",
         "I have never voted on one, I'm old school 😁",
         "I only voted on paper when I was living elsewhere in the state. They had previously had electronic machines too, although they were an older model with a curtain around them. I was shocked and appalled when I showed up one year and we had to vote with a pen and paper. Fine for the Amish but not for me!",
         "😂"
      ]
   },
   "1gk8j4e": {
      "title": "Ron Paul Throws His Support Behind Trump, Revels In the Collapse of the Mainstream Media",
      "text": "",
      "comments": [
         "![gif](giphy|vv41HlvfogHAY)",
         "that's a rare endorsement, Ron is pretty reserved.",
         "Ron Paul Army 08 Checking in!",
         "Ron Paul was my main introduction to politics. I've strayed slightly off from where he is on some things, but he's a big reason I hold many of the views I hold today. Fantastic person to have support from. Kind of represents that his support is far and wide. From former Dems, former never Trumpers, Libertarians, or moderates, Trump is grabbing support.",
         "Based and should’ve been president in 2008 pilled",
         "Gotta love Ron.",
         "Wild how much reddit has changed since he was everywhere here",
         "Wow",
         "![gif](giphy|L4fv5eLVk6geaVmkaO|downsized)",
         "My favourite politician ever bar none. Were that we could clone him.",
         "I wouldn’t go as far as to say that constitutes an endorsement, but it’s closer to one than I’ve ever seen him make.",
         "Love Ron Paul. Wanted him to win in '08.",
         "He is so awesome",
         "Remember when Reddit used to love Ron Paul 🤣 time to cancel him, along with Tulsi, Elon, and Joe Rogan",
         "Always loved this meme, glad to see it back lol",
         "Ron Paul as transparency Secretary?!",
         "I'm loving this, this is one helluva great endorsement!🇺🇸🇺🇸",
         "It isn't red trolley vs blue trolley this time, it's keep America vs end the first American republic with no promise of another republic anywhere in sight.",
         "We live!",
         "He got my vote back then.",
         "It really started to decline when Pao took over.",
         "The government will be so transparent it won't even be there",
         "Regime vs Anti-regime.. Managed Decline of Western Liberalism vs The Resurgent Republic... Being drafted into a nuclear WW3 vs Mean Tweets^tm",
         "I think the republic is headed to an end regardless, Trump just buys a little time to figure out the possibility of continuing it.",
         "Was bad before Pao, but it certainly got a lot worse."
      ]
   },
   "1gkd516": {
      "title": "Democrats Remind Everyone A Winner May Not Be Declared Until 110% Of The Vote Is Counted",
      "text": "",
      "comments": [
         "\"We don't cheat...you do!\"\n\n\\-Democrats",
         "That 3 AM voting bloc is so critical to them.",
         "Funny but true",
         "Even the dead ones.....",
         "Sad, but it's closer to the truth than satire.",
         "Dims will not stop until they get the desired result.",
         "Purchased a lot of suit cases.",
         "I heard she needs 700k votes in Philly to win that state. Need to give her time to find those votes",
         "Or the ones in prison"
      ]
   },
   "1gkc8ei": {
      "title": "My final prediction",
      "text": "",
      "comments": [
         "If you’re right, I owe you a beer!",
         "Only part I disagree with is Nevada. I think Trump will win Nevada. If he does win any blue wall states it’ll either be only Pennsylvania as you show here or Pennsylvania and Wisconsin.",
         "i’m sticking to 312, if NH and Virginia are too close to call, Trump will have an amazing night",
         "I don’t think it will be close. I expect Trump to win at least 6 of 7 swing states, and around 300 electoral college votes.",
         "Bold choice to predict the \"blue wall\" splitting. Has WI, MI and PA ever voted differen't from eachother in the last 50 years? Definitely haven't since 1996. They vote the same.\n\nEdit: just checked and those states haven't split their votes since the 1988 election.",
         "To be honest, I really don't think it is going to be this close. He's going to win way more than what is shown here. What you're showing is basically what the polls show, and Trump over-performs. Early voting results suggested he's over-performing more than both 2016 and 2020.\n\nAll the data indicates an incoming blowout.",
         "Wi will go red",
         "This map is very close to how I'd put it, as well.  I think it will be close, but God willing he'll pull it out in the end.",
         "Me thinks my old home of Nevada is finally going back to RED !",
         "I confidently think he takes WI as well.\n\nI also think he takes NV, that ones more up in the air though",
         "I hope you’re right!",
         "Minnesota is the only state that should be blue.\nAlso D.C., but that's not a state",
         "[My prediction is 272 (Trump) - 266 (Harris).](https://www.realclearpolling.com/my-map/6gE)\n  \nHarris takes NV, MI, & PA.\n  \nTrump takes AZ, WI, NC, & GA.",
         "Believe it or not, for the first time in a very long time, it is not a forgone conclusion that Oregon electoral votes will go the the Democrat candidate. Likely, but not definitely. Time will tell.",
         "My optimist prediction is this, but Trump also wins Nevada, Wisconsin, and Michigan. Stretch optimist prediction adds in MN, NH, and VA.",
         "You mean \n(my prediction if there is no election interference)*",
         "I went to the Supermarket this afternoon. And the Good Omen that I saw was a man of retirement age with a Maga shirt on. But... not just any Maga shirt, a shirt that said \"MAGA AF\"",
         "I don't think hes winning PA but not WI",
         "We can only hope, maybe even stick it to them good, take NV and WI as well.",
         "I really hope that you're correct!",
         "Nice conservative estimate ",
         "[deleted]",
         "WI and PA broke away from each other 3 times in 100 years or so.\n\nI don’t think this seems likely this year.",
         "Trump is going to win Nevada and that makes me happy",
         "Maybe New Hampshire as well...",
         "Yeah, I really do think he's sweeping all 7 swing states. I'd be happily surprised if VA or NH flip, but the fact that it's even a possibility bodes very poorly for Kamala.",
         "Okay fam I am going to save this comment and we'll revisit it tomorrow",
         "Based off recently polling I really doubt he’ll win Michigan. But I hope you’re right.",
         "We need it to be so clear that there is no doubt",
         "I got 310.",
         "Doesn't mean they won't.",
         "Yeah and before 2016 nobody thought any of them could go red again, and they all did. This map is entirely possible. ​",
         "I'm worried. I hope you're right. We will see, not much longer",
         "i 🙏🏻 ur on it but i do feel that way too just by observing social media stuff theres so many young poc pro trump",
         "What about 2022? We certainly didn't overperform then.",
         "I hope this holds true.",
         "I would say PA is more likely for Trump and WI is more likely for Harris.",
         "I've thought WI would be the surprise state to put him over. Which I'd prefer, since they'll most definitely get their results in before PA. \n\nHanging the election on PA is going to be a nightmare for this country. \n\nBut... the blue wall hasn't split their votes since 1988.",
         ">When will they rebalance the EC #'s per state? \n\nThey'll do that when congressional representation is reapportioned after the 2030 census. This is all in the constitution.",
         "So which way are you assuming they lean?",
         "He won't win Minnesota, and Wisconsin is questionable...",
         "*end of the week. We won't know shit till Thursday I bet. Maybe even push that to Friday.",
         "muslim vote will help MI",
         "It’s gone red plenty of times. Just saying they rarely split.",
         "More than possible, I would say LIKELY",
         "I don't even know about the \"much not longer\" part, what with all the \"it could take weeks\" bullshit outta PA.",
         "people are not motivated for midterms unfortunately",
         "I worry about that too, but Democrat turnout was *definitely* boosted by the abortion stuff. It worked for them, that's why they're still trying to act like it's an issue this election",
         "After how the Biden admin treated the states affected by Hurricane Helen I’d say they better vote for Trump. Their treatment was abysmal and after the fact I can’t believe people still willingly support Harris.",
         "I never for a million years thought Minnesota was in play, and anyone who did was probably selling something. MN isn't a swing state. The last time they voted for a Republican, Disco and Jimmy Hoffa were both still alive.\n\nWisconsin, on the other hand, looks pretty good. I don't think it's a lock, but I think there's a higher than not chance that Trump wins it.",
         "The question ends up being how reliable is the polling data? They were wrong in 2020 by a lot. Biden was up 6.7 points on Nov 5th in 2020 and only won it by .7.\n\nIf these errors continue into 2024, it will be a very good night for Trump. If pollsters have over corrected then we’re in for a Harris win possibly. Or maybe they’ve figured it out this time and they’re accurate and it’s a nail biter. \n\nNate Silver thinks pollsters are publishing old or incorrect data for example. ",
         "We'll see! If it's as big of an landslide as OP is thinking, it may be a done deal by 6 AM tomorrow",
         "If he does win Michigan then you may be right about that being the reason.",
         "True. They rarely split but 2020-2024 is different because of remote work. Pennsylvania has seen more inward migration than the other blue wall states. If they split, I think this is the year.",
         "If enough other states are called the two or three \"new normal\" states that take weeks to count won't matter. ",
         "I'm down for that.  If that's the case. Lol"
      ]
   },
   "1gkfn4s": {
      "title": "Biden will skip Harris election watch party  ",
      "text": "",
      "comments": [
         "not surprising. it's going to be passed his bed time.",
         "Those awkward moments when the campaign room starts emptying out.",
         "This is a sign that they are running scared... or they just hate each other.",
         "I like what Shapiro said: forget whether or not he hates her (which he does). If she loses, it's better for his legacy. People will say that he was the better candidate, and that his own party betrayed him. If she wins, what they did to him will come across as justified, and he'll be seen as little more than a placeholder.",
         "I remember reading an article about a Presidential candidate (was it Romney? can't recall).  On election night he rode to the venue with a 12 car motorcade and SS.  After he lost he got a drive home from his son in a Honda or something.  I hope Kamala has to catch the bus home tonight.",
         "Skip or not invited?",
         "He's probably going to be at Trump's!",
         "Well… he mad at her\n\nHe REAL mad at her\n\n“The nominee was supposed to be me!”",
         "He’ll be at Mar-a-Lago",
         "Past his bed time.",
         "More like he was told to GTFO. It's never been well hidden that Joey and Kamala hate each other.",
         "She's planning on being the 47th president whether it's for 4 years or 2 months",
         "If he didn’t like why did he even pick her as vp in the first place. Oh wait, cause he was just a puppet just like she is",
         "He’s probably in Delaware, yes?",
         "[removed]",
         "Well he does have to have his glass of warm milk at 5:30pm and be in bed by 6.",
         "frosty.  He will just have a puddin' and be put to bed by his nurse.",
         "It will be after 4pm. Of course he is skipping it.",
         "Came here for this comment lol.",
         "It will be past my bedtime and I am on the west coast.",
         "Biden is mad about being couped out of the presidency, no doubt about that lol.",
         "He hates her",
         "I remember as early as Thanksgiving 2021 when Biden started swiping at Kamala in interviews. If he didn’t like her then, he absolutely despises her now after she stabbed him in the back and was coronated as the Dem’s nominee over him.",
         "Well, imagine being stabbed in the back and told you're mind is gone. I'd be pissed too.",
         "Or both!",
         "He hates her",
         "Subway. And meets up with some Venezuelan \"voters.\"",
         "This is the real question.",
         "He is absolutely “big mad” at her.",
         "No kidding. She didn't even face a primary battle",
         "Does anyone actually like her?",
         "Until you forget about it. ",
         "Liberals do now, after they've been told to.",
         "LOL",
         "Someone in r/politics said she’s a “master class public speaker”. That shit is scary if they’re that deluded. They probably have not watched anything but short, edited snippets; But it’s crazy nonetheless.",
         "I get liberals and conservatives watch different media and have different values, but that feels certifiable",
         "“Master Class Public Speaker”??  Wow-they’re nuts!"
      ]
   },
   "1gke9lh": {
      "title": "I did my part in PA",
      "text": "Straight R down the line! ",
      "comments": [
         "Good luck with the brigade that's going to hit this post...\n\nMy post from this morning about voting in PA for Trump went from >500 upvotes to negative upvotes in the matter of an hour.",
         "Good job!  Get all your like minded friends and family to vote too.",
         "Good. Now go grab grandma and drag her ass to the polls. Call up that stoner buddy of yours who thought voting was on Friday, and drag his ass to the polls. Reconcile with your HS girlfriend, and drag her now fat ass to the polls. Let's go pal.",
         "Thank you",
         "I hit R on the two big ones in PA, but sprinkled in some libertarian votes locally.",
         "Thank you! People sometimes forget that it is essential that we have a Republican congress too.",
         "God bless! Winning your state is absolutely crucial",
         "I did too!\n\nAnd when there was a position with only a Democrat? I wrote in Donald Trump.\n\nTrump might be some meaningless local politician too!",
         "Right there with ya!",
         "Did my part I. Wisconsin",
         "Hell yeah! Just did the same! PA could very well be very red this time around",
         "Bradford county here, deep red, but did my part!",
         "My grandparents who haven’t voted their entire lives in their mid 70s asked me about voting today because they couldn’t sit by and let Kamala get the win without doing their part. \n\nLet’s turn PA red!",
         "Ugh early voting does not look good for Trump in PA",
         "I could give a sh't about fake internet points.\n\n\nWhen trump wins, I fully expect to have my account banned by the end of the week. ",
         "I've been a lifelong PA Democrat and have been open about voting for Trump.\n\nKarma doesn't mean shit to me. This site is run by a bunch of degenerates.",
         "Who gives a fuck? Oh no, muh internet popularity points!",
         "Nice job fellow Pennsylvanian!\n\nOut of curiosity, I checked my post. Mine is at 0. I don't care about internet points, but it is interesting that on this sub it would be 0.",
         "I drove my mom and my sister to the polls as well. All 6 of my immediate family members are voting to MAGA",
         "\"Go ahead, THROW YOUR VOTE AWAAAY!\" -Kang & Kodos",
         "We don't have early voting. It's all mail-in, and Republicans correctly hate mail-in voting.",
         "The upvotes are irrelevant. What is relevant is that the DNC uses this website as an astroturfing exercise and propaganda wing that silences and discourages conservatives from contributing.\n\nThis should be fought back against.",
         "It has nothing to do with the points. It's that they can try and hide information from you."
      ]
   },
   "1gk5suo": {
      "title": "Vote! Make it Too Big To Rig! ",
      "text": "",
      "comments": [
         "Stood in line over 3 hours on Sunday to vote. First time voting and even though my county is blue we saw a good amount of Trump support.",
         "I early voted; but I’m a 23 year old female from TX and I voted for Trump and Vance!! Vote people; your future depends on it!!",
         "Mailed in my ballot on Saturday, it got to the polls Monday.  Straight red all the way down.  I want the clowns out of office.",
         "Just Voted straight red down the ballot in PA.\n\nI'm a 23 year old Conservative, working out now! Let's go trump.",
         "My daughter voted for the first time today.  She and her friends from school had a registration party this summer where they all got together and got online and registered to vote.  And they are all 19-22 and are voting Trump.",
         "GET OUT AND VOTE!!!!! VOTE LIKE YOUR LIFE DEPENDS ON IT",
         "I just felt like making a red velvet cake yesterday, but my husband and daughter pointed out I picked the appropriate color. \n\nIf we pull this off, I’m going to make it a tradition!",
         "21 year old female conservative getting ready to vote, buffalo ny!",
         "I voted in SC when the polls opened at 7:00am.  A lot of people showed up early, so the line was a little longer than when I left 45 minutes later.",
         "As Hugh Hewitt used to say, \"if it's not close , they can't cheat.\"",
         "Gonna do my part in Maine!",
         "My sole concern with all the early voting is I hope the early voting is in addition to our normally strong Election Day voting. I hope our leads in places is because democrats failed to vote early and not cause we had a huge surge in early voting that might take away from our Election Day voting stronghold we usually have. \n\nI know some places we have 3000 more early votes than normal but democrats have 100k or so LESS.\n\nOne article said we have 30-60k high propensity voters left while Dems have 60-100k low propensity voters left. I hope that’s true, that helps us big time. Dems are far less likely to vote on Election Day especially in big cities",
         "VOTE! \n\nVote like our entire country depends upon it! \n\nWhy? \n\nBecause our country DOES depend upon it!",
         "Voted in person today on election day.  No better way to do it.  Glad I'm rural and with no waiting line, that would suck!",
         "And tell everyone to stay in line! Even if they call a race while you're in line, follow thru and vote anyway. In 2020 Several states called the race and people left the line and it still ended so close.",
         "Oof. Took me 10 minutes just now lol.",
         "Pre gym voting 🤝",
         "I live near Wilkes-Barre PA and Im going to vote straight red right after I get out of work at 3:30",
         "Great job! Your vote could actually determine the presidency",
         "Same",
         "Same here. Used to think Trump was evil years ago. Then I started thinking.\n\nAll red baby. 😎",
         "My 20 year old daughter and all of her friends are voting in their first presidential election today.  They are voting red down the ticket in California!",
         "Maybe the grocery store has decorative cake candles to put the number 47 on it.",
         "The Democrats greatly underestimate how much the younger generation is tired of having wokeness shoved down their throats."
      ]
   },
   "1gka0rg": {
      "title": "Voted!! MAKE AMERICA GREAT AGAIN!!!!",
      "text": "",
      "comments": [
         "lol not even two seconds after this post gets approved the Kamala campaign advisors and bots spam by inbox. \n\nHOW SAD!!!!",
         "GET OUT AND VOTE!!!!\n\nMAKE AMERICA GREAT AGAIN!!!!\n\n🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸",
         "Been reported there are issues with malfunctioning machines in PA so they are already extending voting times",
         "Is it not illegal in your states to take a picture of your ballot?  When I voted there was signs all over the place that said it was illegal to take pictures of our ballots and they told us numerous times we couldn't and that we couldn't even have a phone out or in our hands when in the voting room.",
         "the only correct answer!",
         "I have gotten 2 people already spamming my other posts in other communities with Anti Donald Trump posts... ridiculous.",
         "Only in a couple counties.",
         "I live in PA so as long as I don’t try to take pictures of other ballots and coerce other voters, I’m fine.\n\nhttps://www.fox29.com/news/ballot-selfies-can-i-take-photo-my-ballot-pennsylvania.amp",
         "Literally the only choice stopping America from turning into a one party totalitarian state…\n\nVOTE!!!! VOTE!!!! VOTE!!!!\n\nMAKE AMERICA GREAT AGAIN!!!!\n\n🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸",
         "Thank you for clarifying that the source I got that from wasn't too detailed"
      ]
   },
   "1gkgqkw": {
      "title": "18 Years Old and Proudly Voted for Donald J. Trump – A Momentous Choice for Our Future",
      "text": "This is my first time voting, and I’ve chosen to cast my vote for Donald J. Trump. As an 18-year-old, I believe this is one of the most significant decisions I’ve made, a choice that carries the weight of my hopes and dreams for America. God bless this country, and may the Father, Son and Holy Sprit guide us towards peace, joy, and prosperity. We need providence and benediction from above to help us restore a sense of normalcy, simplicity, and unity in our nation. America needs a return to common sense and grounded values, to a place where we can all feel secure, free, and heard. Let’s make this election too big to rig – a true movement of the people to Make America Sensible Again. This isn’t just about a vote; it’s about bringing back what makes our country strong, united, and great. Here’s to hoping for a brighter future, rooted in faith, common sense, and the values we hold dear.",
      "comments": [
         "Hell yeah, Youngblood!",
         "Hey a fellow Oregonian! I’m 22 and sent mine in last week 🇺🇸",
         "Made my first vote for Trump today at college, as a 19 year old. Had a smile on my face the whole time!",
         "28 year old woman and lifelong Portland native and our family cast votes for DJT/JD also!❤️🤍💙"
      ]
   },
   "1gk4v6c": {
      "title": "TODAY IS THE DAY! TIME TO SAVE AMERICA! 🇺🇸",
      "text": "",
      "comments": [
         "Get out and vote! I hear it's raining in some of the swing states. It doesn't matter. We have to have a historic turnout this year!",
         "It's been storming here all night in the greater Houston area.  I voted a week ago. I'll be praying all day.  Maybe I will gather up some food and take to my church food pantry.  Great way to celebrate Election Day!",
         "Trump, Vance, Elon, Tulsi, RFK, and Ron Paul. Or. Kamala and Liz Cheney  ***VOTE***",
         "Only other time I voted was 2016. Skipped 2020. Voting TODAY.",
         "kamala ya fired",
         "Let’s fucking go!!!",
         "Hey y’all.  Best place to track voting results? I swear in 2020 there was an interactive map on google, but I can’t find it now",
         "God save our Republic.  \n\n![gif](giphy|C1L8yq5ZEz0cg|downsized)",
         "We are going this morning. It's going to be a long day!",
         "Voted and it feels good!",
         "Today is the day America is saved",
         "Voted this morning. 30 minutes in and out. EZPZ. There is no excuse to not do it. \n\nThe turnout at my location was order of magnitudes larger than it was in 2022. Things are looking good.",
         "Get out and vote.  Sure he is ahead but he is going to have to be way ahead because there is going to be fucking boatloads of late Kamala mail ins being counted for days.",
         "Voted in PA today! 🥳",
         "Please God. We need this win! Save America and beat the media machine!",
         "Canadian here. Good luck today boys, we're 100% rooting for you.",
         "I hope we do the Trump victory dance.",
         "Why, is something happening today???",
         "People, get out and vote! I'm voting after work here in Iowa.",
         "I like no tie Trump.",
         "Me and my daughter were 10 and 11 in line this morning when the polls opened in Indiana.  maybe reddit fatigue but i’m not very confident even at lower level races.",
         "[removed]",
         "Currently standing in line.\n\nI’m in an extremely red state (AL), but I have never seen turnout like this before, and I’ve been voting since 2004. The lines are *huge*.\n\nOf course this is just one meaningless anecdote, but I’m praying this is indicative of very strong Trump enthusiasm and a potentially historic turnout.",
         "First 10 min of FL voting R+29 blowout! Keep it up!\n\nhttps://x.com/ericldaugh/status/1853773645006434327?s=46",
         "We have some scattered showers here in rural NC. I voted early, but I’m hoping the weather doesn’t discourage others from showing up! ",
         "I've seen so many posts on other subs about people planning to get so drunk/high celebrating if they win this was a refreshing alternative.",
         "No brainer of course",
         "YA FIRED",
         "I definitely remember the interactive google map in 2020. It will probably show up once polls close and results start coming in. ",
         "Pick a streamer any streamer, I'll be watching mine but I don't link them on Reddit because they've been swatted by internet kids and then told by authorities to take it to civil court instead of the police.\n\nThe *world* is in trouble if this system sticks.",
         "I have been told New York Times has a good tracker.",
         "I have the Axios one up, not sure how it compares but it looks solid enough. ",
         "270towin has an interactive map\n\nNYTimes has a map that lets you check county turnout individually",
         "I've seen you doom on a couple of posts, not having a go but just want to address your concerns constructively. \n\n\nYou say in 2020, people said Biden is senile, no one is at his rallies, but the truth is it was over for Trump as soon as Covid became a big deal. No matter who was in office, they were always going to get blamed and people wanted change for the sake of change to fix things. \n\n\nIn 2022, the economy hadn't really bottomed out and the border issues hadn't really become as mainstream yet. Also, it really came down to a handfuls of races being lost by poor candidates. Sure, Trump picked them but it's common that a Presidential candidate's appeal can't transfer over regardless of endorsement. \n\n\nTrump honestly has everything going for him this time. He's much better campaigning as the opposition then he is as the incumbent, the economy, immigration, foreign policy all on his side. \n\n\nKamala had to replace a guy who was going to lose in a landside, she's barely a better candidate and she's part of the current admin. Not even leftists wanted her to be picked. All she has is abortion, Biden had that and was still losing heavily. \n\n\nKeep the faith. ",
         "🙏😁",
         "Whoa that’s a good sign that Florida should be a massive win! \n\nI hope we see these numbers everywhere",
         "Update!!! \n\n https://x.com/ericldaugh/status/1853791861015495155?s=46 \n\n GOP turnout in FL more than D and no party affiliation combined! And at least half the NPA will be voting red.",
         "Unless it discourages more weak Kamala voters, that is!",
         "I’ve considered fireworks!",
         "been walking around the house all morning yellin this",
         "Wow! Broward country currently voting Red! Insane!\n\nhttps://x.com/ericldaugh/status/1853778450810548246?s=46\n\nFL probably going double digits",
         "i'm so happy about how much Florida's changed. It's no longer the must win battleground state that needs tons of resources to flip, it's a solid 29 electoral vote pickup. (Same with Ohio)\n\nMakes the path to 270 so much easier",
         "True, but there aren’t many of those around here. It needs to rain in Charlotte and the Triangle area 😂. ",
         "Even with the recent rain, it's too dry here.",
         "Probably because Republicans actually have jobs and want to vote before work!",
         "In this economy even the far-left have to report to work!"
      ]
   },
   "1gkfdn9": {
      "title": "I’m 19 and just voted for Trump for the first time",
      "text": "Hey guys, I am a first time voter and I’m proud to say that I voted for Trump, PLEASE PLEASE do your part, it doesn’t matter if it’s rain or shine just please go out there and show what you believe in! As a republican in a quite liberal college it’s quite difficult for me but nothing will ever stop me from holding on to my own values and beliefs, never trade a truth for a lie so VOTE ",
      "comments": [
         "Thank you!!",
         "Always be true to your beliefs",
         "Awesome, my son is 16 and is looking forward to his first vote in a couple years. You have chosen wisely!",
         "Wishing I could vote for Trump too! You got support for Nova Scotia, Canada! 🇺🇸🇨🇦",
         "I  just graduated from a very liberal college (Amherst college). Don’t let them brainwash you. Stay true to yourself! Proud of you!",
         "Great. My faith in the future of our country has been restored.",
         "I'm 27 and I voted Trump, it's not about age but about choosing what's right for the future of this country. Trump is going to get us back on track, Kamala isn't.\n\nThank you for fulfilling your civic duty!"
      ]
   },
   "1gkg8yu": {
      "title": "Voted for Biden in 2020, terrible mistake. Voted to save America and doing my part to turn Michigan red.",
      "text": "",
      "comments": [
         "Welcome to the team!",
         "I'm in SC but was in Detroit this past weekend for a funeral. I couldn't *believe* how many Trump supporters there were... on sidewalks, on corners, driving around with flags out every car window.\n\nI dunno man, I got a feeling Michigan will go red. Been to Detroit many times and never got that sort of feeling.",
         "Sameeee",
         "That's the best sticker I've seen! Ours are so boring",
         "Good for you to have come to your senses. Welcome to the fight!!",
         "It takes a big person to admit a mistake!",
         "Michigan is going red. The muslim vote is going to screw Harris bad."
      ]
   },
   "1gkgic0": {
      "title": "Nervous is good! ",
      "text": "",
      "comments": [
         "If you got to some of the other subs (sewers) you hear people talking about how terrified trump is of Kamala. How she has his number and how smooth and smart she is. My god, I can’t tell if these are bots righting this shit or real people. If it’s real people I am terrified there are people so delusional and insane walking amongst us.",
         "I think EVERYBODY who voted / will vote is nervous.",
         "I CHOOSE TO BELIEVE THIS",
         "Just wait for the after work vote from males.",
         "FORWARD BOYS, WEVE WAITED FOUR YEARS FOR THIS DAY, FINISH THE FIGHT!",
         "The incoming meltdown if things work out is almost enough to make up for these awful 4 years.\n\nAlmost.\n\nI’ll still savor it though.",
         "Hopefully! The only thing Charlie got wrong there is “smart Democrats.” \n\nKidding (but not totally kidding lol).",
         "Harris has an uphill battle to climb and nobody inside this echochamber of reddit will admit it. She likely has to win ALL of PA, MI and WI. I think she carries Wisconsin but thats it. Michigan should go Trump by 2-3%",
         "They have to be bots. I refuse to believe I walk amongst actual people like that.",
         "My \"recommended posts\" from subs I don't follow have been nothing but meltdowns about Trump and the like for a couple weeks now. I genuinely can't fathom that it isn't majority bots because there's now way that level of stupidity is that rampant.",
         "I’m like nauseous with anxiety",
         "Comment of the day and I agree!!",
         "I mean, I get it. You hate trump and need to talk up your person. I can understand that but circle jerking on how she is so smooth and eloquent is a bridge too far."
      ]
   },
   "1gkewiy": {
      "title": "Study: 100% Of Elections Are 'The Most Important Election Of Your Lifetime'",
      "text": "",
      "comments": [
         "100% of elections in which Democrats are involved are the LAST ELECTIONS of your life if you don't vote blue!",
         "Yeah, I said the Obama/McCain election was that. I said we wouldn't be able to recognize America pretty soon after electing Obama. I was right. If we don't turn this extreme leftist slide around, his election will always be seen as the tipping point that started the downfall of America.",
         "The Bee lost me for a while there but they've been spot on lately.\n\nNo matter what happens, life will go on. No point in stressing about it. All you can do is vote and once you've done that any worry should go out the window.",
         "Love the Bee, but nah. \n\nI never said that until this one. After seeing a wraponized DOJ and new regs that allow the feds to turn the military on us for political protests?\n\nNah. Never seen one like this.",
         "Same. Before I would roll my eyes. This time I am taking it seriously, because this time it is serious. Freedom of speech is on the line, your right to bear arms are on the line, your 4th amendment rights are on the line, the constitutional republic as we know it is on the line."
      ]
   },
   "1gkasmi": {
      "title": "Kamala Harris Is the Most Inauthentic Nominee in History, and the Trump Campaign Just Proved It",
      "text": "",
      "comments": [
         "OMG SHE SAID FIGHT. ACCORDING TO MSM WHEB A CANDITATE SATS FIGHT THATS ANGRY RHETORIC, RIGHT?!?!??!",
         "Boy, the lib bots are active today!!!",
         "The Trump Campaign doesn't have to prove Kamala is fake as fuck; Kamala proves it herself, every day.  \n\n#🤷‍♂️",
         "Trump campaign didn't need to do anything, if people knew that no delegates or anyone for that matter, voted her in.  The Democrats are the hypocrites, they forced out their puppet, and installed another.\n\nKind of like Obama did in Ukraine...  I wonder how many billions flowed through there to their pockets!?",
         "Of course, she acts like a robot.  She can not think for herself,  and she can only say what she's told to by the deep state. \nThis is why teleprompters are her friend. The only time she really spoke of the cuff was in the debate, and then she was acting like the trial lawyer she is, attacking the other side.",
         "If the results swing for Trump today to show a clear victory, I want to see the Kamala impersonator do a video parodying her post 2020 election congratulatory call to Biden. But instead it’s of her crying “We didn’t do it Joe! 😭 We didn’t do it!”\n\nEdit: Impersonator’s name is Estee Palti. She’s got that cackle down to a T!",
         "And yet some Americans can't see that she can't run a lemonade stand let alone a country",
         "Anyone seen The Terrifier?",
         "They didn’t have to. She proves it every time she opens her mouth.",
         "She repeated all the lies about Trump and got away with it. It was three against one.",
         "And I picture tampon Tim in the position of Walmart greeter.",
         "<Willie Brown enters the chat> Not /every/ time…",
         "*rimshot"
      ]
   },
   "1gk57dr": {
      "title": "VOTE VOTE VOTE ",
      "text": "",
      "comments": [
         "MAGA!!",
         "For a safer world, for Freedom and for Peanut !",
         "First time voter of Trump, just got done",
         "This IS our last chance, especially now that Soros purchased 200 conservative radio stations that Biden fast tracted FCC approval for. We have NO control if the election is lost and will be fed lies for generations to come!"
      ]
   },
   "1gkiieu": {
      "title": "I voted for the first time today ❤️",
      "text": "I’m 18 years old from Pennsylvania and today I voted for Donald Trump. He will ensure my generation has a strong economy and can afford to live the American dream. Trump will deport illegal immigrants and make it a safer country for me and my kids to grow up in and I won’t have to worry about fentanyl running rampant in the streets. I also don’t have to worry about my future son forcibly drafted into the army in the brink of WW3. If you support peace and want the American dream as well I urge you to go out and VOTE. Polls close at 8 here. Thank you all and God bless America ❤️",
      "comments": [
         "Congratulations.... Go vote again... Just kidding 🙄"
      ]
   },
   "1gk7q2v": {
      "title": "Turnout is going to be HISTORIC here in PA and nationwide!",
      "text": "I’m at my little podunk voting location here in Berks County, PA (I’m about 1 hour drive from Philly) and there’s usually like 4 people in here…there’s like 80 people in this place which I’ve never seen in 10 years living here. It’s the social hall of a fire station and the line wraps around the entire inner perimeter of the hall. I think this turnout may beat all records.",
      "comments": [
         "My biggest hope is that Trump has been under-represented in the polls by a percent or two. If that's the case, he's going to run away with this.\n\nSadly, it probably isn't going to be called until late this week, as the pivotal states are all claiming it will take a few days to tally everything.",
         "An overwhelming victory would be excellent, but still skeptical of any victory until it’s certain.\n\nPopular vote and down ballot are always in play regardless. Take someone with you, wait in line and vote!",
         "Good, we gotta make it too big to rig",
         "My fiance and I voted Trump in PA today ❤️🇺🇸",
         "Good. PA needs to be landslide because it is already known as the state deciding the election, and since early voting there has already shown Trump in the lead, the Harris campaign has already tried claiming that we won't know the results in PA for several days.",
         "I'm in Montco and I've heard different reports from friends. Some (like me) were in and out quick, others not so much. My one friend said she had a 50 minute wait.\n\nMy mom lives in Chester County and she said there was a decent wait down there too.",
         "I love living in a swing state knowing our vote truly matters. Let’s go PA!",
         "Solid red Trump support or is there a mix of Kamaltoes in there?",
         "Glad there's no Fat Ass Harry's there! \n\nHelp us PA, your holding our life's in your hands!",
         "I'm in a blue AF county (Dane Co, Wisconsin) and even here I saw a couple trucks with Trump flags and folks MAGA hats.\n\n###Too Big to RIG -- let's go!",
         "Don’t forget the fuckery happening in Lancaster as well (and God knows where else). Republicans really do need to win by a wide margin here",
         "Where is the early voting data saying Trump is in the lead?",
         "Trump is most definitely not in the lead in PA early voting. I did an estimate based on 2020 exit polls the other day and he was at 39% in early voting. Early voting here is only by mail-in, so very few Republicans do it.",
         "About an hour wait here in Upper Bucks. New polling location for me but other people in line said it was a bigger turnout than previous elections.",
         "This sounds like the elusive Trump vote that doesn't show up in the polling.  We'll see, but the there's been some pollsters talking about how they think they're missing something in the polling again.",
         "[Berks is 53% Trump in 2020](https://www.electionreturns.pa.gov/_ENR/General/CountyResults?countyName=Berks&ElectionID=83&ElectionType=G&IsActive=0). His Trump quotient will probably depend greatly on if he's in a city or a rural area.",
         "Rural PA is not right leaning at all\n\nEdit: /s",
         "Can you elaborate on that?",
         "Yeah we can all hope they’re underpolling Trump voters again like they did in 2016 and 2020. If so, it’s gotta be a huge Trump win.",
         "Really? Why has the election been so close there the last two times? The R votes aren’t coming from the city centers.",
         "https://lancasteronline.com/news/politics/lancaster-county-da-commissioners-link-fraudulent-voter-registrations-to-paid-canvassing-update/article_5132ce60-92dd-11ef-9ec2-d32918af4f5b.html\n\nEdit: FWIW I appreciate you asking for a source and not just going with “Trust me bro” lol. That article is just one of many btw",
         "Just have to remember, in the final polls on RCP in 2020, Georgia OVERestimated Trump, and PA and NV were spot on to the results. The other 4 swing states overestimated Biden. It isn't a uniform underestimation of Trump. Of course, the final polls in 2020 are not necessarily from the same firms that they are in 2024. PA and NV being correct would be good this time. But GA potentially becoming a loss would be a big problem.",
         "Maybe he means it's so solid red that there's no lean? I went to school in rural PA, and it was pretty much blood red.",
         "I asked because I was genuinely curious. Not for memes or any circle jerking. I'm fairly close to Lancaster.",
         "Not much to worry about at this point. Just getting out and voting if you haven’t already.",
         "Yes that's what I mean. Forgot the /s",
         "Yeah perhaps I misread. I looked at the map and all the rural counties appeared to go red in both 2016 and 2020",
         "I appreciate that- too many people just blindly agree with information that fits their narrative so I appreciate the fact check: not enough people do that",
         "I didn’t downvote you haha. I knew you must have had a reason behind what you said.",
         "Bucks County is traditionally blue.  It has gone red and they are freaking out.  They were required by a judge to have two extra days of early voting because of their BS shenanigans and now they are really upset."
      ]
   },
   "1gk9zjn": {
      "title": "Widespread voting problems reported in 2 heavily Republican Pennsylvania counties",
      "text": "",
      "comments": [
         "We need to go 100% paper ballots.",
         "Arizona is watching closely, this happens at their conservative polls all the time too. Accidentally, of course.",
         "they better fucking fix this shit I stg",
         "**The Cambria County Board of Election learned early this morning that a software malfunction in the County’s Electronic Voting System has prevented voters from scanning their ballots**",
         "Thankfully we have a new RNC chairman in Michael Whatley, they’ve been on top of any issues and keeping everyone updated. GO VOTE.",
         "The saving grace is we use paper ballots in PA, so they can be scanned once the machines are fixed.",
         "And so the steal begins.  Have you ever seen a report in the news about voting machine problems in a democratic voting district?  No?  Me either.  It's not a coincidence.  In fact it's all planned well ahead of time",
         "This is why Kamala didn’t pick Shapiro, she needed someone high up to help her cheat here",
         "Noooo you're joking.... 🙄\n\nOf course there is issues at Republican locations not at Democrat locations. \n\nHopefully Chairman Whatley is on it as I hear he did send out teams on the ground and people on the ground to report issues immediately so they can take action. \n\nWe shall see....more strong letters or wagging fingers or real hard as nails action.",
         "No need to be dooming. It’s just a scanner— these conservative poll workers can still hand count, like our ancestors did.",
         "More of a \"Malfukution\"",
         "A friend of mine is active duty military with his home of record in PA.  The mail in ballot arrived a few weeks ago and it said “unofficial ballot” on the top.   He called and asked why they told him it would be fine.   Why would they said and an unofficial ballot to an out of state service member?",
         "If airplanes have multiple failsafes, why can’t vote scanners? This is insanity that dominion keeps their bid after stuff like this happens.",
         "Suprise suprise",
         "And so it begins",
         "This is why voting early was important. The same thing happened in Arizona in 2022.",
         "Oh what a surprise! The steal begins...",
         "Typical Democrat behaviour.  It's always a problem with GOP districts.\n\nWe need paper ballots.\n\nThis is what we're up against all over the world:  Watch and share.\n\nStop Communocracy:   [https://youtu.be/n4PUhsl8jUc](https://youtu.be/n4PUhsl8jUc)",
         "These are paper ballots.  The scanner of the paper ballots isn’t working.",
         "In-person only, with mandatory voter ID.",
         "“Accidentally”\n\nI hope between the RNC’s teams and Louder With Crowder’s poll watchers, we squash all these little “accidents” across the swing states.",
         "Just like the 2020 census SNAFU “accidentally” under-counted half a dozen red states and over-counted half a dozen blue states. End result? The Dems have 7 extra electoral votes that should have been re-allocated to red states. \n\nYes, you read that correctly. Because of 2020 Census “mistakes,” if Kamala wins by less than 14 EC votes, then that would in reality be a Trump victory.\n\n(this also affected House re-apportionment, the Dems currently have a few more House districts that should have been flipped to red states)",
         "Like the Google accidents that only ever effect one side",
         "If the ballots don't get lost burnt flooded or eaten by bats. Hate to say it but methinks yer elections are rigged.",
         "Its NEVER in favor of Rs. Every damn time.",
         "[removed]",
         "Since she shafted Shapiro he should immediately have this investigated and when they find the people who \"just happened\" to cause the malfunction they should be arrested",
         "I don’t think Shapiro is going to bend over backwards to help Kamala. Dude is focused on running in 2028. Much easier to win if Kamala loses this election. Not saying he wants her to lose, just saying he’s probably not going to try too hard to help her",
         "The question is if they ballots are sitting there unscanned all day until the problem is fixed are the poll works going to scan or count them at all considering in this district the votes are going to be predominately republican",
         "It’s a feature. Not a bug.",
         "Yeah this is ultimately not a big deal, no need to blow this out of porportion.\n\nIt's all paper ballots in Pennsylvania, and the courts granted an extension in the counties impacted by the issue. All it really means is we may see a delay in the count from those counties.",
         "Unfortunately, he doesn’t want to step too outside the dem circle. there’s no doubt he’s setting himself up for a 2028 run, and if he goes against the status quo now, he’ll go the way of Biden",
         "If the district is mostly Republican, then a good chunk of the poll workers will be too. They won’t let GOP votes go uncounted in PA.",
         ">All it really means is we may see a delay in the count from those counties.\n\nYou say this like it isn't a big deal. We've had a whole week or more to vote. The count needs to be done. The longer it takes, the more opportunities for fraud and impropriety.",
         "I understand people not wanting to put their ballot in a box to be counted later once they are working given it’s another set of hands touching their vote, but lots of places don’t have you scan your own ballot.",
         "Means we will get a nice big dump of Republican votes late at night for once, nice!",
         "\"Not a big deal\"\n\nI prefer to see that my paper ballot actually gets SCANNED into the machine. If it goes into a box to be scanned later, who knows what happens to the ballots in that box. Boxes of ballots have a way of disappearing.\n\nIt IS a big deal.",
         "Yeah, do the dems can manufacture additional ballots to be scanned.",
         "I agree with you that it is a big deal.  We do this once every four years and they can't get it right.  And it just so happens to be in a Republican district.  If you, as the voter, are not going to stay there all day until it's fixed you have to wonder if the election workers will both to scan your ballot since you are in a Republican district and the odds are that you DID NOT vote for THEIR leftist candidates",
         "California does (personal scanning of paper ballots). If the most heavily populated state in the country can handle this, why can't everyone else?"
      ]
   },
   "1gkhkut": {
      "title": "Google accused of election interference after showing Americans maps of where they 'can vote for Harris' - but not Trump",
      "text": "",
      "comments": []
   },
   "1gkg2da": {
      "title": "Ron Paul rallies libertarians, gives his closing argument for why America must elect Trump",
      "text": "",
      "comments": [
         "Preach Ron, preach! \n\nHow can someone vote for Harris, an empty suit backed by a list of P Diddy party goers? Go vote for greatness, not stupidity.",
         "Did he actually make an endorsement?  I know the NH Libertarian party just endorsed Trump.",
         "The fact that he'll be advising Musk on cuts is amazing. Never thought Ron Paul would be on the 2024 ballot, makes up for 2012."
      ]
   },
   "1gkc5ql": {
      "title": "Trump 2024! 🇺🇸 Let's Go! ",
      "text": "",
      "comments": [
         "I swear, this timeline has been nothing but a Trump Fan Fiction for him"
      ]
   },
   "1gkh87z": {
      "title": "Harris Benefitted from Unprecedented Bias among Major News Broadcasters, Study Finds",
      "text": "",
      "comments": [
         "Water is wet",
         "Because they carried her water. She’s only gotten this far because the media collectively polished a turd.\n\nKamala has no substance, no personality, and is utterly helpless without a teleprompter or friendly interviewer to lean on. The media has treated her with kid gloves instead of scrutiny outside of a handful of times, like Bret Baier’s 20 minute session.",
         "This should at some point fall under the equal time rule or something. The old media were nonstop promoting her",
         "You didn't need a study to know this",
         "No duh"
      ]
   },
   "1gk6egh": {
      "title": "Elon Musk warns if Harris wins she will 'sic the DOJ' on X to shut it down",
      "text": "",
      "comments": [
         "I believe it. If they win they will really clamp down on free speech since they are realizing that alternative media threatens their control on the narrative.",
         "There will be serious persecution if Kamala wins",
         "And Rogan. Anyone that almost cost her the election or would be an issue in the future.",
         "Make the Ministry of Truth fiction again!",
         "We desperately need X, it's one of the last places free speech exists",
         "100% they have plans on doing it.",
         "He's absolutely correct.  They are vociferously  advocating censorship.\n\nThis is what we're up against:  [https://youtu.be/n4PUhsl8jUc](https://youtu.be/n4PUhsl8jUc)",
         "I expect X will be Parlered within two years.",
         "Harris has said as much, and I believe her.",
         "TRUTH!....we can already see it happening!!!...truth is NOT the truth, truth is what the media and government TELL you it is!!...anything outside of 'their' narrative is considered false information, violent and hateful.....\n\nSoros must purchased 200 conservative radio stations with the help of Biden pushing it through the FCC...free speech is no longer free :(",
         "Regardless of whether Trump wins or not, the direction of this country is clear.  It's heading towards a fascist, authoritarian regime not unlike the Socialist / Fascist party of Mussolini.  Trump will just be a bump in the road for the eventual cliff of demise for this country.  250 years is the average length of time it takes for an empire to start to crumble, and once our freedoms go, there's really no other reason to come to America outside of economic oppty, which we can all agree the American Dream is no longer available to most people.  And that will get worse when people like Elon Musk decide to go somewhere else to start their entrepreneurship.",
         "They already did!  How many investigations are ongoing by the commies?",
         "Just imagine what they are going to do to ordinary Americans.",
         "They already have by arresting people praying in public and going after parents at school board meetings.",
         "The idea that one side would actively suppress journalism/reporting they don't like, via government intervention no less, is absolutely sickening to me.\n\nI don't know how anyone could support that.\n\nEdit: To the leftists who are DM'ing me videos of Trump attacking the press and linking sources that show that he promises to block & revoke licenses from outlets who aren't kind to him, you need to find a better way to use your time. Don't you all have an election to lose?",
         "I’m pretty much getting my news from independent voices I trust these days.  Podcasts, substack, etc.  If the person is truthful and intelligent I keep coming back.  If they lie I ignore them.  Simple.  I’m never listening to mainstream media again (except occasionally to see what the current government lies/narratives are).",
         "Door to door gun confiscation. They want us unarmed and unable to defend ourselves against tyranny.",
         "They've already done it.",
         "Because they don't like what's being said so shut it down.",
         "Remind me who are the fascists?"
      ]
   },
   "1gkgopy": {
      "title": "Stay in line when voting tonight",
      "text": "",
      "comments": [
         "This needs to be pinned to the top. Hold the line!!!",
         "This is why early in person voting is so important and I don't understand why every state doesn't do it. People have lives and jobs, not everyone can afford to or is physically able to wait in line for 6-7 hours even if they wanted to."
      ]
   },
   "1gk67ty": {
      "title": "Its confirmed, Imane Khelif medical report leaked. Read and decide for yourself.",
      "text": "",
      "comments": [
         "So typical, the left bashes people who say that this was clearly a man boxing in a woman’s sport and then the “correction” comes out later and gets buried.",
         "So everyone with eyes and a brain who had serious suspicions was right. \n\nAnd everyone who refuses to acknowledge the basic truths of biology who used this person as a sort of victory lap to dunk on us for being wrong were actually making fools of themselves. \n\nThis reminds me of when i heard there was a lab basically called “the wuhan covid 19 virus creation research facility” 20 feet away from the first reported covid 19 case and i said it probably leaked from that lab and got called racist.",
         "They need to bring back chromosomal testing.  Why they stopped is beyond me.  You’re XX or XY.  I don’t want to hear about those 1 in 100 million people with some strange mutation going on.  We need to stop catering to the statistically extreme.  You know what?  If you’re one of those non xx or xy people, tough shit.  Such is life.",
         "Another 'conspiracy' proven true. We are on a roll this year.",
         "Those poor girls he beat on, so sad.",
         "Oh, that gold medal boxer.\n\nThis was a \"duh\" moment at the Olympics, but obviously not to the Olympic committee.",
         "Not surprised.",
         "The IOC sanctioned a man beating the shit out of multiple women",
         "Also note that Imane is Algerian, where it is [illegal to be trans](https://www.equaldex.com/region/algeria).",
         "JFC ",
         "The \"arc of validation\" continues to deliver....\n\n\"It's not happening\"\n\n\"Ok so it's kinda happening\"\n\n\"It's definitely happening but that's fine\"",
         "Someone do a wellness check on the lib subs. Guess that doesn't really narrow it down huh",
         "My theory is some private high school should have a group of boys compete in girls basketball and obliterate a girls team with mostly POC on it.  The left will not know what to do.",
         "\"No Shit\"  comes to mind first",
         "So what will happen with the lawsuit filed by Khelif against Musk and Rolling since they were right all along? 🤔",
         "\"OK, everyone's really busy with the election. Let's release this, it's time!\"\n\nThey know no one's going to focus on it right now.",
         "#That's a man baby",
         "From the first sentence the article is already incorrect:\n\n\"A shocking new development\"",
         "The mentally unwell will never accept this, because it goes against The Science™.",
         "Intersex accounts for a small number of people. I say leave her alone and let’s move on. This is clearly one of these cases. This is not a clear cut and dry circumstance.",
         "So an obvious situation gets proven to be true. Its in his name -I Man e!",
         "Tbh Conservative conspiracy theories are batting 1000 lately.",
         "I remember people so confidently making medical diagnoses on this person when they actually had no idea (although neither did we except based on physical appearance and rumors).",
         ">This reminds me of when i heard there was a lab basically called “the wuhan covid 19 virus creation research facility” 20 feet away from the first reported covid 19 case and i said it probably leaked from that lab and got called racist.\n\nIt's racist to think it came from a Chinese lab that was attempting highly advanced genetic manipulation techniques. It was obviously just a stroke of bad luck from those disgusting bat-eating Chinese peasants who wallow in their own filth.\n\nedit: Whoever downvoted this comment needs to recalibrate their sarcasm detector. JFC.",
         "The reason they stopped is because people went through their whole life and athletic career thinking they were women, qualified for the Olympics, and only found out they were XY when they got their medals taken away. This felt unfair to them, understandably, and the proposed fix was to expand the Olympic definition of women to include them. \n\nAnother possible solution would have been to check at an earlier stage if your Olympic hopeful is XY, so they don't get that nasty surprise on the podium. \n\nIt might not surprise you to learn that XY people who present as women are hugely overrepresented in women's athletics. So I guess they thought that excluding all the top performers would have damaged the cause.",
         "Actually I don't think so, I think they need to push ahead with this stuff, I'm cheering it on. It's radicalizing normies against the global communist agenda, and it's entirely inconsequential to me. It's exactly the kind of wedge issue the globalists themselves use against the common people, only this time its backfiring on them and we can use it against them.\n\nIt does harm female athletes themselves, but it's entirely up to them if they want to take a stand and put a stop to it or not, they could stand up and end it all tomorrow if they chose to. The rest of us shouldn't stick our necks out, just bathe in the flames of the dumpster fire.\n\nI want to see male and trans athletes dominate all womens' sports. Tennis, soccer, basketball, olympics, golf.",
         "In feel so bad for that one woman who was just besides herself during the Olympics. Imagine working your evoke life for this one brief opportunity to compete at the pinnacle of your profession only to be matched up to this monster. \n\nI’m so proud of this girls from UNLV that stood up for themselves and didn’t allow this to happen",
         "I hope women sue the Olympic committee, especially Angela Carini who took punches from Imane.",
         "Well, she's not trans, she was born that way, if this is true. You can't outlaw genetic mutations, lol.\n\n\nShould it have been allowed for her to compete? Hard to tell, it really is one of those extremely unlikely cases (again, if this report is true) that we keep hearing about in lgbt discussions.",
         "As if they’ll allow facts to stand in the way of their delusions",
         "No need. It will either get downvoted to oblivion or won’t even allowed to be posted. ",
         "Khelif is a foreigner from Africa, so I don't think he had standing anyways.\n\nEdit:  Maybe he should be worried that now everyone knows he is \"trans\" and not a female.  So he better hope his own government doesn't jail him because its illegal to be trans in his country.",
         "He is not intersex, read these words, *he has no female body parts and has XY Chromosomes.*. Its 100% cut and dry.",
         "To be fair, Helen Keller could see he was a dude from a mile away.",
         "Lol this is something Norm McDonald would've said. He's probably smiling up from hell right now and giving a big thumbs up",
         "It seems to me that they would have got tested at some point before the olympics/world championship level.",
         "> This felt unfair to them\n\nNot as unfair letting biological men beating up on biological women.",
         "Fairness to a few special cases > fairness to every actual woman trying to compete.  Makes sense.",
         "In the mean time girls and women lose out on achievements they **earned**, lose scholarships, and in some sports get physically hurt.  But you dig the idea because it’ll “wake people up”, so fuck those girls and women.  \n\nNice…",
         "I think that is a little extreme.  The problem can be nipped in the bud now.",
         "Even with this news you still call him a \"she\"?\n\nImane Khelif was born a man, with all the parts men are born with. Regardless of the genetic mutation Imane shares nearly *nothing* with a women as far as his parts, bones, and muscles are concerned.  (Bone density, muscle mass...etc)  \n\n>Well, she's not trans, she was born that way, if this is true. You can't outlaw genetic mutations, lol.\n\nImane has XY chromosomes which means he has all the important male physical properties *important for boxing*.  There is no argument here that Imane could partake in this sport even with his genetic mutations.  Its not outlawing mutations, Imane is free to compete with other dudes.\n\n>Should it have been allowed for her to compete? Hard to tell, it really is one of those extremely unlikely cases (again, if this report is true) that we keep hearing about in lgbt discussions.\n\nThe cognitive dissonance here is insane.",
         "True but you know all the dems jumped on board immediately, just makes me wonder what they have to say about all this. Probably just ignore it and pretend we’re just lying about it or something. \n\nHonestly serves him right if he gets jailed for what he did to those women. It may seem harsh but I don’t think anyone else is going to do anything about it. Those women never stood a chance and they had a right to a fair competition that was taken from them by this guy.",
         "Well, the blind \"see\" by touch and feel.  And, all you had to do is feel for a nut sack.",
         "and Stevie Wonder too",
         "You'd think, right? It's even more blatant than sending an athlete full of steroids, if you know they're testing for that",
         "It's not being nipped.",
         "> Even with this news \n\nWas this confirmed by any serious news source?\n\n> The cognitive dissonance here is insane.\n\nWhere's the dissonance? I don't like trans being pushed on kids, but at the same time we need to have compassion for people with actual issues. Also, I don't think men should be in women sports.",
         "I don't think you actually read any of the article. I agree that Khelif shouldn't have been allowed to compete whole-heartedly, but when I read the article, all I could think was, \"geez, what a miserable existence.\" I'm not sure I know anyone that wouldn't trade an Olympic gold medal for a normal *downstairs mixup*. Being raised in backwater Algeria probably didn't help identify this anomaly for what it was prior to adolescence or beyond, so you've got this person living up to adulthood believing themselves to be a woman. Two things here shouldn't have happened. Khelif never should have been allowed to compete, and the medical report shouldn't have been leaked. If the former didn't happen, the latter never would have. With the former occurring, the latter was about the only course for revelation.",
         "A mile away though?",
         "Maybe this was an issue at the time.  I don’t know how expensive genetic testing was 20 years ago, but it’s cheap now.",
         "I think it will be in the next couple of years once the novelty wears off for the virtue signalers.",
         "I read the article and agree it was probably a terrible childhood. I am sure it was not fun to go through puberty as a boy in a woman’s body. At the same time if we took a normal girl and started her on testosterone at the same time she was going through puberty the world would never let her compete by the time she reached adulthood especially if the testosterone was still being administered. We have separate male and female sports because there is a difference in how the bodies of each grow.",
         "She had very long arms."
      ]
   },
   "1gkgs42": {
      "title": "GOP is expanding its lead...",
      "text": "",
      "comments": [
         "Its almost like I have seen this before....",
         "Just did my part in PA!🇺🇸",
         "God I’m sick with anxiety",
         "NV for Trump",
         "States where we have live party voting data:\n\nAZ, NV, FL\n\nStates where Republicans are expanding on their early voting lead:\n\nAZ, NV, FL",
         "Don't trust any poll, graph, report or prediction. Make it too big.",
         "Don’t get complacent. If they say the voting machines are malfunctioning, stay in line until they work again. Do not put your paper ballot in some random box to be counted later.",
         "Morris County, NJ is reporting a 16k GOP lead!",
         "Would be very nice to get NV and would be a great sign.",
         "That guy is so annoying and clickbaity. I had to mute him on twitter.",
         "Voted in Fl on Lunch for Trump. To big to rig. US!!",
         "Voted in PA as did family and friends all for the Trumper!",
         "I cannot find ONE single data point or marker that shows Kamala can win or one that shows Republicans are not shattering the system with record turnout",
         "It’s simply irrelevant because elections are decided by independents. Also, DUH. We KNOW most election day vote is Republican in non-blue states.",
         "Me too",
         "Do we have any data to back up this confidence? Or just the say-so of some guy on Twitter?",
         "Me three",
         "Maybe that university Florida elections website that tracks it or a state.gov site. I don’t see why anyone would lie about live voting data. It’s not a poll or anything just haw many people by party have already voted.",
         "I thought for sure it’s nationally illegal to post any votes while voting is still active. It’s all just more polls at this point. Except that one New Hampshire spot that got 6 total votes and posted 10 minutes after voting opened.",
         "Not votes, voter turnout. Dems could be voting for trump and vice versa. It's not a hard metric",
         "We’ve know how many early votes were cast by party/male/female/ race ect. That’s why we know that females are outvoting males 56-44 in some states. Most states do announce those albeit some lag a few days behind and are not live. This guy is saying these 3 states have live reporting. I can’t argue for against it as I don’t know. What I do know is republicans have cast the same if not more than democrats in early voting but it’s the registered independents are going to decide this.",
         "Oh I get it. Yeah, that makes more sense."
      ]
   },
   "1gkhu2z": {
      "title": "Google Claims ‘Bug’ Causes Different Results on ‘Where to Vote for Trump’ Vs. ‘Where to Vote for Harris’",
      "text": "",
      "comments": [
         "Funny how these “errors” always favor the same side.",
         "It's a feature, not a bug.",
         "\"Bugs\" always go against Republicans. If you haven't already, GO VOTE!!!!! We cannot let the demoncrats hold the presidency for 4 more years",
         "The only platform we have been conditioned to use...and it's biased. This isn't the first time, remember when Google suppressed searches about the assassination attempt on Trump?",
         "I can think of two remedies: a company divestiture and a lawsuit. That should get rid of any “bugs.“",
         "Amazing how many times we've let google get away with these \"bugs\". Wtf dude.",
         "Thanks to Twitter community notes, we know “Harris” is a county in Texas. Results show for most county names. Same non-results show up if you google “Where to Vote for Kamala”. Or “Where to vote for Walz”. Google is a horrible company and you can bet they’re skewing search results as much as they can, but this particular report is a nothingburger.",
         "Came here to say the exact same thing.  Due to the one-sidedness of these bugs, this is intentional.",
         "They don't even try to be transparent anymore...",
         "And YouTube burying the Trump/Rogan podcast."
      ]
   },
   "1gk50zm": {
      "title": "Trump's Final Message to America: 'We Do Not Have to Live This Way'",
      "text": "",
      "comments": [
         "I’m ready.\n\nLet’s get started making America great again! \n\nMAGA 🇺🇸🇺🇸🇺🇸",
         "Last night final door knocking, a household told us, we don’t want to live 4 more years of this. Hopefully voters will show up to vote for Trump and not an accident of voting machine issue or closing polls etc",
         "MAGA",
         "Echoes of \"It's morning in America\". Good note to end a campaign on."
      ]
   },
   "1gkefar": {
      "title": "The Best Thing For America Would Be A Donald Trump Blowout",
      "text": "",
      "comments": [
         "Uncontested blowout. Decided tonight (so I don't have a heart attack).",
         "It will most likely be decided tonight regardless of if we win or lose. People say 2020 went on for weeks, which is technically true thanks to recounts in states like Georgia, but we knew who won the night of the election in 2020 when Fox called Arizona for Biden. We knew the same night in 2016, 2012, 2008, and 2004 as well.\n\nThe only truly contested election has been 2000, and even then everyone knew what the most likely outcome was and it ended up just like most people thought."
      ]
   },
   "1gkf8uz": {
      "title": "Walz tells Colbert the close election 'disappoints' him: ‘Constitution vs. not the Constitution'",
      "text": "",
      "comments": [
         "--Mods are blocking Trump and voter poll update posts.\nTried twice today. No answer, no 'live' status...just dead air. \nThis platform sux.",
         "It is definitely an election of \"Constitution\" vs \"Not the Constitution\", but not in the way Walz thinks. \n\nWalz is so dense he doesn't even realize half his public appearances involve calling for the destruction of the constitution.",
         "Ah yes. Mr. 'The Freedom of Speech does not protect hate speech and misinformation' and \"I want to ban all 'assault' weapons' cares about the Constitution. That's why he's running on packing the Supreme Court with leftist judges so they can treat it like a 'living document' and legislate from the bench.",
         "Disappoints me as well. How so many vote for that cackling mess is beyond me.",
         "Imagine saying this with a straight face after Covid.",
         "he's right. his ticket has openly criticized the first and second amendments and tried to remove opposition from the ballot. they are very clearly against the constitution.",
         "He’s damn right that it’s the constitution vs not the constitution",
         "What pro-Consitution stance is the Harris ticket defending? Their top issues are abortion (not in the Constitution) and open border (not in the Constitution).\n\nConservatives are voting to protect the First and Second Amendments, while promoting integrity in the electoral process, which has parts codified in the Consitituion as well.",
         "Tim probably thinks it would just be so much better if the general election worked like the Democrat primaries--- where the \"right\" person gets annoited by Barrack Obama.",
         "A modern day democrat claiming to care about the consitution is hilarious",
         "I try to imagine the rationale and thought process that went into thinking this clown was a good VP candidate.....and I can't.",
         "The close election disappoints him because it won't be close; it'll be a YUGE win for Trump.",
         "I agree with everything in that title lol",
         "I'm getting random errors on 2/3 of the buttons I press.",
         "How is it looking?",
         "I think Kamala knows better and either thinks her party's ideas are above the law or she doesn't care.  I think Walz truly doesn't know better.  I'm not sure which is worse, but those two combined are frightening.",
         "I think she probably wanted to pick Josh Shapiro, but he's Jewish so he would have been unpopular with all those college campus antisemites she's counting on",
         "--Scumbags. I remember 3 years ago when this sub FINALLY broke a million. Look at the growth today. Slowest growing sub on Reddit, I would bet my paycheck. \nInfuriating that no matter where we try to go, they always slither in...to ruin everything.",
         "You are correct. Shapiro would have probably been her pick if the democrat party hadn't leaned so hard into hating jews over the last year"
      ]
   },
   "1gk1643": {
      "title": "Thus ends the last MAGA rally, get out and VOTE! ",
      "text": "President Trump needs you, needs all of us. Get out and vote people. We cannot have 4 more years of this disastrous administration in office. ",
      "comments": [
         "Just turned 18, first vote",
         "In Ohio, but did my part still.",
         "Did my part to try and turn Michigan red. We cannot have 4 more years of Kamala. I know SO MANY people at work voting Trump who voted Biden its crazy. We WILL win.",
         "Voting for President Trump for the 3rd time in a few hours!",
         "I'm not even a conservative.  I am a pro-choice, atheist Libertarian.  And I am voting for Trump tomorrow.  I am voting for Trump for two reasons: 1) the Biden/Harris Administration has lorded over the ugliest bastardization and overreach of government in my lifetime 2) Trump has managed to align himself with all the people who I believe will fight against the rot and corruption in DC.  Honestly, I cannot wait to see what existential horror awaits the democrats and the old guard neocons.  I think Trump will be much more of a gentlemen about it than he should be, but I hope he does make the next four years painful for them.  ",
         "I voted early in NC for trump. Rip peanut",
         "Sucks to see five thirty eight go from Trump to very narrow Kamala win but hoping I wake up to better news tomorrow! Please vote!",
         "We really won’t have a country if we don’t vote out Kamala. The reckless border policy will continue and next time there won’t be enough citizen votes to ever oppose the machine. There is no other country left to go to. Vote!!",
         "This will be my first time voting. Getting out of work in a couple of hours, right when the polls open near me.",
         "This is the proudest vote I've ever cast.",
         "Voting tomorrow! (IL)",
         "Just voted in a deep blue state. Even so, feels great to vote for Trump/Vance.\n\nThose in states that will make a difference, please get out and vote no matter what. Even if you're in a deep blue state go vote and let's pad the general election numbers.",
         "Voting for 45 for the second time tomorrow \n\nGodspeed Mr. President",
         "He needs to win. Show up today and take our country back.",
         "I did my part and got my mother who's apolitical to register and vote for Trump.\n\n(My first time too, as i just assumed he'd win my state easily and there'd be no point but this year, i had a change of heart)",
         "Wife and I voted. 3rd time for each of us for Trump. Fuck the haters. Kamala cannot go back to the whitehouse.",
         "I’m bartending tonight , outta be fun lol",
         "Did my part and voted early, don't wait till the last minute today people! 4 years of Kamala would make Joe look like child's play; Lets turn #45 into #47!",
         "Was number 10 in line at opening for my district.",
         "Voted for Trump in MN!",
         "I proudly voted by mail weeks ago.",
         "If Harris wins we are essentially in a dictatorship. It will be Obamas 4th term. If they can get 4, there is no way they ever relinquish power and it will be 5,6,7, and so on. \n\nHarris winning would mean one of two things:   \n1. The majority of people in the US actually want this, or  \n2. Those in charge can get away with anything, and will continue to do so.",
         "Yes people we can’t do 4 more years of Harris, Vote TRUMP!!!!",
         "It will NOT be the last MAGA rally, only the last one with Trump at the top of the ticket. MAGA and American First is more than just him now. We are a unified movement. This is not the end, it is only the beginning. \n\nIf we win, we have a deep bench to continue the legacy. \n\nIf we loose, we are a loud and proud movement. Are you going to roll over and take what the deep state tries to dish out? No! I’m not, and we’re strong if we stand together. Our eyes are open, and we’re not going back to sleep. \n\nMAGA for the Future! America First for the Future!",
         "I voted this morning and took my son along and he voted, too.\n\nA Democrat was running on unopposed for sheriff here in Jackson County Missouri so I wrote my name in and voted for myself rather than vote for a Democrat.",
         "Did my part in New York State, it's a longshot but here's to hoping we put a big enough dent in the popular vote.",
         "I've flown my flag upside down ever since they took the mug shot. Hopefully that will change after today.",
         "Last Trump rally... sad. It's the end of an era, but God willing, we will still have four more years of him in office ahead. Maybe he can throw the occasional rally as president just for fun. :)\n\nI'm sure we'll have good MAGA people ready to lead for future elections, like Vance and DeSantis, but there will never be another Trump. He is something special. A once in a century kind of president.",
         "No, this is the beginning of the 4 year MAGA rally.  Go out and VOTE!",
         "Good luck to all honest agents, both sides",
         "Same bro, NC Trump vote here!",
         "I also was able to vote for the first time when I was 18. It was an amazing feeling. We were lucky!",
         "Let’s go!!! High ho silver!\n\nhttps://youtu.be/GqHNZPkl0qE?si=TIAd9dK2hibV5Wqh",
         "Really wish i could be voting in a swing state... i'm stuck in Washington feeling like my vote is pointless, and all i can do is pray that folks like you get out there and have Trump's back. Thanks for doing your part brother🫡",
         "Was driving through Michigan with family in 2016, en route to Traverse City.  Along the way, we noticed a ton of Trump signs; nary a Hillary sign.  At some point I commented, *\"Call me crazy, but looks like the polls may be wrong.\"*\n\nCouldn't make the trip this year, but the family did.  Asked dad about the signs.  He admitted, *\"Looks like 2016.\"*",
         "Dixville Notch New Hampshire 50% swing right! From 5-0 dem in 2020 to 3-3 Trump.\n\nhttps://x.com/ericldaugh/status/1853770565791687053?s=46\n\nGo go go!",
         "Just did my part too",
         "This will be the third time he has won",
         "That’s my thing. We’re different. Your atheist & im Christian. But we can share some similarities, we can be civil. I feel Harris aligned herself with Hollywood celebrities who aren’t remotely affected by inflation. Oh and a list of Diddy party attendees. I’m the same I hope trump unleashes hell on those that went after him. I’ve noticed a demeanor change with him. He seemed to be having fun. Doing things that resonate with the everyday people more.",
         "I'm sure that was a typo, but I hope you meant you're voting for Trump *today*, not tomorrow. :)",
         "So weird to see a steady Trump lead 1-2 weeks ago then many polls giving Harris a slight lead the final few days before the election. I wonder if it’s to bring momentum to the Democrats",
         "Can 538 even be trusted? I’ve been skeptical ever since ABC News bought them.",
         "Did 538 ever go for Trump? The national polling always had Harris ahead, although today is the lowest she has ever been.",
         "I mean, they went from 52-48 Trump to 51-49 Harris.\n\nThat's barely a difference.  For all intents and purposes, it's 50/50.",
         "going by 270towin at least, thankfully most of the polls are tied, a couple have Harris outright winning but others have Trump taking AZ and GA",
         "🙏🇺🇸",
         "And if the election is stolen again? What options do we have to take our country back?",
         "They never sent me my absentee and I’m too far away to drive as a college student ☹️",
         "No more Bush Cheney Romney warhawks, All republicans to embrace America First would be a dream",
         "Feels so wrong reading a Stephen King citation there.",
         "Its not pointless, vote in local elections, those are sometimes the most impactful ones.",
         "Even if you're in a deep blue or red state, your vote still matters, cause you're inching Trump ever so closer to a popular vote win",
         "Your vote still counts. Even if it just helps turn the popular vote, it makes a statement.",
         "Doesn't help when CNN, Ipsos, and Marist dump garbage polls two days before the election. Take heart - Atlas Intel and Rasmussen have been steady for weeks. Judging from Harris's campaign schedule - she is in real trouble in PA. We shall see.",
         "I think a lot of independents are breaking to Harris. I also think a lot of elderly women are like \"screw it, I want to see a woman president\"",
         "Maybe, Maybe not, they're as biased as everyone else.",
         "Wow, I just saw 1.2. Her biggest lead was around 3.7 in late Aug...post convention. I keep saying trends, people, look at the trends!",
         "That’s treason",
         "100%  I live in Texas, a red state for many years, still need to fight the local fights, all votes matter.",
         "They are. That’s how Soros managed to be so influential in American politics. By funding local DAs and board elections.",
         "Its also the right so many of our veterans and founding fathers fought for. Theres nothing more satisfying as a citizen to me than voting.",
         "If Harris wins because women who want to legalize murdering babies push her over the finish line we deserve whatever ruin God brings down on us"
      ]
   },
   "1gkiei6": {
      "title": "STAY. IN. LINE. ",
      "text": "",
      "comments": []
   },
   "1gkb7oa": {
      "title": "Former Democrat and just voted for Trump and down ballot R for the first time ever!",
      "text": "My tipping point was seeing so many former Dems - like Trump - turning and supporting him over the last few months. RFK, Tulsi, Elon, Nicole, etc. The Democrats have now become the party of the corrupt military industrial complex and never ending war machine. Trump is truly running a UNITY ticket! It’s outsiders versus the uniparty, not left versus right. I wouldn’t have voted Dem this election anyway because of how bad they’ve been over the last four years, but now I am actively pro-MAGA. LFG. 💪",
      "comments": [
         "Feels good right? Thank you for sharing your story. \n\n\nI had a similar experience what really solidified my belief that the right was the right choice quote unquote, was watching Trump speak live and then seeing the legacy media twist his words and downright outright lie about what was said. \n\n\nI could never vote for the side that actively pushes propaganda. ",
         "Thank you!",
         "Welcome to the crew.\n\nJust so we're clear, there's more to being a conservative than not wanting wars.   1A and 2A are critical.  But also less government.  Less spending (which means less social programs).  Secure border.   And other things.\n\nWars will happen, no matter who is in office.  But you're right, with a Cheney in office (or supporting an office), wars may be more likely.",
         "These are the best stories on here, very grateful for your support!"
      ]
   },
   "1gkg96t": {
      "title": "Elon Musk expected to join Trump to watch presidential results come in",
      "text": "",
      "comments": []
   },
   "1gkbyqi": {
      "title": "Cities Across the Country Are Boarding Up in Preparation for Looting, Violence, and Fiery Election Chaos",
      "text": "",
      "comments": [
         "Luckily Trump doesn't technically start his presidency till January. So all of the crime would go under Biden's term.",
         "Kind of makes me think they are prepping for a Trump victory",
         "Just think if small rural towns did this after a Trump loss? \n\nIt seems so ridiculous. Another small town neighbor would smack you upside the head and ridicule you.\n\nLike who destroys their own town?",
         "Think it'll be \"mostly peaceful\"?\n\n![gif](giphy|sEFwWG91N4RIEQklZV|downsized)",
         "I can’t wait to hear about how the Party of Love, Tolerance, and Understanding needs space to work through their feelings. Like whatever nonsense excuse was given in 2020 for BLM to ransack neighborhoods and corner stores.",
         "They already know that Trump is going to win and that Liberals will lose their fucking minds and go full thunderdome because that can't handle being wrong.",
         "Fiery but mostly peaceful! :)",
         "All in heavily Blue areas as usual...",
         "I can't wait to open my windows and smell the burning rubber from the fiery but mostly peaceful protests.",
         "They did the same thing in the mid terms",
         "Why do sports fans riot when their team ***wins?*** Because they showed up planning to riot, the game was just background music for *their own* show.\n\nWe've got people on both sides of the law who are simply planning in advance for a giant looting and destroying festival. Towns that coddle criminals get more criminals and they get bolder criminals, locals prepare for looting events the way they'd prepare for a big incoming storm.\n\nEver hear about the time cowboy town with tough cops and tough civilians got destroyed by rent-a-rioters? Me either.",
         "Who knows, this might rival the 'peaceful' protests from the George Floyd Riots.",
         "Yep and we all thought Red wave. Hopefully better results this time lol"
      ]
   },
   "1gk7rli": {
      "title": "ELECTION 2024 COVERAGE - Updates here all day 🇺🇸",
      "text": "",
      "comments": [
         "Is this a r/Conservative gameday live thread or do we have one?",
         "Praying that no pipes burst in battleground state ballot rooms 🙏",
         "Let’s go!",
         "Feeling really good about Georgia (my home state) and North Carolina. Hopefully they are a bellwether for the election. \n\nVery, very nervous about PA, MI, and WI. \n\nPennsylvania bros how are we looking??",
         "OK, this thumbnail is just gold.",
         "Go VOTE!!!!! Lets put trump back in office!",
         "If President Trump will win, don't rub it in the face of the liberals very much. Their hate (which is manufactured by the mainstream media mostly) is one of the components that will make that possible.",
         "Put on your war face!!",
         "Needs to win one of the rust belts",
         "Did they stop updating? It hasn’t changed for an hour\n\nEdit: nvm there’s a new update",
         "I need a shot of Liberal Tears Tomorrow!!",
         "It will be made later in the day. We are busy organizing that and our discord (which is surging right now in activity).",
         "That's what I'm looking for rn\n\nLooks like op took the initiative before the mods, we'll see what they do",
         "The title of my post was simply the title of the Not The Bee webpage.",
         "Following, I've also been spending a lot of time on X, watching the boots-on-the-ground videos.",
         "MODS make it official!",
         "Let’s hope that doesn’t have to be an issue",
         "I’ve got a sneaking suspicion we’re gonna sweep Idaho. 🇺🇸",
         "PA looks as solid as it did in 2016 if you’re judging just based on the margin of signs you see on lawns.  It was a solid indicator in 2016 even when polls disagreed.",
         "Jesus Christ himself instructs to be reconciled to your neighbor.",
         "Not gonna lie dawg, I don’t think I have that level of self control. \n\n\nWe’ve had people gaslight and crow to us about how great things are the past four years and how Trump was going to die in prison and the rest of us ~~deplorables~~ **garbage** aren’t far behind him.  \n\n\nIf he wins I’m going to be so insufferable to those folks.",
         "As much as I want too this is the best advice. ",
         "It’s always better to be the bigger person than a sore winner, no matter how tempting it may be after being vilified",
         "I told my liberal family I'll vouch for them when they're sent to the camps",
         "Trump will win Ohio",
         "Just want to say thanks for the effort on Discord, seeing lefties ctrl+V'ing with all their hearts made me drop out of there but in another week or so I'll see if they've gotten tired of tantruming yet. Seeing the mods out and about reminds us all that the invasive pests have not taken over.",
         "Sorry, the Seltzer poll indicates a 100% sweep for Kamala",
         "I know that's a hard thing to do. But that will be a historic possibility to tone down the division in the American society. These are very perilous times, and more division will be detrimental to America.",
         "What do the “D” and “R” mean?",
         "Botched by all the mail in ballots!"
      ]
   },
   "1gke7m7": {
      "title": "Kamala Harris Confused By Process Where She Needs To Get Votes To Be Selected",
      "text": "",
      "comments": [
         "My buddy tried justifying Harris by saying people were nominating the Biden Harris ticket. That's why she never got the actual votes.",
         "Doesn't obama just appoint her as president?",
         "She was confused about participating in a competitive election from the time she was handed the nomination on silver platter without receiving any delegates in the primaries."
      ]
   },
   "1gk7ncj": {
      "title": "Michael Cohen announces he is leaving the United States and that he’s already working on getting a foreign passport with a new name if Donald Trump gets elected President.",
      "text": "",
      "comments": [
         "Maybe they can all charter one huge airplane and leave together. Con Air.",
         "So many of these celebs and personalities said this in 2016.. but they never did. I'd be surprised to see which countries would actually accept them.",
         "Don’t let the door hit you…\n\nWhat countries even “give” away passports?",
         "Maybe his new name can be Felicia.",
         "Honestly, who cares? These people announce it as if our day to day lives will be worse without them in the country.",
         "NA NA NA NA\n\nNA NA NA NA\n\nHEY HEY\n\nGOODBYE",
         "How much nicer would this country be if every one of these yahoos followed through on their “I’m leaving the country” threats?? Conservatives don’t threaten to leave because they love their country and want to stay and save it. The petulant left threaten to leave at every turn if they don’t get their way.  “Brats” indeed.",
         "Promises, promises.",
         "And nothing will be lost.",
         "I hear Ukraine is nice this time of year.",
         "Ok cool. Have fun bud.",
         "Don't let the door hit 'ya where the good Lord spilt 'ya.",
         "![gif](giphy|dC9PJPv2YbO76QZ4zu)",
         "Don't let the door hit you where the good lord split you, nah, let it hit you.",
         "Definitely not guilty of anything odious.",
         "I'd say good riddance, but I don't really care what he does.",
         "Epstein client list coming and the rats are fleeing",
         "🙌🏼",
         "Okay. I’m sure he will.",
         "Mr Cohen heading to palestine perhaps.",
         "Have a nice trip brother! Can you pick up the ladies of the view on your way out of town?",
         "Maybe a Boeing?",
         "I do actually think this time a good few people will leave. Between Epstien and Diddy, the next Avengers movie (eww) could look a lot different.",
         "I like to use the verb \"promised\".",
         "You can buy citizenship in many countries. Also check out golden visas.",
         "Don't let the door hit you where the good Lord split you",
         "Interesting thanks!"
      ]
   },
   "1gkc7x7": {
      "title": "Trump Urges Supporters to “Stay in Line” on Election Day, Calls for High Voter Turnout",
      "text": "",
      "comments": [
         "I spent 45 minutes in line but would have spent 4.5 hours if that's what it took.  Let's save the Republic!",
         "For anyone still sitting on the fence…\n\nKamala co-owns the past term of Joe Biden we’ve been made to suffer through. She wants America to hand her a 4 year contract extension, where she’ll give us more of the same from the past 4 years, if not more heavy handed. And she wants a promotion.\n\nShe deserves neither. Punish her. Do so in numbers that give her a resounding rebuke for her God-awful governance.",
         "Whatever it takes!!! ❤️🇺🇲"
      ]
   },
   "1gkik1s": {
      "title": "Donald Trump Presses Americans to Stay in Line to Vote: ‘Do Not Let Them Move You’",
      "text": "",
      "comments": []
   }
}