{
   "1gjvs3d": {
      "title": "Joe Rogan endorses Donald Trump for President.",
      "text": "https://x.com/joerogan/status/1853614670764015762?t=xNY58kOY7eqdtmHVnN90mA&s=19\n\nSeems like Musk convinced him. Here's what he wrote:\n\n>The great and powerful @elonmusk.\nIf it wasn't for him we'd be fucked.  He makes what I think is the most compelling case for Trump you'll hear, and I agree with him every step of the way.\nFor the record, yes, that's an endorsement of Trump.\nEnjoy the podcast",
      "comments": [
         "All those clips of him saying the N word are coming back out tomorrow",
         "2024 bingo card currently on fire",
         "We are living in the wildest timeline. 8 years ago he hated Trump",
         "Trump was right. Rogan wasn’t going to support Kamala lol",
         "Reddit/MSM will surely be even more kind to Rogan from now on.\n\nWhats the over/under on how many accusations against him *come to light* in the next 24 hours?",
         "Surprised he gave him the explicit endorsement. Didn't have to do that, especially after hosting him/JD/Elon, the endorsement was implied. Joe must feel really convicted to put his reputation on the line. Good for him.",
         "Pin this mods",
         "Excellent, he finally endorses.",
         "AHAHAHAHAHAHAHAHAHAHA COME ON PEOPLE, ITS OURS TO LOSE",
         "We're gonna win. His endorsement trumps any celebrity endorsement.\n\nGo vote! Vote no matter what! Bring your friends, family, drag them to the polls!\n\nEdit: I'm receiving hateful DM's! This must be an even bigger deal to those on the left!",
         "King of bros just knighted Trump, never expected that",
         "Fuck yeah, Rogan!",
         "Wow, never saw that coming.",
         "r/politics is very upset!!!",
         "I did not expect that whatsoever but holy shit is it exciting. Get out there and vote people!!",
         "I did not expect that.  I think it is awesome, but also at the same time I enjoy a Joe Rogan who operates at a more non-partisan view.",
         "Biggest podcast in the world. It’s about time he figured it out. Love how he genuinely looks at all issues. Hoping he can embrace Christianity soon. 🙂",
         "Yeah the day before he does it. After a lot of people have voted. But better late than never?",
         "This sub is so slow . Mods should be pinning this post at the top….\n\nOur country is at stake!",
         "About time...",
         "Huge",
         "holy shit....endorsement i care about. Joe Rogan and elon musk. God bless the timeline cops.",
         "And oh boy is the hate from the left at nuclear levels.",
         "Hopefully this helps!",
         "Let's go Joe! This is huge!",
         "Let’s go!",
         "He avoided it when Trump asked for his endorsement on the podcast. I wonder what made him go public.",
         "HUGEEEEEEEEEEEE",
         "Wish he would have done it sooner but this is awesome none the less.",
         "Isn't he a bit late with this endorsement? I know election day is tomorrow but a lot of people have already been voting early. \nAlso I can only imagine how much of a meltdown the Joe Rogan sub is having.",
         "I wish he hadn't. now ,la will feel justified for skipping.",
         "This is why he waited until the day before, hahaha",
         "Lmao yup",
         "He will be a top priority to try to destroy \n\nBut then again after his covid stance he was already high on the list",
         "Joe Rogan bout to join the Team of Hitlers on MSNBC",
         "Who cares about Reddit",
         "Kathy Griffin coming out to say he inappropriately touched her on “News Radio”\n\nNah, not even the most dyed in the wool lefty will believe that!",
         "It’s honestly pretty crazy. I read a few years ago that Trump and Rogans relationship was tepid at best and now they’re homies.",
         "The interview with Vance, and the latest one with Elon pushed him over from the silent supporter into just coming right out with it. I respect the hell out of him for doing it too. He really, REALLY seemed to like JD Vance. Like, he doesn't get on with some of his comedian friends the way he did with our future VP.",
         "\"Ree who cares\"\n\nYeah, who cares about the biggest podcaster on the planet endorsing a candidate. Lol.",
         "I can’t wait to think of what they are going to smear Joe Rogan with now. The Left really is a hateful group.",
         "GOOD!!",
         "His recent episodes over the past few months have lead me to believe he's converting to Catholicism privately, honestly.",
         "Amen!",
         "I wouldn't be surprised at all if he wasn't already a Christian or at least strongly considering it.\n\nHe's been open to Jesus and Christianity a lot the last year or so, especially with how insane the Left is becoming.",
         "Most people, especially Republicans, vote on Election Day. Endorsement the day before is arguably stronger than a week out when the news cycle will have buried it after 24 hours.",
         "Brandon!",
         "This endorsement is to grab people that weren't on planning on voting at all. The timing is fine.",
         "Never underestimate importance of just sitting down and talking to person. I think that would help a lot of things these days.",
         "Thank Uncle Dana for that. And Elon. And RFK.",
         "Really? Very interesting take. I’ve listened to him since 2009 and still listen pretty regularly. What makes you think so?",
         "His stance on abortion has a long way to go.",
         "For sure 👍🏼",
         "Except that’s not really the case this election. A lot of us voted early. My county is very red and 50% of us voted early",
         "And that Austin has been getting progressively worse under the Dems",
         "It’s not about swaying people, it’s about getting them out to vote. There will be a non zero number of Rogan fans who will vote tomorrow because of this, every vote counts and we will get some because of this",
         "It's still less than half of all votes and Republicans doing well with early voting was unheard of before this year. I'm not saying it necessarily was strategic on Joe's part, but personally I think it's more impactful only hours before the majority go out and vote.",
         "75 million votes have been cast already. That's probably 50% of the vote. That's still another 75 million votes to be cast.\n\nThe timing of his endorsement is perfect. It would have gotten buried a week ago. Besides, the people voting early for Trump were going to vote for him anyway.",
         "Neither am I. He had Trump and Vance on which was great for the campaign"
      ]
   },
   "1gjw31l": {
      "title": "It’s JOEVER",
      "text": "",
      "comments": [
         "I'm sure after interviewing fetterman he decided he needed to lol.",
         "Would have been nice if it was 3 or 4 days ago!",
         "As someone who has been listening to Rogan since he was recording in his house this is a wild time. Never thought in my lifetime Rogan would endorse Donald Trump for president.",
         "Finally",
         "LET\"S FUCKING VOTE! THIS IS FOR P'NUT!",
         "oh fuck!!!",
         "Hot damn, the slogan makes a strong comeback!",
         "Bro jogan we praise you",
         "🇺🇸",
         "Will this actually sway people?!",
         "Joever and Hoever. Never been so over.",
         "Woohoo!",
         "“GET OFF YOUR ASS HARRY” VOTE!!! Our lives depend on it! 🇺🇸",
         "Fetterman is the least troublesome of Democrats IMO. He seems to have a lot of common sense and has recovered well from the stroke. \n\nI’d never vote for the guy, be he seems like an okay, genuine dude who’s willing to buck his party for what he believes in. I wish we had more transparent politicians like him.",
         "Nah probably best the night before the election tbh to drive turnout",
         "People on the fence are likely to wait til the last minute anyway",
         "I remember all the times he said he would NEVER have trump on his podcast due to the controversy. The moment i saw he had him on, i knew rogan realizes how important this election is",
         "PNut was an American Hero! 🇺🇸 He went down fighting! Tomorrow we fight for him!",
         "Not meant to sway. Meant to drive turn out.",
         "This will drive people to the polls...big dick energy. Hell yes.",
         "Yeah for sure",
         "Do you think it will?",
         "Yes, creating hype works.",
         "Republicans need men to turn out tomorrow in order to win and this puts a jolt in a respectable portion of male voters who are indifferent towards politics but would go vote for Trump if given the right push"
      ]
   },
   "1gjsezm": {
      "title": "A Hell of A Campaign ",
      "text": "",
      "comments": [
         "It's easy to forget so much craziness that happened this election cycle. But it will all be Decided Tomorrow if it was Worth it or not.",
         "Photo #9 is the most iconic photo of my lifetime.",
         "This campaign has been brilliant. If Trump doesn’t win, he literally gave everything he had. Unfortunately we live in a corrupt country with many bad actors that control the media and most of our institutions. It takes a miracle to overcome them.",
         "The present time has been incredibly mean towards Trump, but I honestly believe this campaign run is the kind of stuff that will take a good chapter in high school and college history books sometime in the future.\n\nAlso, VOTE",
         "He laid it all on the line. Now we wait",
         "It can only end in victory this has been the greatest campaign I’ve ever witnessed",
         "I truly believe this will go down as one of the greatest presidential campaigns of my lifetime. It was a wild, crazy time. Full of laughs, tears, tragedies, divine intervention, and a hell of a good time. Kind of sad it’s over. But it’s time to get him back in the White House.\n\nGood luck tomorrow, Mr. Trump. We’re all behind you.",
         "What about \"As I was saying\" ?????",
         "This man took bullets, worked at a McDonald’s, went on Joe Rogan and drove a garbage truck\n\nAll within the past 3 months\n\nOne heck of a quarter of a year for this guy\n\nHopefully it was not all for nothing",
         "It’s amazing how the DNC doesn’t learn from their faults. \n\nIt’s the night before the election. \n\nWhere are the candidates? \n\nTrump just did an interview with *Bill Belichick* on the SiriusXM NFL radio channel. \n\nEarlier he was in Raleigh, NC.\n\nThen he was in Reading, PA. \n\nLater he’ll be in Pittsburgh, PA. \n\nHe’ll end his night in Grand Rapids, MI. \n\nHarris? \n\nShe’s only in PA. \n\nAllentown. \n\nThen Philadelphia, where she’s hosting a huge concert full of celebrities. \n\n\nThis is literally the 2016 script all over again. \n\nI just doing get it. What is the DNC/Harris Campaign thinking?",
         "God bless President Trump!",
         "Trumps near miss should have been an iconic time magazine cover. Too bad every media has been infected with TDS hopefully that will change in a few hours.",
         "I hope our boy makes it back in. We need him now more than ever. \n\nI don't know if I can survive 4 years of Kamala as president. I don't know if ANYONE would.",
         "Go vote everyone!!!!\n\nGet your fat pig husband from the couch and go vote",
         "Iconic",
         "They really threw everything they could at him",
         "Trump has run the greatest campaign we will ever see in our lifetimes and perhaps all of American History! We love you Donald, thank you! 🇺🇸",
         "Vote vote vote",
         "\\#10 is still the hardest mugshot ever , change my mind",
         "It honestly baffles me that there are a sizable amount of people who will vote for Harris. It's not even close, even if you are left leaning. It feels like the only people that would vote for her are just never Trumpers who hate Trump so much they're willing to put up with a cackling maniac who has no policy lol",
         "I voted Hilary in 2016 and was so upset when she lost. Now in hindsight I'm glad she didn't win. I'm one of the Latino voters who went Republican for the first time this year.",
         "I know this has been said before, but this really is “the” election. \n\nIf Team Trump 24 can’t beat the machine, nothing can.\n\nAnxiety levels 🔋",
         "Like him or not, this man has campaigned like hell. God willing he will be #47",
         "Great photos! Gave me goosebumps.",
         "This is the most insane election cycle ever and it’s not even close.\n\nAnd now I wait for a historian to correct me.",
         "Please, God. Please 🙏 please give us Trump tomorrow. Signed, a wife, mother, and a true American 🇺🇲",
         "Great photos, we have to win this.",
         "I really hate how they were making fun of Elon for jumping and skipping. He's literally the richest man in the world, building cars, owner of Twitter, autistic and catching rockets, let him be",
         "#9 is iconic",
         "The garbage collector bit was pretty funny!",
         "I don’t know that there will ever be another candidate like him. Now let’s just all say an extra prayer tonight that tomorrow goes the right way",
         "That McDonald’s picture is just great",
         "I already have 🫡 🇺🇸 \n\nMAGA! USA! ✊️🙂",
         "🔴🇺🇸TRUMP❤️2024🇺🇸🔴",
         "Man, this has been such a long year.",
         "No matter what happens this week, we had this incredible experience with an American hero",
         "Lol shit has been so crazy I forgot about his mugshot. It's been one hell of a ride.",
         "That is a nice montage.",
         "Number 5 is a pretty important moment too.",
         "He's not only a president but he's also an entertainer.",
         "Iconic that Georgia was  very recently sued over ‘early voting’.",
         "It's been real guys.",
         "Keep in mind, this man was written off entirely. I think he wins tomorrow, and when it does, it’ll be one of the greatest comeback stories of our time. And his campaign masterfully pieced it all together.",
         "It trump doesn’t win off pic 9 I will be surprised I think the base is very motivated to vote this time around",
         "I live in Butler County PA. PPG arena is packed. I have friends there sending pics. Harris is at a small venue with a small crowd compared to Trump. My friends are reporting that it is overwhelming and a magical night at the arena. Trump is going to win!!!",
         "Think about how crazy this whole cycle has been. Everything that happened with Trump and a back door coup by the Dems. I really hope Americans see through all the BS and vote Trump.",
         "There will never be another like him. I don't even know if anyone will ever try. This is literally peak, everything after this will be a pale imitation. JD Vance is my next president, but the spectacle will be so drab compared to Donnie. Who do you think they'll run against JD Vance, if he chooses to run in 2028?",
         "Literally, what has Kamala done to make her campaign a fraction like this",
         "Bigly",
         "The demorats killed peanut. He will be avenged.",
         "Good luck! Just if we lose, let’s not go to the capital this time. But mark my words if they lose they will 100% do something similar and not a single one of them will call it an insurrection",
         "Rfk and Tulsi got me more. Tulsi and vivek, honestly was the seal. Hopefully Vivek is head of the SEC. and Tulsi head of the military honestly.",
         "I wonder if the candidates sleep at all tonight.\n\nI’d be up all night",
         "an assassination attempt alone is crazier than any other campaign.  Someone yesterday randomly mentioned the eating cats and dogs thing so so many things happened.",
         "I hope he takes both the EC and the popular vote. This must be a stomping, that way the Dems have no choice but to concede.",
         "Well I have my doubts it’ll be decided tmrw. \n\nJust praying for no 4am vote dump, broken pipes, and never ending mail in ballots that are 99% dem votes",
         "We’ll see",
         "I’ve had hope for a few months, so to me, it’s been worth it.",
         "I am surprised they didn't run that more in ads.",
         "God bless Trump and all of us in this country; bless each and every citizen no matter who they vote for and help Trump bring freedom back to the USA.",
         "To understand how corrupt democrats are realize that this image isn't anywhere to be found on the [wikipedia page for this event in history.](https://en.wikipedia.org/wiki/Attempted_assassination_of_Donald_Trump_in_Pennsylvania)",
         "What's crazy is when you zoom in you can literally see the wound to his ear, that leftists deny exists.",
         "I keep seeing people wearing shirts with that pic on it. And I live in Canada.\n\n\nLove it",
         "That photo will be in history books. And hopefully by the time it is, our country will wake up and won’t spew bullshit lies the media tells us.",
         "Agreed, it gives me chills.  I use it for my Lock Screen.",
         "It is truly up there with the “I can hear you” Bush bullhorn speech video.",
         "100%. He could not have given anymore.  I am 11 years younger and I would have been so tired after a week of it.  His stamina is amazing.  I really hope he gets some rest after tomorrow.",
         "And Kamala's entire campaign was atrocious to boot. If Trump loses, either gaslighting or corruption will prove to be too big of a factor to overcome and I'm sad to say I'll lose what's left of my faith in this country as a whole.",
         "We can pray that turnout for President Trump outpaces the \"easily coerced\" turnout for Kamala that was based upon an extremely dishonest media that was in bed with the DNC and Harris campaign. \n\nI am hoping for a replay of 2016.",
         "Everyone here is already voting. You need to call your friends in MI WI PA NH NM VA.\n\nMultiply your vote.",
         "Hard to beat 2016 but with the Butler shooting, the McDonalds ploy and the garbage truck...  \n\nI'm not hearing lots of bitching about the RNC this time either... they've already had successful lawsuits too.\n\nHe gave himself just about the best chance to win that he could. He might beat the odds again.",
         "1: The Dems aren't voting for a candidate, they're voting for a system.\n\n2: Honest persuasion is losing more and more of its importance to Dems with each cycle. It's all about the process now. (Courts, city halls, DAs etc etc etc.)",
         "But the Dems are saying “he’s tired”…… \n\nIdiots",
         "Don’t forget she picked her tim kaine too.",
         "Oh is Harris doing the Springsteen concert thing like Hillary did in 2016?  That ended well last time, let’s see if it works any better this time 😆",
         "> What is the DNC/Harris Campaign thinking?\n\nIt tells me that they are confident that whatever cheating they have in place will be sufficient. \n\nCan you imagine a US without Trump Derangement Syndrome and a fair playing field? Can you imagine if the media was bipartisan and didn't twist, obfuscate and lie? She wouldn't stand a chance.",
         "If it was a Democrat, they would have given them a Nobel Peace Prize by now.",
         "Should be time person of the year, and if it was any other person or candidate they definitely would. Maybe even a noble peace prize. But since it was Trump, they will give person of the year to Beyoncé for the awesome concert at the rally to get everyone fired up and a noble peace prize to KJP surviving nonstop attacks and persecution from the media.",
         "I’d like to become a homeowner within the next 4 years. Have you seen the housing inflation lately? It’s batshit insane and if Kamala wins I can kiss owning a home goodbye",
         "Literally WWIII\n\nShe will be taken advantage of day 1. Zero critical thinking skills or strategic capabilities. Couldn’t win tic tac toe against a pre-schooler.",
         "Would be the first Republican to win the Popular vote in 20 years",
         "I guess it didn't do well with squishy moderates in focus group tests.",
         "If it weren't for Elon, pretty much the whole modern internet would just be a woke loudspeaker.",
         "Leftists destroy everything they touch",
         "No seriously. Within minutes of it happening, like before Corey’s passing was announced, the crazies on X were claiming it was fricken ketchup. I saw ketchup and immediately thought “someone has never watched a low budget horror movie”.",
         "If I were in his position, I would have gone off into the sunset and lived out my life playing golf and fading into luxurious obscurity. It takes a great man to decide to jump into the nest of cockroaches that is politics with such an alternative.",
         "He is amazing. I saw him in Macon last night and it was clear he was tired. It was his third event that day. But he still had so much personality and spoke for over an hour. He did not shortchange us even though we were the last stop.",
         "Unfortunately, he won't get any rest either way. You can bet the left will continue their lawfare against him no matter the outcome. I fully expect him to be sentenced to jail if he wins.",
         "I hope he gets some rest too, especially as president elect.",
         "Watch he goes into cardiac arrest after this election is finally over and he gets a chance to rest. His body will be in shock.",
         "The thing that gives me hope is the economy, global instability/wars, and the border crisis. Most Americans agree that the country is headed in the wrong direction. How can they justify voting for more of the same failed policies? Stumps me.",
         "The people who pretend they're doing a get out the vote drive when they're really just shouting the same thing at the same people *in every conversation* are just adding to the tedium of it all.",
         "It's also less and less about intraparty democracy for Democrats. It's been 16 years since the last time they had a truly open-ended primary in which the powers that be didn't heavily tip the scales in favor of their chosen candidate.",
         "Literally yes, with Springsteen too. But don’t worry, Lady Gaga is there too.",
         "That's really what concerns me. Joe was very, very weak on the geopolitical stage, but kind of masked it by funneling billions to Ukraine. \n\nKamala on the other hand, has absolutely no grit or negotiation sense whatsoever. Easily taken advantage of, projects an aura of stupidity. Nevermind Putin, she'd get taken to the cleaners by EVERYONE. WWIII a genuinely likely event with her at the helm.",
         "Had no Idea its been that long thanks for pointing that out.",
         "Honestly cockroaches are more useful than the current administration at this point.  At least roaches eat the trash instead of creating it. 🪳",
         "Not to mention we are in a political sub",
         "I’m still shocked that anyone that considers themselves left of center forgave the DNC for rigging the primaries against Bernie. \n\nI know so many people that voted for Trump that said they would have voted Bernie if he was the candidate. America wanted a pivot non-establishment candidate so bad and the Dems had the guy. Yet today MSNBC writes an article asking why Trump is popular"
      ]
   },
   "1gjrpbw": {
      "title": "Georgia ",
      "text": "BREAKING: GEORGIA SUPREME COURT SAYS DEMOCRAT COUNTIES THAT OPENED OVER WEEKEND TO COLLECT BALLOTS ILLEGALLY CAN NOT COUNT THEM!\nThe Georgia Supreme Court Reversed A Fulton County Judge Who Ruled Democrat Counties Around Atlanta COULD Count Absentee Ballots They Collected From The Deep Blue Areas By Opening Select Offices After The End Of Early Voting IN CLEAR VIOLATION OF STATE LAW.\n\nhttps://assets.bwbx.io/documents/users/iqjWHBFdfxIU/rQSs57Ek6f9M/v0",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "Bout fucking time courts uphold the election laws we already have!",
         ">BREAKING: GEORGIA SUPREME COURT SAYS DEMOCRAT COUNTIES THAT OPENED OVER WEEKEND TO COLLECT BALLOTS ILLEGALLY CAN NOT COUNT THEM!\n\nI don't see that in the ruling.\n\n>Consistent with OCGA § 21-2-386, the Cobb County Board of Elections and Registration (the “Board”) ***may count only those absentee ballots received by the statutory deadline of 7:00 p.m. on Election Day, November 5, 2024.***",
         "Another win for election security!",
         "I have a feeling MAGA folks will be out in force tomorrow in Georgia.",
         "Fulton County.  Its where a lot of Zuck Bucks went in 20' to do the same exact things: Violate the rules to give Dems an advantage.   Fucking cheaters and liars.",
         "not seeing it. the order states absentee ballots received after 7pm nov 5 will not be counted. there is nothing there abouts the offices.\n\nCobb County Board of Elections and Registration (the “Board”) may count only those absentee ballots received by the statutory deadline of 7:00 p.m. on Election Day, November 5, 2024.",
         "I don't think this says what you think it says - it doesn't say anything about the votes from *this past weekend* (after the end of early voting), it only talks about absentee ballots received *after election day*. I think you have the Cobb County late absentee ballots confused with the weekend shenanigans in Fulton, Dekalb, etc.",
         "Source? \n\nAnd fuck Fulton County lol always some bullshit every election",
         "🎶 We don't get fooled again! 🎶",
         "Thank God",
         "\"Fuck election laws and security! They are racist! They are literally Hitler!\"\n\n- leftists",
         "I bet they already counted them and mixed them in with the others and \"can't identify which ones they are\"",
         "What happens when they count them anyway?",
         "So I want to put a PSA out there. North Fulton and south Fulton county are very different and the Fulton you all dislike is south Fulton where downtown Atlanta is. North Fulton is mostly suburban and includes Johns Creek, Alpharetta, Milton (3 of the richest areas in the state) and Roswell. \n\nNorth Fulton tends to go more conservative, especially Alpharetta and Johns Creek. I live in one of these 4 cities and I wish we would break off of Fulton County and go back to being Milton County like we were until the 1920s. \n\nWe do not think like the downtown/midtown/hood folks. Not at all. North Fulton consistently scores nationally among elite places for raising a family, schools, amenities, housing, food scene, etc. We are not downtown. \n\n>!obligatory I already voted down ballot R including against this dork Ashwin Ramaswami up here. I hope my vote actually counts and isn’t replaced at 3am due to a “power outage” this year…!<",
         "Source? Google isn’t pulling this info up.",
         "[deleted]",
         "source?",
         "So what happens now that the left knows how many early ballots were for Trump…",
         "Imagine voting and your vote doesn’t end up counting because of some dumbfuck volunteer screwing up procedure",
         "Lets GO!!! make sure to vote!!!",
         "But will it help the midnight watermain bursting and bags of ballots being brought in in the chaos?",
         "Ready for rPolitics to tell me how this is fascism.\n\nEdit: aww shit libs out in full force tonight",
         "Come onnnnnnn!!!!!!!",
         "So how may votes is that down the drain for them?",
         "This is HYUUUUUUUUUUUUUUUUUUUUUUUUUGE.",
         "Fool me once, shame on you. Fool me twice. Shame on me. Glad to see the GOP got the rocks out of their pants and decided to actually do something about the fraud.",
         "First time for everything. But if this ruling is challenged who knows when we'll get election results from Georgia.",
         "They've probably already commingled the ballots.",
         "Like not purging voter rolls within a certain time period of an election…?",
         "Now we have to worry about the other states in play",
         "I'm in GA and didn't vote early. I for sure will be.",
         "Waited to vote til tomorrow. 👍",
         "We already have been and I hope we take PA and/or WI too to seal the win.",
         "They should have been out in force early and in person to help get rid of things like this. The more in person votes there are, the fewer mail in ballots can be forged.",
         "If I lived in the burst pipe precinct, wild horses could not drag me out of the polling place. \n\nA pipe burst? Then I’ll get wet. Keep counting.",
         "And even this isn't the win a lot of people think it is. A Democrat leaning county is what triggered this ruling but the ruling doesn't only apply to votes from Cobb County. Republican voters have been encouraged to vote by mail this year and Democrats have been encouraged to vote in person (John Ossoff has been going on about DeJoy/the postal service for years now and Democrats no longer have faith in the postal service), all it would take is a Democrat mailman to \"lose\" a bunch from red counties. So this very well could hurt us as much or more than Democrats in the end.\n\nI know we can't have ballots showing up a week late but there needs to be a little wiggle room to prevent trickery and allow for an investigation if necessary.",
         "Possible. I snagged it from John Basham’s X post. I do not know Georgia judicial system.",
         "It's all over the top line on a Google search now.",
         "If you know how many Trump votes there are among the early ballots, you know how many Kamala ballots you need to overtake them.",
         "Thanks for the geography lesson! Good information to have.",
         ">Google isn’t pulling this info up. \n\nUse Bing, Google's AI they've started relying upon isn't nearly as good as soyjack subreddits chant it up to be.",
         "This is from John Basham on X\nhttps://assets.bwbx.io/documents/users/iqjWHBFdfxIU/rQSs57Ek6f9M/v0",
         "https://assets.bwbx.io/documents/users/iqjWHBFdfxIU/rQSs57Ek6f9M/v0",
         "https://assets.bwbx.io/documents/users/iqjWHBFdfxIU/rQSs57Ek6f9M/v0",
         "I pulled it from X. I’ll check.",
         "I think the saying is  “Fool me….you can’t get fooled again.”\n\nI don’t blame you for fucking it up, it’s a tough one.",
         "Not sure it can be.  There’s no constitutional basis to appeal a state law to the US Supreme Court.",
         "This is the same county that the court case found 315,000 invalid votes for Biden. The democrats there are professionals at Ballot Box stuffing.",
         "By the end of the month maybe.",
         "It can't be challenged.",
         "They may not have time to challenge this one.",
         "very likely what they have done...",
         "Speaking of purging voters, how many ballots were cast in the Democratic primary for the shit for brains candidate you are supporting?",
         "I voted early but because I was out of town the week of the last EV period and didn’t want to risk anything happening Tuesday where I couldn’t go. Go cast that ballot and bring a friend. Let’s not be the reason we lose here in GA.",
         "LezDoIt!",
         "Pennsylvania is a must win for Trump, what ever way Pennsylvania goes so to will the election in my opinion",
         "I think I'm more comfortable with a couple hundred (maybe a thousand max?) ballots being invalidated for being late than the opportunity to \"find\" a bunch of ballots after the election and just say \"oh, we received them late! But it's just enough for our candidate to win!\".\n\nAt some point, for the people who mail in their ballots, there just has to be accountability. You mailed it late, it arrived late, and now it won't count. Next time mail it sooner.",
         "They'd also have to know in advance how many Trump votes are cast *on election day.*\n\nWhich is why it was a \"bursting pipe\" last time around which prompted an evacuation.",
         "This doesn’t say anything about the ones collected over the weekend. Makes it seem like it’s ok because it says ballots collected by 7 pm tomorrow. ??? What am I missing?",
         "I don't think this says what you think it says - it doesn't say anything about the votes from *this past weekend* (after the end of early voting), it only talks about absentee ballots received *after election day*. I think you have the Cobb County mailing of 3K mail-in ballots confused with the weekend shenanigans in Fulton, Dekalb, etc.",
         "John Basham posted it on X along with a copy of the order.",
         "The only way would be to say it violates some constitutional right. But it doesn't. In fact allowing them to get away with it would be what violate rights as it gives special treatment to voters depending on where they live and who they are likely to vote for. And they can't say the ruling violates the legislatures rules (which was the valid electors clause argument from 2020 even though SCOTUS was too chicken to take it) because that didn't happen here.",
         "It would be challenged as a violation of the equal protection clause of the 14th Amendment, which is a guaranteed federal right. So yes, it absolutely can be appealed to the federal courts.",
         "Surely the ballots submitted will have to be counted though, don't you think? I don't know Georgia law but the people who turned them in late were told to do so.",
         "I did a little more reading and it's 3000 ballots from Cobb county. If they're received before the polls close tomorrow they'll be counted, but they won't be accepted late.",
         "He could take Wisconsin and be ok provided Az is truly red this year. But yeah , PA certainly gives us a a buffer. I don’t see Michigan happening anymore unfortunately.",
         "My point is you could mail it on time and a bad actor could sabotage it. There has to be some brief grace period to make sure people have time to check if their ballot arrived and investigate if it didn't.\n\nGovernment workers are overwhelmingly Democrats. Do you really trust some Democrat mailmen to handle hundreds if not thousands of Republican ballots?\n\nIf cheating were to occur, it would be much easier for them to \"lose\" ballots from red counties than to create fake Democrat ballots.",
         "So it looks like civil rights groups had fought for an extension in the counting of absentee ballots so that 3000+ ballots that are expected to arrive after election day could still be counted. The extension was granted, and then the Georgia Supreme Court said no and cancelled the extension. OPs post is incorrect. This is still a win for election integrity, but not like how OP is describing it. 3000+ absentee ballots won't be counted because they are expected to arrive after tomorrow.",
         "No. \"Ignorance of the law is no defense.\" If they were too late, they were too late, regardless of what corrupt election officials told them.",
         "AZ has the best early voting data of any swing state, R’s are outvoting D’s +9 in AZ so far, which is nuts",
         "I doubt Michigan goes red but you never know, especially with the voting shenanigans there",
         "That works for me, we know which party lives primarily in Fulton county and those nearby. I used to tell my kids that quote once they started driving, lol.",
         "Michigan has a lot of industrial union workers. Plus the Arab x-factor.  \nI also believe it is the least likely of the swing states to go for Trump, but I wouldn't write it off just yet.",
         "I’m not an expert just a guy with a laptop but none of the polls are going Trumps way in Michigan"
      ]
   },
   "1gjlya8": {
      "title": "I hope Trump wins.",
      "text": "Voted for him a third time yesterday. As a big middle finger to the MSM for lying about him 24/7. I'm not going to vote on the side of liars. If the media would just report facts and not add some demented spin on everything to demonize him then I'd be willing to give democrats a fair shake. But that's not what's happening. I used to think I was liberal until I joined Reddit.\n\nEdit: now I got Reddit liberals reporting me for suicide watch and going through my comments to harass me on other subreddits. I have absolutely nothing against liberals. Vote for Harris if you want, that's your right as voting for Trump is mine. If Harris wins, I'll be happy for you.",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "When the entire establishment of warhawks and career politicians come out against a candidate, that's a good indicator of exactly where your vote needs to go. Not sure where people are getting this sudden belief that politicians serve anyone but themselves.",
         "Voted for him for the first time in NJ, hopefully NJ wakes up because it's getting impossible to live here.",
         "Same! A big 🖕🏻to leftist Redditors and the left in general, another 🖕🏻to the media",
         "Don’t forget you’re helping chase Whoopi outta our country lol. Get out and VOTE ya filthy deplorables!!",
         "3rd time in one election? That’s voter fraud!…….mainstream media probably. \n\nTaking things out of context. Their MO.",
         "Voted for Trump for the first time, as a former Biden supporter. Watching this country go nothing but downhill over the last 4 years, and how Biden's policies wrecked my family and the middle class gave me a rude awakening. As an Oregonian, I've watched the far left take a beautiful state and turn it into a crime-infested drug haven with radical socialists in Portland controlling every single piece of policy. It's about time we take our country back.",
         "I just hope the polls are under predicting him again. We need to win or they will stack every state with so many illegal immigrants and give them the right to vote.",
         "MSM is nothing but lies. They lie favorably for Kamala and negatively against Trump. I literally don't even have to research anymore to see if whatever is being reported is true because it never is. Just look at the source reporting it.",
         "Anyone that called themselves center-left before ~2010 and is still a Democrat was never center-anything, they were just \"Team Blue\".\n\nI voted for Obama twice; but at some point, I just had to acknowledge that the Democrats were no longer a party of Liberals, but of Progressives. I didn't move. I just got left behind. Being a Liberal in 2024 is a solidly Conservative idea, and that's why I'm here.",
         "I hope he wins to punish the Dems for all their Covid crap, and then for lying to us about Biden's dementia for years until he became a political liability. Not a liability as a world leader, mind you, he's been that for years and still is. But as a political liability who might cost them power. That's when everything changed.",
         "Me too. I voted for him in 2016, 2020, and again in 2024.",
         "Land\nSlide",
         "Former third-party voter here. My middle finger was to the media, government, and medical industry for lying to us about COVID.",
         "Big upvote, feel the same! Voted already Trump for the 3rd time also",
         ">1,042 points (64% upvoted)\n\nLots of salty salty people lurking in this sub.",
         "Wife and I voted for him last week. Anxious about possible election frauds but hoping whatever happens is legitimate and not some bullshit. I don't see how Trump can lose and pray he doesn't.",
         "Report every single one of the RedditCares messages.  They will ban people abusing that tool.\n\n\nEven though he's not my favorite, I hope he wins too.  Kamala has a lot to answer for, especially for lying to us so long about Biden's health.  What else would she lie about?",
         "We all do. VOTE\n\nand then hope for the best.",
         "VOTE",
         "\\> Voted for him a third time yesterday.\n\nOutstanding...I see your inner (D)ifferent is bleeding through.  s/\n\nEdit...lol so many trolls...see you guys Wednesday.",
         "I mean doesnt it kinda feel like the dems handed him his 2nd term on a silver platter? I mean, we have Biden dropping out, years of messed up economy, scandals, all the stuff from the 2020 campaign coming out to be lies literal months after Biden takes office. Its almost like him getting re-elected was supposed to happen. If he doesnt get elected, then i will be shocked because how the heck after all that he still loses. He wont be able to run again, he might lose all support.",
         "[removed]",
         "I relate to this…if trump doesn’t win, the media will be justifying themeselves and keep lying about republicans",
         "You do, huh? Brave of you to post that here",
         "I can't lie, he is pissing off all the right republicans and democrats.",
         "When the establishment says “something is a threat to democracy” what they really mean is a threat to their corrupt bureaucracy",
         "Additionally, Iran and Russia put their support behind Harris. When your enemies want to see a specific party in power, you should do everything to make sure that doesn't happen.",
         "If America actually elects a president who’s only selling point is a bastardized argument in favor of abortion then we all deserve what happens next.",
         "Ayyy I also placed my voting gabagool on Trump",
         "Thank Murphy for that, partially. Was always a high cost state but it keeps getting worse. Min wage hike didn’t help..",
         "I didn't necessarily vote against Harris, but I was sure to vote against the Media machines, Reddit especially. \n\nEDIT: Oh, but when I filled in that Trump oval... I did think about Harris's stunt and nonsense during Kavanaugh.",
         "Get on with the times will ya. We are garbage now.",
         "She keeps saying she'll leave but never goes",
         "Welcome Mr. Ripe. I'm from Humboldt County and so happy to be a Texan now. You are right Oregon was a beautiful state just like California.",
         "🛝",
         "Lol.....apparently not a moment in time for obvious sarcasm.",
         "You should be in Washington State.  All the lady legislators did was run ads on abortion; I've seen ads by Maria Cantwell and Kim Schrier ad naseum this election season and its the only topic. The only thing they try to do is try to appeal to women for whom this is the only issue.  Everybody else can go to hell.  They will both almost certainly win and it just makes me ill.",
         "It's been shown and stated everywhere what the top 3 issues were that everyone is voting for and abortion was not in those top 3. I personally know a lot of women that are voting for Trump and don't care about the abortion rights. \n\nBut it's when I read all of these posts especially from the left that say the women are going to win the election this year, it's pretty damn sad just based on that alone",
         "This argument is bullshit. I don't deserve what happens next and neither do you. Neither does our families.\n\n\nIf our country elects Harris, those of us who are moral, God-fearing people just trying to make a living to support our families are going to be the people who suffer the most.",
         "\"All this from a slice of gabagool?\"",
         "Can't win em all",
         "Are you telling me that Carmen Goers WON’T join extremists to push project 2025, and put doctors in jail?? \n\n/s in case it wasn’t obvious lol",
         "Not to mention the obnoxious lying around the initiatives. I was up visiting relatives and I couldn't believe what I was seeing",
         "I noticed this when I was up there in June, some of them were gleeful while talking about the sunject.",
         "Even if they care about abortion it's not realistically on the ballot so it should have no impact on anyone's vote. This is why people make fun of women.",
         "Goers will lose, Reichert will lose.  Ferguson will be governor and Cantwell will continue on for life. My property taxes will continue spiraling upward as they pay school administrators $200-700k a year. Patty Murray, the world's dumbest senator, isn't on the ballot but she will probably continue winning re-election.  If I have a job come up in Idaho or Texas, it could mark my exit.",
         "But a lot of the libs on here are saying it does. Tons of postings on that alone",
         "We followed our daughter and family 6 months after they moved here June 2021. Left California after 64 years. My sister and brother live in Washington. Sis would love to leave, but can't leave her grandchildren. I hate to think we would still be in California if not for our daughter and retired Marine Husband.",
         "Yeah because what else can they run on? They are conditioned their whole lives that democrats are the good guys we are the bad guys. It's deep psychological conditioning so they will latch onto any excuse to rationalize it rather than change their position if they can help it. Many of them are lying about that being the real reason but they have nothing else to say because they're so obviously on the wrong side. They have to create caricatures about abortion and democracy even though when you push them on it it comes down like a house of cards. But as they say, \"you can't reason someone out of a position they didn't reason themselves into.\"",
         "I've lived in the PNW almost all of my life.  Been in the Seattle area since 2002.  There are things I love about this area and I am climitized to the weather.  But, I noticed fentanal starting to hit around 2007 and a deterioration in downtown. My wife doesn't feel safe down there and I can't blame her. With Trump, it feels like a major part of the people I know, hit a hysteria that is just unbearable and this goes for some family as well.  All they do is talk about politics without any thought that others in their orbit could view these things differently. They really do despise people who might go to church or participate in what is viewed as 'conservative' past times.   I hate to say it, but its the women more than the men who seem to be the most unbearable (but there are exceptions).  Its hard for me to listen to people justify the critical Race theory based education they are teaching in schools around here and not tell them how much I have grown to despise their mis-guided and destructive bullshit.",
         "Good points all valid. Love your \"You can't reason\" line too.",
         "Yeah it's hot here in Texas, but I'm getting used to it even though I lived my first 64 years in a county where if it got to 70 degrees we all thought we were dying. Now 70 is cool (been here almost 3 years)."
      ]
   },
   "1gjnr88": {
      "title": "Apparently Kamala has an issue with saying \"Merry Christmas\". Team Trump posted this and it has gained lots of views and likes.",
      "text": "",
      "comments": [
         "Never forget when Dems all coordinated the term \"easter worshipers\" and then got angry at people asking why.",
         "Is that a real video of Kamala?? The whole thing feels like parody, which I guess is on brand for the state of politics in this country 😅",
         "See she's very sure of herself and to the point when she's actually honest.",
         "The most emotion she’s ever shown was over killing babies and not saying Merry Christmas. Says a lot about her character!",
         "I'm no Kamala supporter, but her quote is terribly missing context.  Practically a lie the ways it's presented.  Notice how her clip is so short?  It's because she was saying that we shouldn't be wishing each other Merry Christmas in the face of kids having their immigration status pulled from them. \n\nWe can win this election and still tell the truth.",
         "Pffft… More practiced & rehearsed anger.\n\nhttps://imgflip.com/gif/987yiq",
         "NGL Kamala sounds like me seeing christmas stuff put up in the stores the day after Halloween. That is for the day after Thanksgiving and not a day earlier.",
         "[The people calling you weird](https://www.youtube.com/watch?v=VEFz2J56n7M).",
         "[removed]",
         "#Merry Christmas one and all!!!",
         "Meme magic is real!",
         "I will never understand this.\n\n\nI have no issues wishing Muslims \"happy hari raya\" even though I don't believe in Islam or it exists and I am an atheist who truly believe all religions are man made including Christianity. \n\n\nI believe every Holy book was a novel written by men in the past. \n\n\nBut what's the big deal to say \"Merry Christmas\" to those who believe in it? ",
         "Never Forget Biden deemed “Trans Awareness Day” on Easter",
         "[Full quote](https://www.youtube.com/watch?v=fk91YYJUHus\n):\n\n> \"and only when they cleared that vet did we give them DACA status and now we're talking about taking it\naway. it is morally wrong and when we all sing Happy Tunes and sing Merry Christmas and wish each other Merry Christmas these children are not going to have a Merry Christmas. how dare we speak Merry Christmas. how dare we.\"",
         "Unlike when she's talking about ballot initiatives from her own state of California like prop 36. When asked by a reporter how she voted she refrained from comment as not wanting to endorse one side.\n\nYou want to be president but you won't tell the country how you feel about a piece of legislation? What do you think you're going to do if you win?",
         "And they say Trump is Hitler, her tone and mannerisms seemingly awfully angry Nazish....",
         "Thanks. I had blissfully forgotten that.",
         "The annoying thing was the the left came out in droves saying “It was always on that day. Why do you have a problem with it now?” It’s because the one year that Easter lands on that day, which it rarely ever lands on that day, is the year they decided to make it an official day.",
         "Theeeeeere we go. I was thinking “surely I’m missing some context here.” Still think it’s a very funny edit, but makes it feel a little more “normal” from her (whatever normal means)."
      ]
   },
   "1gjnrr8": {
      "title": "New Trump ad just dropped staring Elon Musk, Tulsi Gabbard, RFK Jr., Nicole Shanahan, JD Vance and Vivek Ramaswamy.",
      "text": "",
      "comments": [
         "The ONLY one single thing I would have changed on that... Is I would have had the FIGHT FIGHT FIGHT clip. \n\nI have to be honest, NOT USING THAT ALL THE TIME has me confused. I get they don't want to encourage another try, but come on! It is ICONIC.",
         "Banger ad. We have 24 hours to decide this country's future. Don't wait, don't be lazy, don't get complacent.\n\nIt's time to push through the finish line and WIN.",
         "Man this needs to be played everywhere. No division, no hate, no name calling, just all about our country moving forward together and achieving greatness.",
         "Where is this playing? The most important thing is who sees this in the next 24 hours.",
         "Feels like the Avengers forming.",
         "I just don't see how anyone can be against this campaign. Biggest tent campaign I've ever seen. Former Democrats, former never Trumpers, classical liberals. Elon Musk was the champion of the left as the leading EV manufacturer until he had the nerve to have opinions.",
         "Not gonna lie this gives me exactly the same vibes as that final / closing ad from 2016, where I was like dang how could you not be down with that message. Time to bring it home.",
         "Thats a banger ad cant wait.",
         "What a world where democrats have to admit Donald Trump is the coalition moderate candidate.",
         "Whoever edited this deserves a raise",
         "This shit got me so hyped. What a fuckin banger!",
         "They should have been spamming this shit for the past week. Fantastic ad, really drives home the point that the MAGA message is for *everybody*.",
         "Wow. Amazing. What a line up we have, we have the best and most intelligent political leaders. I don't even look at them as politicians. They are the voices for us, and they want us to succeed and progress in life. They actually want what's best for our people and country. We haven't been able to say that abt the democratic side in a long time. Where you at Candace Ownens! She needs to be in this line up as well.",
         "Just imagine if Ron Paul got in on this too. RFK Jr put it out there.",
         "This is great. It makes me happy.",
         "Fucking goosebumps!",
         "Not gonna lie, his ticket is basically a dream team. His momentum is huge.   \n\n\nAnd I say that as someone who genuinely started off really disliking Trump.   \n\n\nHope this team wins.",
         "Damn where's the IG reel I can repost?",
         "🇺🇸❤️I’M LOVIN’ IT!!!!❤️🇺🇸🙏🏻🙏🏻🙏🏻🙏🏻",
         "It's a good ad.",
         "This is Beautiful! One of those \"Tear in my eyes\" moments",
         "A political ad has never made me tear up before. This is amazing. So optimistic.",
         "We need the link to this one. Dang, that is a kick ass ad.",
         "I wish the people that constantly hear about how evil and racist and sexist the Trump campaign is would actually pay attention to the Trump campaign.",
         "First time I watched this, I watched it muted and STILL got goosebumps. What an incredible coalition of world-changing passion, dignity, and love for this country.",
         "Did this have anything to do with the whole SNL/NBC bit?",
         "Is the last shot with them walking AI looks kinda odd. The rest of the add is spectacular!",
         "Hopefully in every single swing state on as many channels as they can get it on.",
         "That would make Kamala Thanos? That tracks considering she only gives a crap about half of humanity.",
         "But they actually assembled for Kamala /s",
         "The imagery is incredible.\n\nAnd I gotta admit… Tulsi looks really good.",
         "Got a link to that?",
         "Yeah but we have had a lot of great ads this cycle not just this one. [Check out this one](https://x.com/MAHAalliance/status/1849965434898161672) that absolutely demolishes Kamala.\n\n[This](https://www.youtube.com/watch?v=AFcrA3EeVp4) and [this](https://www.youtube.com/watch?v=Ipi5JpqkTfY) one are themed to focus more on Trump and his campaign's goals and policies. They are great as well.\n\nAnd the [JD Vance one](https://www.youtube.com/watch?v=XYDRWu0Dvj0) was also really well done.",
         "She's not impressive enough to be Thanos. Maybe tazerface",
         "Those are Diddy-affiliated Actors. Don't need them.\n\nThe people on Trump's team are the real deal. It's hard to tell without the smoke, wires, spandex, and steroids. You need to actually hear the words they use.",
         "[So cringe](https://youtu.be/TDvUe8fIuNs). Everything about their campaign is fake. They even have to bring out a fake Iron Man to contrast the real life one on our side. The differences between the two paths ahead of us could not be more stark.",
         "Be cool man. ;)",
         "And the “slogan” the actors came up with is Kamala: Down with Democracy. Fitting. It was cringy."
      ]
   },
   "1gjrp4i": {
      "title": "BREAKING: Georgia Supreme Court gives BIG victory to Republicans on election day voting",
      "text": "",
      "comments": [
         "HELL YEAH!!",
         "Generally support this, but what about the military members who didn't receive their ballots in time? That's a very republican voting bloc. Any updates on that situation?",
         "This needs to be the law of the land. All 50 states.",
         "Election DAY not WEEK.",
         "Perfect. No late ballot dumps",
         ">The Supreme Court in Georgia just ruled that no election office can extend voting to accept ballots after election day, according to Josh McKoon, chairman of the Georgia Republican Party.\n\nIn case you want to skip the clickbait and ad-gore on the site",
         "1 state out of 50…",
         "No votes after Election Day? What a joke this has become. The world is laughing at us.",
         "I'm happy for the win but its pathetic that this issue has to go to the state supreme court.  There should be a deadline that absentee ballots should be in a few days before election day so those votes and early in-person voting can be counted before election day then count the election day ballots on election day.  Forgot to send in your absentee ballot with enough time for it to arrive by the deadline?  Go vote in person then.  The rest of the country shouldn't have to wait for the results because the people who didn't bother getting their mail-in ballot in the mail on time.",
         "don’t listen to it, get out there and vote.",
         "You gotta like it",
         "Why is this even a case? It boggles my mind how people are so anti the Republican party that there has to be a court case to stop illegal ballots from being cast, and it's a partisan issue. \n\nWth is wrong with people.",
         "How do they un-count the ones that were added over the weekend.",
         "Sad when it requires a Supreme Ruling to make people follow election law.",
         "Not just for Republicans, but for Election integrity.",
         "Sone good people Stopping the steal!",
         "Fuck Fulton County. Can't wait till I move.",
         "My sentiments exactly.",
         "did you read the ruling?  the last paragraph clearly states:\n\n\"does not pertain to voters entitled to vote under the federal uniformed and overseas citizens absentee voting act\"",
         "Deployed military have an exception to ballot rules. Their votes will count when they finally receive ballots and vote.",
         "I have never seen where there ballots change the election outcome. Not enough to sway it. They get their ballots in plenty of time. Although I am sure they could make an exception for them. They just don’t want any late night dumps.",
         "I agree with the hard cutoff being a hard cutoff, but I liked voting for Trump early.",
         "Even so, Republicans have been encouraged to vote by mail more this year than ever and Democrats have backed off mail in voting (here in Georgia specifically Ossoff has been on a crusade against DeJoy/USPS and Democrats no longer have faith in the postal service). All it takes is for a Democrat mail man to \"lose\" ballots from red counties and make sure they don't arrive on time. This ruling means there will be no time for an investigation if something suspicious happens. There's a very real chance this backfires on us.",
         "Good to know. Thank you.",
         "Except this time.",
         "There was an article this morning about the federal government not providing them with enough ballots, as if this is not typical and is a unique problem this election cycle. That's what I'm talking about, not how it generally is historically, but this year in particular.",
         "99.9% of mail in ballots are fine. \n\nI like our odds of securing low-propensity voters and “un-enthused voters”, who may walk away at a long line or let their schedule make them not vote. \n\nMail in voting isn’t perfect, I hate it, but it’s a necessary tool we have to use to win.\n\nIn a perfect world there would be zero mail in voting besides military, which would be a vote on base and then counted and digitally sent or something, idk. But we could do so much better."
      ]
   },
   "1gjmift": {
      "title": "Early voting numbers scary for Harris...",
      "text": "https://www.newsweek.com/early-voting-numbers-scary-kamala-harris-republicans-gains-democrats-election-ex-obama-aide-1979791\n",
      "comments": [
         "Means nothing when the \"mail in votes\" get counted after everything else.",
         "To all the people saying it doesn’t matter because possible fraud\n\n\nShut the fuck up. I’m TIRED of the defeatism that has taken over a large sect of this party for the last 4 years. Holy fucking shit.",
         "She still has those 3 am ballot boxes to fall back to.",
         "Whats that in the corner? A water pipe?",
         "Let's make it Traumatizing. Vote Harder Dammit!",
         "If Harris isnt winning by 7ish points in swing states after mail in and early is counted then shes screwed, liberals have to dominate that aspect of voting.",
         "I believe people are more aware. Voters are documenting their voting experiences. More people are watching even if they didn't believe the questions in 2020. And we have a better RNC in place. We still need a too big to cheat turnout, but I feel we're in a better place than 2020.",
         "It's no coincidence that some states are allowing \"postmarked\" mail-in ballots to be counted DAYS after the election.  That is to ensure the \"right\" amount of fraudulent mail-in votes can be manufactured and subsequently counted.",
         "JUST GO VOTE!!!!!",
         "Maybe scary, maybe not. \n\nRepublican voters who vote Republican NEED to show up in even GREATER numbers tomorrow. \n\nDo not settle. Do not assume. Go and VOTE.",
         "I don't find any of it reassuring. If they can cheat and get away with it, they will.",
         "A legacy media company publishing a potentially-fear-mongering story right before Election Day about Harris being down. This is exactly the sort of thing designed to drive up turnout on The Left. I don't see this story as a positive development for Trump at all. It's all part of the game. Vote Trump.",
         "Don't care, go vote.",
         "There is a reason they flooded us with illegal immigrants. There will be potentially millions of votes from people not legally allowed to vote. This is one of those things that should be stated by every single republican, every single time they speak.\n\nThere is only 1 reason they flooded the border and only 1 reason the left constantly works to underminine the credibility of the voting process by fighting any type of ID or verification process. There is only ONE reason, period. We all know what it is.",
         "Hopefully her political career will end in the same way that it began....by blowing it.",
         "still, vote!",
         "Don’t let your foot off the gas…vote!",
         "We don't have covid this time around so there is more in person voting this time around. A heck of alot of early voting. In many cases half of all registered voters have already voted. I would say more then mail ballots.",
         "Keep voting!!!",
         "I have a feeling there’s is going to be a lot of fraud going on for mail in voting ballots like if Harris is losing in the evening then somehow votes just will be lost over night. Wish there was a system that certifies that your vote is counted officially for the party selected.",
         "There are already reported \"power outages\" at local polling places around the Los Angeles area.''\n\nLets see if they will have any more water pipes bursting and blackouts and other delays which will hamper in person voting.\n\nThen we'll have to sit it out and see Trump lead all the way into 2am and then by 6am every swing state will have late counts that miraculously will be 100% Kamala and just by enough to win it.\n\nAt this point, I really don't think the libs care about how blatant they are with how they do it as long as they win.",
         "Well done slytherin well done slytherin HOWEVER\n\nthere are some last minute votes that we need to add.",
         "Exactly.  The \"doctoring\" comes in at the end, not the beginning.  \n\nHarris will be behind all night tomorrow night, and then we'll wake up on Wednesday morning to her victory thanks to a 2 AM \"rally\" with the mail-in count.  Like clockwork.",
         "At least not in Georgia, thanks to the GA supreme court ruling today.",
         "Yup, only chance is for the margin between Republicans and Democrats to be too large for them to be able to cheat their way out of.",
         "Republicans are also preforming very well in mail in ballot requests and returns.",
         "How come late night ballots and “mail in votes” are ALWAYS for Democrats? I never hear about Republicans all of a sudden finding 100,000 extra ballots in the back of an alley or UPS truck.",
         "Why are we thinking like this? If the election is surely going to be stolen, like last time, then it's not worth it to even fight for victory.",
         "Especially when then they're all for Kamala and no one else, just like that happened with Biden last election. I mean, at least make it look believable if you're going to cheat.",
         "Means nothing when all the left will do is magically find all the fake manufactured ballots that coincidentally are JUST the numbers needed to win the electoral votes of that state.",
         "Watch for the 3am bump",
         "While I understand your sentiment, it's pretty damn hard not to be at least a little defeatist when we saw what happened 4 years ago and the brazen corruption has only expanded since then. At this point we're basically hoping for a win so fucking massive no amount of cheating will compensate for it. Because we all know there will absolutely be cheating. It's just a question of whether or not it will be enough to matter",
         "Yep.  The patented \"go to bed behind, wake up a winner\" democrat strategy.",
         "and 2 more weeks of trucks full of ballots after the election!",
         "the toilets have had enough time to get leaky again",
         "*EvAcUaTe*",
         "Firstly, I don't like cheating whatsoever. BUT.... I think the right should have some \"mail in ballots\" of their own. Like oh, the democrats just found 100,000 votes that are all for them, then the Republicans can then say, what a coincidence, we just found 175,000 votes all for our side. Let it keep going back and forth until it is so comical that everyone has to admit shenanigans.",
         "I sincerely hope you're wrong,  but you are likely right.",
         "They can cheat if you sit around, complain, don't call the people you know in swing states and make sure they get to the polls.\n\nNo dooming and no pre-celebrating.",
         "SaViNg dEmOcRaCy",
         "Especially with the *tight races* and knowing ahead of time the polls aren't in their favor.",
         "The big story I saw yesterday was her being up in Iowa.",
         "Damn I never made the connection that Dumbledore was a democrat lol.",
         "Or because six million Kamala votes suddenly appeared in Georgia two weeks after the election.",
         "Need to be vigilant, they made it harder by tightening restrictions again in some ways. Let’s see if it holds.",
         ">we'll wake up Wednesday morning \n\nYou can sleep?",
         "yup",
         "No doubt. It’s the playbook.    \n\nRemindMe! 40 hours",
         "Yep ",
         "The biggest security I feel about this is that total percentage of registered voters is high enough right now that I suspect that might have a high enough turn out that that sort of thing would be a huge red flag. If there are going to be shenanigans, extremely high voter turnout actually makes it hard to cheat because if you have more votes than registered voters, that’s a dead give away that someone cheated.",
         "I can't believe it took this long to do that.",
         "because resistance is never futile \"The only thing necessary for the triumph of evil is for good men to do nothing,",
         "Im not saying its going to be stolen. Im just saying I am not celebrating anything until he is actually sworn into office.",
         "Welcome to reddit",
         "Make it too big to rig. Go vote.",
         "Yeah this: “they’re going to steal the election, let’s vote harder!” Makes genuinely no sense in the slightest",
         "Stop with this nonsense until after the election. You do nothing but persuade people to stay home.",
         "AND - we now know what happens to conservatives who question election integrity.",
         "Whatever dude",
         "Just remember positive thoughts provide positive outcomes.",
         "2020 was the breaking point for me when it comes to the deep state.",
         "In which 80% of them are D votes.",
         "And the pipes get their turn to break as well",
         "That only works in a society or system where both sides are treated equally. In theory yes you can keep 1-upping the other side til everyone sees the absurdity but just about every institution that is \"trusted\" will take the left's side and hand wave their own shenanigans while hyper focusing on any perceived mischief from the right.",
         "Yep, you have to play by the rules of your enemy if you want to win.",
         "I want them to keep doing it until there are more votes than US citizens.",
         "Explains a lot now that you mention it",
         "Well, yeah. Eventually, you got to. Not even Artie, the Strongest Man in the World, could stay wake all night.",
         "That's right! I live in California. And the expectation of Adam Shithead becoming the next senator is exceedingly high, but I still voted for Garvey because I'm going to fight! Fight! Fight!",
         "Life between tomorrow and Jan 20th is going to be extremely tense for sure.",
         "I see you would lay down and just let the Borg assimilate you",
         "If my comment persuaded people to stay home, then they need to rub their brain cells together better in order to form some synapses.",
         "he’s right, we’re fighting but it’s hard not to be upset that the democratic republic our forefathers fought for is being stolen.",
         "80%?  Remember Michigan's drop at 1:30am which 100% were all Biden votes?  Nothing fishy about that.",
         "You are absolutely right. The double standard is their only standard.",
         "Then what's the point, if the defeat is inevitable why fight at all.",
         "My question is, WHO decides who is treated in a specific way? Aren’t there AT LEAST as many Republicans as there are democrats? My point is this only works for the Dems because republicans allow it. Democrats have been openly cheating for decades. Why isn’t anyone calling BS already?",
         "If you knew the election was rigged, why would you ever vote? Does it make you feel like you’re a part of the resistance? I loved that scene when Luke voted palpatine out of office by reaching a certain threshold that meant he couldn’t cheat",
         "Oh I didn't remember that, only the 80% from maricopa and fulton county...\nYeah statistically impossible but hey nothing to worry abt.",
         "I believe that was Wisconsin.",
         "Like 90% of the federal government bureaucrats are Democrats. Look at the voting patterns of DC and nearby areas.\n\nSo no, there aren’t as many Republicans in the federal government."
      ]
   },
   "1gjp29q": {
      "title": "Republicans take lead in swing-state early voting",
      "text": "",
      "comments": [
         "Until it says Trump wins, keep up the voting.",
         "Doesn’t matter, go VOTE",
         "The margin matters! We need to send a loud and clear message that Marxism has no place in America! Tomorrow they will hear from ALL of us! The cavalry is coming 🇺🇸🇺🇸🇺🇸",
         "Blow them away, keep voting!",
         "The Republicans are entering[ election day ](https://www.telegraph.co.uk/us/politics/2024/11/04/election-donald-trump-kamala-harris-live-updates/)with a historic lead in a majority of states, figures show.\n\nThis is the first time that registered Republicans have outvoted registered Democrats in more states since at least 2008, with early voting traditionally favoured by Democrats.\n\nAcross two-thirds of states that produce early voting data by party, registered Republicans outperformed the Democrats in votes cast.\n\nDespite the high numbers, nationally more votes have been cast for the Democrats because [some states have much bigger populations than others.](https://www.telegraph.co.uk/us/politics/2024/11/04/how-us-electoral-college-works-why-created/)\n\nCrucially, early voting among Republicans is higher in Nevada and North Carolina, two[ key swing states](https://www.telegraph.co.uk/us/politics/2024/11/01/what-is-swing-state-key-battlegrounds-us-election/) that will determine the election.\n\nThey have also overtaken Democrats in Iowa and Florida, two states that historically tend to lean Republican, but more recently went blue.\n\nArizona, another key state, was Republican before the 2016 election. In 2020, this lead went to the Democrats. However, this year Republicans lead once again with a margin of 41 per cent to 33 per cent.\n\nAcross all states, around 36 per cent of [votes cast before election day ](https://www.telegraph.co.uk/us/politics/2024/11/03/us-presidential-election-2024-when-dates-candidates-voting/)have come from registered Republicans, compared to the Democrats’ 37.9 per cent.\n\nThis is the slimmest national gap on record between the two parties and a reflection of changing views on early voting which, historically, has favoured the Democrats.\n\nIn 2020, just 30.5 per cent of early votes were made by registered Republicans.\n\nAs many politicians were encouraging early voting due to the coronavirus pandemic, Donald Trump repeatedly raised [suspicions about the practice.](https://www.telegraph.co.uk/us/politics/2024/10/31/polling-chaos-risk-undermining-us-election/)\n\nIn a series of tweets and conversations in September that year, he suggested that foreign countries could easily produce “counterfeit ballots”.\n\nHe stated that the ballots were “uncontrollable, totally open to election interference by foreign countries, and will lead to massive chaos and confusions”.\n\nBut this year, the Republican party has encouraged members to adopt early voting. This has led to a surge in Republicans voting which, in turn, has pushed early votes to historic highs.\n\nAs of Monday evening, 78,185,854 early votes had been cast, equivalent to 49.4 per cent of the 2020 electoral turnout.\n\nThis is almost two-thirds higher than in 2016, when around one in three votes were cast before the election.\n\n**Read more from The Telegraph:** [https://www.telegraph.co.uk/us/politics/2024/11/04/republicans-take-lead-in-swing-state-early-voting/](https://www.telegraph.co.uk/us/politics/2024/11/04/republicans-take-lead-in-swing-state-early-voting/)",
         "1 - The race isn't as close as they want you to believe. 2 - There are psyops of all kinds going on right now including those being run by democrats and republicans. 3 - if everyone expected to vote tomorrow, votes, we will save our country and will have Trump along with a republican house and senate majority.\n\nThe bottom line is, just vote. Seriously. Whether you live in Alabama, Iowa, Pennslyvania, or California, vote.\n\nWe want and need to run up the score to get a Republican government, as well as make sure the message is sent to the right people you can't just install a terrible puppet candidate and win power.",
         "GO VOTE!!",
         ">*Despite the high numbers, more votes have been cast for the Democrats nationally because some states have much bigger populations than others.*\n\nI assume these are the pro-abort women in California who have no idea what Roe v Wade is.",
         "This is why these states are allowing 3 days of counting mail in ballots. To combat this with the same Biden playbook.",
         "Having the early voting lead is like having a 1st quarter lead. \n\n  \nDoesn't hurt to have, but the game isn't over yet. Gotta keep going. If you haven't voted yet, make sure to vote tomorrow!",
         "Cool, go vote. Don’t let early voting records or doing well in polls make you complacent.",
         "The Pennsylvania portion of this is not promising so don't take it for granted. Get your friends and family to vote tomorrow if they haven't.",
         "My worry is the pull ahead effect. Pulling ahead day of voters and not really seeing a bump, just shifting the same voters a few day earlier ",
         "I fear the high early turnout will end up leading to crazy statistics that make the results questionable. We will see but eventually we will have more voters than people",
         "I wanna be optimistic about this but also am worried tbat this could be mean less republicans going on ED than we are typically used to seeing",
         "Libs keep saying it's doesn't matter because a lot of republicans are voting for Harris - this is biggest load of shyte I keep hearing this election cycle.\n\n  \nDoes anyone think this will hurt our voting day turnout?",
         "Voted last week here in Nevada! Time to tell this administration “You’re Fired”",
         "Until it says Trump wins, keep voting....they dont check IDs...... (yes, I'm kidding - don't do that!)",
         "It’s not over until the Berkley Marxists are screaming at the sky!",
         "THIS!",
         "Amen!!! keep voting",
         "Thank you for reminding me. I would have forgotten if I hadn’t seen this same exact comment for the billionth time…",
         "👆 This",
         "Stop dooming. The margin for fraud will be so much lower this time because of circumstances. We can swamp it. Get out and vote.",
         "I'm praying the mail-in ballots are much closer than 2020 and if election day turn out is higher for Republicans like usual than Trump will win this.  I think the Republican observers will be watching the vote count like eagle hawks and there are no Covid excuses for kicking them out like in 2020.",
         "Vote early, vote often is the Dems catchphrase. lol",
         "That's good, I'm glad you've seen it so many times. I'll probably say it ten more times across my socials / friend groups / etc. before polls close tomorrow, because it's true.",
         "Didn't forget to vote! Call your friends, family, get them out to vote!",
         "☝️That",
         "Especially the Chicago area, which is where I lived my first 57 years... in Florida now (much better!)."
      ]
   },
   "1gjiwwz": {
      "title": "Democrats Warn That If Trump Is Elected It Will Be The End Of Bureaucracy As We Know It",
      "text": "",
      "comments": [
         "I already voted for the guy, you don't need to sell me on him.",
         "Don't laugh, I'm hoping that's true.",
         "The bureaucrats are responsible for what happened to Peanut. That will not be forgotten soon.",
         "Excellent cut the bloated bureaucracy. !!",
         "Don't threaten me with a good time.",
         "Having bureaucrat experience myself, I'd say the ones who are actually working ***will finally get actual work done*** when the dead weight is cleared out. With no actual work to do, they make themselves busy interfering in others' work both public and private.\n\nYou know that guy in every American neighborhood who gets away with scamming the government, and is richer than everybody else for a fraction of their work? That guy's magic trick was *not getting caught* year after year when the system had all its tubes clogged. When the system flows the way it's supposed to, people like that will start getting caught and suddenly their magic is over.\n\nMost people can't understand the depth of this. For entire generations cheating was the correct answer, and when it ***suddenly isn't anymore*** we'll feel the start of a cultural change. The smart but naive kid followed the rules and got punished, the cunning devil kid broke the rules and weaponized the rules at the same time. Who does ***not*** remember this from school growing up?",
         "The bee is always on fire.\n\nMusk bought Twitter to unban the bee was god's will",
         "😂",
         "Ok deal!",
         "Looks like a Democrats Freudian slip.",
         "Is this s bad thing?",
         "Lol, yes please.\n\nIn all seriousness though, Democrats and Republicans both need to get their heads out of their ass and produce a sustainable budget. Reducing Bureaucracy is a great start.",
         "Yes please. As a former member of that bureaucracy I agree.",
         "I can only vote once dammit.",
         "Reason #5937 to vote for Trump.",
         "We can only hope",
         "And I feel fine.",
         "> Democrats Warn That If Trump Is Elected It Will Be The End Of Bureaucracy As We Know It\n\nDon't threaten me with a good time.",
         "That right there is a good reason to vote for Trump! Like we already needed another reason.",
         "Democrats warn that if Trump gets elected anything from a decline in the frog population to Armageddon will happen.  Problem is, he has already been president and none of those things happened despite the same nonsensical warnings back then.  Instead, the economy improved greatly, the US was not thrust into another war with no end in sight, and people enjoyed a quality of life that Dems did everything they could to take away.",
         "I’m hard already. Don’t need to keep selling me on it.",
         "this november bureaucracy is on the ballot!",
         "I've said it 1000 times, The bee is not supposed to be legit news.\n\n  \nYet here we are, unsurprised at the Simpson level premonitions of the Bee.  rofl",
         "[removed]",
         "I suppose they all wipe before they poop too.",
         "GOOD",
         "Guiding the lily much?",
         "The future of bureaucracy is at stake.",
         "You're damn skippy it will be.",
         "The Bee is usually way ahead of the curve in predicting the future through absurd parody. Let's hope this is another one of those times.",
         "Stop, I can only get so errect.",
         "Yes. It will have actually work again and given them the result they hate.",
         "Thank God!!!",
         "Sold!",
         "After Trump is elected, all conservative media should ask Chuckie Shumer, \"Now that President Trump has been reelected, when will you be retiring?\"\n\nJust hit him with that question every chance they get...",
         "Don't threaten me with a good time.",
         "That's what I'm hoping for.",
         "I don't see the downside.",
         "We already saw this in action during his last presidency with the \"One In, Two Out\" executive order on regulations. \n\nGranted, not a lot came out of that, but still better than not having that guideline.",
         "In Chicago it was anyone working for streets and san",
         "'nuff said.... o7 salute o7",
         "Let's see what Beyonce has to say first. I don't want to think for myself. ",
         "Me too! The airport I worked at had FIVE layers of management to oversee about 40 TSA screeners. Ridiculous!",
         "I firmly believe that the bureaucracy has become the fourth branch of government. In some ways it has more power than the other three.",
         "Frogs are annoying though.",
         "If Trump is in but it's a 50/50 congress then it'll continue being *not a lot.*\n\nIf people don't like what congress does then people need to start putting different people in congress, sounds simple but voters make a hell of an ordeal out of it.",
         "I’m calling Taylor Swift as we speak!",
         "😆",
         "Trump is the head of the executive branch. He may be authorized to run a department... is he required to? Can we fire them all? could we put the ATF headquarters on Guam and then blow up the airport stranding them there? prolly...."
      ]
   },
   "1gjj5z5": {
      "title": "WHAT IS HAPPENING IN NEW HAMPSHIRE? A massive line has formed for JD Vance in Derry, New Hampshire… These people aren't all MAGA-cap wearing partisans. They're middle class people tired of the Democratic regime - Kamala's worst nightmare.",
      "text": "",
      "comments": [
         "It's also fucking cold out there right now. The fact that they're standing out there for Vance is telling.",
         "There is a NOT IMPOSSIBLE scenario where Harris wins WI, PA, MI... and almost has the election LOCKED... But HN flips and Trump wins.",
         "He will be a rock star after 4 years as VP.",
         "Let’s go! Snatch NH from them!",
         "Recovering democrat voting straight R for the first time. The biggest thing that drove me away from the Dems was how hateful they were/are if you didn’t agree exactly with the party line. They think every one of these people in line are Nazis.",
         "To go from a senator that hardly anyone knew to the VP pick and and drawing crowds like this must be mind blowing.  I've been impressed with his interviews and look forward to him running for president one day.",
         "Calling it now, at least one of New Hampshire, New Mexico, Virginia, or Minnesota will flip trumps way by tomorrow",
         "If Harris wins the rust belt and Trump wins the sun belt, Harris wins 270-268. \n\nIf Trump then flips NH, he wins 272-266. \n\nGet out and VOTE New Hampshire!!!",
         "I’m a New Hampshire resident and this will be my first time voting. Me and my whole family are voting for Trump!",
         "Full Disclosure: I live in Mass and had to pick up my dad since his transmission blew in NH. I had to go up to the Manchester area like last week. \n\nOn the highway right off the side at one point by the woods but still very viewable someone put a massive Trump banner the size of a billboard and tied it to two trees and it had an eagle on it. On the overpass next to it after it there was a guy waiving a massive Trump flag on a flag pole of sorts. \n\nDo I think NH will flip ? To be honest not sure but there is a reason why people specifically sat out in the cold to see JD Vance. \n\n**The reason why people went out in the cold to see JD is because his story talks about addiction and NH has been plagued by drugs destroying people’s friends, communities, and relationships. The fact that many say it is harder to get weed than hard drugs in most parts of the state tells you all you need to know.**.",
         "Guys if the disaster scenario is looming where Kamala wins 270 and Trump wins 268, but we happen to flip New Hampshire somehow, that puts us at 272 and her at 268. If we win by flipping a historically blue state that would be poetic justice",
         "After reading his book, I would stand in line to listen to Vance as well.",
         "More than Kamala can get in a warm state",
         "There are a lot of people I know, some of whom are democrats, who are tired of what is going on with the Dem party and are voting for Mr. Trump. One of whom is a former coworker who \\*hated\\* Trump and believed a lot of the stuff that was said about him, before myself and others told her to actually DO some research into the accusations and learn the truth herself. Well, now she knows that a majority of the stuff said about him were lies and in some cases, even projections.",
         "Looks like a rally at a Costco.... It's either Vance, or those $6 pumpkin pies!",
         "So a Vance is pulling in more people in a Blue area than a Harris pulls in without a fake performance in a Blue area.",
         "Looks like some people might finally be wising up",
         "It’s simple: Republicans have been bullied and threatened with cancel culture for supporting Trump. Now most don’t openly do it (especially in swing and left leaning/owned states). \n\nThey’ll come out to vote though. Going to be interesting to see the numbers 👀",
         "In my best Steve Irwin voice: Crikey! Could this be a rare sighting of the silent majority?!",
         "Check out Lily Tang Williams running for Representative of NH-2. She just got endorsed by RFK. Solid candidate.",
         "good luck tomorrow",
         "Early voting shows a much better GOP turnout than in 2020 and above the margin Biden beat Trump in NH. If the in-person voting rates are the same then NH will flip. Based on these margins of early coting I have NH red and part of a Trump victort at 275-263",
         "Honestly, even if Trump loses, we probably take the senate and keep the house. Then we get a big mid-term and a wave election in 28 with Vance. \n\nThere is an argument to be made a Kamala win = a Vance super majority in 28",
         "Tim Waltz is handing out free tampons at his rallies and still can't draw a crowd.",
         "Man it'd be a surprise for nh to go red",
         "Go NEW HAMPSHIRE!!!\n\nA small but awesome state of hard working people!",
         "It’s not going to matter if the election is rigged again.",
         "Omg normal people, how refreshing.",
         "It looks like it might happen boys..",
         "This line was easily double this size by 5:40 last night… There was also 1 ‘protester’ parked a box truck next to the building covered in projectors about Ayotte.. loser just left the truck there blaring with a poor dog locked inside! Horrible human!",
         "Isn’t it illegal to wear a MAGA/Harris hat at polling stations?",
         "You all are out of your fucking minds if you think that people standing in long lines means your guy will win.",
         "There's a couple hundred people out there. It's going to overwelm thr whole state.",
         "They are all white…lol",
         "Derry. It's a rural area. Rural is GOP.",
         "These massive lines are an attempt at election interference",
         "Paid to be there.",
         "> It's also fucking cold out there right now. \n\nyeah, got down to the low 20's last night up here (and that thumbnail looks to be a night time thing).\n\nnot \"cold\" by new england standards, but definitely not t-shirt weather either.",
         "It’s freezing here. And it’s raining a little bit",
         "New Hampshire flipped so hard it became Hampshire New",
         "I'd laugh so hard if this happens.  Tiny New England state that's been a write off for two decades flips and saves this election (and the country).",
         "> HN flips \n\nI see what you did there.",
         "I live in NH and I think it will be close but NH is becoming Vermont light unfortunately \n\nOver the last 10 years the population moving here is more and more liberal \n\nMy wife goes into people’s homes to meet clients and she comes home everyday telling me how every single one was liberal. She could tell by the books they had out\n\nI’ll be surprised as hell if he wins NH. The smaller towns are full of trump flags and signs but anywhere with population? Completely different",
         "This would be hilarious",
         "I would die laughing. New Hampshire hasn't gone red since 2000. To have it go red at the 11th hour and *barely* stop Harris from taking the White House would be too sweet.",
         "God I hope you’re correct.",
         "Who? You talkin about 2028 President Vance? \n\nYea, we're a LONG WAY from BUSH McCAIN ROMNEY... Almost like MAGA didn't come from Trump or the TeaParty before it, but rather from decades of not having a conservative voice.",
         "I think he's a bit of a rock star now.  When he told what's her name \"do you hear what you are saying\", about Aurora, CO. I mean that was great!",
         "It would be a nice surprise if they picked off a few other surprise states.",
         "Almost on the same exact grounds as you. I was, too. Now an Independent but could see myself voting Republican in the future.",
         "Welcome to the right side of history, friend!",
         "Welcome",
         "It’s funny because they’re the biggest Nazis you’ll ever meet. Even Hitler would blush ",
         "Welcome.  We really are nice people.  Anyway my husband and I are and all the people we know who are conservative.....and we are from California!",
         "That’s just Le Redditors ",
         "To be fair you guys call every other dem a communist so it evens out",
         "Voting republican because…. Democrats hurt your fee fees ? Oh wow. The projection from the right is insane",
         "Would love to see Minnesota flip. Trump came real close to doing so in 2016.",
         "I’m in VA and would love to see us flip back to red. The majority of the state is red except for the DC carpetbaggers up in Fairfax county / NOVA. Like, go back across the bridge pls 🙄 apparently internal polling only has Trump down like 2-3 here and all the men I know are going tomorrow. \n\nThe small city where I live is basically Trump country. My neighbors across the street are like the only Harris Walz signs around here. New people who moved in next door to them have Trump signs up and there are plenty of Trump signs all over the neighborhood. Around the rest of town, you see some HW signs but a lot more Trump, and plenty of people have no issue displaying stickers or wearing MAGA hats/shirts etc. We don’t do signs or stickers on our stuff but my husband is voting tomorrow and I already voted last week. Voted early for the first time ever. Paint the Commonwealth Red!",
         "New Mexico going red would be a great curveball. \n\nHasn’t voted Red since ‘04",
         "RemindMe! 1 day",
         "RemindMe! 48 hours",
         "I'm not a snowballs chance, but if so we win. Big if.",
         "Trump flipping Minnesota even after Harris chose Walz would be amazing. And if we are going by the RCP averages, Minnesota or New Hampshire has the best chance of flipping (+4.2 and +3.5 respectively for Harris).",
         "minnesota no way, Virginia no way.  I guess maybe the other two, but it's so far out of the expected outcome that it's hard to believe",
         "Excellent! Thank you and please spread the word",
         "He can't even string them along no pun intended",
         "Seeing as NH is literally 90% white, this is not surprising.",
         "It’s New Hampshire… it’s pretty much an all white state dork.",
         "> Derry. It's a rural area.\n\nderry most certainly is NOT rural area. it's a normal southern nh suburban city.",
         "Not from around here are you?",
         "Derry isnt rural.",
         "Hahahaha are you serious? That's your side that does that.",
         "I heard Beyonce was dancing at the event!",
         "That would be the Kamala campaign that pays to bus attendees around and pays for celebrity appearances/endorsements to generate interest.\n\nShe can afford it; the Dems outspend Repubs 4:1 because they are the party of the wealthy elite.\n\nSee ya tomorrow.",
         "🤣ok buddy.  Not sure where the sign up for that is , I get all kinds of political spam never saw any offers for that.",
         "Projection",
         "Again it's your side that does that. I remember seeing ads for \"demonstrators\" in the Northcoast Journal, published in my home county of Humboldt in California.",
         "Definitely not cold by real England standards either.  20s, that's our summer.  Got some soft Americanos over there if that's your idea of grim weather.",
         "Lmao",
         "Thanks for the joke lol, made my day",
         "The funniest thing is that it would be a 2000 redux, when Gore would have won if he had held NH or carried his home state of Tennessee.",
         "You never know. New Hampshire is only +3.5 for Harris right now. It's Trump's best chance at flipping a blue state.",
         "You can tell if someone is liberal if they have books, unlike mouth breathing MAGATS",
         "It would be glorious!",
         "He is charming I have no doubt he will become a superstar in 4 years",
         "I live near Aurora CO and everything Trump has said about it is false. I had no idea what the hell he was even talking about. He didn't even go more than 100 ft into Aurora city limits for his silly speech.\n\nA true man of the people.",
         "I want NH and 300+ EV!",
         "Make that future day today!",
         "You mean the future like tomorrow right?",
         "when you silence free speech, yes you are a commie.",
         "In no world would that \"even out\". The left has way more power to indoctrinate the masses with lies. They control almost all of online, hollywood, TV and print media, the education system, entrenched government institutions and bureaucrats, the biggest most monopolistic corporations and industries are all run by democrats. The only reason the communist label sticks is because it's organic and grass roots - because it's actually true. Many democrats are even ok with the label because they agree with it and self identify.\n\nAnd those who don't are de facto supporting communist/fascist/authoritarian government by voting for democrats at this point. Cancel culture and political correctness, suppression of opposition speech, manipulation of algos, media propaganda, abuse of power and lawfare against political opponents, use of identity politics to create division, full support of the establishment and patriot act surveillance state types, the party of top-down government control... I mean they literally just murdered some guy's innocent pet squirrel and racoon the other day in NY... I don't even know where to begin or where to end in explaining how the label actually applies to them objectively from a purely factual basis but not to us... So no it's not the same at all.\n\nWe can say you are a communist because X, Y, Z and list direct examples of them supporting policies that would undoubtably classify as that. Meanwhile they call Trump and us Nazis... but can't back that up with anything real. They say because he had a dog and Hitler did too... I mean there is some serious logical problem and disconnect from reality on one side compared to the other. Trump's about to be a grandfather to both jewish and arab grandkids too.\n\nIf you don't see the difference between the two sides here then your mind is so clouded by democrat conditioning and you are far gone. Survey after survey and real life event after event shows that modern day democrats are the intolerant ones. The hate is off the charts from them they are the same people who in nazi germany would report their neighbors and family members to the state. They have a bunch of the key psychological traits of nazis even their overwhelming use of projection which is why they literally gave us the label all over mainstream news even though it obviously makes no sense to anybody who spends more than a minute to think about it and has a brain larger than a pea.",
         "BTW I just started listening to Musk on Joe Rogan. He completely debunks your \"both sides\" argument in a long detailed segment that begins around [11m 30s](https://www.youtube.com/watch?v=7qZl_5xHoBw&t=11m30s) in.",
         "This is an issue, but I'd say that this is more an exception than a rule on the Rep side, but more a rule than an exception on the dem side.",
         "To be fair most of you are!",
         "Eh, I don't like to generalize.",
         "When you say you guys, I’ve been a Dem my whole life. I don’t do that.",
         "Weak",
         "My feelings are fine. My Jewish neighbor shot in the shoulder by a radical Islamist allowed into this country by Biden/Harris, who Kamala said their heart was in the right place, is also fine. Because evil never wins.",
         "Cringe",
         "If I’m told I have no place among the democrats then why would I vote for a democrat?",
         "You hide behind an alt-account like a loser. ",
         "I’m from Minnesota, Hennepin county actually, and everyone I know (family, friends, neighbors, etc) are voting red this year. No yard signs, bumper stickers, maga hats, or anything like that. We keep to ourselves. It will be close but rest assured r/Minnesota does not represent our state.",
         "Hopefully. If he could pull off a flip in one of those states, and gets az, nv, nc, ga, it would mean a win regardless of how pa, mi, wi go",
         "Agreed! I’ve lived in the nova area all my life, and I hate what it’s become. I really hope he can swing it.",
         "Did you even need to ask? Bonus points if he is European!",
         "What side is my side??!",
         "> 20s, that's our summer. \n\ni'm talking real temperature, not your monopoly measurements.",
         "Imagine all the Iraqi people that would still be alive…",
         "Typical liberal. People like you are exactly why the country is so divided",
         "So an apartment complex was not being terrorized by gang members? It was all over the news.  Trump didn't say it. There were people who lived in the apartment complex.  That woman said it was only 2 complexes which is when JD Vance said are you listening to yourself.  So all that is a big fat lie?",
         "You're nuts. I grew up in Aurora and that's where immigrants go first (my family did). It's the worst part of the Denver metro area and this 100% is happening there.",
         "Keep going!! Why not VA too?",
         "How has your free speech been silenced?",
         "Significant amounts of anti semitic violence come from white nationalists on the far right. Those people are born and raised in the US. Seems like a weird thing to go for Trump over Kamala on",
         "> I’m from Minnesota, Hennepin county actually, and everyone I know (family, friends, neighbors, etc) are voting red this year. No yard signs, bumper stickers, maga hats, or anything like that. We keep to ourselves. \n\nSomehow polls \"aren't aware\" of this. \n\nLol, catch me answering a poll, or if I do, doing so honestly!",
         "How does everyone in Minnesota view Walz?",
         "Hi, fellow Minnesotan! Here in the west suburbs, I'm seeing very few Harris signs and more Trump than I thought. Would love a flip because Walz is the worst",
         "How amazing would it be to see the 3am machine, a billion dollars in advertising, and a non-stop media blitz win PA, MI, WI for Harris, and lose because no one watched NH in the corner?",
         "I’m in Winchester and they’re starting to come here because of the lower COL and because it’s the last stop where you can somewhat reasonably commute to NOVA (my husband does it twice a week) \n\nStill fairly red out here, especially my neighborhood, but the carpetbagging needs to stop. It sucks",
         "Damn! Born and raised in Texas, I try not to even go outside when it’s below freezing! lol",
         "Correct. The mayor of the city said it wasnt true.",
         "I'm not greedy man! I just want something to flip",
         "As a Virginian, I wish we could go red again",
         "That’s a question best asked of Mark Zuckerberg.  He apologized for censoring due to pressure from the Biden/Harris regime.",
         "2020 has entered the chat.",
         "Kamala Harris’ husband appointed CAIRS as one of the organizations in charge of combatting antisemitism. On Oct 8th the president of CAIRS tweeted that “it was incredible to see Gazans walking around a free Palestine. This is what resistance can bring”. Kamala Harris has said the heart of the protestors (protesting for a genocide against Israelis) is in the right place.\n\nDonald Trump has said some things I fervently disagree with, but look at what he has done. He recognized the capital of Jerusalem as the undisputed capital of Israel. He removed funding to the PA for their pay to slay program. He instituted maximum pressure on Iran. \n\nOk buts that’s all Israel and I’m an American first and foremost. What has he done for American Jews? He has unequivocally denounced the pro Hamas protests. He extended Title VI civil rights protections to include Jews, those same protections are being used to sue concentration campuses today. He secured our border so Hamasnicks, like the one who shot my neighbor, don’t come in. He has called out by name a policy for deporting supporters of FTOs who are not American citizens. On the anniversary of the Simchat Torah massacre he said a prayer at the Ohel in the company of a rabbi. \n\nTell ya what, I live in PA and haven’t voted yet. Stack Kamala’s record. What has Kamala done for American Jews? Do it without bashing Trump and maybe you can win my vote.",
         "Democrats are supporting a country that attacked our ally Israel and killed thousands of Jews. They are also continuing to give them monetary consideration that is funding their expansion of their ballistic missile capabilities.  Not “weird” at all.",
         "Nah, at least in the last year violent antisemitism is 100% a left wing thing. You’ve got the occasional right wing shithead on X spouting conspiracy theories (ironically, they are generally about the Jews being responsible for the worst excesses of the left) but they’re mostly accounts with like 10 followers and no clout.",
         "As you can imagine some like him and some don’t.",
         "Might be even funnier if it was nm that flips, Harris did no campaigning here while Trump held a late rally on Halloween",
         "I'm not greedy either.  I just want to win, even by as small an amount as possible.  I will take it any way I can!",
         "Maybe some tables will flip in the more leftwing households.",
         "It's amazing who you elected for Governor and Lt. Governor. There's hope",
         "Based on your comment, you already know who to vote for, my friend.",
         "Please go out and vote tomorrow",
         "Yea.\n\nNew Something, I don't care. I just want to see a flip.",
         "Let’s go!!!"
      ]
   },
   "1gjob0r": {
      "title": "We The People",
      "text": "",
      "comments": [
         "We The Peanut\n\n1 vote for Trump = 1 justice for Peanut",
         "I have a grandson coming in about two months. Might be a cool onesie."
      ]
   },
   "1gjrxtr": {
      "title": "Here's your reminder:",
      "text": "Regardless if you live in a state that goes blue every 4 years, if you think your vote doesn't matter, IT DOES. \n\nGo out tomorrow and vote like your life depends on it, because it does, and this election is the most important in our nation's history.\n\nVOTE VOTE VOTE!",
      "comments": [
         "CNN: Trump finalizes campaign with fascist salute",
         "Let’s go baby!",
         "That's my president",
         "Don’t give them ideas lol"
      ]
   },
   "1gjdww0": {
      "title": "It’s always darkest just before the Don ",
      "text": "",
      "comments": [
         "I voted GOP down the line.  \n\nBut, I always hate this kind of cultish shit.",
         "Save US!",
         "For Freedom, for a safer world and for Peanut !!!",
         "God bless Trump!",
         "Vote!!!!!!!",
         "No",
         "It makes voting easy, but I’m right there with you. I hate voting down party lines because it reinforces the “us vs them” mentality, but with the cockamamie horseshit coming from the left these days, and with your average Democrat policy maker staying lockstep with the party narrative, you feel compelled to give them nothing.",
         "It’s just someone goofing off, brother",
         "I think its a funny meme, wouldnt look that much into it lol",
         "Silly thing to get upset over.  The left makes up shit constantly to be malicious, even funny stuff like this.  \n\n  \nSometimes funny is just funny.",
         "It's just fun.  Can't fall into the trap of the far left where they are angry all the time",
         "Meh, it's fun. Could be worse.",
         "Have you seen what they done to Peanut and Fred? This can happen to anyone in the future, if the communists will somehow win. This are very dark times, with a prospect to become the darkest in the future.",
         "To me this is \"dress my kid up as [my politician of choice up for election] for Halloween\" levels of cringe.",
         "I did see that and it was heartbreaking to read what they did to those poor rescue animals. It’s a total breach of rights and I hope the people involved are investigated.",
         "I don't feel like that's the same at all but you are entitled to your opinion ",
         "I finally heard the entire story today and it was shocking and horrible.  Oh I know, it was on Outnumbered."
      ]
   },
   "1gjvfz7": {
      "title": "I got to vote for the first time! This was a wild ride!",
      "text": "",
      "comments": [
         "Hell yea!",
         "Congrats! Hopefully for Team Red, but you do you."
      ]
   },
   "1gjlyy1": {
      "title": "Vote Trump to protest Peanut’s murder",
      "text": "MAGA 2024! For Peanut! ",
      "comments": [
         "That seconds image is the funniest thing i've seen all week, thank you.",
         "dude I live in NYC and someone it broad daylight with me in the room by the window stole groceries from my front. And you know what I could of done about it? Scream at him and let him take anything else he wanted while I wait 3 hours for cops to come and do nothing",
         "If that squirrel were a kalama supporter half of New York would be in flames right now.  Firey but peaceful. You know what I mean",
         "Avenge Peanut",
         "What a world we live in!\nThis is nuts!",
         "Conflating issues is what Democrats do. Please do not stoop to such levels. \n\nThis was a LOCAL, non-federal bureaucratic issue that had nothing to do with the federal government or the president.",
         "The last one made me laugh a lot, too!",
         "The third one as well.",
         "“Mostly peaceful protests.”",
         "Remember this is true for your life as well. If it doesn't serve their own wealth and power they don't care about you. We care about all lives no matter what your politics. Just a couple weeks ago I watched democrats laugh and gloat over a gold star 70 year mother be put in prison for the rest of her life for a non-violent so called \"crime\" with no victim and for doing what other democrats have done and even admitted to with no consequences. This is who they are. Vote accordingly.",
         "It's not conflating issues, it's the mindset that infects all bureaucratic institutions. That the bureaucracy is correct and justified in its actions because they are following regulations written by that bureaucracy. It's basically caused by Pournelle's iron law of bureaucracy, that organizations are eventually taken over by people dedicated to the bureaucracy, rather than the mission.\n\nThis has nothing to do with state, local, or federal, it's a succinct demonstration of what happens when you let these agencies run wild and don't keep them reigned in. You want an example at the federal level? How about when Chuck Schumer warned Trump that the intelligence agencies had \"six ways from Sunday to get back at\" any president who dared to cross them. In other words, a bipartisan admission that these agencies have amassed so much power and have gone rogue and no longer answer to the elected head of the civilian federal executive as they are required to by law. And in fact they will take down anybody who tries to get in their way. Some unelected bureaucrats are completely above the law. That's far worse than this squirrel, right? The squirrel is not about one rodent being killed, it's the symbolism. The squirrel is us."
      ]
   },
   "1gjm9oa": {
      "title": "This race is close but I'm predicting Donald Trump wins the Electoral College -- and possibly the popular vote",
      "text": "",
      "comments": [
         "After the \"red wave\" flop two years ago, I am extremely pessimistic to be honest. We don't talk enough about how wrong the polls were in 2022 in favoring Republicans",
         "BUT:\n\nNone of this will happen unless YOU and everyone else goes out to vote!",
         "Like I have said before. 2020 I felt like Trump was gonna lose. This time it feels much more hopeful.",
         "Did the Harris campaign ever get around to explaining her positive side to voters?",
         "99% chance the popular vote win isn't happening, but man that would be some fun shit. He would have a true mandate.\n\n**BUT HE WON'T EVEN WIN THE EC IF YOU DON'T GO FUCKIN VOTE! SO DO THAT! NO EXCUSES!**",
         "Don't think the race will be close if the PV is around a >1% difference.",
         "How do we think Harris supporters would respond to Harris losing the popular vote but winning the electoral vote? Just curious… with their disdain for the Electoral College & what not",
         "Thanks, Henry Olsen. Quick follow up question- who are you?",
         "Such a bizarre election. I've never seen voters simp for more government bureaucracy and demand higher taxes. That's how powerful left-wing propaganda can be.",
         "Just vote, share and pray.",
         "I am optimistic he pulls off an incredible win. He may very well flip some counties and pick up more votes then he did in 2016 and 2020. Popular vote is not out of the question. If Kamala had Obama like enthusiasm, I would believe she would win, but this time around feels a lot different. The enthusiasm for the Biden administration and Kamala I do not think is there.",
         "I'm cautiously optimistic.",
         "Trump has to win the popular vote! Democrats will want to contest if he only wins the electoral vote!\n\nGet anyone you know that will vote Trump, text them, call them, make sure they are voting!",
         "If republican voters come out in our usual numbers on election day then we win. It's that simple.",
         "Don't care. Going to vote tomorrow, come hell or high water. I'd crawl through a field of dinosaur shit naked to vote for Trump.",
         "I predict either they will try to invoke the 14th and not certify. \n\nOr\n\nIt will be stolen by election interference- that has already started.",
         "I'd be happy with a Trump win, that's all.\n\nBut if he somehow wins the popular vote, it would be **glorious**, just to hopefully silence all the screeching, constitutionally ignorant leftists who whine about this topic incessantly. \n\nAnd it will still be entertaining to watch them then suggest that we need some other form of voting process, like only college graduates or some nonsense.",
         "Sounds good. Vote vote vote pray pray pray",
         "Get out and make it happen!",
         "Lol this is a Mondale landslide, or at least a Carter landslide",
         "Fingers crossed.",
         "I want Trump to win, but they are going to cheat as much as they have to in order to beat him. The 3AM ballot dumps are going to happen until they have enough votes to win.",
         "Vote! Vote! Vote!",
         "Blue New Mexico, owned by the fed because it's the second most reliant state for federal funds.",
         "Who cares about the popular vote?  It has no relevance on who wins the presidency.",
         "Generic ballot was pretty much spot on though. It was state by state polling that turned out wonky",
         "Ironically, the numbers just before Election Day in a lot of the polls were pretty close but the distribution of those votes by congressional district are were things got weird.",
         "Exactly! There are less Republicans in this country than Democrats unfortunately. We are counting on the liberals and Trump hating Republicans to stay home, because they don’t like Kamala. The Republicans have to show up to the plate for this, and not be nonchalant , because they don’t like Trump as a person.  We unfortunately can’t put a loud speaker to the country. I am hoping for Trump to win, but prepared for Harris to win too. It’s the Reality.",
         ">This time it feels much more hopeful.\n\nWithout a doubt. The polling as it is now would have been a dream in 2020 and 2016.",
         "The last couple months have been huge for trump",
         "I remember talking to my brother a couple days before the election in 2020, I said \"Biden could win, dude.\" He said, \"there's no way, who would vote for him?\" Welp, see what happened. \n\nI can see an electoral college win, by the narrowest margins. A popular vote win? I'd be gobsmacked if that happened, but would love it.",
         "I felt the opposite in 2020",
         "Same here. I felt he'd win in 2016 and felt he'd lose in 2020. I'm feeling like he'll win again this year.",
         "Dude, she grew up in a middle class family",
         "You didn't hear? Her neighbors were proud of their lawns when she was a kid.",
         "Literally just unburden by what has been",
         "No, but dude Trump is Hitler!",
         "No, and honestly - doing so would have been a mistake on their part.\n\nThis election is Trump vs. \"Anyone But Trump\" and the \"anyone\" in this case is an absolute disaster.",
         "How could she? She doesn't have a positive side.",
         "Did you not see all the Joyful Warriors?",
         "Oh, if it benefits themselves they'll reaffirm that the electoral college is the greatest thing ever and that anyone crying about popular vote doesn't understand how our government works. Guaranteed.",
         "They’re going to spend at least the first year shitting on the electoral college.",
         "That's not good enough, drive to their homes, drag them into your car take them to the polls if you have to.",
         "A good number of them have already voted early, I know a few.\n\nI hope more of the early voters are those that would've stayed home on election day than not.\n\nI'm going tomorrow, going *on* election day just feels like tradition to me. It's comfy.",
         "I mean… I hope you’re right\n\nBut to say Trump is as popular as Reagan was… that’s a stretch",
         "Yes but many liberals like to talk about the unjustness of the EC and a president winning without the popular vote. They don’t understand how the EC works, so the point OP is making is it would quiet the dissenters.",
         "Not sure what you mean. Didn't generic polling show a Republican advantage that never materialized?",
         "No, the balance shifted this year. There are more Republicans than Democrats. Per Gallup.\n\nBut it still matters who actually turns out to vote.",
         "Trump has possibly just run the greatest campaign in American electoral history",
         "Its funny that the majority here was crying about Trump's debate performance but I felt like that was a real turning point and ended the Harris honeymoon fully. She came across as a Karen who needed help from the moderaters.\n\nIt is also possible that that was astroturfing fake conservative accounts, as I definitely noticed a few fake cons, but there were still a lot who weren't.",
         "Too much crap was happening in 2020. I just had a feeling he was gonna lose.",
         "Apparently a large number of early voting Republicans are those and also first time voters",
         "With Reagan's media at the time, it would be.",
         "Just watch...",
         "Generic ballot (whether you'd vote for a Republican or democrat) was pretty much spot on. Predicted R+2-3 in the national vote, and that's what we got",
         "James Madison’s campaign was better imo\n\nCampaign slogan: “Literally wrote the Constitution”",
         "I don’t think Trump’s debate with Harris was strong though. That was a loss.",
         "I think you're correct.  The energy, the nonstop tour of America, bringing people on board like RFK. ",
         "If he can't win with this campaign then it means no one can ever oppose the machine and we are beyond the tipping point as a country. Not a single person can say he ran a bad campaign. [This is the best campaign and best ticket I have ever seen in my lifetime.](https://x.com/Honingbiene/status/1853302789713043586)",
         "The hard truth is that she definitely won the debate, help from moderators notwithstanding \n\nThe good part is nobody remembered that after a week. Both Democrats and Republicans were too busy jamming to the meme remixes of \"they're eating the dogs, they're eating the cats\"",
         "Big if true. Do you have a link to some early voting stats?",
         "Getting shot doesn't hurt, either. \n\nWell, I'm sure it hurt *him*, but not his polling numbers.",
         "Yeah but even though she won the debate by a mile and trump looked pretty insane i can’t lie, i think it still highlighted how unlikeable, uncharismatic and disingenuous she is. She just can’t have a normal human reaction to anything, it always seems so pre planned and rehearsed",
         "It wasn’t anything I read, but whoever the dude is who does internal polling for the campaign (I forget his name) was on Fox a few days/a week or so I think talking about this bc they were asking if they were worried about cannibalizing Election Day votes. They are not. He had numbers but I don’t want to try to recall them off the top of my head and be inaccurate. I can try to find the link to the segment, if I do I will update this comment.",
         "Mainstream media did their best to memoryhole that event",
         "She was extremely well coached for that debate, and might even have had the questions beforehand. \n\nBut yeah she's not likable at all, and seems so artificial and stage managed"
      ]
   },
   "1gjw3m1": {
      "title": "Breaking.....Joe Rogan endorses Trump!",
      "text": "I listened to both 3 hour interviews with President Trump and JD Vance. Very interesting conversations.  I may even listen to the podcast again sometime.\n\n[https://nypost.com/2024/11/04/us-news/joe-rogan-announces-endorsement-of-trump-while-promoting-elon-musk-interview-on-x/](https://nypost.com/2024/11/04/us-news/joe-rogan-announces-endorsement-of-trump-while-promoting-elon-musk-interview-on-x/)",
      "comments": []
   },
   "1gjkjzy": {
      "title": "New York Times admits ‘woke’ ideology is losing its ‘grip on the country’",
      "text": "",
      "comments": [
         "ABC called reddit ultra right wing. https://x.com/reddit_lies/status/1853501421586423809",
         "All Legacy media is losing its grip on the country.",
         "The article was interesting in that he noted how democrat politicians have backed off all their lunatic ideas.  But what we all know is true is that if any of them are elected they will be right back screaming about DEI and other nonsense.  Also not noted was that even if the NYT notices the drop off in lunacy they have no intention of being factual in their news coverage.  They will continue to slant everything to fit the leftist narrative",
         "One can only hope",
         "What's the point of calling yourself a newspaper if you're just a political advocacy group parading as \"journalism\"\n\nAmericans are tired of the bias.  Tired of the 24/7 clickbaits",
         "Because of the left, the terms racist, nazi, fascist have all lost their meaning. Like the boy who cried wolf, no one cares about these accusations anymore. Amazing how the left hurts people who actually experience racism and downplays the story of people who have experienced real fascism. All by cheapening the meaning of words to score political power for an elite few.",
         "It’s about freaking time!!",
         "The world is healing",
         "DEI must DIE\n\nDEI = Didn't Earn It",
         "They call it woke.\n\nIts really the american version of communism.  I would refer to it as Intersectional Communism.  We've see shit like this in world history.  It comes in different flavors and types but it all goes back to Marx.  Its insideous, dangerous, and needs to be exposed as just rebranding of Marxism; a rebranding that started in the 90's after the the fall of the Soviet Union.",
         "People are fighting back against woke because, people don't want to have to walk on eggshells for the rest of their fucking lives",
         "Bye bye NYT and the rest. A tech CEO offered to replace all their staff with AI. I don't think there are many jobs out there that require compulsive lying.",
         "The Millennials have been coddle enough. They can give up their woke bullshit",
         "Ahh yes, because despite this sub being the only one I’m truly active in, my newsfeed gets bombarded with pro-Harris, pro leftist proganda, but extremely anti-Trump stuff. Definitely right wing.",
         "Reddit makes ABC look ultra right wing. 😂",
         "That's honestly how you know they aren't a real network. I mean even just spending like 10 minutes on this website you can tell that is FAR from the truth.",
         "That’s what happens when you live in your east coast elitist bubble.",
         "If the DEI VP becomes President, we will be calling this interregnum the \"White Boy Summer\", the calm before an absolute tsunami of astroturfed rainbow vomit in every cultural channel the Regime controls.",
         "Even in the so-called 'golden age' of journalism, they were just better at hiding their biases. Nearly all the personalities that were considered 'the greats' had very left-leaning views which they didn't express overtly but used it to select which stories to emphasize and how to frame them. The entire national discussion started from a point of left-wing thought. I much prefer news sources where you can determine their bias and then look for the opposing view in order to attempt to synthesize my own opinion. But that's a lot of work that most people won't take the time to do.",
         "Dude literally every sub is insanely leftist. Makes me want to just stop using Reddit. I got banned from r/Texas for saying people should use the bathroom of their gender they were given at birth lmao.",
         "lol - I was excoriated last night on the r/medical_advice sub for having the audacity to tell a junkie that shot up with a dirty needle to \"see a doctor and get clean.\" \n\nThe complete unwillingness of this current breed to accept any personal responsibility or be held accountable for ANYTHING is just stunning. \n\nJust whining and excuses about everything.",
         "You know who else said people should use bathrooms based on their own gender? \n\n\n\nHitler.",
         "Are you Serious 💀💀💀"
      ]
   },
   "1gju63d": {
      "title": "‘Essential That He Wins’: Megyn Kelly Announces She’s Appearing With Trump In PA",
      "text": "",
      "comments": [
         "She really wants back on the wagon after that failed stint at NBC",
         "Still waiting... I bet she's getting annoyed \n\nWould be a great attorney general though"
      ]
   },
   "1gjfdnd": {
      "title": "NBC Forced to Give Trump Two Minutes of Airtime and Boy Does He Deliver: ‘Kamala Broke It, I’ll Fix It’",
      "text": "",
      "comments": [
         "I think what really blows my mind is the facts that two political ad spots cost 1.7 million.\n\nThese networks are raking in cash.",
         "The stunt to put Harris on SNL really backfired on them because it forced them to give Trump airtime during Sunday Night Football, which I'm confident in saying was seen by more left-leaning independents and democrats than SNL was seen by conservatives.\n\nRFK should have demanded 90 seconds as well. They forced him to stay on the ballot, so he is still officially a candidate and thus is entitled to the same amount of time that Harris was offered.",
         "You never know. Those ads might must have turned some independents into critical thinkers! Vote like your life depends on it... because it does.",
         "Like finding a brilliant chess move after your opponent makes a blunder.",
         "I was wondering why he randomly popped up at the end of the race. But let’s be real- about 95% of the people watching were already going for him anyway. SNF was definitely a different story (I didn’t know they aired it again, couldn’t care less about either of those teams).",
         "Why is no one talking about how her appearance was basically a political campaign for her to get voters in PA? There was no humor just a pitch for people in PA to vote for her",
         "Hahahah. I didn’t know this till now. Awesome. Like everything else they’ve tried to do to Trump-it backfired",
         "NBC tried pulling a fast one at the last possible minute, what a corrupt system.",
         "Man I had commented on a sub that talked about Kamala appearing on SNL and said Trump should get equal airtime in a true democracy and those snowflakes lost their minds bashing and down voting. Yet here goes NBC making amends.",
         " Steep Fines to direct these organizations to clean house.",
         "SATURDAY NIGHT live considers SUNDAY DAY NOT live equal time😂",
         "They should have done this ad that I'm watching right now about the toxic masculinity and is it too late, can we come back and it starts showing crowds at Trump rallies.  I love that one. I also love the best is yet to come from 2020.",
         "The whole system is corrupt.",
         "It's easily the most highly viewed television program of the week is why it is so expensive. It happens right after dinner on Sunday night. Other than Championship Sunday and Superbowl Sunday, you can't get anywhere close to the 20-25 million viewers. \n\nThe only positive is that it was Minnesota vs. Indianapolis which are smaller markets.",
         "Which is why they want the polls to show closer than they might be",
         "Fair point about RFK. Chase Oliver and Jill Stein perhaps should've gotten some air time too.",
         "RFK has been treated like crap this whole election.  I know he's not the favorite, but he deserved Secret Service protection. ",
         "But I think the big motivation right now is fueling the turnout. Even if 90% of NASCAR fans generally like Trump, we need to drive them to the polls. Pun intended.",
         "For years they tried to make fun of people who said \"the liberal media.\"\n\nNow they don't give a fuck, masks are fully off.",
         "Ads about trans stuff or toxic masculinity appeal to the hardcore MAGA base, but not so much  to swing voters who are on the fence. Focusing on kitchen table issues (jobs, prices, housing) and immigration instead of the culture war stuff was definitely the right play here.",
         "Free market",
         "Officially, the law is that equal time must be offered to everyone who is on the ballot for President, in any state. Which means there are like a dozen different people entitled to air time if they want it.\n\nWhether they will get it or even care to pursue it is a different story. But RFK should demand his appearance. He's on the ballot in several states. He's officially a candidate. He's entitled to equal time.",
         "Oh no doubt!",
         "Oh is that why I'm getting the down votes. I thought it was great, but yeah I'm a Trump girl.",
         "I don’t have a problem with them making money. The problem is them pretending they are anything other than propaganda machines.",
         "I assume they'd still have to pay for it, so that might price some of the smaller candidates out. RFK should be able to do it though. Would be funny for him to do an ad just endorsing Trump.",
         "No, you're getting downvoted by bots and brigaders.",
         "Fair",
         "No, Kamala was on without being charged, so as I understand it, the network had to eat the cost of the ad slots.",
         "Oh I'm glad I got the attention! Haha."
      ]
   },
   "1gjvudr": {
      "title": "It's Election Eve tonight. ",
      "text": "Don't forget to leave a Diet Coke and a McDonald's Big Mac out tonight. ",
      "comments": [
         "I'm putting out the Diet Coke, Big Mac and some garbage bags for cleanup.",
         "ROGAN JUST ENDORSED",
         "Trump just wished a Happy Diwali to Hindu's around the world and swore to protect Hindu's against radical Islam.\n\nMY FUCKING PRESIDENT",
         "It's just like Christmas Eve, except instead of definitely getting presents tomorrow, it's either: \n\nA - Getting no presents, my guns taken away, my free speech taken away, WW3, 20+ million more illegal invaders, untold billions more to ukraine and israel, another great depression, lose my job, lose my house, and will have to listen to a drunk woman cackle at me from the oval office for 4 years.\n\nOr B - We all get wonderful presents (the best presents really) and the country is made great again.\n\nI, for one, am hoping for option B.",
         "My vote and well wishes coming from California!",
         "Get your fat pig husband out to vote tomorrow!",
         "The Grand Rapids rally will be electric. That's where he closed in 2016. We've come full circle.",
         "I don’t eat McDonald’s much but I make the Big Mac sauce at home in bulk and dip everything possible in it. \n\nhttps://youtube.com/shorts/4l7yLutlRD4?si=JDvKQ68Znw-_oQ6J",
         "Bahahaha",
         "MAGA Claus is coming to town, and he's giving a lot of people some coal for Christmas!",
         "While that’s great, he should have a week or 3 ago",
         "I kinda forgot that he hadn't endorsed. I feel like he was holding it back in hopes of getting Kamala on the podcast.",
         "👍 Outstanding 👍",
         "Better late than never, and the fact he had both Trump and Vance on felt like an implicit endorsement anyway. \n\nI say welcome to the fight and let's F'n Go!",
         "Ok boo fucking hoo, how about when an independent decides to endorse instead of being a dick and going “hirrr he shoulda earlier” you go “wow that’s awesome!”",
         "I agree",
         "Woah woah I think you took my comment in the wrong direction there my guy!!"
      ]
   },
   "1gjw84r": {
      "title": "Joe Rogan Endorses Trump ",
      "text": "",
      "comments": []
   },
   "1gjw13o": {
      "title": "Joe Rogan just officially endorsed Trump!",
      "text": "",
      "comments": [
         "I typically couldn’t care less about celebrity endorsements because they are usually ineffective, but this might sway a couple minds. \n\nGlad he’s on the team.",
         "Let’s goooo 🔥🔥🔥",
         "Brandon!"
      ]
   },
   "1gjsoy4": {
      "title": "Philadelphia Judge Allows Elon Musk’s $1 Million Giveaways to Proceed",
      "text": "",
      "comments": [
         "Just another thing for leftists to cope and seethe over",
         "Not like the democrats are giving away money for supporters to show up to their rallies am I right? /s",
         "Rivers of leftist tears.",
         "Why doesn’t the party of democracy want people to register to vote? I thought every vote counted.",
         "Just hundreds of billions of OUR tax dollars for student loans. But Elon using his own money LEGALLY and they lose their minds. Sick people.",
         "Well, every LEGAL vote counts. It’s them illegal votes that Republican/Conservatives want stopped before the election. Not complaining afterwards. Like the guy that just was determined voted illegally, but guess what, because it’s a secret ballot you can’t unring the bell."
      ]
   },
   "1gjwc3v": {
      "title": "Joe Rogan Endorses Trump on Eve of Election ",
      "text": "",
      "comments": [
         "Kamala missed out",
         "🇺🇸",
         "Jim Cramer thinks Harris will win. If there is one time the inverse Cramer needs to be invoked, it would be now lol.",
         "Even if she went on the podcast, there is no way in fuck that Joe Rogan would ever endorse her."
      ]
   },
   "1gjtdat": {
      "title": "Tomorrow save democracy ",
      "text": "",
      "comments": [
         "God bless America,  and God bless Trump. Keep him safe from all who would like to do him harm.",
         "He has twice already."
      ]
   },
   "1gjuti5": {
      "title": "Kamala Ad Targets Men, Begs Them To Secretly Vote Blue: ‘No One Will Ever Know’",
      "text": "",
      "comments": [
         "This is their entire final argument. Men, vote for us, nobody will ever know, so you don't need to be embarrassed! Women, vote for us, your husband can't control you!",
         "This reeks of desperation from the Dems.",
         "The whole \"No one will know\" campaign whether it's for men or women is just stooping to such low levels.\n\nThe Dem represents an actually dying democracy where blatant lying for voting is seen as necessary.",
         "Top tier cringe",
         "Why does this sound like something a predator says to a child?",
         "Well nobody will know the other way either! 😂",
         "What a great way to announce that you should be embarrassed to vote for them.",
         "[removed]",
         "What a pathetic approach. \"Be a real man. Hide and lie\"",
         "Why would they do that? Are they suggesting it's the worst pick?",
         "It’s like they know it’s a shameful thing to do, lol",
         "I’m not an effeminate man like a Democrat, I can’t be wooed with liberal illogic",
         "They’re just all about deceit and dishonesty, huh?   Is that really how they want to be seen?",
         "I would run this ad with cuts to videos of leftists screaming insults and committing violence, and end it with clips of politicians and press insulting Trump voters.",
         "It's weird, right? The overarching message for both men and women is essentially \"we know you'd be embarrassed to vote for us, but if you don't tell anybody, they can't clown you!\"\n\n\n\n  \nlol like what is this?",
         "Doesn’t just reek of it, it is. And I think men will be completely turned off by it. I see it as pathetic.",
         "Right?  \"Just don't tell your parents.\"",
         "My first thought. It's very groomy.\n\n\nThe shoe fits, considering how many dems are rank in file with the Epstein pedo network. ",
         "This, coupled with the other ad aimed at women lying to their husbands about their vote,  are not sending a good message at all. All they are doing is sowing distrust within marriages.",
         "The liberals are all about lying to your spouse apparently."
      ]
   },
   "1gje7qc": {
      "title": "Make America Great AGAIN",
      "text": "",
      "comments": [
         "We need Vivek and Tulsi in there.",
         "Please 🙏",
         "If we can somehow put Vivek in this picture, you’d have my Republican Dream Team",
         "[Our Avengers](https://x.com/Honingbiene/status/1853302789713043586)\n\n[Their Avengers](https://youtu.be/TDvUe8fIuNs)",
         "Boys I think the Republican X-Men are gonna take this. If the establishment allows, that is.",
         "Dear Santa I only want 1 thing for Christmas 😂",
         "Too Big To Rig.",
         "Holy cringe.\n\n  \nThey actually organized for that zoom.",
         ">[Our Avengers](https://x.com/Honingbiene/status/1853302789713043586)\n\nTHIS IS HYPE AS HELL DUDE WTF.",
         "Yep. The most epic ticket we've ever had in my lifetime."
      ]
   },
   "1gjms82": {
      "title": "Trump Has 56% Odds of Winning, Harris 44%: Oddschecker",
      "text": "",
      "comments": [
         "Doesn’t matter. Vote. \n\nDon’t trust any numbers but the final numbers.",
         "Don't trust any poll, graph or 'report'.",
         "After the betting odds stopped narrowing earlier today, it looks as if they've started moving apart again.\n\n[https://www.realclearpolling.com/betting-odds/2024/president](https://www.realclearpolling.com/betting-odds/2024/president)\n\n**Betfair (as an example):**\n\nTrump 57 Harris 38\n\n(previously: Trump 55 Harris 41)\n\nLooks like Trump is going into this election keeping the betting odds lead.\n\n\n\nBut this doesn't matter. Vote",
         "So not much more than a coin flip. \n\nGo vote.",
         "JUST VOTE!!! GO OUT AND VOTE!",
         "I want MOAR!",
         "Just to clarify:  these are numbers generated by the opinions of degenerate online gamblers and the bets they have placed.  They aren't real odds -- nobody really knows what is going to happen tomorrow.",
         "56/44 odds is statistically a coin flip. Absolutely get out and vote.",
         "Voted yesterday! From California but voted none the less!",
         "Exactly. TRUMP 2024!!!",
         "At this point, I don’t even know if we can trust the final numbers, but let’s just hope the Trump wins and they don’t try to cheat",
         "wasn’t he ahead in 2020 too ?",
         "A vote is a vote if Trump wins the Popular vote then the Dems have nothing to stand on.",
         "They will. This I can guarantee. ",
         "I don't think so"
      ]
   },
   "1gjvd8s": {
      "title": "Early Voter Turnout In Storm-Ravaged Western NC Surpassed Statewide Percentage",
      "text": "",
      "comments": [
         "Hoo boy...\nCarter or Mondale landslide?",
         "“Don’t Tread On Me” 🐍🇺🇸",
         "That’s never happening again",
         "You can thank good ole' Ronny for that"
      ]
   },
   "1gji2g8": {
      "title": "‘Don’t Lie’: Bill Maher Rips Media For Claiming Trump Wanted Liz Cheney In Front Of ‘Firing Squad’",
      "text": "",
      "comments": [
         "I really feel that bill is internally battling this kamala issue. He may vote for her, but I don't think the thought of it settles inside. you just see it.",
         "Bill can see the iceberg approaching, and he really wishes the ship were more steerable.",
         "Sending Liz Cheney to war is literally an Eminem lyric from 2004. \n\nIt's always been an anti war narrative to say that the people who vote to go to war should be (or their children should be) on the front lines.\n\nBut I guess it's (D)ifferent now....no wait. It's just (D)ishonesty",
         "Lying is all the democrats have at this point",
         "Democrats do not have a moral compass. Lying doesn’t even bother them.",
         "Bill will vote for Kamala but only because of his personal hatred for Trump and his desire to be in the good graces of the LA elites. He knows Trump is better for the country but will never say it out loud.",
         "Obama is up to 2 packs a day 🚬 the pressure.",
         "I honestly do not envy Bill Maher's position. He's trying to talk sense into the left, and that is forbidden nowadays. Obviously I don't agree with everything he believes, but he is putting himself in the crosshairs of some very low-brow people (figuratively speaking. well hopefully figuratively speaking) by calling out what is going on.",
         "It was pretty obvious he meant war.  As older folks say, “she should strap on some combat boots”.",
         "[deleted]",
         "Lol the same people who justify weaponizing the justice system, election cheating, and assassinations to stop “literal Hitler,” lying doesn’t even register on the scale for them.\n\nIn their twisted perspective they actually think they are doing the moral thing and are “on the right side of history.”",
         "He's trying to talk sense into them, in theory, but he's still voting for them. What weight do his words hold if the recipients know he'll fall in line anyway?",
         "And yet even while calling them out he won't (at least avowedly) vote for Trump, so he gets what he F'n deserves. \n\nUnless he's voting third party in which case you know what, I'll take a third party vote over a vote for Kamala."
      ]
   },
   "1gjutxp": {
      "title": "Kamala Running Pro-Palestinian Ads In Michigan, Pro-Israel Ads In Pennsylvania",
      "text": "",
      "comments": [
         "Trump campaign should pay to run them in the opposite place.",
         "No way they are that dumb. Trump needs to run with these ads and run fast.",
         "So that's why she has no stance on that war, she is fighting for both sides."
      ]
   },
   "1gjv2i6": {
      "title": "GET OUT AND VOTE to nullify mail in ballots for the sake of the country",
      "text": "I remember 2020. A lot of people were confused about the sudden surge of mail in ballots. Im sure there were people here who were upset and believed that the election was rigged. Personally, i feel that it wasnt. We got out voted. It was COVID, Trump didnt deal with it very well, out we went.\n\nNow, we must go out in droves. Droves so big that no mail in ballots can overturn the red wave. That even when the mail in ballots are counted, it cant overturn the huge ED advantage. This is our moment . Get out and vote\n\n\nDream scenario: Michigan says that they will get a result by 11. Georgia and NC promises to count votes quicker.\n\nImagine if we win GA NC and MI. We dont even need to wait for the Snails in NV, PA and esp WI. The race could be over by 12 am for the first time in forever because AZ will def be red if those three states flip. \n",
      "comments": [
         "PA will be done Wednesday, even Shapiro said so. They’re not taking breaks from counting anymore.",
         "NO FAT ASS HARRY'S ..Get off the couch, chair whatever and go to your polling location early to VOTE! \n\nLIVES ARE COUNTING ON YOU!",
         "I'm one of those who think it was rigged.",
         "To the Liberals, what the fuck is Harris going to do about abortion as well? Why would you vote Harris to “save abortion”? \n\nIf she were so serious about it, she would get Biden to sign executive orders to protect your rights, instead of trying to pass some bills only to get it clotured. Shes not serious about it. Tell me what Harris is GOING to actually do about abortion.",
         "There was clearly situations where thousands of votes were illegally counted in many places all across the nation. Whether or not it tipped the scales nationally is unknown, but in state and local elections it certainly did, especially in places where the margin was a few hundred or a thousand votes. \n\nIn combination with that,  and the democrats penchant for getting out the vote way better than conservatives we lost. \n\nThe right thinks that the civil duty to vote is all it takes to get support. The truth is we fail at every other measure of getting votes. (legal or otherwise) This is election is an anomaly, and the GOP will quickly forget just why numbers are high.",
         "You mean no highjacked trucks from NY to PA this time? \n\nI'm shocked ..but USPS could be up to some shenanigans...count on it.",
         "Hope Shapiro is right, but Michigan specifically said 11pm Tuesday. Will be quite nice for the election to be called so early that Harris campaign chair cant pull a John Podesta.",
         "They had operatives in a couple precincts in swing states in 2020. \n\nThey waited until other precincts were done counting and kicked everyone out. \n\nThen they took out boxes of “mail in ballots” and they scanned in enough of them to take the lead. \n\nThis is why we saw several states with the blue vote tally line where both lines had a clear trend, but the blue line has a vertical spike in it where it leapfrogs the red line. \n\nIt was obvious. And they got away with it."
      ]
   },
   "1gjrt7x": {
      "title": "Trump Promises Tariffs On All Products From Mexico Until It Curbs Flow Of Migrants Into U.S.",
      "text": "",
      "comments": [
         "Watch Mexico solve the problem in 24 hours",
         "….good",
         "Tariffs can be a very effective tool.",
         "Mexico has no political motivation to curb illegal migration through their country. Welp, then give them some motivation.",
         "Trump plays cards with a winning hand",
         "He’s pushing the aggressive tariffs plan to use as a bargaining chip. "
      ]
   },
   "1gju6pv": {
      "title": "On the Denver ballot",
      "text": "What are we doing? Citizenship is slowly becoming useless ",
      "comments": [
         "Does Denver have so many Hispanics that the ballot is also in Spanish? I'm in San Diego and my ballot was only in English",
         "😂😂😂 so fucking PATHETIC",
         "For firefighters, I’m open to discussion as legal immigrants could use the civil service of firefighting as a provisional employee as a means to gain citizenship. But anything law enforcement related should be off the table. That’s insane.",
         "That’s interesting. I’m a volunteer firemen and we’re always open to anyone as long as we give you a background check.",
         "Lowered expectations…. Wonder why they can’t find competent Americans…",
         "Any government jobs should only be held by citizens of the United States. Absolutely insane that this might pass.",
         "This is fking crazy",
         "Considering your ballot is in the language of the invaders, you might have already lost so good luck voting against that.",
         "I saw this as well and thought it was absolutely insane. Had to read it a few times because it's such a dumb idea especially for any law enforcement, was shocked to see something like this",
         "Yeah it’s a fucking joke. Not even sure how it ended up on the ballot",
         "So I’ve served with maybe a dozen guys who got their citizenship through military service. I respect that. Move to America and earn your citizenship by serving the country. \n\nIf Denver, or other cities and states, did something like this as a pathway to citizenship for legal immigrants I would absolutely support it.",
         "Holy fuck",
         "There's an issue with foreigners enforcing laws against American citizens on American soil. We fought a war and founded a country to stop that from happening.",
         "Knowing how much Denver likes to fuck everything up I’m guessing this will pass. 😂",
         "They do now",
         "My absentee ballot from Pennsylvania had a link to access a Chinese translation -.-",
         "Fire fighters are government employees with pensions and additional benefits paid for by our taxes. That should be limited to US citizens.\n\nI agree with Starship Troopers on this one: the only civil service that should be on the table to gain citizenship is military service. If you take an oath to defend the country against all foes foreign and domestic, and actually walk-the-walk, then after 4 years you should be granted citizenship. (assuming you're a legal immigrant to begin with)",
         "They are full time government employees, not volunteers. That means taxpayer funded pensions  insurance and other benefits. ",
         "Probably cause no one wants to sit through the forced woke re-education programs government employees have to endure now.",
         "My thought exactly.",
         "I see a big difference between cops and fire.  Cops, citizens only seems obvious.   I can't understand why a legal resident couldn't be a fire fighter even if it is a government job.  If they're here legally,  allowed to work, qualified and pass a background check who cares?",
         "Except that wasn't true in Starship Troopers:\n\n\n\n> The Federation makes the opportunity of Federal Service open to everyone, able-bodied or not. A doctor giving a medical examination says \"if you came in here in a wheelchair and blind in both eyes and were silly enough to insist on enrolling, they would find you something silly to match. Counting the fuzz on a caterpillar by touch, maybe.\" The only impediment that can render one ineligible for federal service is if a psychiatrist determines that one cannot understand the oath of service"
      ]
   },
   "1gjd9v7": {
      "title": "A majority of Democrat voters only care about “reproductive rights” but now it’s a state level issue - so they’re voting for nothing",
      "text": "Leave it to voters only concerned about abortion to have no idea about the difference between state and federal laws. They also have no idea about the difference between the branches of government. Kamala can’t do anything about abortion. Congrats Democrats, you’re voting for a bad economy, and bad foreign policy, for no change to abortion 👍🏻 ",
      "comments": [
         "Ya know I am of the opinion that Government should have absolutely ZERO say over anything remotely to do with body autonomy. I understand theres a bit more of a moral issue than they way I put it but its not for the government to make a decision based on Morality arguments.",
         "Unless they get the house and senate in which case they will try to pass it, have it struck down by SCOTUS, which they will then use as a reason to pack the court with additional justices. Then they can pass whatever abortion law they want. \n\nDo NOT get complacent. The only reason the court wasn’t packed earlier was because of moderates like Sinema and Manchin. If the democrats ever get to 56 or so seats along with house control they will add dc and Puerto Rico as states, and pack the courts.",
         "Remember safe legal, and rare?",
         "It's really no different then pro-life conservatives still being a single issue vote for this same reason, hoping to make a federal law banning it.",
         "We see that in the ads against Bernie Moreno here in Ohio.  They're \"scare ads\" saying that if Bernie gets into office, there will be a 100% national abortion ban with no exceptions.  I actually don't know if Bernie would support such a ban or not, but it doesn't matter - even if he does, he would need 59 more Senators to beat the filibuster, plus the House, and a President to sign it.  Trump and Vance unequivocally state they wouldn't sign such a law.  Frankly I don't see any subsequent Republican President doing so either.  So the ads are completely detached from reality.",
         "No one is more tortured than a liberal white woman complaining about abortion laws in a state she doesn't live in.",
         "To me, it's crazy that this is the number one reason to vote Blue for many women. There are are so many problems in the USA, the world is burning,  and all they care about is their \"rights\".  Yes, I'm a woman.",
         "It’s sad there’s nothing Harris if she won can do the SCOTUS will slap it down they’ll never get the Congress to agree.\n\nAlso more abortion now post Dobs than before so wtf.",
         "Hopefully the response to overturning Roe has not come as a surprise to anyone",
         "if you really want to see their little heads explode point out the the amount of abortions in this country has actually INCREASED since the Dobbs decision.",
         "The same people who would love the federal govt to set the rules for all states on abortion would absolutely shit themselves if the same govt set positive rules for all states for assault weapons.",
         "R v W is a huge nothing burger.....abortion is not illegal and people can still gain access....that Dems believe otherwise is just dog whistle politics at its worst.",
         "My fiancee and I have been talking about this. Half the country is ready to make us as weak as ever on the world stage if Kamala wins just over abortion. Putin and Xi and others will do whatever they want even more so with Kamala at the helm.",
         "People who are pro-choice often struggle to convince others of their position and instead turn to the government to enforce their views, rather than engaging in open dialogue to persuade others. This approach can undermine the relationship between individuals and the government and them.",
         "Not only is it a state-level issue, but it's a lie.  Trump has stated that he will not pass an abortion ban.  It's like the national sales tax.",
         "The only cases that really trip me up are cases with twins. There are circumstances where one twin has a condition and is greatly impacting the ability of the other to survive. What do we do in that situation. \n\nThis is my issue with the abortion topic. If you ask a simple question trying to get clarity you get jumped by both sides. Especially as a non-religous person just trying to learn. The left calls you a Theocratic Facist, and The far religous right calls you a baby killer.",
         "Trump explained that day 1.\n\n*Blue no matter who* people don’t listen to both sides of debates. They just allow news media to brainwash them and stay cozy inside their echo chambers.",
         "All it would take to stop them is for the rest of the party to adopt Trump's popular, moderate stance on abortion, but too many refuse. If we lose, we've got no one to blame but hard line pro-lifers.",
         "BUT you will see commercials by the left excoriating candidates for US congress/senate as those that are BAnNiNg AborTioN in xxxx StAte.  These people know that those on the left has no clue how govt is even run so they can snow them into thinking that a US representative/senator has any sayso in their state legislature.",
         "Unfortunately liberal women are some of the most selfish and coniving individuals.\n\nThey are really voting for a female president regardless of how awful and annoying she is",
         "Nah democrats believe one rule coming down from the federal government is how legislation should be. States rights allows for difference of policy and that goes against what they believe.",
         "Democrats don’t like federalism. They don’t want to imagine that some states might choose a way of life they disagree with.",
         "Nobody here is accusing Liberals/Democrats of being very smart",
         "Serious question, but wouldn’t invoking a federal law for women’s rights to their bodies affect selective service? \n\nGovt passes a law giving women rights first their bodies, eligible draft men and women take a look at that law and say if women have that right, why does the government get any say in getting drafted for war? \n\nLawsuit gets opened. Federal government can’t draft anymore.",
         "They want to pack the supreme court with leftist who'll ignore the constitution.",
         "Every person I talk to that early voter for Harris did so because of abortion and not a single one, not one, could tell me what our current state law is or how Trump proposed to change it.  It's mot an insignificant number either, part of my job is to converse with people and politics often comes up. The ignorant may very well swing this election for Harris.",
         "The long con here is to get the fed gov't blue, replace multiple justices, and establish something ironclad that enshrines abortion as a right.",
         "Let me preface this by saying I'm pro choice. I think you've jumped the shark on this one, though.\n\n> its not for the government to make a decision based on Morality arguments\n\nDo you think the government shouldn't make murder illegal because it's a morality argument? Because that's what the anti abortion argument is. It's an argument against murdering babies, not removing a body part.",
         "I agree that's why abortion is bad because you're interfering with the baby's bodily autonomy.",
         "So are you good with abortions for any reason, through the entire course of pregnancy?",
         "Ummm, in the write-up on the overturning of Roe, the basis of the overturn was due to the fact that abortion rights were only held through court decision instead of codification. SCOTUS mentioned that it wasn't the place of the Supreme Court to create law through decision. So, therefore, the decision is overturned and placed in the hands of the States. Now, if Congress codifies abortion rights, then there is no issue with SCOTUS.\n\nSo, what makes you think they'd overturn it if the codification doesn't violate the Constitution?",
         "Ummm, in the write-up on the overturning of Roe, the basis of the overturn was due to the fact that abortion rights were only held through court decision instead of codification. SCOTUS mentioned that it wasn't the place of the Supreme Court to create law through decision. So, therefore, the decision is overturned and placed in the hands of the States. Now, if Congress codifies abortion rights, then there is no issue with SCOTUS.\n\nSo, what makes you think they'd overturn it if the codification doesn't violate the Constitution?",
         "Just curious wouldn't it take a Constitutional amendment to make it possible for DC to be made into a state? Doesn't the Constitution establish the Federal capital as a \"neutral\" area outside of state control?",
         "The economy at the household level is shit, but damn let’s go get an abortion.  The leftist logic is astounding.",
         "Whoever wins this election, I think, will be replacing at least 2 justices.",
         "It’s crazy that people are voting for all of that just for “unlimited abortion” when every state has all the exceptions and most have MONTHS for just elective abortion. Probably time for those kinds of people to care about the other 1,000 issues at this point.",
         "They'd only need a simple majority in both houses of Congress and the White House, assuming they all voted together, to pass legislation suspending the filibuster. Once they do that they could codify Roe and restucture SCOTUS or most anything else they want to. Eliminating the SCOTUS majority would prevent them from striking down anything on the Dems' legislative wish list.\n\nDown ballot races are almost as critical as the Presidency itself. Vote straight ticket R.",
         "Pepperidge Farm remembers",
         "\"Don't worry we're not going to do it bad way, we're only going to do it good way.\" -the basic political promise template.",
         "Any time I pass by a turned-on TV I notice the media has become outright cartoonish these days. Seeing what calls itself the news these days is like seeing an overacted soap opera from the 20th century.",
         "Every anti Bernie Moreno ad I see on Facebook or Instagram has comments in full support of him, same with the weird peer pressure ads where they say you can see who didn’t vote",
         "I am pro life but at the same time, we need to make sure that protections are in place for when abortions are medically necessary.  I also extend the clause for the health of the mother to include her mental health.  If she is very likely going to harm herself or her child, it is better to terminate the pregnancy early on and seek therapy for her.\n\nSterilization services should also be more readily available for those of sound mental health to choose them.  I am happy with the two children I have and do not want any more.  If I were to get pregnant again, I would not be quite as happy about having to start all over.  However, it can be very difficult for women of childbearing age to receive these services even if they are very much wanted.",
         "I’m a woman too and I don’t get it. \n\nCereal is $7 a box, my healthcare sucks, and illegal immigrants are pouring over the border unchecked but their number one issue is whether they can murder their fetus if they want to.\n\nI am so sick of hearing Kamala drone on that Trump will enact a national abortion ban. It is now left up to the states. Anyone with a brain can see that. So no, he’s not going to do that. Do you want an abortion and live in a red state? Great, drive to Oregon.",
         "Also a woman here, and it’s SO frustrating to hear other women make abortion their number one priority. It’s also frustrating that they all think that Trump wants to ban it. He said on JRE, he thinks women should have longer than six weeks to make a decision. That doesn’t sound like an extreme right view to me.",
         "It's television.\n\nIt's theatrical drama tied to whatever issues TV companies want people to care about, plus mentioning something 100 times in a day to make people feel like *it legitimately came up* 100 times instead of just being the topic of prolonged brute force nagging.\n\nTV is the source of people not caring about what matters while they obsess over what doesn't matter. It's videogames for people who can't stand to do anything with their hands.",
         "It's because a large percentage of women think emotionally instead of logically. And democrat propaganda directly targets an emotional response.",
         "In principal, I agree with a woman being in control of her own body. That being said she also chooses to have sex. She also chooses to have sex without birth control. That's a choice.\n\nA bad economy, bad border policies, and bad foreign policies affect everyone including all women. The last four years have been a disaster with this administration. This country can't afford four more. I'll choose the latter every time.",
         "They eat up the BS the media spews about Trump then repeat it as gospel fact while those of us who know it’s BS can’t do a thing because they just keep yelling the BS louder and louder. Like a child with their fingers in their ears screaming “I CANT HEAR YOU”. \n\nThe fact that it was the proper thing to make it a states issue and that decision has zero to do with the actual issue is irrelevant to them.  They’re going to scream like children who aren’t getting a happy meal (which are unaffordable now ironically).  Dems hate it because it’s their issue du jure they can trot out every time they need a few votes.  \n\nAt least I saw some libs even that chunk yogurt guy calling out the BS for the Liz Cheney comments. Was surprising.",
         "Shouldn't doctors be able to save a woman's life if it's in danger from pregnancy complications regardless of what state they live in? Or why should only blue states allowed to save the mother's life? The US already has one of the worst maternal death rates out of the developed world, we should be focusing on making it better, not worse.",
         "It's because there is no moral way to argue the position. The more people think about abortion, the more clear it becomes that it is incredibly evil. It's why they don't even call it abortion anymore. \"Reproductive rights\" sounds nicer. When Dems start losing the argument, they pivot the language. Illegal aliens become asylum seekers. Affirmative action becomes DEI. Raising taxes becomes making the rich pay their fair share. Gun grabbing becomes common sense gun laws. The list goes on and on.",
         "Ironically, a Harris win will set women back decades in terms of political appeal. She is completely unlikeable along with being dumber than a bag of hammers. Her administration will be such an unmitigated disaster that it'll be a very long time before anyone wants another woman as President.",
         "[deleted]",
         "I kinda worded that poorly I meant more that in the sense of finding a limit for abortion they dont need to waste time on the morality debate that exists amongst the people just find a good limit and stick too it. Sure some people won't like it but thats what compromise is.",
         "Excellent and succinct!  💯",
         "No Im saying the government doesnt need to worry about a moral debate around a limit. Pick a reasonable time limit and stick to it. Well I say the government I mean state governments federal stays out of it entirely.",
         "The federal capitol is supposed to be a neutral area. The federal capitol is also supposed to be just for the federal offices. There were never any intentions that permanent residences would exist in the district, which do now. The present idea is to designate the residential parts of the city (which many make quick note to be more populated than the state of Wyoming) as a legislative district with its own representatives and senators. A concurrent idea, unpopular for reasons that nobody cares to mention (sarcastic tongue-in-cheek,) is to have the residential parts of the city assigned to the legislative districts that they would have been in if they were still in Virginia or Maryland and representation be reevaluated accordingly.",
         "Not if they have a court that says it doesn’t",
         "I think there is room for both ideas. Balance bodily autonomy with life as a gift.  Ban elective late term abortions.   Make early term/pill based, and any time there’s risk for the mother, rape/incest/whatever accessible to women who want those options. Stop making tax payers fund them. Household economics suck, why would we want to force poor people to have more babies when those babies won’t be well cared for?\n\nI’m voting for Trump btw and am generally pro life, but realize there needs to be balance because there is demand for a product, and I’d rather have the product be safe, legal and regulated than dangerous and illegal.",
         "Most of these fuckwits rely on government handouts to get by anyway, so the economy being in shambles is a lower priority for them.",
         "I have abortions about 5 times a week. I only go to the grocery store once about every 10 years. \n\n#LiberalLogic",
         "If Trump wins I really really want Thomas to retire. He’s getting up there in age.",
         "It’s not about the actual issue anymore…you know that.  It’s about “winning” the point at any cost.  \n\nThey don’t look at the strike down of Roe v. Wade with some kind of constitutional or moral perspective.  They view it as “we lost the game.”  The issue isn’t personally important or relevant to 98% of the people arguing for it, they just want their opponent to “lose”. Period.",
         "It’s not about logic or actual issues, it’s only about using emotion for control.",
         "Actually, it would only take a simple majority in the senate to suspend the filibuster.  It's already happened in cases of presidential appointments.  The 60 votes to end debate on a bill is a self-imposed senate rule.",
         "LOL!",
         "Another weird anti-Bernie ad is the one where they ominously declare that he...own rental properties! Oh my the horror!  Now the ad is phrased in a way that implies he's somehow taking advantage of his renters, but yet doesn't come out and say so directly (I assume because it's not true, or else they would).  \n\nI know there are those on the left who have an irrational inherent rage against landlords, but I'd assume those people are already going to vote for Brown.  (There are shitty landlords of course, but that's true in every walk of life - good, bad, and neutral people).",
         "He wanted to see RvW overturned and get the federal government OUT of the abortion issue. Now that he accomplished that, he wants to get the federal government BACK INTO the issue for a national ban?!? Add to that, they think somehow he'll be able to get it passed through the house *and* the senate in order to become law. Like how? None of them can answer how Trump would be able to do all the dictator-esque things they claim he'll do. They think all levels of government including military and police will just magically fall in step doing everything he commands. As if he would even command shit like that if he could. Morons.",
         "Yeah, it's a clear lie. Trump doesn't want a national abortion ban. He was even squemish about coming out against abortion in his own state of Florida. Personally, a national ban is what I want. But Trump very clearly doesn't.",
         "You aren’t wrong, but there are states that have no exception for rape.  It is a lot harder to defend that.  \n\nMost importantly though, abortion is not and should not be a federal issue.  There is no constitutional justification for it.",
         "This was the same reason why RvW persisted until Trump showed up.\n\nYester-gen GOP didn't fight, they just had a handshake for every occasion. Seeing the rage explosion that happened the moment Trump started getting ahead in the primaries *in 2015* showed us the opposing force had finally arrived.",
         "Who decides what a \"reasonable\" time limit is?  And what if a life and death issue of the mother arises outside of that time limit?",
         "The latter concept seems more like what was intended.",
         "That would mean the court can't/won't read the Constitution.",
         "I agree with this. I am moderate when it comes to abortion and think there just needs to be common sense applied to it. I am baffled by the lefts obsession with it and that they choose that hill to die on but I think conservative policy on abortion should be more middle ground. I think conservatives would take all the moderate vote and right leaning Dems if this simple principle was applied.",
         "\"Safe, legal, and rare.\"",
         "It’s gonna be so sad though, Thomas is the absolute GOAT",
         "Is he the oldest? I'm embarrassed I have to ask.",
         "One hundred percent and it’s not even about Trump anymore as well. The next Republican that is up for President will be labeled fascist, racist, etc. It’s going to be a never ending cycle.",
         "You're right. I got ahead of myself a little bit.",
         "> a national ban is what I want.\n\nI guarantee most republican voters do not want that. While none of us like what an abortion actually does, they are an unfortunate necessary evil. A compromise absolutely needs to happen to end this once and for all, a small set window of opportunity and exemptions for reasons we can agree on. Also part of what's needed in this same conversation is overhauling the adoption process, make it easier and cheaper while maintaining safety vetting processes. There are couples that go on waiting lists to adopt a baby. While I wish they'd also consider fostering/adopting anniversary child, at least they are taking an unwanted baby.",
         ">The latter concept seems more like what was intended.\n\nThe rebuttal question would be, \"Intended by whom?\" The former concept is currently highly popular because the city would then have two senators and one representative, voted from the populace of the City of Washington DC, whereas if the city was assigned into the existing districts no additional senators would be appointed and possibly only one additional representative, likely not from the city populace, would be appointed.\n\nThe battle cry is that the people of the city deserve representation (which they should in fact have) but the underlying intention is that the interested parties want the two senators and the representative *elected from the populace of the city and therefore with their liberal ideologies and leanings* adding their votes to the liberal voice of the federal legislature. The unrepresented people of the city would be greatly ignored by their current supporters if they leaned conservative and, if anything, the latter concept would be put in place, certainly ~~gerrymandering~~ melting them into a liberal legislative district.",
         "Ok, you mean like they didn’t when they made the Roe decision? Or the 4 justices in Heller that said there was no right to private firearm ownership?",
         "You should listen to some Sotomayor interviews. It’s like she doesn’t have any background or qualifications, she’s just on the court.",
         "Taking that approach, and repeating the same line, isn’t going to make any progress or win over anybody. \n\nIf you want the republican and conservative parties to die on the pro-life hill, that’s the choice you’re making. \n\nI do not care if it’s rare. I think that accepting some elective abortions is going to have to be the compromise we reach in order to move forward.",
         "Clinton was playing the safe centrist on that.  His party generally was more to the left as I recall.",
         "How far the left has gone since Clinton.",
         "Oh well, I don’t want us getting a Ginsburg situation where our favorite justice stays on long past when they should’ve left and dies with a dem president in office with a dem senate.",
         "Of the conservatives yeah. It’s unfortunate but let’s get a young person in there who will be a reliable R Vote for 30-40 years. Thomas has done his part",
         "I 100% agree with both of you. It's just about winning and they portrayed DeSantis the same way as they do Trump, applied all the same labels to him. It's what they do, and what they're always going to do.",
         "So far, during my lifetime, the only Republican candidate for president they haven’t called a fascist was McCain.",
         "I definitely agree. I don’t think Republicans should die on this hill, especially when the country is facing a bunch of other crises. I’d really like to see the GOP tackle economic reform - aimed at families - to make it easier for people to have and raise children.",
         "Oh I agree, I think Thomas should retire, but it will be a sad time."
      ]
   },
   "1gjgbl3": {
      "title": "Sad: Thousands Of Women Left Standing Clueless In Voting Booths After Husbands Fail To Tell Them Who To Vote For",
      "text": "",
      "comments": [
         "Ever notice how the Dems talk like 1930s cartoon bigots *habitually* now?",
         "Not me. Straight Republican all the way down the ticket. And I didn’t even need my husband to tell me, although he will also be doing the same ✅",
         "Itsa good thing the left is here to help all those women.",
         "Pretty sure I care way more about politics than my husband. \nAlso, I’m pretty sure his response to me saying I voted for Harris would be, “ok.” \nDo the left view marriages like partnerships between like minded people or do they think we’re all subservient housemaids?",
         "When woman on the left forget how Joy Behar and Stacy Abrams told them to vote, they are clueless and need the string mind of a conservative male to guide them",
         "What is this referencing? Did people say women aren’t smart enough to vote on their own?",
         "Not me. Straight Republican all the way down the ticket. And I didn’t even need my husband to tell me, although he will also be doing the same ✅",
         "Not me. Straight Republican all the way down the ticket. And I didn’t even need my husband to tell me, although he will also be doing the same ✅",
         "Not me. Straight Republican all the way down the ticket. And I didn’t even need my husband to tell me, although he will also be doing the same ✅",
         "The left was running ad's basically telling women to secretly vote for Kamala and \"not tell their husbands\", as if women have no agency and just vote for whoever their husband tells them to."
      ]
   },
   "1gjs0rp": {
      "title": "Here Are The Things Kamala Has Supported In The Past But Won’t Say If She Supports Now",
      "text": "",
      "comments": [
         "She travelled the country. Now that's why she has flip flopped",
         "What she has demonstrated is what she will do. What she says is simply what she says.\n\nDoes she still copy Trump's tax proposal? That was a thing at one point, I don't know if it's a thing anymore.",
         "She just saying whatever her handlers tell her to say that they think give her the best chance of getting elected. But remember, her values haven't changed. She's told us as much.",
         "I have to give her credit. She managed to say nothing her entire campaign.",
         "We need to elect her to find out what's in her",
         "Yeah even John Kerry is impressed with her flip-flopping",
         "I think we already know"
      ]
   },
   "1gjgxa2": {
      "title": "Kamala's Closing Argument Includes Communist Price Controls",
      "text": "",
      "comments": [
         "Normal person: \"but won't all these forced higher wages lead to higher prices?\"\n\nDemocrat: \"we'll just decide their prices FOR them!!\"\n\nThe left is voting for poverty.",
         "Communists failed in the past. And communists will fail again.",
         "the sad thing here is this election is built on emotion, NOT logic...people will vote her in thinking peace for all, wealth for all...while the country spirals into a welfare haven for 'newcommers' to live tax free off of YOUR taxes while prices rise...",
         "Bad ideas like that keep spreading because they're persuasive.\n\nIf the evidence (every single time it's been tried) isn't enough to convince them, then people will keep trying until communist is just as verboten a word as fascist.",
         "Last quarter King Soopers' Profit Margin was 1.37%.    Those  greedy bastards.  Thank God for Kamala's plan.",
         "I can't believe her team still thinks that is a good idea.  It just shows how unfit she and her team of handlers are to govern anything.  They have no idea how things really work.",
         "Unreal how some \"conservatives\" will sit this one out (or vote for Kamala) in the face of this",
         "If Kamala wins the good news is a dozen eggs will be priced at $1.50. The bad news will be that there are no eggs available anywhere.",
         "Strong cult-like responses to Kamala in Charlotte, NC...\n\nBut only Trump supporters are cultists, right??? /s\n\nhttps://www.youtube.com/watch?v=jll6uGtzCtY",
         "\n\n@KamalaHarris\n\n**“I will lower the cost of everyday essentials for families and pass the first-ever ban on corporate price gouging on food and groceries”**\n\nNo you won’t, because there isn’t enough margin in the first place you fucking dimwit lady. \n\nHad this argument with a left of center friend.     \nHim:   “Grocery stores are PRICE GOUGING!!!”    \nMe:  “Google grocery store, average profit margin”    \nGoogle result:  “Between between 1% and 3%“   \nHim:  “Oh… Well, shit then”",
         "That's always worked so well when others have tried it.../s",
         "Hey at least everybody will be equal! (equally broke)",
         "I worked in grocery as a kid, and some of the managers were kind enough to explain the economics of the business. Sure the mark-up on a can of peas was 30%, and liberals of that day would fume about it, but the actual profit was only 1-2%. Imagine the utilities alone to heat and cool a giant building, plus run 30' long banks of refrigerators and freezers. The business next door, a Super Kmart was paying $20,000 month just for electric.",
         "Holy she is fake as hell. Who falls for this? Cringe.",
         ">Him: “Oh… Well, shit then” \n\nHe's head and shoulders above the modern average if he noticed the facts instead of digging deeper and raising his voice louder.",
         "Well no. The \"leadership\" won't be.",
         "Exactly this.   Kroger's gross was about 22.5%.   Net profit (gross profit - expenses and taxes,) drops to the 1.37 figure.   So we know the cost to run the business and taxes are huge.   Need to lower taxes , wages and energy prices to reduce pain at the supermarket.",
         "Really he doesn’t try to debate politics with me.  Firstly because like so many folks, he can’t just discuss, he gets all riled up and mad.  I LOVE to discuss or debate politics when somebody can keep it on a more pragmatic, intellectually distanced from emotion level.   And secondly because he’s ill informed and I have an easy time puncturing the unicorn balloons he falls for.",
         "All animals are equal, but some animals are more equal than others. Orwell.",
         "Democrats can only argue emotionally and not rationally.  Probably their low testosterone i think. "
      ]
   },
   "1gjk1fn": {
      "title": "How SNL’s Pro-Kamala Stunt Just Backfired Bigly",
      "text": "",
      "comments": [
         "\"Trump landed a spot during Sunday Night Football, reaching far more viewers\"",
         "I wish he used one of his good ads instead of the statement, but a win is a win i guess",
         "Everything the democrats touch turns to shit.  Yet people still vote for them.",
         "When they talk trash, we put on orange vests.\n\nWhen they cook fiction fries, we cook real fries.",
         "Bigly like my big big vote",
         "Try posting this is r/Whatcouldgowrong \n\nLOL",
         "I've been waitin' all day for Tuesday night.",
         "Its pretty on brand for the harris campaign to be so out of touch that they do not realize that SNL has not been relevant since the 90s. \n\nI mean she drudged up that molly shannon character that nobody over 35 has thought about in two decades and nobody under 35 recognized at all.",
         "The statement was really good it spoke directly to the people. The ads are great too though. Honestly most amazing ads I've ever seen for a candidate and Kamala has the worst ads I've ever seen. Even they have to see the contrast it's just so self evident.\n\nSaw a post on an X thread for this that [showed a new ad](https://x.com/Honingbiene/status/1853302789713043586). I don't understand how anyone can vote against this ticket. They'd have to be self destructive.",
         "Remember when we called them freedom fries? \n\nNow they’re Trump’s Freedom Fries.",
         "And even though I did recognize it I felt like it was cringy",
         "That is a great ad."
      ]
   },
   "1gju8fu": {
      "title": "Elon Musk Predicts ‘Crushing Defeat’ For ‘The Kamala Puppet’",
      "text": "",
      "comments": [
         "Kamala is still a lifetime member of the gluck gluck club. They can never take that away from her. ",
         "Watching his interview with Joe Rogan currently. Very interesting",
         "Fucking hope so."
      ]
   },
   "1gjr2cf": {
      "title": "NY Assemblyman introduces ‘Peanut’s Law’ to safeguard sanctuary animals from undue harm",
      "text": "",
      "comments": [
         "I still can't believe how horrible that whole situation is. Government over-reach at its worst.",
         "🌰Out 4️⃣ 🥜",
         "I know did the guy not even get due process ? because if the seizes property you’re supposed to get due process"
      ]
   },
   "1gjts6t": {
      "title": "😂🇺🇸",
      "text": "",
      "comments": [
         "He just looks sickly, she has not aged well. Both still think they’re relevant on the political stage.",
         "Bill looks like he’s slowly turning into a variant zombie and killary looks like she’s escalating her empress-wannabe cosplay.",
         "They need some orange spray tan.",
         "Which is which?? 😂"
      ]
   },
   "1gjd7by": {
      "title": "Kamala's campaign has to be the fakest of all time",
      "text": "",
      "comments": [
         "Everything about her just seems so disingenuous ",
         "They had plenty of scripting practice over the past 4 years trying to hide Biden's dementia.",
         "Literally a billion dollars in media fluff and she's allegedly tied with Trump.",
         "Imagine what future campaigns will look like if she wins this.",
         "If she wins, the 5-6 elites that control the mainstream media officially have this entire country by the nuts.",
         "Maybe 1 or 2 unscripted moments in months.",
         "It was a big mistake to go completely Trump negative.",
         "And it's not just her campaign that's fake...",
         "Not nearly as fake as here marriage though. I just saw a portion of an interview with him today and holy cow this guy isn't really into girls.",
         "It's like the Grammies or American Music awards of Politics. Or, if you want to go the other route, Ringling Brothers Barnum and Bailey.",
         "Because it’s so obvious, she’s such a bad politician. Absolutely insane a little hawk tuah and DEI could get anyone so incompetent and unlikable so far in politics. \n\nEven CNN called her out.. that’s when you know it’s bad. \n\nshe tells Jews in PA she will defend Israel’s right to defend itself, then tells terrorist supporters she will end the GeNoCiDe. Luckily the internet exists and anyone with an above room-temp IQ can see right through it.",
         "Everything about the entire political left is disingenuous, I don't even think they know what they actually support in private anymore",
         "What really does it are the fake accents.  She's literally an actress playing whatever character she thinks will sell best to a given audience.",
         "Exactly, the same people who have been running the county for the past 4 years want to keep their power. \n\nDifferent ticket, same shtick.",
         "no campaigns.  Just two CIA approved candidates like the aliens in Simpsons.",
         "That's because she comes across as incoherent.",
         "but that is ALL the have.  Not a single sellable policy.  I guess Abortion is their best shot, but Trump has no plans to change anything about the state policies so they had really nothing but smears and fear.",
         "Yeah. Trump-negative only worked in 2020 because Trump was actually in charge. \n\nIt failed in 2016 and it's failing now, because you can no longer pretend like he's the problem.",
         "Apparently Willie got the real thing.  She could have campaigned with Monica Lewinsky.  😂",
         "You’re assuming most blue voters care though.  She goes from last in her states primary to neck and neck in the general election.",
         "That type of thing happening is why the Party's apparatchiks and elites want \"better control\" over the dissemination of information. Remember that during this election cycle Comrade Mika on MSNBC said that \"they\" formerly were the ones telling the normals/serfs what to think. The Party wants a return to that level of control.",
         "What's most scary about it is that it demonstrates the power of the Democrat-MSM machine. They have the ability to prop up a soulless shell of a candidate into having a 50:50 chance at winning the highest office in the country.",
         "People who think there is going to be a difference between a Biden administration and a Harris administration might be missing a chromosome.",
         "Also disingenuous, shrill.",
         "Incredible though inn’t?",
         "They should take their own candidate's word for it: she can't think of anything she would have done different than Biden.",
         "Also underprepared and incompetent."
      ]
   },
   "1gjs1g0": {
      "title": "GOP Chairman Announces ‘Huge Election Integrity Victory’ In Georgia",
      "text": "",
      "comments": []
   },
   "1gjtdpc": {
      "title": "Can't wait until tomorrow ",
      "text": "The meltdowns will be epic. Don't forget to stock up on popcorn ",
      "comments": [
         "#praying",
         "Let's hope we don't have to wait a week for them to \"Count the Votes\"",
         "I'll be happy either way. If he loses then everyone on the left will finally SHUT UP. \n\nIf he wins, I get the heartbroken, tear lined faces of over emotional, hysterical feminists and beta males as an early Christmas present.",
         "\"If you don't learn from history, you're doomed to repeat it.\"",
         "Bold of you to assume they know how to shut up, lmao. The bots know no bounds",
         "They won't shut up. They will be emboldened, and I guarantee that they will double the lawfare.",
         ">If he loses then everyone on the left will finally SHUT UP.\n\nAnyone that doesn't agree with them becomes hitler. They did it to DeSantis too. There is no end to it."
      ]
   },
   "1gjo2kl": {
      "title": "Biden-Harris Admin Spent $80M To Help Immigrants Bypass Southern Border",
      "text": "",
      "comments": [
         "They could use that money in western North Carolina, Tennessee and Florida where Hurricane Hellene tore those areas apart.",
         "Not to mention Hawaii."
      ]
   },
   "1gju8o4": {
      "title": "Georgia poll worker arrested for making bomb threat against election workers",
      "text": "",
      "comments": [
         "HAHAHAH UP TO 25 YEARS IN PRISON.\n\nThe delusion these people have to throw away their lives because 'oRaNgE mAn BaD'",
         "Way to throw away your life for nothing"
      ]
   }
}