{
   "1gk62p0": {
      "title": "23 Year old Conservative, just voted in PA for Trump.",
      "text": "Got in Line at around 7:05, waited about 30+ minutes, and voted red straight down the ballot. \n\nI have a good feeling about Trump this election.\n\nTime to work out and get the stress out at the gym before work.",
      "comments": [
         "![gif](giphy|hWw8WWjYFhv3XqsgzY)",
         "Good work. I live in Erie and will vote after work due to a polling location SNAFU, but people in my office are saying the polls were jam packed this morning.",
         "Well done lad. Every vote counts.",
         "Good on you, especially in a crucial state like PA. I hope you have 20 friends that you brought with you.",
         "Thank you for your vote and for voting in general.",
         "PA is critical.",
         "I'm in CST. Will be heading to vote after I get off work.\n\nI don't care how long the lines are. I will fill out that ballot today no matter what.",
         "O7",
         "Fighting the good fight. I was in line at 6:10, waited 90 min, was told to do things in an intimidating fashion by someone who was not an election judge before voting straight republican in Chicago.",
         "Thanks for doing your part.",
         "I love hearing about the longer than usual lines!",
         "MAGA",
         "Same here, fellow Gen Z! Got my dad who’s never voted before to come with me and vote red down ballot here in Allegheny County! Got there bright and early, and even then, the line stretched out the door.\n\nTrump 2024!",
         "Welcome to the party!",
         "[removed]",
         "👍",
         "Good job 👍",
         "Hell yeah! I woke up today ready to Make America Great Again!",
         "Thank you!!!",
         "Thank you, brother 😄",
         "Let's go!!!! ",
         "I got in line before 7 AM in northeastern PA. Voted straight Republican on the Dominion machine (which I really like, except for the fact that Democrats were placed in the top position on every ballot choice). I was out 23 minutes after the doors opened. The machine prints your ballot choices out on paper, and that is then scanned into something that looks like a copy machine. That part seems a little convoluted to me. I'm not sure why one machine can't do it all. But I love not having to fill in a circle with a pencil or some old school sheet like that.",
         "LFG!!!!!!!!!!!",
         "Good to hear! Text and remind any Trump-friends to do the same",
         "You PA guys really gotta show up. It’s the key to the presidency.",
         "Show up Pennsylvanians we need you!!",
         "Erie here too. Stopped before work.  Lines were long.  Going after work now.  My 20 year old is voting for the first time and is voting red! Proud momma.",
         "Jam packed in Alabama this morning. I’ve been voting since 2004 and this is the biggest turnout I’ve seen. Huge lines.\n\nHoping and praying that this is a sign that Trump gets a historic turnout today 🙏",
         "Update us when you vote. You are the key!",
         "Unfortunately not. But I did text my 3 old roommates from college and made sure they were set to vote today, they are all voting Trump.",
         "I'm near lancaster city, the line today was longer then I have ever seen.",
         "Thanks although I have been apart of the party since I was 18. Voted for Trump in 2020, unfortunately we know how that went.",
         "For mine i just filled out a ballot with a pen, submitted it into a scanner and it said congrats, and then I left. Did fill out an exit poll survey.",
         "Awesome news!  We need all the help we can get. I’m happily surprised at how many Trump signs are up in and around the city.",
         "It would be amazing if Trump won the popular vote",
         "Good man!",
         "Great work man, every vote counts",
         "Good for you! Follow up with them.",
         "Maybe you can help me with Elon’s petition? DM me on discord",
         "I like the Dominion machine because I can see on a print-out that it recorded my vote correctly. I don't have to worry if I \"filled in the circle\" properly or anything. And pushing the big buttons on the screen is just fun. High-tech is better than ancient low-tech methods!\n\nAn exit poll would be fun. Those are really, really important. They get referred to for years after the fact by pundits, and are examined by the parties to figure out why people voted the way they did. It will definitely have an effect on party policy. So anyone who gets the opportunity should always do an exit poll.",
         "Im sure we will be talking shit about stuff later on in our group chat about Harris."
      ]
   },
   "1gk5suo": {
      "title": "Vote! Make it Too Big To Rig! ",
      "text": "",
      "comments": [
         "Just Voted straight red down the ballot in PA.\n\nI'm a 23 year old Conservative, working out now! Let's go trump.",
         "Stood in line over 3 hours on Sunday to vote. First time voting and even though my county is blue we saw a good amount of Trump support.",
         "I just felt like making a red velvet cake yesterday, but my husband and daughter pointed out I picked the appropriate color. \n\nIf we pull this off, I’m going to make it a tradition!",
         "Oof. Took me 10 minutes just now lol."
      ]
   },
   "1gk1643": {
      "title": "Thus ends the last MAGA rally, get out and VOTE! ",
      "text": "President Trump needs you, needs all of us. Get out and vote people. We cannot have 4 more years of this disastrous administration in office. ",
      "comments": [
         "Just turned 18, first vote",
         "Did my part to try and turn Michigan red. We cannot have 4 more years of Kamala. I know SO MANY people at work voting Trump who voted Biden its crazy. We WILL win.",
         "We really won’t have a country if we don’t vote out Kamala. The reckless border policy will continue and next time there won’t be enough citizen votes to ever oppose the machine. There is no other country left to go to. Vote!!",
         "I'm not even a conservative.  I am a pro-choice, atheist Libertarian.  And I am voting for Trump tomorrow.  I am voting for Trump for two reasons: 1) the Biden/Harris Administration has lorded over the ugliest bastardization and overreach of government in my lifetime 2) Trump has managed to align himself with all the people who I believe will fight against the rot and corruption in DC.  Honestly, I cannot wait to see what existential horror awaits the democrats and the old guard neocons.  I think Trump will be much more of a gentlemen about it than he should be, but I hope he does make the next four years painful for them.  ",
         "Voting for President Trump for the 3rd time in a few hours!",
         "Sucks to see five thirty eight go from Trump to very narrow Kamala win but hoping I wake up to better news tomorrow! Please vote!",
         "Voting tomorrow! (IL)",
         "This will be my first time voting. Getting out of work in a couple of hours, right when the polls open near me.",
         "He needs to win. Show up today and take our country back.",
         "This is the proudest vote I've ever cast.",
         "Voting for 45 for the second time tomorrow \n\nGodspeed Mr. President",
         "Just voted in a deep blue state. Even so, feels great to vote for Trump/Vance.\n\nThose in states that will make a difference, please get out and vote no matter what. Even if you're in a deep blue state go vote and let's pad the general election numbers.",
         "I voted early in NC for trump. Rip peanut",
         "In Ohio, but did my part still.",
         "Did my part and voted early, don't wait till the last minute today people! 4 years of Kamala would make Joe look like child's play; Lets turn #45 into #47!",
         "Was number 10 in line at opening for my district.",
         "If Harris wins we are essentially in a dictatorship. It will be Obamas 4th term. If they can get 4, there is no way they ever relinquish power and it will be 5,6,7, and so on. \n\nHarris winning would mean one of two things:   \n1. The majority of people in the US actually want this, or  \n2. Those in charge can get away with anything, and will continue to do so.",
         "I proudly voted by mail weeks ago.",
         "I've flown my flag upside down ever since they took the mug shot. Hopefully that will change after today.",
         "I’m bartending tonight , outta be fun lol",
         "Yes people we can’t do 4 more years of Harris, Vote TRUMP!!!!",
         "It will NOT be the last MAGA rally, only the last one with Trump at the top of the ticket. MAGA and American First is more than just him now. We are a unified movement. This is not the end, it is only the beginning. \n\nIf we win, we have a deep bench to continue the legacy. \n\nIf we loose, we are a loud and proud movement. Are you going to roll over and take what the deep state tries to dish out? No! I’m not, and we’re strong if we stand together. Our eyes are open, and we’re not going back to sleep. \n\nMAGA for the Future! America First for the Future!",
         "Good luck to all honest agents, both sides",
         "Let’s go!!! High ho silver!\n\nhttps://youtu.be/GqHNZPkl0qE?si=TIAd9dK2hibV5Wqh",
         "Same bro, NC Trump vote here!",
         "I also was able to vote at 18. It was an amazing feeling. We were lucky!",
         "Really wish i could be voting in a swing state... i'm stuck in Washington feeling like my vote is pointless, and all i can do is pray that folks like you get out there and have Trump's back. Thanks for doing your part brother🫡",
         "Was driving through Michigan with family in 2016, en route to Traverse City.  Along the way, we noticed a ton of Trump signs; nary a Hillary sign.  At some point I commented, *\"Call me crazy, but looks like the polls may be wrong.\"*\n\nCouldn't make the trip this year, but the family did.  Asked dad about the signs.  He admitted, *\"Looks like 2016.\"*",
         "Just did my part too",
         "Dixville Notch New Hampshire 50% swing right! From 5-0 dem in 2020 to 3-3 Trump.\n\nhttps://x.com/ericldaugh/status/1853770565791687053?s=46\n\nGo go go!",
         "That’s my thing. We’re different. Your atheist & im Christian. But we can share some similarities, we can be civil. I feel Harris aligned herself with Hollywood celebrities who aren’t remotely affected by inflation. Oh and a list of Diddy party attendees. I’m the same I hope trump unleashes hell on those that went after him. I’ve noticed a demeanor change with him. He seemed to be having fun. Doing things that resonate with the everyday people more.",
         "This will be the third time he has won",
         "So weird to see a steady Trump lead 1-2 weeks ago then many polls giving Harris a slight lead the final few days before the election. I wonder if it’s to bring momentum to the Democrats",
         "Can 538 even be trusted? I’ve been skeptical ever since ABC News bought them.",
         "Did 538 ever go for Trump? The national polling always had Harris ahead, although today is the lowest she has ever been.",
         "I mean, they went from 52-48 Trump to 51-49 Harris.\n\nThat's barely a difference.  For all intents and purposes, it's 50/50.",
         "🙏🇺🇸",
         "And if the election is stolen again? What options do we have to take our country back?",
         "Feels so wrong reading a Stephen King citation there.",
         "Its not pointless, vote in local elections, those are sometimes the most impactful ones.",
         "Your vote still counts. Even if it just helps turn the popular vote, it makes a statement.",
         "Doesn't help when CNN, Ipsos, and Marist dump garbage polls two days before the election. Take heart - Atlas Intel and Rasmussen have been steady for weeks. Judging from Harris's campaign schedule - she is in real trouble in PA. We shall see.",
         "I think a lot of independents are breaking to Harris. I also think a lot of elderly women are like \"screw it, I want to see a woman president\"",
         "Wow, I just saw 1.2. Her biggest lead was around 3.7 in late Aug...post convention. I keep saying trends, people, look at the trends!",
         "100%  I live in Texas, a red state for many years, still need to fight the local fights, all votes matter.",
         "They are. That’s how Soros managed to be so influential in American politics. By funding local DAs and board elections.",
         "If Harris wins because women who want to legalize murdering babies push her over the finish line we deserve whatever ruin God brings down on us"
      ]
   },
   "1gk4v6c": {
      "title": "TODAY IS THE DAY! TIME TO SAVE AMERICA! 🇺🇸",
      "text": "",
      "comments": [
         "Get out and vote! I hear it's raining in some of the swing states. It doesn't matter. We have to have a historic turnout this year!",
         "It's been storming here all night in the greater Houston area.  I voted a week ago. I'll be praying all day.  Maybe I will gather up some food and take to my church food pantry.  Great way to celebrate Election Day!",
         "Trump, Vance, Elon, Tulsi, RFK, and Ron Paul. Or. Kamala and Liz Cheney  ***VOTE***",
         "Voted this morning. 30 minutes in and out. EZPZ. There is no excuse to not do it. \n\nThe turnout at my location was order of magnitudes larger than it was in 2022. Things are looking good.",
         "Get out and vote.  Sure he is ahead but he is going to have to be way ahead because there is going to be fucking boatloads of late Kamala mail ins being counted for days.",
         "We are going this morning. It's going to be a long day!",
         "Let’s fucking go!!!",
         "Voted and it feels good!",
         "kamala ya fired",
         "Hey y’all.  Best place to track voting results? I swear in 2020 there was an interactive map on google, but I can’t find it now",
         "Today is the day America is saved",
         "Please God. We need this win! Save America and beat the media machine!",
         "Me and my daughter were 10 and 11 in line this morning when the polls opened in Indiana.  maybe reddit fatigue but i’m not very confident even at lower level races.",
         "[removed]",
         "Currently standing in line.\n\nI’m in an extremely red state (AL), but I have never seen turnout like this before, and I’ve been voting since 2004. The lines are *huge*.\n\nOf course this is just one meaningless anecdote, but I’m praying this is indicative of very strong Trump enthusiasm and a potentially historic turnout.",
         "First 10 min of FL voting R+29 blowout! Keep it up!\n\nhttps://x.com/ericldaugh/status/1853773645006434327?s=46",
         "I've seen so many posts on other subs about people planning to get so drunk/high celebrating if they win this was a refreshing alternative.",
         "No brainer of course",
         "YA FIRED",
         "I have been told New York Times has a good tracker.",
         "Pick a streamer any streamer, I'll be watching mine but I don't link them on Reddit because they've been swatted by internet kids and then told by authorities to take it to civil court instead of the police.\n\nThe *world* is in trouble if this system sticks.",
         "🙏😁",
         "Whoa that’s a good sign that Florida should be a massive win! \n\nI hope we see these numbers everywhere",
         "Update!!! \n\n https://x.com/ericldaugh/status/1853791861015495155?s=46 \n\n GOP turnout in FL more than D and no party affiliation combined! And at least half the NPA will be voting red.",
         "I’ve considered fireworks!",
         "been walking around the house all morning yellin this",
         "Wow! Broward country currently voting Red! Insane!\n\nhttps://x.com/ericldaugh/status/1853778450810548246?s=46\n\nFL probably going double digits",
         "Even with the recent rain, it's too dry here.",
         "Probably because Republicans actually have jobs and want to vote before work!",
         "In this economy even the far-left have to report to work!"
      ]
   },
   "1gk57dr": {
      "title": "VOTE VOTE VOTE ",
      "text": "",
      "comments": []
   },
   "1gjw31l": {
      "title": "It’s JOEVER",
      "text": "",
      "comments": [
         "I'm sure after interviewing fetterman he decided he needed to lol.",
         "And the official New Hampshire Libertarian Party endorsed Trump.\n\nI feel like that's bigger news. New Hampshire has more Libertarians than any other state in America (as a % of the total voter base), and NH is IN PLAY if Trump can outperform by just 3-4%.",
         "As someone who has been listening to Rogan since he was recording in his house this is a wild time. Never thought in my lifetime Rogan would endorse Donald Trump for president.",
         "Would have been nice if it was 3 or 4 days ago!",
         "Finally",
         "oh fuck!!!",
         "LET\"S FUCKING VOTE! THIS IS FOR P'NUT!",
         "This is a great endorsement but I’m worried about female voter turnout for the GOP.",
         "Hot damn, the slogan makes a strong comeback!",
         "Bro jogan we praise you",
         "Again. Like I said. Rogan effect. This will drive more men to vote",
         "Will this actually sway people?!",
         "🇺🇸",
         "Woohoo!",
         "“GET OFF YOUR ASS HARRY” VOTE!!! Our lives depend on it! 🇺🇸",
         "Joever and Hoever. Never been so over.",
         "Do endorsements actually do anything? Seriously asking. I vote for who I want, IDGAF who someone endorses",
         "I feel like Trump has so much momentum that if he wins an EC landslide I wouldn't be surprised but I am still nervous",
         "The most feckless endorsement ever.  Maybe a week ago would've been useful, but nobody is voting on election day anymore (which is another gripe of mine).",
         "Glad to have him but who cares about a celebrity endorsement?",
         "Fetterman is the least troublesome of Democrats IMO. He seems to have a lot of common sense and has recovered well from the stroke. \n\nI’d never vote for the guy, be he seems like an okay, genuine dude who’s willing to buck his party for what he believes in. I wish we had more transparent politicians like him.",
         "Please God let NH be in play.\n\nIf we could flip that it would be a massive help",
         "Libertarian here: Sometimes the NH libertarian can be wacko’s but other times they are pretty based. This is the latter. \n\nA lot of conservatives completely missed who the libertarians “voted for” on their on primary for party ticket. Dave Smith said there was nothing amiss but there’s a part of me that think Oliver was picked just so he wouldn’t siphon votes away from Trump. \n\nOliver is the least popular libertarian with right leaning libertarians and libertarians in a while because of things he’s said and done in the past. When you have support of Dave Smith + Massie + a possibility of Ron Paul cutting government spending + the opposing candidate being a massive gun grabber it makes choices very very easy.  \n\nThe people who vote libertarian this year aren’t going to be the normal people who vote libertarian. They likely are going to be disenfranchised democrats as a protest vote.",
         "I remember all the times he said he would NEVER have trump on his podcast due to the controversy. The moment i saw he had him on, i knew rogan realizes how important this election is",
         "Because the last 4 years has really pulled the wool back from over the eyes of a lot of middle aged -- older Americans and exposed a lot of the corrupt and tyrannical motivation and policies of the Left. Middle Aged and older Americans remember a time when being American was awesome, when people loved their country, was seeing real strides in overcoming the last slivers of racism, and remember their schooling on the Constitution, Bill of Rights, and know what freedom, liberty, and the pursuit of happiness is really all about. It's no wonder people who aren't already radical leftist, aren't bougie elitists, or Hollywood pervs are changing their minds about what they were spoon-fed as reality.",
         "ALOT of people came out for trump this time around than even in 2016 and 2020....This time we really need to save this beautiful country from the woke left.",
         "People on the fence are likely to wait til the last minute anyway",
         "Nah probably best the night before the election tbh to drive turnout",
         "I actually don't mind it. There's been a lot of effort over the last few days to try and tank Trump's momentum and push a \"Trump's stalled, Harris is on the rise!\" narrative.\n\nBy making today a good day for Trump there's no time left for the MSM to try and shift the narrative again.",
         "Internet age, baby. Three of four days would have had its advantages too, but there is a lot of upside to this type of thing the night before.",
         "Undecided voters, as well as people rightly worried about election fraud, generally don't vote early. \n\nThis is a great time to drive conservative turnout.",
         "Honestly, this is a massive, massive W for Trump. Can't wait for tomorrow 😎",
         "**LETS GO!**",
         "PNut was an American Hero! 🇺🇸 He went down fighting! Tomorrow we fight for him!",
         "This female is currently waiting in line in PA to vote straight red",
         "It's offset by the lack of male turnout for the dems. Not great but will help balance what is already going to probably be the biggest gender gap in politics in a long time.",
         "I think Trump's campaign is too. They got Megyn Kelly to endorse Trump at his Pittsburgh rally tonight (she had already endorsed him on her show). At the Reading rally I attended Monday, they put a wall of women with pink \"Women for Trump\" signs right behind him. And they've been using a lot of female speakers in recent rallies, Tulsi Gabbard, Lara Trump, Sarah Huckabee Sanders. In Reading, they also had a female campaign staffer give a speech who I had never heard of before (all I remember now is she said her parents immigrated from Russia).",
         "White women largely skew red as a whole",
         "Not meant to sway. Meant to drive turn out.",
         "I think that it actually will sway a fair number of holdouts, and drive turnout.\n\nJoe is a HUGE voice. He is bigger and more trusted than all the A-list celebrities combined. 50 million listeners, hundreds of millions of impressions on his social media posts - mostly all 18-35 year old dudes who have a low voting %.",
         "This will drive people to the polls...big dick energy. Hell yes.",
         "I doubt a celebrity endorsement does. An endorsement from a fellow, popular politician means a LOT though. Trump got a ton of candidates to win in primaries by endorsing them as the preferred MAGA candidates.",
         "Democrats will vote for who a celebrity tells them because they’re simple minded. But less simple minded people I could see being pushed to vote by a Rogan endorsement because he’s not just a mindless “celebrity”, but rather an intelligent human being that people listen to his opinions on as they put trust in things he says.",
         "Pennsylvania is. All we have for early voting are mail-in ballots, and a hamfisted way of voting \"in person\" by going to the county office to get your mail-in vote and filling it out there. It's extremely inconvenient. GOP early voting numbers had a small increase in PA this year compared to other states. Election day will still rule the day in PA for the GOP and Trump. I could see this endorsement swaying some young male voters in PA who may still be on the fence. Maybe college kids who are on the white collar path. The sensibility in PA is a good fit with Joe Rogan. People are pretty independent and anti-establishment here.",
         "Yes I agree with all that... However Joe made him admit the border stuff is all BS and with Joe being in Texas I would feel like Joe feels strongly about border security.",
         "I think people believed this when he spoke out against antisemitism, but his appearance on Rogan convinced me he still shouldn't be in Congress. As soon as the topics around immigration and voting integrity started, he seemed to not just fall into the Democrat trope replies, but answer a different question than was asked. It seemed like either his transcriptions were off, he wasn't understanding the questions, or he was intentionally trying to avoid them.\n\nThis was a one-on-one, casual conversation. The idea that he had transcription problems or didn't understand the topic are both bad, given he should be operating in busier, noisier environments. He made comments on Rogan's show about doing better following music he knows better than stuff that's new. I think he struggles with unfamiliar topics or ideas still, and that he showed difficulties in following the conversation properly on there. Despite having respect for him on a personal level, I think he just isn't in a good enough state to trust in that position.",
         "> Fetterman is the least troublesome of Democrats IMO. He seems to have a lot of common sense and has recovered well from the stroke.\n> \n> \n> \n> I’d never vote for the guy, be he seems like an okay, genuine dude who’s willing to buck his party for what he believes in. I wish we had more transparent politicians like him.\n\nIt's all an act to retain voters. Despite what he says, he still votes the same as all other Democrats on everything. It's the same as when Democrats say \"I support the 2nd amendment\" but go and vote in support of every 2nd amendment restriction bill they come across. Actions speak louder than words.",
         "No, it’s all an act because he’s in a purple state. Just like Baldwin, Tester, and every other “common sense” democrat, Fetterman votes at a 95%+ clip with the other Democrats. He votes straight in line with Warren, Sanders, Schumer, and all the other far left wackos. Fetterman is NOT to be trusted. Always check the voting record!  \n\nThe only Democrats you can trust to think independently and regularly break from the leftist insanity is Krysten Sinema (who left the Dems in 2022 to become an independent and is not running for re-election) and Joe Manchin (who left the Dems this year to become an independent and is also not running for reelection). ALL the rest of the Dem senators are party shills.",
         ">and has recovered well from the stroke. \n\nI noticed this from a clip shared from a segment he did the other day on one of the news channels. His speech has really come a long way. I'm happy he's made great strides in his recovery.",
         "He wasn't transparent about voter ID lmao",
         "This is his podcast with Fetterman in python code: \n\nWhile true:\n\nprint(\"Ok, Immigration is a good thing, but you say you want a secure border, what should we do to secure it?\" )\n\nprint(\"Well, you gotta start with saying immigration is a good thing.\")",
         "With New Hampshire and the Sun Belt Trump wins and doesn’t have to win any of the Upper Rust Belt states.",
         "I'm not a libertarian, but I listen to a lot of Dave Smith and it makes sense why more Libertarians are likely voting with Republicans. Seems like a perfect storm of a terrible LP candidate and the left completely losing their marbles. I honestly don't understand how someone like chase oliver even got the nomination.\n \nIt was funny Dave Smith was thanking God that he ended up dropping out because he would have pulled a lot of votes from Trump and would likely tilt the elections to the Dems. Funny how things work out. ",
         "Yeah for sure",
         "My thoughts exactly. The downside to doing it this late is he’ll lose out on changing the minds of those who already voted but the upside is the media can’t drown it out (at least not as well) so this will be in people’s heads when they vote. \n\nI hope the calculus pans out in our favor. Like Musk said, if Harris wins our elections will be reduced to Democrat primaries.",
         "Along those lines, Nate Silver and 538, at the literal last minute, just changed their election model predictions to Harris. They had been Trump for at least a month, it seems like. I don't know if it's a conspiracy or a function of the polls. Still seems fishy, since the polls don't seem to have changed much in the last few days, except for the wild Selzer Iowa poll. They gave Harris the slimmest margin over Trump. So it seems like they want to give Harris a publicity bump, while still being able to claim they had \"barely\" given her the edge if she loses.",
         "Not necessarily in states where registration is not allowed on election day, if you're trying to motivate first-time voters. Of the swing states, only Wisconsin and Nevada apparently have \"easy\" same-day registration. Michigan looks like you have to go to your county office to do it, a trek an apathetic voter is not likely to make.",
         "Do you think it will?",
         "Great point tbh, I hadn’t considered that",
         "Problem is they can't register to vote in most of the swing states anymore. Not in Pennsylvania, the most important one. I would also think Rogan being friendly and agreeable with Trump in his interview would've already swayed them if they were on the fence.",
         "I listened to the whole interview and I have no idea what you're referring to. Trump never said any such thing.",
         "I seriously get the feeling when he is being less DNC line carrier, and more common sense American - it’s because his mental issues have him forgetting, or his filter is “broken”.",
         "Shit politics, but happy for the dude and his family",
         "I never wish for poor health for anyone, so I'm always happy to see a recovery story going well. That said, I do not trust him politically, and I will always feel that it was ridiculously irresponsible to continue to run for office in his condition. \n\nAlthough I guess his cognitive health doesn't really seem to matter that much. I know that as far as voting goes he is just a democrat rubber stamp, and the public there would vote for a shoebox of dead spark plugs if it had a D next to its name.",
         "I don't think anyone who cares about his opinion would have voted for Kamala. He's been pretty critical and the things he cares about clearly don't line up with the left's current platform. \n\n\nI think this is more about getting apathetic men out to vote and doing the endorsement as late as possible for them makes sense. \n\n\nIt would have been awesome though if Kamala had have done the show and then Joe came out soon after to endorse Trump, that would've been the ultimate middle finger. ",
         "Pretty much. Also, Reddit tries to call RealClearPolitics right wing propaganda but its averages by state were much closer to the actual result than 538 was in 2020. \n\n\nIf we go off of RCP, Trump is ahead in enough states to win. \n\n\nNate's model also conveniently barely factors in national polls when the truth is if Trump is within two points of winning the popular vote he almost certainly wins the presidency. ",
         "Republicans need men to turn out tomorrow in order to win and this puts a jolt in a respectable portion of male voters who are indifferent towards politics but would go vote for Trump if given the right push",
         "Yes, creating hype works.",
         "What it does is provide motivation to the guys who say \"leave me alone I just want to watch sports.\"\n\nThey aren't listening to political talk, probably because it's been glowing radioactive for a decade, but they'll listen to JRE.",
         "10k voters could make the difference, yes",
         "In the comments you are responding to, they were talking about Fetterman.",
         "Funny thing, you'd never see this chain of well meaning wishes if Fetterman was a republican and dems were talking about him. Shows how unhinged they've become."
      ]
   },
   "1gjvs3d": {
      "title": "Joe Rogan endorses Donald Trump for President.",
      "text": "https://x.com/joerogan/status/1853614670764015762?t=xNY58kOY7eqdtmHVnN90mA&s=19\n\nSeems like Musk convinced him. Here's what he wrote:\n\n>The great and powerful @elonmusk.\nIf it wasn't for him we'd be fucked.  He makes what I think is the most compelling case for Trump you'll hear, and I agree with him every step of the way.\nFor the record, yes, that's an endorsement of Trump.\nEnjoy the podcast",
      "comments": [
         "We are living in the wildest timeline. 8 years ago he hated Trump",
         "Trump was right. Rogan wasn’t going to support Kamala lol",
         "Reddit/MSM will surely be even more kind to Rogan from now on.\n\nWhats the over/under on how many accusations against him *come to light* in the next 24 hours?",
         "All those clips of him saying the N word are coming back out tomorrow",
         "I don't follow Rogan a lot, but I wasn't too surprised. His subreddit seems to be having a meltdown though. ",
         "2024 bingo card currently on fire",
         "Surprised he gave him the explicit endorsement. Didn't have to do that, especially after hosting him/JD/Elon, the endorsement was implied. Joe must feel really convicted to put his reputation on the line. Good for him.",
         "Pin this mods",
         "r/politics is very upset!!!",
         "Wow, never saw that coming.",
         "Fuck yeah, Rogan!",
         "We're gonna win. His endorsement trumps any celebrity endorsement.\n\nGo vote! Vote no matter what! Bring your friends, family, drag them to the polls!\n\nEdit: I'm receiving hateful DM's! This must be an even bigger deal to those on the left!",
         "Excellent, he finally endorses.",
         "AHAHAHAHAHAHAHAHAHAHA COME ON PEOPLE, ITS OURS TO LOSE",
         "King of bros just knighted Trump, never expected that",
         "I did not expect that.  I think it is awesome, but also at the same time I enjoy a Joe Rogan who operates at a more non-partisan view.",
         "I did not expect that whatsoever but holy shit is it exciting. Get out there and vote people!!",
         "Biggest podcast in the world. It’s about time he figured it out. Love how he genuinely looks at all issues. Hoping he can embrace Christianity soon. 🙂",
         "And oh boy is the hate from the left at nuclear levels.",
         "This sub is so slow . Mods should be pinning this post at the top….\n\nOur country is at stake!",
         "About time...",
         "holy shit....endorsement i care about. Joe Rogan and elon musk. God bless the timeline cops.",
         "Huge",
         "Yeah the day before he does it. After a lot of people have voted. But better late than never?",
         "Let's go Joe! This is huge!",
         "So i did some quick head math on how this endorsement might impact vote totals.\n\nIn U.S for listeners we expect in the U.S around 140-150 million. Election season I  would think more, but let's be conservative and say of all listeners who is able to vote 50 million.\n\n0.10 percent of those listeners gets swayed tonight and votes Trump tomorrow.\n\n50000 more votes.\n\nThat could be impactful with some states so narrow in 2020.\n\nImagine if it  was only 1% of rogan listeners who got motivated to vote tomorrow because of Joe.\n\n500k more votes for trump.\n\n\\---\n\nNot that Im saying any of these totals would happen. But its fun to see how little of a percentage of his listeners submitting a vote could impact the election.\n\nTruly the sign of classic media being dead.",
         "Thank you Joe. (Also though, It’s about time.) \n\nI’m putting myself in his shoes and even for someone who is unapologetically himself it takes moxie to endorse someone as hated as Trump when you have the top podcast in the world. But that’s why he’s Joe Rogan. He don’t care. So many people will try to use this against him. No fucks given. Well done indeed.",
         "Let’s go!",
         "Wish he would have done it sooner but this is awesome none the less.",
         "HUGEEEEEEEEEEEE",
         "Isn't he a bit late with this endorsement? I know election day is tomorrow but a lot of people have already been voting early. \nAlso I can only imagine how much of a meltdown the Joe Rogan sub is having.",
         "Hopefully this helps!",
         "He avoided it when Trump asked for his endorsement on the podcast. I wonder what made him go public.",
         "This endorsement is to grab the independent and libertarians that were going to stay home. If RFK Jr wasn't enough, Rogan was to push them over.\n\nThe timing is perfect.",
         "Don't think anyone was really surprised by this, it was just a matter of time (little late than never).\nYou know damn sure the left is going to go full blast more and dig up every little tiny thing they can on him. The vaccine stuff they tried to go after him for, is going to look like a cakewalk compared to what they will try to do now against him.",
         "Really glad he endorsed him, but it would have been much better had he done it earlier since we have so many people early voting.",
         "That's actually insane and I never thought I'd see the day",
         "Trump has built a coalition unlike anything that anyone was expecting. Vance. Musk. Gabbard. Kennedy. Rogan. Kelly. Heck, Ron Paul publicly expressed interest in potentially working with them. No campaign or candidate is perfect, but it's hard to imagine what more he could have done in this election cycle.",
         "/r/JoeRogan is seething and I'm here for it lol",
         "Get to the Polls and Vote Today. Trump/Vance need your Vote Today!",
         "I wish he hadn't. now ,la will feel justified for skipping.",
         "Same could be said about JD Vance.",
         "I will comfortably say that 8 years ago it was an entirely different campaign, so many supporters which have broad viewpoints and even disagreements have come together, it's actually beautiful to see as an American.\n\nIn the event that he wins, it might be one of the most historic Presidential campaigns ever",
         "Lots of people hated Trump, but after 4 yrs of this shit show Trump looks really good to them now😁",
         "He might still do. Its just that the other candidate is terrible",
         "He probably wouldn't have said something if she had come on the podcast like he did.  But she is so fake and untalented she couldn't.  Her weakness is that she can't act like a normal person, she's been manufactured since the start, crammed down Americans throats, and Joe Rogan just wanted a conversation with her and she couldn't even do that.",
         "I think its more about ensuring that future dems have to go on his podcast on his terms.",
         "He will be a top priority to try to destroy \n\nBut then again after his covid stance he was already high on the list",
         "Kathy Griffin coming out to say he inappropriately touched her on “News Radio”\n\nNah, not even the most dyed in the wool lefty will believe that!",
         "It’s too late. The election is tomorrow.  Rogan timed this well.",
         "Joe Rogan bout to join the Team of Hitlers on MSNBC",
         "Who cares about Reddit",
         "This is exactly why he waited until the last second to endorse Trump. If he had done it any earlier the MSM would’ve ended his career.",
         "This is why he waited until the day before, hahaha",
         "Lmao yup",
         "Don’t believe anything manipulated by the Kamala troll farms. They’re paying a lot of money to shape public discourse. It’s all fake just like her.",
         "That’s Sabrina has been Astroturfed to death \n\n\nEven before the election insanity began, the entire sub bread. It was just a place dedicated to hating Joe Rogan because Redditors aren't smart people",
         "I don't know, this seems consistent with Rogan being an anti-establishment type.",
         "The interview with Vance, and the latest one with Elon pushed him over from the silent supporter into just coming right out with it. I respect the hell out of him for doing it too. He really, REALLY seemed to like JD Vance. Like, he doesn't get on with some of his comedian friends the way he did with our future VP.",
         "It’s honestly pretty crazy. I read a few years ago that Trump and Rogans relationship was tepid at best and now they’re homies.",
         "Maybe Elon showed Joe the internal numbers haha",
         "[deleted]",
         "\"Ree who cares\"\n\nYeah, who cares about the biggest podcaster on the planet endorsing a candidate. Lol.",
         "I can’t wait to think of what they are going to smear Joe Rogan with now. The Left really is a hateful group.",
         "GOOD!!",
         "When are they not?",
         ">Edit: I'm receiving hateful DM's! This must be an even bigger deal to those on the left!\n\nLmao fucking cuckolds foaming at the mouth on the other sub",
         "> Edit: I'm receiving hateful DM's! This must be an even bigger deal to those on the left!\n\nI only came in here to note that I can smell the meltdown and I've barely been paying attention.\n\nAlso:\n\n>843 points (58% upvoted)\n\nFlair only for virtually all posts was the best thing the mods ever decided to do for the sub.\n\nProbably 4 years too late, but eh.",
         "He realizes what's on the line.",
         "His recent episodes over the past few months have lead me to believe he's converting to Catholicism privately, honestly.",
         "Amen!",
         "I wouldn't be surprised at all if he wasn't already a Christian or at least strongly considering it.\n\nHe's been open to Jesus and Christianity a lot the last year or so, especially with how insane the Left is becoming.",
         "Most people, especially Republicans, vote on Election Day. Endorsement the day before is arguably stronger than a week out when the news cycle will have buried it after 24 hours.",
         "Brandon!",
         "This endorsement is to grab people that weren't on planning on voting at all. The timing is fine.",
         "He wanted to give a fair shake to Kamala, is the most likely answer.",
         "I'd say I was a little surprised. Not that he wouldn't, but didn't expect it since it was literally the night before.",
         "Megyn Kelly as well.",
         "And me",
         "People keep forgetting the context from actual quote from Vance. \n\n\nHe said he wasn't sure if Trump would become our savior, or be the next Hitler. \n\n\nEveryone hyper focused on the Hitler part of the quote and forgets he gave equal weight to Trump maybe becoming great.",
         "And Ted Cruz.",
         "Trump won over a lot of us over time. I didn’t support him in 2016 but still saw him as the lesser of two evils with Hillary. By 2020 I was fully on the Trump train.",
         "The only problem is, a lot of his haters hate him more now than ever. Their views have become cemented and entrenched over the years to where it's almost a plank in the leftist platform that you must think Trump is Hitler.",
         "Trump can be frustrating at times. But hate him? Nobody who sees through the media lies hates him. Rogan has gone into this enough to know [Trump isn't who they make him out to be](https://youtu.be/WjhMYv1z0ws)",
         "I mean, let's not beat around the bush though: Rogan's key audience, males aged 18-45, have broken sharply toward Trump over the past 4 years. Siding with Trump means Rogan goes where most of his listeners already are.",
         "If he survived peak COVID insanity he can survive anything. I don't actually like his show but I love that he's doing it.",
         "You're underestimating how much they'll believe ANYTHING when it comes to someone they don't like. There was no evidence that Trump called the military lovers, but took it as gospel. The truth doesn't matter to them. All they care about is destroying anyone who goes against their rhetoric ",
         "Kathy Griffin was not on Newsradio. Vicki Lewis was their redheaded secretary. As I recall, some in the Newsradio cast criticized Suddenly Susan for copying a lot of what they did (that show debuted a year and a half later).",
         "I’d submit his timing would be better yet if he’d have endorsed a couple of weeks ago.  But I absolutely don’t judge private citizens decisions on such things, ya gotta do what ya gotta do.",
         "Call me crazy but i think this move wasnt for the broader audience, its for lazy young men who listen to rogan. Lazy young men wont remember joe rogan said go vote for trump a month ago. They remember it today, the very last election day, when rogan said it yesterday. Both these campaigns seem to bo going after low propensity voters HARD. My guess is bc they know peoples minds are made up and its such a 50/50 they need to get new voters out to the polls to win. The left has women esp gen z women and the right has some minority men and are now going after first time or apathetic gen z/millenial males.",
         "Never underestimate importance of just sitting down and talking to person. I think that would help a lot of things these days.",
         "Thank Uncle Dana for that. And Elon. And RFK.",
         "What would that conversation even look like? \"Hey Joe, we are really down in our internal polling and could really use your endorsement.\" I don't think so.\n\nI don't doubt it's a tight race and the Trump campaign will take any vote they can get, but they have always wanted Rogan's endorsement. Who wouldn't? That's why Trump went on the podcast.",
         "Yet when some dumb former stripper dog shit rapper endorses Kamala they act like it’s a huge deal.",
         "Really? Very interesting take. I’ve listened to him since 2009 and still listen pretty regularly. What makes you think so?",
         "His stance on abortion has a long way to go.",
         "For sure 👍🏼",
         "Except that’s not really the case this election. A lot of us voted early. My county is very red and 50% of us voted early",
         "I love Megyn Kelly, what a great podcast!",
         "And Ben Shapiro, who went from not voting for president in 2016 --> voting Trump in 2020 --> donating money and campaigning for Trump in 2024. \n\nTrump proved himself from 2017-2020. He changed the minds of a lot of people with his record as president. \n\nIt's time to take out the trash today.",
         "Same here, I think a big part was the media. I also think Trump is just more likable this election.",
         "And this was apparently in a private Facebook message. I'm sick and tired of people attacking politicians based on private text messages. There is a total difference between speaking out loud in public vs. texting someone in private. Private conversations are where you TEST ideas and theories before you settle on what you really believe. That can be done by playing devil's advocate. Or essentially trolling, where you say something provocative to try and get a discussion going. Not to mention a private conversation with a friend involves shorthand, where you do not need to put in the same qualifiers and explanations that you would in a public speech. They know that something you say may not be meant to be taken literally.",
         "We're not supposed to care about those people, any time spent interacting with them is more wasted than TV time or booze time.\n\nThe swing voters aren't the ones who spend 10000 hours watching MSNBC and pretend they've done 10000 hours of self-improvement. They go on Twitter and they chat with their bros, largely unaffected by the political ecosystem because Twitter is *a chat with their bros* instead of some MMORPG they're playing all day the way Hillary-left plays Reddit.",
         "Why don't you like his show?",
         "Today I learned",
         "I can’t upvote this enough.  It makes me mad and at the same time breaks my heart how the left has made politics us vs them, good vs evil.  In the pursuit of political power and celebrity, they’re torn apart our country.  It’s ALWAYS the lefty who can’t set politics aside.  **ALWAYS**\n\nThe right didn’t do this, we haven’t moved - hell - we’ve moderated.   I have people in my orbit who’ve managed to de-family themselves, some kicked out of families, friendships decades old torn apart.",
         "And that Austin has been getting progressively worse under the Dems",
         "[deleted]",
         "It’s not about swaying people, it’s about getting them out to vote. There will be a non zero number of Rogan fans who will vote tomorrow because of this, every vote counts and we will get some because of this",
         "It's still less than half of all votes and Republicans doing well with early voting was unheard of before this year. I'm not saying it necessarily was strategic on Joe's part, but personally I think it's more impactful only hours before the majority go out and vote.",
         "75 million votes have been cast already. That's probably 50% of the vote. That's still another 75 million votes to be cast.\n\nThe timing of his endorsement is perfect. It would have gotten buried a week ago. Besides, the people voting early for Trump were going to vote for him anyway.",
         "Hands down the best conservative podcaster, in my view. I would have never believed that five years.",
         "Trump has become less \"mean\" which gives the left one less thing to grab onto whether their grabs are legit or not. He's doing pure pro-America and nothing else at this point, the way the left still speaks of him like he's the devil incarnate only highlights their own extreme childishness.\n\nA: ***HAVE YOU HEARD WHAT TRUMP JUST SAID--***\n\nB: I'm sure you haven't heard what Trump just said.\n\nA: ***MSNBC JUST SAID--***\n\nB: That's not Trump, and you were doing the same exact thing about Ron Paul in the 2010s.",
         "I'll start off with what I do like:\n\n1. He's open to having anyone on. He had Dr Malone on during peak COVID crazy despite the left trying to destroy him for it. He had Trump, Vance, and Fetterman on in the last two weeks and would have had Harris on if she had a brain.\n\n2. He's long-form. Short-form is just a series of soundbytes and recitals of obedience to dogmas. Rogan basically made this format and it's wonderful.\n\n3. He's generally libertarian and moved to my hometown because California is bullshit.\n\nWhat I don't like:\n\n1. I don't care about MMA, feats of strength or chimps.\n\n2. He doesn't push back enough with bullshit artists. I'm talking Eric Weinstein. I've been made to watch his interactions with this douchemonkey and it has left me irreversibly annoyed with him.\n\nI like Rogan as a person and like what he's done to national discourse, I just don't want to listen to his show. I'm not throwing shade at him or people who enjoy him. My initial comment maybe was too extreme sounding.",
         "Yeah you always see the “I’m sorry but I can’t be friends with someone who literally wants to genocide all non whites” or something to that effect.\n\nThey can never look inward and ask that maybe people that disagree with them actually aren’t evil. They’d rather nuke every relationship they have than admit they were wrong. Their entire political ideology is based around avoiding any sense of personal accountability.",
         "Kind of a trend for everywhere with Democrat controlled government.\n\nNot like anybody is pointing at Chicago or Detroit as paragons of well run local governments.",
         "No worries,  I just think Joe wants to put his stamp on it and is willing to take the arrows. I also think he must believe it's at least a toss-up, as he wouldn't want to be on a sinking ship.",
         "Neither am I. He had Trump and Vance on which was great for the campaign",
         "I loved her Fox show too. O'Reilly and Megyn back-to-back were must-see TV for me for years. I can't stand any of the Fox prime time lineup ever since they booted Bill. It's totally predictable listening to three hard-line conservatives say the exact same talking points every day. The fact that Bill and Megyn were more unpredictable, and at least made it a point to challenge conservatives, simply made their shows more interesting to watch. If a Republican makes a mistake, the Fox prime time hosts now are so partisan that they will not acknowledge it. They'll just spin for them.\n\nMegyn has definitely said she's become more conservative now. I think she rated herself a 6-7 out of 10 recently on conservatism, which seems a little low. Years ago when Howard Stern asked her what her politics were, she said conservative on economics, liberal on social issues. She also said she voted for Trump in 2020 and 2024, and I assume that means she didn't in 2016. Her show now is definitely more to the right of her Fox show, but she will criticize Republicans if she thinks they made a mistake (she didn't like the non-Trump speakers at the Madison Square Garden rally much at all).",
         "Rogan doesn't seem to be in the \"pushback\" business. He actually reminds me more of Johnny Carson than any other talk show host these days. No guest had to worry about Carson digging up dirt on them or trying to debate them on the show. Some people blame Carson for helping promote Paul Ehrlich's devastatingly wrong junk science population doomsday theories when he had him on as a guest. But Carson's style was not to debate, disprove or discredit anyone. He simply gave them a platform and let them make whatever case they wanted to make. Watch him interview Siskel and Ebert, two supremely opinionated guys, and, even then, Carson never brings strong opinions of his own into the interview. He always maintained the kind of agreeable tone that Rogan had with Trump.\n\nFull disclosure, I've only watched a handful of Rogan interviews. But the Trump one gave me major flashbacks to Carson, in that Rogan did not insert his own opinions into the discussion very much, and was very gentle with how he addressed any controversial topics.\n\nI'd theorize that this moderate and even-handed approach is why Rogan is at the top of the heap of his industry, just as Carson was.",
         "You're a good human.",
         "Why do you hate chimps?"
      ]
   },
   "1gjxu1e": {
      "title": "Heavy downvoting from Marxist troll farms",
      "text": "Kamala trolls are in full swing inside our Sub. Keep your head UP and go vote and let’s defeat them once and for all. WE MUST PREVAIL DECISIVELY! 🇺🇸🇺🇸🇺🇸\n\nTomorrow we will end the cancerous Obama Marxist experiment once and for all. THEY ARE PANICKING!\n\nTrump has run the greatest campaign in American history! We will never see anything like it again! LETS WIN! 🇺🇸🇺🇸🇺🇸",
      "comments": [
         "Reddit is nothing more than a Bot Farm.  Getting on any political post at this point is an endless stream of undifferentiated thought.  No hot takes.  No dissenting opinions.  No creative thought.  No unique ideas.  No neutral perspectives.  This reminds me of Reddit during the height of the pandemic, when you got instantly banned from almost every sub for saying true but inconvenient-for-the-forced-narrative things like \"the vaccine doesn't stop the spread of the virus\".  The overall site is garbage.  I honestly don't know why I come back.",
         "fight fight fight",
         "Even on this sub my comments start off downvoted before trickling back upwards. Crazy.",
         "Not surprised, This vid for a fantastic ad for Trump \n\nhttps://youtu.be/ypaLXHzpOj4?si=Hde6YbPhapMUnqbm\n\nHas been posted here and was instantly down voted that you couldn't see it.\n\nJust wait till tomorrow, if Trump wins which of course most of us want him to, the down votes will be on steroids and everyone will be getting one.",
         "When the brigade is going badly I recommend posting more often than normal. You can post up to four times per hour, even if all four are right after another.\n\nThe websites leftists use to pay for downvotes charge by the downvote, rather than by the hour of labor. So more posts means you drain their pre-paid account more quickly. Because posts downvoted to “zero” tend to have more than one downvote, when there is more posts, paid brigading is more costly than when there are just a few posts, but with some upvotes.\n\nThat is a strategy against paid brigading, but it is not as effective against volunteer brigading. To wear them out, you’d need even more posts.\n\nWhen the brigading is really bad, the mods might consider putting a sticky note up announcing that the four posts per hour limit has been suspended temporarily. Then conservatives could just post dozens of links each at a time until eventually it wears out the brigade.\n\nWould this actually work? I don’t know, but it would be interesting to give it a try.\n\nAll leftists need is a credit card, and there are white collar workers in third world countries who will be happy to downvote whatever they want.\n\nSome Reddit users have described in the past spending what appears to be in the thousands of dollars on paid votes. It isn’t cheap to put food on the table for hundreds of people halfway around the world.\n\nThe cost of 50 downvotes is $16.99, which comes out to $0.3398 per downvote. According to [https://www.numbeo.com/cost-of-living/country\\_result.jsp?country=India&displayCurrency=USD](https://www.numbeo.com/cost-of-living/country_result.jsp?country=India&displayCurrency=USD) , one pound of white rice in India costs $0.33.\n\nI don’t know how much of the fee actually reaches the base level worker, but even if it is only half, it still adds up over time.\n\nPaid Reddit voting makes you think about the kind of people who pay for downvotes. Same kind of people that might mess with an actual real life election.\n\nBut I accept that Reddit is twisted as sort of a fact of life. What I’d be interested in seeing is a stickied title modeled as a charitable drive.\n\nLike\n\n**Today lets try and feed people from far off lands. Posting frequency limit is suspended for the next 24 hours. Post away so leftists employ people who need money more than they do.**",
         "Voted DJT and down ballot red.\n\n\nGod Bless America!",
         "When you don’t work and have no life I guess you have to find ways to stay busy! I pity them!",
         "Remember that Reddit only allows brigading in right wing subs",
         "They are so weak with no testosterone that it takes them 3-4 times pushing the downvote button to actually work.",
         "They're too busy engaging in election interference by suppressing posts on Reddit",
         "Their education system failed them.",
         "The devil works hard but Kamala works way harder. What a pitiful last ditch effort haha.",
         "Lefties gonna hate",
         "Vote Donald J Trump tomorrow if you love America",
         "MAGA 🇺🇸",
         "\"troll farms\" - for when your position is so terrible, you need to artificially create negative optics to fight the opposite view point.\n\nLOSERS",
         "Let them cry a river after tomorrow",
         "They are in every sub :/",
         "Good. they'll be crying on wednesday.  I imagine they'll do something insane.",
         "I've been commenting here for the last couple months and only the last day or two I have started getting DMs trying to change my views and some hateful DMs also.",
         "They literally use staffers and volunteers to astroturf Reddit.  It’s pathetic and undemocratic, (while, funnily enough, very Democratic)but hey, that’s show biz baby!",
         "Stay strong, fellow racist deplorable fascist pieces of garbage! Let’s get out there and re-elect the convicted felon mothertrucker already!!",
         "Kamala's staff are really active with the astroturf right now it seems!",
         "They're gonna seethe hard tomorrow lmao 😂",
         "EVERYBODY in this sub needs to issue a rebuke of the left and get off your arse and vote.  You have to assume a smal amount of cheating is going to take place favoring the communists.  Make it so much of a victory, any of their cheating is irrelevant.",
         "I'm up in upvotes.   But the more I peruse reddit the more honor I get from receiving downvotes.   And I made a few comments in my local city's subreddit.   I'm ready to have a bad reputation in there for speaking truth.   But I'll avoid it the next few days after Trump wins.",
         "They think downvoting hurts my feelings  pfffft",
         "GOD BLESS YOU GOD BLESS DONALD TRUMP AND GOD BLESS AMERICA",
         "I look forward to seeing these freaks screech and cry if they lose.",
         "10 pm tomorrow the Kamala bots will disappear",
         "It’s Reddit, you should see the main page. Never seen nothing like it.",
         "It's reddit. What did you expect during election season?",
         "The panic is definitely real.  I did check up on the lefty subs and the language they use is \"there's still hope for kamala!\".  They are high on copium.",
         "We can do this. Not going to let them destroy the country.",
         "Liberal slacktivism at its finest. Can't count on them to critically think or recognize the dimensions of their own hypocrisy, but can always count on them to troll en masse on the internet - the only place they can find the courage fight.",
         "God Bless America and may God save our Republic in this election.  Trump '24!!! LFG!!!!!",
         "Gotta spend all that money",
         "Kamala’s team is distracting everyone from her interview with the Islamic influencer whose question about the war was dodged and she told him bacon was a spice.",
         "I voted but nervous . I have a bad feeling it will end up a loss . God I hope I’m wrong and he wins . \n\nAt this point polls don’t matter, votes do.  Get out and vote and encourage your friends to vote and your family to vote .  I believe Elon, if Trump loses it’s the last election",
         "all morning I've been driving my family up a wall.\n\n  \n\"KAMALA YA FIRED!!!!\"",
         "Go Vote Trump/Vance, you’ll feel better.",
         "No matter how this turns out, the leftists won't be happy. They'll either have 4 more years of Trump and then he's gone for good, or they'll have 4 more years of him campaigning and then running again. As long as he's alive, he's the only candidate for the right.",
         "Thanks Reddit. All the downvoting this past year made me continue to vote for Trump even more",
         "Y’all know how the home feed sometimes recommend you subreddits? \n\nI got one pics sub post recommended to me which was another “I voted for Camala post”. I checked the comment section and a mod stickied their comment saying that post’s image was taken outside of Reddit.\n\nWhen even a pics mod acknowledges bot posts, you know it’s bad.",
         "Their covid banning was all I needed to know about the site. It really showed its true colors for the real totalitarians they are. Hopefully someday they’ll have some clarity to know it’s not healthy to live like that with constant hatred or where hate is their primary emotion.",
         "The sad truth here is that this generation relies so much on social media, online dating, navigation apps...their entire being is fed to them. They have no beleifs or values other than upvotes. Sure, they may be conservative but out of fear of downvotes they will just go along with the narrative....",
         "It will go out the same way Digg did. It will just take longer.",
         ">The overall site is garbage. \n\nI came to this sub when the rest of the site was shut off one sub at a time (just about everywhere but here) for mandatory \"\"grass roots\"\" activism. I think it was about an interface redesign or something.",
         "it's a hate site.",
         "The cabal is in full force. The one place on Reddit that disagrees with them is one place too many",
         "Weirdo liberals refreshing the sub just waiting to downvote a fresh comment. Fucking pathetic losers the whole lot.",
         "What a sad existence to just linger in subs of people you disagree with, going through and downvoting comments. I really do hope they find meaning in their life",
         "The botnet downvotes are largely up front, so posts are hidden with the intention of having them never seen by non-bots.",
         "I assume it’s all bots and not real people or else the down votes would continue at a relatively steady pace. It’s always a cluster of instant down votes because the bot recognizes a new post, but then the up votes start to come in because they have run out of bots to down vote with.",
         "Damn is a fantastic ad.  I love that they put him dancing in it, i don’t know why, but I do.  Also, what’s a metal code conservative?  Just a conservative who likes metal core?",
         "Who was that other lady in the ad?  Not Tulsi Gabbard.  I’m not very familiar with American politics.",
         "People pay others to downvote?  Just when you think you've seen it all.   Let them waste their money.   Or more likely, mommy's money.",
         "So this explains why my first couple comments are down voted, and the last few tend to be upvoted in certain subs.",
         "Democrats have been manufacturing optics for longer than the Republican party has existed.",
         "Yeah, I've gotten some pretty nasty DMs also.",
         "He has said he will not run again. He really started something, though. The right is changed now because of Trump, which is wonderful. The days of establishment Republicans are over. I would happily support Vance, Vivek, Tulsi, etc for president after Trump is done. Imagine the state of the Republican party if Trump hadn't come along. I didn't even vote until 2016 because I didn't like any of the candidates and just didn't care. Trump lit a fire in me and many others. I'd love to see him be president these next 4 years, and see him endorse someone like Vance for 2028.",
         "Most of those are just bots designed to automatically downvote comments",
         "Bots… not people. Read about “Dead Internet Theory”",
         "It’s because it appears under “latest”. Reddit isn’t limited to America and the majority of the English speaking world will inevitably downvote right-wing self indulgence, when forced to see it. It will then leave ‘latest’, eventually only getting shown to those subbed in the communities it is posted to, the people who actually want to see it.",
         "Yep. I watched the Joe Rogan endorsement post go from 1.1k last night, down to like 600 something upvotes. Now it's back to over 1k.",
         "What’s even more ridiculous is that it’s probably our tax dollars paying for this shit.  Fucking ridiculous clown world we live in.",
         ">People pay others to downvote?\n\nThis inevitably exists, but is also not the only system.\n\n*Partly* they pay for downvotes, partly they grind all day all night like MMORPGs for downvotes, partly they flagrantly break Reddit's rules for downvotes and if we complain a strike is issued on *this* sub. (It's happened.)",
         "UK voters just asked their dommy mommy government to go harder.\n\nCanada re-elects *Pretty Boy Darth Vader* every chance they get, they don't *want* something different unless they emigrate. Australia sounds tough until you look at their politics, NZ is similar but moreso.",
         "That, and bots."
      ]
   },
   "1gk50zm": {
      "title": "Trump's Final Message to America: 'We Do Not Have to Live This Way'",
      "text": "",
      "comments": [
         "I’m ready.\n\nLet’s get started making America great again! \n\nMAGA 🇺🇸🇺🇸🇺🇸",
         "MAGA",
         "Last night final door knocking, a household told us, we don’t want to live 4 more years of this. Hopefully voters will show up to vote for Trump and not an accident of voting machine issue or closing polls etc"
      ]
   },
   "1gjsezm": {
      "title": "A Hell of A Campaign ",
      "text": "",
      "comments": [
         "It's easy to forget so much craziness that happened this election cycle. But it will all be Decided Tomorrow if it was Worth it or not.",
         "Photo #9 is the most iconic photo of my lifetime.",
         "He laid it all on the line. Now we wait",
         "This campaign has been brilliant. If Trump doesn’t win, he literally gave everything he had. Unfortunately we live in a corrupt country with many bad actors that control the media and most of our institutions. It takes a miracle to overcome them.",
         "I truly believe this will go down as one of the greatest presidential campaigns of my lifetime. It was a wild, crazy time. Full of laughs, tears, tragedies, divine intervention, and a hell of a good time. Kind of sad it’s over. But it’s time to get him back in the White House.\n\nGood luck tomorrow, Mr. Trump. We’re all behind you.",
         "The present time has been incredibly mean towards Trump, but I honestly believe this campaign run is the kind of stuff that will take a good chapter in high school and college history books sometime in the future.\n\nAlso, VOTE",
         "It can only end in victory this has been the greatest campaign I’ve ever witnessed",
         "I voted Hilary in 2016 and was so upset when she lost. Now in hindsight I'm glad she didn't win. I'm one of the Latino voters who went Republican for the first time this year.",
         "What about \"As I was saying\" ?????",
         "It’s amazing how the DNC doesn’t learn from their faults. \n\nIt’s the night before the election. \n\nWhere are the candidates? \n\nTrump just did an interview with *Bill Belichick* on the SiriusXM NFL radio channel. \n\nEarlier he was in Raleigh, NC.\n\nThen he was in Reading, PA. \n\nLater he’ll be in Pittsburgh, PA. \n\nHe’ll end his night in Grand Rapids, MI. \n\nHarris? \n\nShe’s only in PA. \n\nAllentown. \n\nThen Philadelphia, where she’s hosting a huge concert full of celebrities. \n\n\nThis is literally the 2016 script all over again. \n\nI just doing get it. What is the DNC/Harris Campaign thinking?",
         "This man took bullets, worked at a McDonald’s, went on Joe Rogan and drove a garbage truck\n\nAll within the past 3 months\n\nOne heck of a quarter of a year for this guy\n\nHopefully it was not all for nothing",
         "Like him or not, this man has campaigned like hell. God willing he will be #47",
         "I hope our boy makes it back in. We need him now more than ever. \n\nI don't know if I can survive 4 years of Kamala as president. I don't know if ANYONE would.",
         "Trumps near miss should have been an iconic time magazine cover. Too bad every media has been infected with TDS hopefully that will change in a few hours.",
         "Missing the iconic photo of the mic malfunction ",
         "DJT has fought long and hard.   All the traveling, rallies and personal media appearances.  I HOPE HE WINS, IF WE GET STUCK WITH KAMALA...HERE COMES THE MARXISM.   I can't go there in my head.   Because I personally believe if she \"somehow wins\" (most likely by cheating) that will be the end of the US.   We are at a serious precipice.",
         "I love him like a grandpa I never had.",
         "Wait.....i thought his rallies were empty.   Or was i just reading the msm again?",
         "God bless President Trump!",
         "Go vote everyone!!!!\n\nGet your fat pig husband from the couch and go vote",
         "I know this has been said before, but this really is “the” election. \n\nIf Team Trump 24 can’t beat the machine, nothing can.\n\nAnxiety levels 🔋",
         "Iconic",
         "Trump has run the greatest campaign we will ever see in our lifetimes and perhaps all of American History! We love you Donald, thank you! 🇺🇸",
         "It honestly baffles me that there are a sizable amount of people who will vote for Harris. It's not even close, even if you are left leaning. It feels like the only people that would vote for her are just never Trumpers who hate Trump so much they're willing to put up with a cackling maniac who has no policy lol",
         "Keep in mind, this man was written off entirely. I think he wins tomorrow, and when it does, it’ll be one of the greatest comeback stories of our time. And his campaign masterfully pieced it all together.",
         "Lol shit has been so crazy I forgot about his mugshot. It's been one hell of a ride.",
         "Vote vote vote",
         "\\#10 is still the hardest mugshot ever , change my mind",
         "The demorats killed peanut. He will be avenged.",
         "Pic 9 goes so hard",
         "We've got a country to save",
         "Man, this has been such a long year.",
         "Great photos! Gave me goosebumps.",
         "That is a nice montage.",
         "No matter what, he'll always be MY president! Trump Vance 2024 & Vance Vivek 2028",
         "This is the most insane election cycle ever and it’s not even close.\n\nAnd now I wait for a historian to correct me.",
         "I really hate how they were making fun of Elon for jumping and skipping. He's literally the richest man in the world, building cars, owner of Twitter, autistic and catching rockets, let him be",
         "I already have 🫡 🇺🇸 \n\nMAGA! USA! ✊️🙂",
         "Please, God. Please 🙏 please give us Trump tomorrow. Signed, a wife, mother, and a true American 🇺🇲",
         "There will never be another like him. I don't even know if anyone will ever try. This is literally peak, everything after this will be a pale imitation. JD Vance is my next president, but the spectacle will be so drab compared to Donnie. Who do you think they'll run against JD Vance, if he chooses to run in 2028?",
         "🔴🇺🇸TRUMP❤️2024🇺🇸🔴",
         "Number 5 is a pretty important moment too.",
         "It's been real guys.",
         "Bigly",
         "I don’t know that there will ever be another candidate like him. Now let’s just all say an extra prayer tonight that tomorrow goes the right way",
         "Think about how crazy this whole cycle has been. Everything that happened with Trump and a back door coup by the Dems. I really hope Americans see through all the BS and vote Trump.",
         "It trump doesn’t win off pic 9 I will be surprised I think the base is very motivated to vote this time around",
         "Great photos, we have to win this.",
         "No matter what happens this week, we had this incredible experience with an American hero",
         "I live in Butler County PA. PPG arena is packed. I have friends there sending pics. Harris is at a small venue with a small crowd compared to Trump. My friends are reporting that it is overwhelming and a magical night at the arena. Trump is going to win!!!",
         "That McDonald’s picture is just great",
         "Literally, what has Kamala done to make her campaign a fraction like this",
         "#9 is iconic",
         "The garbage collector bit was pretty funny!",
         "Iconic that Georgia was  very recently sued over ‘early voting’.",
         "They really threw everything they could at him",
         "He's not only a president but he's also an entertainer.",
         "Rfk and Tulsi got me more. Tulsi and vivek, honestly was the seal. Hopefully Vivek is head of the SEC. and Tulsi head of the military honestly.",
         "Good luck! Just if we lose, let’s not go to the capital this time. But mark my words if they lose they will 100% do something similar and not a single one of them will call it an insurrection",
         "Great time to be alive, a world hero",
         "Kamala takes three days off and trump picks up three jobs.",
         "I wonder if the candidates sleep at all tonight.\n\nI’d be up all night",
         "an assassination attempt alone is crazier than any other campaign.  Someone yesterday randomly mentioned the eating cats and dogs thing so so many things happened.",
         "I hope he takes both the EC and the popular vote. This must be a stomping, that way the Dems have no choice but to concede.",
         "Well I have my doubts it’ll be decided tmrw. \n\nJust praying for no 4am vote dump, broken pipes, and never ending mail in ballots that are 99% dem votes",
         "Just wish he hadn’t done that microphone fellatio 😢",
         "I’ve had hope for a few months, so to me, it’s been worth it.",
         "We’ll see",
         "He needs to win or that will be the demise of the US under Kamala.",
         "Get out and vote! Go go go!",
         "I am surprised they didn't run that more in ads.",
         "God bless Trump and all of us in this country; bless each and every citizen no matter who they vote for and help Trump bring freedom back to the USA.",
         "To understand how corrupt democrats are realize that this image isn't anywhere to be found on the [wikipedia page for this event in history.](https://en.wikipedia.org/wiki/Attempted_assassination_of_Donald_Trump_in_Pennsylvania)",
         "What's crazy is when you zoom in you can literally see the wound to his ear, that leftists deny exists.",
         "I keep seeing people wearing shirts with that pic on it. And I live in Canada.\n\n\nLove it",
         "That photo will be in history books. And hopefully by the time it is, our country will wake up and won’t spew bullshit lies the media tells us.",
         "Agreed, it gives me chills.  I use it for my Lock Screen.",
         "It is truly up there with the “I can hear you” Bush bullhorn speech video.",
         "100%. He could not have given anymore.  I am 11 years younger and I would have been so tired after a week of it.  His stamina is amazing.  I really hope he gets some rest after tomorrow.",
         "And Kamala's entire campaign was atrocious to boot. If Trump loses, either gaslighting or corruption will prove to be too big of a factor to overcome and I'm sad to say I'll lose what's left of my faith in this country as a whole.",
         "We can pray that turnout for President Trump outpaces the \"easily coerced\" turnout for Kamala that was based upon an extremely dishonest media that was in bed with the DNC and Harris campaign. \n\nI am hoping for a replay of 2016.",
         "I serve a God who is in the business of miracles.",
         "Hard to beat 2016 but with the Butler shooting, the McDonalds ploy and the garbage truck...  \n\nI'm not hearing lots of bitching about the RNC this time either... they've already had successful lawsuits too.\n\nHe gave himself just about the best chance to win that he could. He might beat the odds again.",
         "Everyone here is already voting. You need to call your friends in MI WI PA NH NM VA.\n\nMultiply your vote.",
         "Thank you.",
         "1: The Dems aren't voting for a candidate, they're voting for a system.\n\n2: Honest persuasion is losing more and more of its importance to Dems with each cycle. It's all about the process now. (Courts, city halls, DAs etc etc etc.)",
         "Oh is Harris doing the Springsteen concert thing like Hillary did in 2016?  That ended well last time, let’s see if it works any better this time 😆",
         "But the Dems are saying “he’s tired”…… \n\nIdiots",
         "Don’t forget she picked her tim kaine too.",
         "> What is the DNC/Harris Campaign thinking?\n\nIt tells me that they are confident that whatever cheating they have in place will be sufficient. \n\nCan you imagine a US without Trump Derangement Syndrome and a fair playing field? Can you imagine if the media was bipartisan and didn't twist, obfuscate and lie? She wouldn't stand a chance.",
         "I’d like to become a homeowner within the next 4 years. Have you seen the housing inflation lately? It’s batshit insane and if Kamala wins I can kiss owning a home goodbye",
         "Literally WWIII\n\nShe will be taken advantage of day 1. Zero critical thinking skills or strategic capabilities. Couldn’t win tic tac toe against a pre-schooler.",
         "If it was a Democrat, they would have given them a Nobel Peace Prize by now.",
         "Should be time person of the year, and if it was any other person or candidate they definitely would. Maybe even a noble peace prize. But since it was Trump, they will give person of the year to Beyoncé for the awesome concert at the rally to get everyone fired up and a noble peace prize to KJP surviving nonstop attacks and persecution from the media.",
         "I was watching Nick Shirley, and it's amazing how many people said they were voting for the woman.   They admitted to not even knowing her name.",
         "I don’t have the mental or emotional capacity to speculate on 2028 right now…",
         "Glad to see I am not alone. I am a bit scared. I know if she wins, everyone will be like she is the first American Woman to be President. Cheers and parades in her honor. That will be the only focus of the media cycle for days. They will also be switching over to Trumps legal battles. Then January comes and she will change her tune on the border, letting millions in her first year. More money going out to Ukraine. More countries turning on Israel. Inflation staying high and an economic recession on the rise. The full effect will be felt by next summer. That will be the future with her winning, but the country doesn’t care. We have not hit rock bottom enough, apparently. We can only pray Republicans keep the house and possibly the senate. We will all be here whether Trump wins or loses. This sub is what unites us.",
         "Would be the first Republican to win the Popular vote in 20 years. Not happening",
         "Just the EC would be enough.",
         "You know they will try that shady crap...because that's what they do!  They can't win an HONEST AND TRANSPARENT election if their life depended on it.",
         "I guess it didn't do well with squishy moderates in focus group tests.",
         "Yes!  I hope to see one of the BEST Presidents EVER back in the Whitehouse, Donald John Trump!",
         "If it weren't for Elon, pretty much the whole modern internet would just be a woke loudspeaker.",
         "Leftists destroy everything they touch",
         "No seriously. Within minutes of it happening, like before Corey’s passing was announced, the crazies on X were claiming it was fricken ketchup. I saw ketchup and immediately thought “someone has never watched a low budget horror movie”.",
         "Unfortunately, he won't get any rest either way. You can bet the left will continue their lawfare against him no matter the outcome. I fully expect him to be sentenced to jail if he wins.",
         "If I were in his position, I would have gone off into the sunset and lived out my life playing golf and fading into luxurious obscurity. It takes a great man to decide to jump into the nest of cockroaches that is politics with such an alternative.",
         "He is amazing. I saw him in Macon last night and it was clear he was tired. It was his third event that day. But he still had so much personality and spoke for over an hour. He did not shortchange us even though we were the last stop.",
         "I hope he gets some rest too, especially as president elect.",
         "Watch he goes into cardiac arrest after this election is finally over and he gets a chance to rest. His body will be in shock.",
         "The thing that gives me hope is the economy, global instability/wars, and the border crisis. Most Americans agree that the country is headed in the wrong direction. How can they justify voting for more of the same failed policies? Stumps me.",
         "What's also memory holed is he made a LOT more mistakes in 2016.\n\nSome people are nostalgic because he was even more entertaining back then, but part of it was him being naive to politics and making a lot of errors.\n\nHe's a more seasoned politician now and post the debate he's barely put a foot wrong.",
         "The people who pretend they're doing a get out the vote drive when they're really just shouting the same thing at the same people *in every conversation* are just adding to the tedium of it all.",
         "It's also less and less about intraparty democracy for Democrats. It's been 16 years since the last time they had a truly open-ended primary in which the powers that be didn't heavily tip the scales in favor of their chosen candidate.",
         "Literally yes, with Springsteen too. But don’t worry, Lady Gaga is there too.",
         "That's really what concerns me. Joe was very, very weak on the geopolitical stage, but kind of masked it by funneling billions to Ukraine. \n\nKamala on the other hand, has absolutely no grit or negotiation sense whatsoever. Easily taken advantage of, projects an aura of stupidity. Nevermind Putin, she'd get taken to the cleaners by EVERYONE. WWIII a genuinely likely event with her at the helm.",
         "They will blame Trump because they say the economy is always based on the prior president.   So will they still blame Trump or will they follow their own logic and blame Biden then?",
         "My anxiety is through the roof!   We cannot AFFORD another crappy four years of the Biden/Kamala polices.   We just can't.   We are talking about liberty versus Marxism.",
         "Had no Idea its been that long thanks for pointing that out.",
         "You know 20 years is just 4 terms right? Since before Obama has been elected or in other words, the last Republican president before Trump.",
         "I won't be surprised.",
         "Honestly cockroaches are more useful than the current administration at this point.  At least roaches eat the trash instead of creating it. 🪳",
         "Not to mention we are in a political sub",
         "I’m still shocked that anyone that considers themselves left of center forgave the DNC for rigging the primaries against Bernie. \n\nI know so many people that voted for Trump that said they would have voted Bernie if he was the candidate. America wanted a pivot non-establishment candidate so bad and the Dems had the guy. Yet today MSNBC writes an article asking why Trump is popular",
         "It's because more people live in LA county than like 80% of all counties in the U.S. combined. That's why we need the electoral college - so CA and NY don't decide our future.",
         "Bernie vs Trump is the race that America should have had in 2016. A clear repudiation of the failed status quo, and a true choice election about the new course."
      ]
   },
   "1gjtdat": {
      "title": "Tomorrow save democracy ",
      "text": "",
      "comments": [
         "God bless America,  and God bless Trump. Keep him safe from all who would like to do him harm.",
         "Will be voting for Trump for the first time tomorrow. And proudly so.\n\nEx-liberals are many in number.",
         "My wife and I are voting Trump later today! Let's get him back!",
         "Let’s fucking do this!",
         "He has twice already."
      ]
   },
   "1gjvfz7": {
      "title": "I got to vote for the first time! This was a wild ride!",
      "text": "",
      "comments": [
         "Congrats! Hopefully for Team Red, but you do you.",
         "Hell yea!",
         "People don’t realize what showing up and voting means. A lot of people from different eras have sacrificed a lot to make this country what it is and cast their vote. You honor them by showing up and voting. I’ll stand in line all day to vote.\n\n👏",
         "Awesome!",
         "Sick shirt, I like that!"
      ]
   },
   "1gjvudr": {
      "title": "It's Election Eve tonight. ",
      "text": "Don't forget to leave a Diet Coke and a McDonald's Big Mac out tonight. ",
      "comments": [
         "I'm putting out the Diet Coke, Big Mac and some garbage bags for cleanup.",
         "ROGAN JUST ENDORSED",
         "Trump just wished a Happy Diwali to Hindu's around the world and swore to protect Hindu's against radical Islam.\n\nMY FUCKING PRESIDENT",
         "I don’t know what to do with my hands.  I’m already wound a little tight and the waiting game hasn’t even started.",
         "r/politics leaving out a tampon tonight for Tim",
         "It's just like Christmas Eve, except instead of definitely getting presents tomorrow, it's either: \n\nA - Getting no presents, my guns taken away, my free speech taken away, WW3, 20+ million more illegal invaders, untold billions more to ukraine and israel, another great depression, lose my job, lose my house, and will have to listen to a drunk woman cackle at me from the oval office for 4 years.\n\nOr B - We all get wonderful presents (the best presents really) and the country is made great again.\n\nI, for one, am hoping for option B.",
         "The Grand Rapids rally will be electric. That's where he closed in 2016. We've come full circle.",
         "Get your fat pig husband out to vote tomorrow!",
         "My vote and well wishes coming from California!",
         "Ron Paul may get involved to help out Elon with federal cuts.\n\nTrump 2024  =  Ron Paul 2024",
         "And the left is infecting all the subs with their wails of abortion \"rights\".",
         "I don’t eat McDonald’s much but I make the Big Mac sauce at home in bulk and dip everything possible in it. \n\nhttps://youtube.com/shorts/4l7yLutlRD4?si=JDvKQ68Znw-_oQ6J",
         "I’ve been back and forth with my confidence this election, but I am feeling very confident that Trump will win. There is even more momentum for him now than there has ever been. The enthusiasm for Harris is just nowhere to be found.",
         "Bahahaha",
         "I just hope trump wins... The rally tonight was good in PA. Hope it gets him over the top since he needs to win Pennsylvania.",
         "MAGA Claus is coming to town, and he's giving a lot of people some coal for Christmas!",
         "While that’s great, he should have a week or 3 ago",
         "I kinda forgot that he hadn't endorsed. I feel like he was holding it back in hopes of getting Kamala on the podcast.",
         "👍 Outstanding 👍",
         "And a package of Plan B for Kamala ",
         "Yep it's either the greatest Christmas ever or coal lots of coal",
         "The best present I could get is watching most of the fed get their layoff notices. \n\nI’ve been begging for government efficiency oversight for decades.",
         "Very well said👍",
         "Fist bump from the Bay Area!",
         "Why not just make your own for cheaper?",
         "Better late than never, and the fact he had both Trump and Vance on felt like an implicit endorsement anyway. \n\nI say welcome to the fight and let's F'n Go!",
         "Ok boo fucking hoo, how about when an independent decides to endorse instead of being a dick and going “hirrr he shoulda earlier” you go “wow that’s awesome!”",
         "I did. It’s just the ingredients in the video",
         "I agree",
         "Woah woah I think you took my comment in the wrong direction there my guy!!"
      ]
   },
   "1gk6egh": {
      "title": "Elon Musk warns if Harris wins she will 'sic the DOJ' on X to shut it down",
      "text": "",
      "comments": [
         "I believe it. If they win they will really clamp down on free speech since they are realizing that alternative media threatens their control on the narrative.",
         "And Rogan. Anyone that almost cost her the election or would be an issue in the future.",
         "We desperately need X, it's one of the last places free speech exists"
      ]
   },
   "1gk33d5": {
      "title": "Swing state Trump voters say groceries, housing, insurance costs are too high — but Harris supporters say they don’t feel the heat",
      "text": "",
      "comments": [
         "1. They don’t feel the heat because they’re uber wealthy Dem donor class folks\n\n2. They say they don’t feel the heat out of willing ignorance, then go home to their crappy 300 sq ft apartment in a dumpy neighborhood with almost empty pantry and fridge, and stacking overdue bills and sulk\n\nThe NUMBER ONE thing I see everyone on Reddit posting about is cost of groceries, healthcare, rent, bills, student loans debt, cost of college, cost of travel, etc. \n\nThen the election draws near….and they go silent on that, and dogpile anyone who brings it up. They know what they’re supporting and that it doesn’t work but they’re too proud to admit it and will still vote for it out of arrogance.",
         "Democrats are now the elite party, mostly all white collar in control, and pandering to a coalition of special interests to maintain their power.",
         "I don't see how anyone is not affected by rising insurance costs. They have just gotten insane over the last few years. Unless perhaps the people saying they aren't affected choose not to have insurance, which seems like it should be just as big a concern as unaffordable insurance costs.",
         "It's very surreal. We saw how wrong the polls were in 2016, when the \"blue-wave\" never happened....and again in 2022 when the \"red-wave\" never happened. I've watched the battleground polls diligently for the last three months, noted every incremental change and I have not a clue how it's going to turn out. My guts tell me that the range of possibilities run from a squeaker Kamala victory to a substantial Trump win in the electoral college....and a squeaker Trump victory to a substantial Kamala win in the popular vote. Whatever happens, I think the GOP ends up with at least a 52-48 majority in the Senate.\n\nGod bless the United States of America.",
         ">Then the election draws near….and they go silent on that, and dogpile anyone who brings it up.\n\nThese past couple of months I've frequently seen people being told they need to learn how to budget better and/or they need to find a better job, and I get the feeling these replies have been from people who fall into category 2 and the description in your last line.",
         "What is weird is that most of them double down and think that more government control over companies is the correct solution. Of course none of them are successful business owners.",
         "My favorite cognitive dissonance is when theyre volunteers at a foodbank or something like that, and theyre all proud about \"we signed up 6 new families this week that we're helping - more than ever before!\" because Progressives love to \"help\" people. Then you point out that the economy must be doing pretty poorly if they're signing up more families \"than ever before\" and they just get really angry and belligerent.",
         "exactly this. It’s like there blue programming chip gets activated the closer we get to Election day",
         "For sure, some articles say that U.S. families are spending upwards of an extra $1,120 a MONTH on rising costs.",
         "I thought the red wave actually did happen, but not to the scale it predicted?",
         "What gets me is they’ll post “‘budget better’ doesn’t help my situation at all” but then when told not to vote the same leadership back in, they get all defensive and claim that has nothing to do with it, this is Trump’s fault!!\n\nWhen you point out the claims that the economy has been amazing under Biden/Harris, they go nuts and say “you’re just confusing the issue. Shut up!”\n\nThen the posts stop when election time draws near. Maybe mods crack down on them closer to Election Day.",
         "The red trickle. Hopefully, this time is the real red wave."
      ]
   },
   "1gjtdpc": {
      "title": "Can't wait until tomorrow ",
      "text": "The meltdowns will be epic. Don't forget to stock up on popcorn ",
      "comments": [
         "Folks, be prepared for the Reddit outage",
         "#praying",
         "Let's hope we don't have to wait a week for them to \"Count the Votes\"",
         "Obviously I want Trump to win. On his inauguration I hope the screaming lady from 2016 shows up again.",
         "\"If you don't learn from history, you're doomed to repeat it.\"",
         "Youll have to wait cause the swing states will take days to count. No its not odd at all, dont worry about it.",
         "I'll be happy either way. If he loses then everyone on the left will finally SHUT UP. \n\nIf he wins, I get the heartbroken, tear lined faces of over emotional, hysterical feminists and beta males as an early Christmas present.",
         "IF she does win, how many of them are going to have buyers remorse within the first 6 months and actually admit to her many failures",
         "2016 election day on r/TheDonald was so much fun.\n\nHoping for another day like that today.",
         "lol I hope so. Seriously gonna have a good laugh then cry because we still have a country.",
         "Only way to guarantee this is to VOTE! \n\nExecute and bring as many friends with you!",
         "I hope so. The joy of hearing liberal heads pop for a while is just too much fun.",
         "I don’t know I think Trump loses PA and so the election, without PA Trump is dead in the water",
         "Not that they are any different on any other day",
         "Crazy to think that tomorrow we will know if we have WW3 and officially an irreversible decline of our nation and the free world",
         "Pennsylvania has entered the chat",
         "I wish I could reply with gifs in here. Mods, make it happen. \n\n“Donald J. Trump is now the 45th president of the United St—NOOOOOOO”",
         "I want to know the context of the picture. What was she saying and to whom?",
         "Sock hat and glasses screaming lib will forever be a legend in the lore of American politics ",
         "What is dead may never die!",
         "Bold of you to assume they know how to shut up, lmao. The bots know no bounds",
         "They won't shut up. They will be emboldened, and I guarantee that they will double the lawfare.",
         ">If he loses then everyone on the left will finally SHUT UP.\n\nAnyone that doesn't agree with them becomes hitler. They did it to DeSantis too. There is no end to it.",
         "No Man. The left will never shut up. Trumps loss will embolden them like nothing we’ve ever seen",
         "Happy either way? WTF?  \n\nI think you are in the wrong subreddit.",
         "Absolutely agree"
      ]
   },
   "1gjrpbw": {
      "title": "Georgia ",
      "text": "BREAKING: GEORGIA SUPREME COURT SAYS DEMOCRAT COUNTIES THAT OPENED OVER WEEKEND TO COLLECT BALLOTS ILLEGALLY CAN NOT COUNT THEM!\nThe Georgia Supreme Court Reversed A Fulton County Judge Who Ruled Democrat Counties Around Atlanta COULD Count Absentee Ballots They Collected From The Deep Blue Areas By Opening Select Offices After The End Of Early Voting IN CLEAR VIOLATION OF STATE LAW.\n\nhttps://assets.bwbx.io/documents/users/iqjWHBFdfxIU/rQSs57Ek6f9M/v0",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         ">BREAKING: GEORGIA SUPREME COURT SAYS DEMOCRAT COUNTIES THAT OPENED OVER WEEKEND TO COLLECT BALLOTS ILLEGALLY CAN NOT COUNT THEM!\n\nI don't see that in the ruling.\n\n>Consistent with OCGA § 21-2-386, the Cobb County Board of Elections and Registration (the “Board”) ***may count only those absentee ballots received by the statutory deadline of 7:00 p.m. on Election Day, November 5, 2024.***",
         "I don't think this says what you think it says - it doesn't say anything about the votes from *this past weekend* (after the end of early voting), it only talks about absentee ballots received *after election day*. I think you have the Cobb County late absentee ballots confused with the weekend shenanigans in Fulton, Dekalb, etc.",
         "Bout fucking time courts uphold the election laws we already have!",
         "Another win for election security!",
         "Fulton County.  Its where a lot of Zuck Bucks went in 20' to do the same exact things: Violate the rules to give Dems an advantage.   Fucking cheaters and liars.",
         "I have a feeling MAGA folks will be out in force tomorrow in Georgia.",
         "not seeing it. the order states absentee ballots received after 7pm nov 5 will not be counted. there is nothing there abouts the offices.\n\nCobb County Board of Elections and Registration (the “Board”) may count only those absentee ballots received by the statutory deadline of 7:00 p.m. on Election Day, November 5, 2024.",
         "Source? \n\nAnd fuck Fulton County lol always some bullshit every election",
         "🎶 We don't get fooled again! 🎶",
         "Thank God",
         "I bet they already counted them and mixed them in with the others and \"can't identify which ones they are\"",
         "\"Fuck election laws and security! They are racist! They are literally Hitler!\"\n\n- leftists",
         "What happens when they count them anyway?",
         "So I want to put a PSA out there. North Fulton and south Fulton county are very different and the Fulton you all dislike is south Fulton where downtown Atlanta is. North Fulton is mostly suburban and includes Johns Creek, Alpharetta, Milton (3 of the richest areas in the state) and Roswell. \n\nNorth Fulton tends to go more conservative, especially Alpharetta and Johns Creek. I live in one of these 4 cities and I wish we would break off of Fulton County and go back to being Milton County like we were until the 1920s. \n\nWe do not think like the downtown/midtown/hood folks. Not at all. North Fulton consistently scores nationally among elite places for raising a family, schools, amenities, housing, food scene, etc. We are not downtown. \n\n>!obligatory I already voted down ballot R including against this dork Ashwin Ramaswami up here. I hope my vote actually counts and isn’t replaced at 3am due to a “power outage” this year…!<",
         "Source? Google isn’t pulling this info up.",
         "source?",
         "[deleted]",
         "Imagine voting and your vote doesn’t end up counting because of some dumbfuck volunteer screwing up procedure",
         "So what happens now that the left knows how many early ballots were for Trump…",
         "Lets GO!!! make sure to vote!!!",
         "But will it help the midnight watermain bursting and bags of ballots being brought in in the chaos?",
         "Ready for rPolitics to tell me how this is fascism.\n\nEdit: aww shit libs out in full force tonight",
         "Great news let's hope the other rigged states are being fixed",
         "Come onnnnnnn!!!!!!!",
         "So how may votes is that down the drain for them?",
         "This is HYUUUUUUUUUUUUUUUUUUUUUUUUUGE.",
         "And even this isn't the win a lot of people think it is. A Democrat leaning county is what triggered this ruling but the ruling doesn't only apply to votes from Cobb County. Republican voters have been encouraged to vote by mail this year and Democrats have been encouraged to vote in person (John Ossoff has been going on about DeJoy/the postal service for years now and Democrats no longer have faith in the postal service), all it would take is a Democrat mailman to \"lose\" a bunch from red counties. So this very well could hurt us as much or more than Democrats in the end.\n\nI know we can't have ballots showing up a week late but there needs to be a little wiggle room to prevent trickery and allow for an investigation if necessary.",
         "Possible. I snagged it from John Basham’s X post. I do not know Georgia judicial system.",
         "Fool me once, shame on you. Fool me twice. Shame on me. Glad to see the GOP got the rocks out of their pants and decided to actually do something about the fraud.",
         "First time for everything. But if this ruling is challenged who knows when we'll get election results from Georgia.",
         "They've probably already commingled the ballots.",
         "Like not purging voter rolls within a certain time period of an election…?",
         "Now we have to worry about the other states in play",
         "I'm in GA and didn't vote early. I for sure will be.",
         "Waited to vote til tomorrow. 👍",
         "We already have been and I hope we take PA and/or WI too to seal the win.",
         "They should have been out in force early and in person to help get rid of things like this. The more in person votes there are, the fewer mail in ballots can be forged.",
         "If I lived in the burst pipe precinct, wild horses could not drag me out of the polling place. \n\nA pipe burst? Then I’ll get wet. Keep counting.",
         "It's all over the top line on a Google search now.",
         "If you know how many Trump votes there are among the early ballots, you know how many Kamala ballots you need to overtake them.",
         "I thought they were counting number of ballots received, not tallyign up the vote. They can't tally votes until after the polls close.",
         "Thanks for the geography lesson! Good information to have.",
         ">Google isn’t pulling this info up. \n\nUse Bing, Google's AI they've started relying upon isn't nearly as good as soyjack subreddits chant it up to be.",
         "This is from John Basham on X\nhttps://assets.bwbx.io/documents/users/iqjWHBFdfxIU/rQSs57Ek6f9M/v0",
         "https://assets.bwbx.io/documents/users/iqjWHBFdfxIU/rQSs57Ek6f9M/v0",
         "I pulled it from X. I’ll check.",
         "https://assets.bwbx.io/documents/users/iqjWHBFdfxIU/rQSs57Ek6f9M/v0",
         "Similar to how the Republicans continue to file lawsuits in Pennsylvania to force as many mail-in ballots as possible to be rejected on technicalities such as a date not filled in, even while Elon Musk and some others are encouraging Republicans to vote early by mail. These strategies are inconsistent. Right hand not talking to the left hand. The GOP has been trying to enforce strict mail-in rules for years, but that's only because the ballots were overwhelmingly from Democrats. The strategy to reject more ballots makes no sense if they want Republicans to switch to mail-in voting (However, in PA, the mail-in vote remained overwhelmingly Democrat this year. GOP usage only increased by under 10%, I think.). Bottom line, Democrats are not more likely to make errors on their mail-ins than Republicans. And we even had someone from PA on here say his entire family's mail-ins were rejected this year.",
         "I think I'm more comfortable with a couple hundred (maybe a thousand max?) ballots being invalidated for being late than the opportunity to \"find\" a bunch of ballots after the election and just say \"oh, we received them late! But it's just enough for our candidate to win!\".\n\nAt some point, for the people who mail in their ballots, there just has to be accountability. You mailed it late, it arrived late, and now it won't count. Next time mail it sooner.",
         "I think the saying is  “Fool me….you can’t get fooled again.”\n\nI don’t blame you for fucking it up, it’s a tough one.",
         "Not sure it can be.  There’s no constitutional basis to appeal a state law to the US Supreme Court.",
         "This is the same county that the court case found 315,000 invalid votes for Biden. The democrats there are professionals at Ballot Box stuffing.",
         "It can't be challenged.",
         "By the end of the month maybe.",
         "They may not have time to challenge this one.",
         "very likely what they have done...",
         "Speaking of purging voters, how many ballots were cast in the Democratic primary for the shit for brains candidate you are supporting?",
         "I voted early but because I was out of town the week of the last EV period and didn’t want to risk anything happening Tuesday where I couldn’t go. Go cast that ballot and bring a friend. Let’s not be the reason we lose here in GA.",
         "LezDoIt!",
         "Pennsylvania is a must win for Trump, what ever way Pennsylvania goes so to will the election in my opinion",
         "They'd also have to know in advance how many Trump votes are cast *on election day.*\n\nWhich is why it was a \"bursting pipe\" last time around which prompted an evacuation.",
         "This doesn’t say anything about the ones collected over the weekend. Makes it seem like it’s ok because it says ballots collected by 7 pm tomorrow. ??? What am I missing?",
         "I don't think this says what you think it says - it doesn't say anything about the votes from *this past weekend* (after the end of early voting), it only talks about absentee ballots received *after election day*. I think you have the Cobb County mailing of 3K mail-in ballots confused with the weekend shenanigans in Fulton, Dekalb, etc.",
         "John Basham posted it on X along with a copy of the order.",
         "My point is you could mail it on time and a bad actor could sabotage it. There has to be some brief grace period to make sure people have time to check if their ballot arrived and investigate if it didn't.\n\nGovernment workers are overwhelmingly Democrats. Do you really trust some Democrat mailmen to handle hundreds if not thousands of Republican ballots?\n\nIf cheating were to occur, it would be much easier for them to \"lose\" ballots from red counties than to create fake Democrat ballots.",
         "The only way would be to say it violates some constitutional right. But it doesn't. In fact allowing them to get away with it would be what violate rights as it gives special treatment to voters depending on where they live and who they are likely to vote for. And they can't say the ruling violates the legislatures rules (which was the valid electors clause argument from 2020 even though SCOTUS was too chicken to take it) because that didn't happen here.",
         "It would be challenged as a violation of the equal protection clause of the 14th Amendment, which is a guaranteed federal right. So yes, it absolutely can be appealed to the federal courts.",
         "Surely the ballots submitted will have to be counted though, don't you think? I don't know Georgia law but the people who turned them in late were told to do so.",
         "I did a little more reading and it's 3000 ballots from Cobb county. If they're received before the polls close tomorrow they'll be counted, but they won't be accepted late.",
         "He could take Wisconsin and be ok provided Az is truly red this year. But yeah , PA certainly gives us a a buffer. I don’t see Michigan happening anymore unfortunately.",
         "So it looks like civil rights groups had fought for an extension in the counting of absentee ballots so that 3000+ ballots that are expected to arrive after election day could still be counted. The extension was granted, and then the Georgia Supreme Court said no and cancelled the extension. OPs post is incorrect. This is still a win for election integrity, but not like how OP is describing it. 3000+ absentee ballots won't be counted because they are expected to arrive after tomorrow.",
         "No. \"Ignorance of the law is no defense.\" If they were too late, they were too late, regardless of what corrupt election officials told them.",
         "AZ has the best early voting data of any swing state, R’s are outvoting D’s +9 in AZ so far, which is nuts",
         "I doubt Michigan goes red but you never know, especially with the voting shenanigans there",
         "That works for me, we know which party lives primarily in Fulton county and those nearby. I used to tell my kids that quote once they started driving, lol.",
         "Michigan has a lot of industrial union workers. Plus the Arab x-factor.  \nI also believe it is the least likely of the swing states to go for Trump, but I wouldn't write it off just yet.",
         "I’m not an expert just a guy with a laptop but none of the polls are going Trumps way in Michigan"
      ]
   },
   "1gk08m0": {
      "title": "Trump doesn’t lose Dixville Notch for the first time, tying Kamala 3-3",
      "text": "He lost to Hillary 4-2, he lost to Biden 5-0, he’s tied Kamala. This could be a big sign of the day ahead if everyone shows up to vote. Let’s go win.",
      "comments": [
         "Democrats are already framing it as \"half of Haley's voters have flipped to Harris\" since they apparently all voted for Haley in the primary. Lol",
         "Absolutely insane how strongly the rest of Reddit is clinging to that one Iowa poll. They are literally already counting on winning Iowa lol",
         "Massive 50% shift in favor of Trump from 2020.",
         "Great start to the day.",
         "What the hell did you just call me?",
         "Hopefully this is a good sign of things to come. ",
         "Yes there are lots of signs he's going to not only win, but win by a lot.",
         "Has me worried because they said it was 4 republican voters and 2 undeclared. That means at least 1 registered republican voted Harris. Cringe.",
         "Fox's article on this split doesn't mention stats from the last 2 elections. I wonder why.",
         "I’m 30(M) and love to see the tide turn… but it is shocking whether it be friends of friends or people I know through social media.. Even my close friends fiancés or girlfriends etc.. still don't necessarily jive with Trump specifically for the abortion/roeVwade issues.. and that’s the only reason.. I feel like Ivanka could’ve helped with that demographic or am I missing something??\n\nRegardless. Big day. Excited to go out and vote. 4 more years!",
         "MAGA",
         "This post, my coffee and 3 donuts just started my day off very nicely!\n\n  \nLFG!! VOTE VOTE VOTE VOTE",
         "Sometimes our voting practices feel like a superstition from the Middle Ages.",
         "The two \"independents\" are definitely Democrats who registered as independents to vote against Trump in the primary ",
         "If Harris’ team thought it was legit then either herself or Walz would’ve scheduled something for Iowa after that poll dropped. That never happened. \n\nAt best it was an outlier and at worst it was an intentional shock poll meant to drive up voter enthusiasm for Democrats after Republicans showed up en masse for early voting.",
         "They also think they’re gonna flip Texas.",
         "They're clinging to that news because they are desperate for good news. Harris had not been doing well in October at all as her polling dropped.",
         "Trump won Iowa by 8 against Biden and by 10 against Hillary.   He's not losing Iowa in 2024.  He's probably  +9 there right now",
         "I still think msm made it a big deal ahead of the posting on purpose because they knew the results already. I 100% think it was skewed on purpose",
         "I live in Minnesota, bordering Wisconsin and Iowa. If MN is a toss-up, Wisconsin and Iowa should be red - they are way more republican than us. \n\n\n(It could be just because so many Minnesotans hate Walz, but I digress.)",
         "The one poll that admitted they over sampled \"older white liberal women\" haha. The real Iowa poll is +8-11 Trump LETS GO!!!",
         "It seems to be true. I've been desperate to not give myself a confirmation bias but only absorbing things that support what I want. But it really seems like he is edging into a win. We shall see! ",
         "That's probably why Melania came out pro-choice in her book.  Trump for his part wants to find a middle ground.  He thinks it belongs to the states and personally supports exceptions and has spoken against a 6-week ban he considered too soon.  \n\nMost of Europe puts the ban as 12 weeks and that's really where most Americans are at.",
         "Democrat influencers went crazy posting that poll talking about “easy blue wall wins because Iowa is going to them too”. It was clearly an enthusiasm poll. One blue wall state goes to Trump and he wins, that’s it. Just one. It was a desperation poll.",
         "It's not gonna happen. I drive all over Texas regularly. I spent time in liberal AF Austn a few weeks ago as I regularly do, and I actually saw a ton of Trump signs, to my surprise. I guarantee you that is a huge sign that Texas is not going to flip. I've never seen conservative signs like crazy in Austin before. It is very uncommon.",
         "Which do we think is more likely, WI or PA?",
         "I agree. I how Trump wins by evem a  percentage this time.",
         "Texas may go a little pink, but it's definitely not blue. Although Ted Cruz and Collin Allread are neck and neck, it could be anyone's game, but Texas will still be Trump country."
      ]
   },
   "1gjlya8": {
      "title": "I hope Trump wins.",
      "text": "Voted for him a third time yesterday. As a big middle finger to the MSM for lying about him 24/7. I'm not going to vote on the side of liars. If the media would just report facts and not add some demented spin on everything to demonize him then I'd be willing to give democrats a fair shake. But that's not what's happening. I used to think I was liberal until I joined Reddit.\n\nEdit: now I got Reddit liberals reporting me for suicide watch and going through my comments to harass me on other subreddits. I have absolutely nothing against liberals. Vote for Harris if you want, that's your right as voting for Trump is mine. If Harris wins, I'll be happy for you.",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "When the entire establishment of warhawks and career politicians come out against a candidate, that's a good indicator of exactly where your vote needs to go. Not sure where people are getting this sudden belief that politicians serve anyone but themselves.",
         "Voted for him for the first time in NJ, hopefully NJ wakes up because it's getting impossible to live here.",
         "Don’t forget you’re helping chase Whoopi outta our country lol. Get out and VOTE ya filthy deplorables!!",
         "Same! A big 🖕🏻to leftist Redditors and the left in general, another 🖕🏻to the media",
         "I just hope the polls are under predicting him again. We need to win or they will stack every state with so many illegal immigrants and give them the right to vote.",
         "Voted for Trump for the first time, as a former Biden supporter. Watching this country go nothing but downhill over the last 4 years, and how Biden's policies wrecked my family and the middle class gave me a rude awakening. As an Oregonian, I've watched the far left take a beautiful state and turn it into a crime-infested drug haven with radical socialists in Portland controlling every single piece of policy. It's about time we take our country back.",
         "3rd time in one election? That’s voter fraud!…….mainstream media probably. \n\nTaking things out of context. Their MO.",
         "MSM is nothing but lies. They lie favorably for Kamala and negatively against Trump. I literally don't even have to research anymore to see if whatever is being reported is true because it never is. Just look at the source reporting it.",
         "Anyone that called themselves center-left before ~2010 and is still a Democrat was never center-anything, they were just \"Team Blue\".\n\nI voted for Obama twice; but at some point, I just had to acknowledge that the Democrats were no longer a party of Liberals, but of Progressives. I didn't move. I just got left behind. Being a Liberal in 2024 is a solidly Conservative idea, and that's why I'm here.",
         "Me too. I voted for him in 2016, 2020, and again in 2024.",
         "I hope he wins to punish the Dems for all their Covid crap, and then for lying to us about Biden's dementia for years until he became a political liability. Not a liability as a world leader, mind you, he's been that for years and still is. But as a political liability who might cost them power. That's when everything changed.",
         "Former third-party voter here. My middle finger was to the media, government, and medical industry for lying to us about COVID.",
         "Land\nSlide",
         "Big upvote, feel the same! Voted already Trump for the 3rd time also",
         "Report the suicide watch as harassment.   They get bans for that. ",
         "Wife and I voted for him last week. Anxious about possible election frauds but hoping whatever happens is legitimate and not some bullshit. I don't see how Trump can lose and pray he doesn't.",
         ">1,042 points (64% upvoted)\n\nLots of salty salty people lurking in this sub.",
         "We all do. VOTE\n\nand then hope for the best.",
         "I have a feeling Trump wins but I am more hoping the media has a realignment. One of my favorite pastimes is being able to read/watch the news without obvious distasteful spin.",
         "\\> Voted for him a third time yesterday.\n\nOutstanding...I see your inner (D)ifferent is bleeding through.  s/\n\nEdit...lol so many trolls...see you guys Wednesday.",
         "I can’t wait for Trump to win. I’ll be watching Steven Crowder’s election coverage until it’s announced. I’ll be reading all the drama on Reddit as it’s happening.",
         "VOTE",
         "Me too!!  vote it’s the last day, do whatever you have to do today to vote.",
         "I mean doesnt it kinda feel like the dems handed him his 2nd term on a silver platter? I mean, we have Biden dropping out, years of messed up economy, scandals, all the stuff from the 2020 campaign coming out to be lies literal months after Biden takes office. Its almost like him getting re-elected was supposed to happen. If he doesnt get elected, then i will be shocked because how the heck after all that he still loses. He wont be able to run again, he might lose all support.",
         "Report every single one of the RedditCares messages.  They will ban people abusing that tool.\n\n\nEven though he's not my favorite, I hope he wins too.  Kamala has a lot to answer for, especially for lying to us so long about Biden's health.  What else would she lie about?",
         "[removed]",
         "I relate to this…if trump doesn’t win, the media will be justifying themeselves and keep lying about republicans",
         "You and I think alike. Wear those reports as badges of honor. Anyone who takes the trouble to stalk you is really just letting you know the degree to which you triggered them. I know you say that isn’t your goal, but it brings me joy.",
         "You do, huh? Brave of you to post that here",
         "I can't lie, he is pissing off all the right republicans and democrats.",
         "When the establishment says “something is a threat to democracy” what they really mean is a threat to their corrupt bureaucracy",
         "Additionally, Iran and Russia put their support behind Harris. When your enemies want to see a specific party in power, you should do everything to make sure that doesn't happen.",
         "If America actually elects a president who’s only selling point is a bastardized argument in favor of abortion then we all deserve what happens next.",
         "Ayyy I also placed my voting gabagool on Trump",
         "Thank Murphy for that, partially. Was always a high cost state but it keeps getting worse. Min wage hike didn’t help..",
         "Get on with the times will ya. We are garbage now.",
         "She keeps saying she'll leave but never goes",
         "I didn't necessarily vote against Harris, but I was sure to vote against the Media machines, Reddit especially. \n\nEDIT: Oh, but when I filled in that Trump oval... I did think about Harris's stunt and nonsense during Kavanaugh.",
         "Narrator: they were.",
         "Welcome Mr. Ripe. I'm from Humboldt County and so happy to be a Texan now. You are right Oregon was a beautiful state just like California.",
         "Do you think your case is isolated? Do you see more switching in your family and friends group?",
         "To be honest, it took me a second to get that he meant in 3 elections. I also am only on my 1st cup of coffee.",
         "🛝",
         "Lol.....apparently not a moment in time for obvious sarcasm.",
         "This sums it better than anything we can not forget about China in the mix also.",
         "You should be in Washington State.  All the lady legislators did was run ads on abortion; I've seen ads by Maria Cantwell and Kim Schrier ad naseum this election season and its the only topic. The only thing they try to do is try to appeal to women for whom this is the only issue.  Everybody else can go to hell.  They will both almost certainly win and it just makes me ill.",
         "It's been shown and stated everywhere what the top 3 issues were that everyone is voting for and abortion was not in those top 3. I personally know a lot of women that are voting for Trump and don't care about the abortion rights. \n\nBut it's when I read all of these posts especially from the left that say the women are going to win the election this year, it's pretty damn sad just based on that alone",
         "This argument is bullshit. I don't deserve what happens next and neither do you. Neither does our families.\n\n\nIf our country elects Harris, those of us who are moral, God-fearing people just trying to make a living to support our families are going to be the people who suffer the most.",
         "\"All this from a slice of gabagool?\"",
         "I would say my case isn’t isolated. My brother has switched to the right as well, along with a couple of my friends. Some are still left though.\n\nThe vast majority of young guys like me that I meet and talk to though are conservative. I think Gen Z men are overall becoming more and more conservative because the left has either zero or straight up antagonizing messages for young men. That rhetoric is eventually going to come back to bite them hard.",
         "Can't win em all",
         "Are you telling me that Carmen Goers WON’T join extremists to push project 2025, and put doctors in jail?? \n\n/s in case it wasn’t obvious lol",
         "Not to mention the obnoxious lying around the initiatives. I was up visiting relatives and I couldn't believe what I was seeing",
         "I noticed this when I was up there in June, some of them were gleeful while talking about the sunject.",
         "Even if they care about abortion it's not realistically on the ballot so it should have no impact on anyone's vote. This is why people make fun of women.",
         "Sarcasm free day in here after 2020, haha. Cheers, man.",
         "Goers will lose, Reichert will lose.  Ferguson will be governor and Cantwell will continue on for life. My property taxes will continue spiraling upward as they pay school administrators $200-700k a year. Patty Murray, the world's dumbest senator, isn't on the ballot but she will probably continue winning re-election.  If I have a job come up in Idaho or Texas, it could mark my exit.",
         "But a lot of the libs on here are saying it does. Tons of postings on that alone",
         "We followed our daughter and family 6 months after they moved here June 2021. Left California after 64 years. My sister and brother live in Washington. Sis would love to leave, but can't leave her grandchildren. I hate to think we would still be in California if not for our daughter and retired Marine Husband.",
         "Yeah because what else can they run on? They are conditioned their whole lives that democrats are the good guys we are the bad guys. It's deep psychological conditioning so they will latch onto any excuse to rationalize it rather than change their position if they can help it. Many of them are lying about that being the real reason but they have nothing else to say because they're so obviously on the wrong side. They have to create caricatures about abortion and democracy even though when you push them on it it comes down like a house of cards. But as they say, \"you can't reason someone out of a position they didn't reason themselves into.\"",
         "[deleted]",
         "Good points all valid. Love your \"You can't reason\" line too.",
         "Yeah it's hot here in Texas, but I'm getting used to it even though I lived my first 64 years in a county where if it got to 70 degrees we all thought we were dying. Now 70 is cool (been here almost 3 years)."
      ]
   },
   "1gjnr88": {
      "title": "Apparently Kamala has an issue with saying \"Merry Christmas\". Team Trump posted this and it has gained lots of views and likes.",
      "text": "",
      "comments": [
         "Never forget when Dems all coordinated the term \"easter worshipers\" and then got angry at people asking why.",
         "Is that a real video of Kamala?? The whole thing feels like parody, which I guess is on brand for the state of politics in this country 😅",
         "I'm no Kamala supporter, but her quote is terribly missing context.  Practically a lie the ways it's presented.  Notice how her clip is so short?  It's because she was saying that we shouldn't be wishing each other Merry Christmas in the face of kids having their immigration status pulled from them. \n\nWe can win this election and still tell the truth.",
         "See she's very sure of herself and to the point when she's actually honest.",
         "The most emotion she’s ever shown was over killing babies and not saying Merry Christmas. Says a lot about her character!",
         "Pffft… More practiced & rehearsed anger.\n\nhttps://imgflip.com/gif/987yiq",
         "#Merry Christmas one and all!!!",
         "[The people calling you weird](https://www.youtube.com/watch?v=VEFz2J56n7M).",
         "NGL Kamala sounds like me seeing christmas stuff put up in the stores the day after Halloween. That is for the day after Thanksgiving and not a day earlier.",
         "[removed]",
         "I can’t even describe how much I love this.",
         "This has quickly become one of my favorite Christmas songs. Trump sings, *Christmas is Here*.\n\nhttps://youtu.be/nranUeNkXpM?si=C2rAQMnCm7cURvfK",
         "Man this is the shit they do to Trump and we get pissed about be better guys. There is plenty of negative things to post about kamala we don’t need to edit shit like this",
         "I will never understand this.\n\n\nI have no issues wishing Muslims \"happy hari raya\" even though I don't believe in Islam or it exists and I am an atheist who truly believe all religions are man made including Christianity. \n\n\nI believe every Holy book was a novel written by men in the past. \n\n\nBut what's the big deal to say \"Merry Christmas\" to those who believe in it? ",
         "Meme magic is real!",
         "Never Forget Biden deemed “Trans Awareness Day” on Easter",
         "[Full quote](https://www.youtube.com/watch?v=fk91YYJUHus\n):\n\n> \"and only when they cleared that vet did we give them DACA status and now we're talking about taking it\naway. it is morally wrong and when we all sing Happy Tunes and sing Merry Christmas and wish each other Merry Christmas these children are not going to have a Merry Christmas. how dare we speak Merry Christmas. how dare we.\"",
         "Eh, once Kamala misquoted Trump's interview and spliced it to suggest he wanted to use the military to attack the American people, any adherence to the Marquess of Queensberry rules is out the window. Lie about the witch all day long, I say.",
         "Unlike when she's talking about ballot initiatives from her own state of California like prop 36. When asked by a reporter how she voted she refrained from comment as not wanting to endorse one side.\n\nYou want to be president but you won't tell the country how you feel about a piece of legislation? What do you think you're going to do if you win?",
         "And they say Trump is Hitler, her tone and mannerisms seemingly awfully angry Nazish....",
         "Thanks. I had blissfully forgotten that.",
         "Plus Christmas is an official U.S. holiday, and it has completely crossed over into the secular world. It's existed as a separate entity from religion for so long that the 1965 Charlie Brown Christmas special's main theme was about people forgetting that Christmas is about the birth of Christ. It's obviously a religious holiday to Christians, but it has a completely parallel existence as a secular holiday.",
         "The annoying thing was the the left came out in droves saying “It was always on that day. Why do you have a problem with it now?” It’s because the one year that Easter lands on that day, which it rarely ever lands on that day, is the year they decided to make it an official day.",
         "Theeeeeere we go. I was thinking “surely I’m missing some context here.” Still think it’s a very funny edit, but makes it feel a little more “normal” from her (whatever normal means).",
         "What's good for the goose is good for the gander.",
         "Tone seems a close match to Tokyo Rose.",
         "It also shows that Biden and his administration care more about trans people than they do about the Christian morality that tries not to validate that lifestyle.\n\nA President who claims to be Christian, while failing to uphold any Christ-like values, is nothing more than a snake."
      ]
   },
   "1gjnrr8": {
      "title": "New Trump ad just dropped staring Elon Musk, Tulsi Gabbard, RFK Jr., Nicole Shanahan, JD Vance and Vivek Ramaswamy.",
      "text": "",
      "comments": [
         "Just imagine if Ron Paul got in on this too. RFK Jr put it out there.",
         "Banger ad. We have 24 hours to decide this country's future. Don't wait, don't be lazy, don't get complacent.\n\nIt's time to push through the finish line and WIN.",
         "Feels like the Avengers forming.",
         "Whoever edited this deserves a raise",
         "Where is this playing? The most important thing is who sees this in the next 24 hours.",
         "Not gonna lie this gives me exactly the same vibes as that final / closing ad from 2016, where I was like dang how could you not be down with that message. Time to bring it home.",
         "Man this needs to be played everywhere. No division, no hate, no name calling, just all about our country moving forward together and achieving greatness.",
         "I just don't see how anyone can be against this campaign. Biggest tent campaign I've ever seen. Former Democrats, former never Trumpers, classical liberals. Elon Musk was the champion of the left as the leading EV manufacturer until he had the nerve to have opinions.",
         "This shit got me so hyped. What a fuckin banger!",
         "Thats a banger ad cant wait.",
         "What a world where democrats have to admit Donald Trump is the coalition moderate candidate.",
         "The ONLY one single thing I would have changed on that... Is I would have had the FIGHT FIGHT FIGHT clip. \n\nI have to be honest, NOT USING THAT ALL THE TIME has me confused. I get they don't want to encourage another try, but come on! It is ICONIC.",
         "They should have been spamming this shit for the past week. Fantastic ad, really drives home the point that the MAGA message is for *everybody*.",
         "Not gonna lie, his ticket is basically a dream team. His momentum is huge.   \n\n\nAnd I say that as someone who genuinely started off really disliking Trump.   \n\n\nHope this team wins.",
         "We need the link to this one. Dang, that is a kick ass ad.",
         "This is great. It makes me happy.",
         "Wow. Amazing. What a line up we have, we have the best and most intelligent political leaders. I don't even look at them as politicians. They are the voices for us, and they want us to succeed and progress in life. They actually want what's best for our people and country. We haven't been able to say that abt the democratic side in a long time. Where you at Candace Ownens! She needs to be in this line up as well.",
         "A political ad has never made me tear up before. This is amazing. So optimistic.",
         "I wish the people that constantly hear about how evil and racist and sexist the Trump campaign is would actually pay attention to the Trump campaign.",
         "Fucking goosebumps!",
         "Damn where's the IG reel I can repost?",
         "This is Beautiful! One of those \"Tear in my eyes\" moments",
         "🇺🇸❤️I’M LOVIN’ IT!!!!❤️🇺🇸🙏🏻🙏🏻🙏🏻🙏🏻",
         "It's a good ad.",
         "First time I watched this, I watched it muted and STILL got goosebumps. What an incredible coalition of world-changing passion, dignity, and love for this country.",
         "I hate to use emojis here, but this necessitates it…\n\n🔥🔥🔥",
         "Did this have anything to do with the whole SNL/NBC bit?",
         "This is the future they want to steal from you",
         "I literally don't understand why Nicole Shanahan is being used in any of this. It was even crazier that she was RFK's V.P. Any political office is entirely out of her league and above her paygrade.",
         "Why did they wait to so long to make and play this ad? This is perfection.",
         "Incredibly uplifting. Anyone saying otherwise has their head in sand.",
         "We've seen what _one_ unabashedly conservative Governor, Ron DeSantis, is capable of. It was a massive missed opportunity not electing Kari Lake to join him in Arizona.\n\nI pray America doesn't pass up this opportunity to bring Elon, Vivek, RFK, Tulsi, JD, and Trump to Washington to get shit done.\n\nAll the damage Kamala and the Democrats can (or will continue to) do pail in comparison to the missed opportunity this group could deliver.",
         "Is the last shot with them walking AI looks kinda odd. The rest of the add is spectacular!",
         "One word to describe this ad\n\nGENUINE",
         "This blows away any Harris ad",
         "RFK’s endorsement was crucial. I think it really started to help turn the tide. We could still be toast but I’m glad Trump had so many former democrats and others with just common sense standing behind him.",
         "That would make Kamala Thanos? That tracks considering she only gives a crap about half of humanity.",
         "The imagery is incredible.\n\nAnd I gotta admit… Tulsi looks really good.",
         "But they actually assembled for Kamala /s",
         "It's great!I got some hope",
         "Hopefully in every single swing state on as many channels as they can get it on.",
         "Got a link to that?",
         "Same here. If Trump wins someone needs to edit “fight fight fight” right onto the end of this ad. That picture is one of the most iconic in my lifetime.",
         "Yeah but we have had a lot of great ads this cycle not just this one. [Check out this one](https://x.com/MAHAalliance/status/1849965434898161672) that absolutely demolishes Kamala.\n\n[This](https://www.youtube.com/watch?v=AFcrA3EeVp4) and [this](https://www.youtube.com/watch?v=Ipi5JpqkTfY) one are themed to focus more on Trump and his campaign's goals and policies. They are great as well.\n\nAnd the [JD Vance one](https://www.youtube.com/watch?v=XYDRWu0Dvj0) was also really well done.",
         "RFK's involvement never appeared to have any affect on the numbers. I personally think he would've been more helpful staying in as a spoiler to Kamala. Remember, the Dems desperately wanted him off ballots in the beginning. He was expected to take votes away from Biden.",
         "She's not impressive enough to be Thanos. Maybe tazerface",
         "Be cool man. ;)",
         "Those are Diddy-affiliated Actors. Don't need them.\n\nThe people on Trump's team are the real deal. It's hard to tell without the smoke, wires, spandex, and steroids. You need to actually hear the words they use.",
         "[So cringe](https://youtu.be/TDvUe8fIuNs). Everything about their campaign is fake. They even have to bring out a fake Iron Man to contrast the real life one on our side. The differences between the two paths ahead of us could not be more stark.",
         "Kamala Harris, Down with Democracy!\n\n\n\n\n\n\n\n\n\n\nWait...",
         "And the “slogan” the actors came up with is Kamala: Down with Democracy. Fitting. It was cringy."
      ]
   },
   "1gjrxtr": {
      "title": "Here's your reminder:",
      "text": "Regardless if you live in a state that goes blue every 4 years, if you think your vote doesn't matter, IT DOES. \n\nGo out tomorrow and vote like your life depends on it, because it does, and this election is the most important in our nation's history.\n\nVOTE VOTE VOTE!",
      "comments": [
         "CNN: Trump finalizes campaign with fascist salute",
         "Let’s go baby!",
         "That's my president",
         "FIGHT!",
         "Blue Oregon warned us its going to take a few days to tally *all* the ballots.",
         "Liz Cheney would be in a Kamala cabinet. Kamala Harris and Liz Cheney would be running foreign policy. ***Vote***.",
         "Don’t give them ideas lol"
      ]
   },
   "1gk6kui": {
      "title": "Harris campaign tells Muslim interviewer he can't ask about Gaza, she talks up bacon instead: 'Taken aback'",
      "text": "",
      "comments": [
         "She is unqualified in all aspects to lead.",
         "This has got to be made up bs. Her position on people taking their shoes off on airplanes? Bacon?"
      ]
   },
   "1gk67ty": {
      "title": "Its confirmed, Imane Khelif medical report leaked. Read and decide for yourself.",
      "text": "",
      "comments": [
         "So everyone with eyes and a brain who had serious suspicions was right. \n\nAnd everyone who refuses to acknowledge the basic truths of biology who used this person as a sort of victory lap to dunk on us for being wrong were actually making fools of themselves. \n\nThis reminds me of when i heard there was a lan basically called “the wuhan covid 19 virus creation research facility” 20 feet away from the first reported covid 19 case and i said it probably leaked from that lab and got called racist.",
         "Those poor girls he beat on, so sad.",
         "They need to bring back chromosomal testing.  Why they stopped is beyond me.  You’re XX or XY.  I don’t want to hear about those 1 in 100 million people with some strange mutation going on.  We need to stop catering to the statistically extreme.  You know what?  If you’re one of those non xx or xy people, tough shit.  Such is life.",
         "Not surprised.",
         "Another 'conspiracy' proven true. We are on a roll this year.",
         "Oh, that gold medal boxer.\n\nThis was a \"duh\" moment at the Olympics, but obviously not to the Olympic committee.",
         "JFC ",
         "Also note that Imane is Algerian, where it is [illegal to be trans](https://www.equaldex.com/region/algeria).",
         "Actually I don't think so, I think they need to push ahead with this stuff, I'm cheering it on. It's radicalizing normies against the global communist agenda, and it's entirely inconsequential to me. It's exactly the kind of wedge issue the globalists themselves use against the common people, only this time its backfiring on them and we can use it against them.\n\nIt does harm female athletes themselves, but it's entirely up to them if they want to take a stand and put a stop to it or not, they could stand up and end it all tomorrow if they chose to. The rest of us shouldn't stick our necks out, just bathe in the flames of the dumpster fire.\n\nI want to see male and trans athletes dominate all womens' sports. Tennis, soccer, basketball, olympics, golf.",
         "I hope women sue the Olympic committee, especially Angela Carini who took punches from Imane.",
         "Well, she's not trans, she was born that way, if this is true. You can't outlaw genetic mutations, lol.\n\n\nShould it have been allowed for her to compete? Hard to tell, it really is one of those extremely unlikely cases (again, if this report is true) that we keep hearing about in lgbt discussions."
      ]
   },
   "1gjw84r": {
      "title": "Joe Rogan Endorses Trump ",
      "text": "",
      "comments": [
         "HELLO FREAK BITCHES",
         "Well it’s about fucking time",
         "He has essentially been doing so without outright saying it. His podcast has been a powerful mechanism for exposing the legacy media’s lies, corruption and general lunacy from the left. Now that he officially made the endorsement I could see him becoming public enemy #3 right behind Musk."
      ]
   },
   "1gjw3m1": {
      "title": "Breaking.....Joe Rogan endorses Trump!",
      "text": "I listened to both 3 hour interviews with President Trump and JD Vance. Very interesting conversations.  I may even listen to the podcast again sometime.\n\n[https://nypost.com/2024/11/04/us-news/joe-rogan-announces-endorsement-of-trump-while-promoting-elon-musk-interview-on-x/](https://nypost.com/2024/11/04/us-news/joe-rogan-announces-endorsement-of-trump-while-promoting-elon-musk-interview-on-x/)",
      "comments": [
         "Its time to take this country back boys"
      ]
   },
   "1gjrp4i": {
      "title": "BREAKING: Georgia Supreme Court gives BIG victory to Republicans on election day voting",
      "text": "",
      "comments": [
         "HELL YEAH!!",
         "This needs to be the law of the land. All 50 states.",
         "Generally support this, but what about the military members who didn't receive their ballots in time? That's a very republican voting bloc. Any updates on that situation?",
         "Perfect. No late ballot dumps",
         "Election DAY not WEEK.",
         ">The Supreme Court in Georgia just ruled that no election office can extend voting to accept ballots after election day, according to Josh McKoon, chairman of the Georgia Republican Party.\n\nIn case you want to skip the clickbait and ad-gore on the site",
         "1 state out of 50…",
         "I'm happy for the win but its pathetic that this issue has to go to the state supreme court.  There should be a deadline that absentee ballots should be in a few days before election day so those votes and early in-person voting can be counted before election day then count the election day ballots on election day.  Forgot to send in your absentee ballot with enough time for it to arrive by the deadline?  Go vote in person then.  The rest of the country shouldn't have to wait for the results because the people who didn't bother getting their mail-in ballot in the mail on time.",
         "No votes after Election Day? What a joke this has become. The world is laughing at us.",
         "Why is this even a case? It boggles my mind how people are so anti the Republican party that there has to be a court case to stop illegal ballots from being cast, and it's a partisan issue. \n\nWth is wrong with people.",
         "don’t listen to it, get out there and vote.",
         "Not just for Republicans, but for Election integrity.",
         "You gotta like it",
         "Fuck Fulton County. Can't wait till I move.",
         "How do they un-count the ones that were added over the weekend.",
         "Sad when it requires a Supreme Ruling to make people follow election law.",
         "Sone good people Stopping the steal!",
         "Big win, but I still don’t trust ratchet cities like Atlanta and Philly to not attempt corrupt stunts. For example, the post office back dating postmarks",
         "My sentiments exactly.",
         "I love how they waited until the one day before the election to make this ruling. \n\nImagine all the liberal tears from people who mailed in their ballot this morning, thinking the state would just count their ballot.",
         "What happens if it's a delay caused by the post office though? \n\nPostmark date seems pretty reasonable, but granted I'd love to understand it better.",
         "did you read the ruling?  the last paragraph clearly states:\n\n\"does not pertain to voters entitled to vote under the federal uniformed and overseas citizens absentee voting act\"",
         "Deployed military have an exception to ballot rules. Their votes will count when they finally receive ballots and vote.",
         "I have never seen where there ballots change the election outcome. Not enough to sway it. They get their ballots in plenty of time. Although I am sure they could make an exception for them. They just don’t want any late night dumps.",
         "I agree with the hard cutoff being a hard cutoff, but I liked voting for Trump early.",
         "Squirrel murder is somehow a partisan issue now lol",
         "You can't rule certain ballots can't be counted until those ballots actually exist. I.E. ballots received after a deadline, can't exist until that deadline passes. So a judgement on those ballots can not happen until both the deadline passes and the ballots exist.",
         "Then they need to account for such delays and make sure and mail their ballots in time.\n\n\nPost marks are too easy to fabricate. \n\n\nBallot counters either have them in their hands on election day, or they don't count.",
         "Maybe they handle things differently with election mail, but I can't tell you the last time I got a mailpiece with a visible postmark. Maybe they're using some kind of glow in the dark ink like the Chuck E. Cheese hand stamps or something, but I am not really convinced that postmarks are a thing anymore based on my recent experiences.",
         "Even so, Republicans have been encouraged to vote by mail more this year than ever and Democrats have backed off mail in voting (here in Georgia specifically Ossoff has been on a crusade against DeJoy/USPS and Democrats no longer have faith in the postal service). All it takes is for a Democrat mail man to \"lose\" ballots from red counties and make sure they don't arrive on time. This ruling means there will be no time for an investigation if something suspicious happens. There's a very real chance this backfires on us.",
         "Good to know. Thank you.",
         "Holy shit, this is amazing.\n\nSecuring the predominantly GOP votes, and tossing out a bunch of dem voters who probably will never even realize that their laziness cost them their vote.",
         "Except this time.",
         "There was an article this morning about the federal government not providing them with enough ballots, as if this is not typical and is a unique problem this election cycle. That's what I'm talking about, not how it generally is historically, but this year in particular.",
         "99.9% of mail in ballots are fine. \n\nI like our odds of securing low-propensity voters and “un-enthused voters”, who may walk away at a long line or let their schedule make them not vote. \n\nMail in voting isn’t perfect, I hate it, but it’s a necessary tool we have to use to win.\n\nIn a perfect world there would be zero mail in voting besides military, which would be a vote on base and then counted and digitally sent or something, idk. But we could do so much better."
      ]
   },
   "1gju6pv": {
      "title": "On the Denver ballot",
      "text": "What are we doing? Citizenship is slowly becoming useless ",
      "comments": [
         "There's an issue with foreigners enforcing laws against American citizens on American soil. We fought a war and founded a country to stop that from happening.",
         "Any government jobs should only be held by citizens of the United States. Absolutely insane that this might pass.",
         "Does Denver have so many Hispanics that the ballot is also in Spanish? I'm in San Diego and my ballot was only in English",
         "😂😂😂 so fucking PATHETIC",
         "For firefighters, I’m open to discussion as legal immigrants could use the civil service of firefighting as a provisional employee as a means to gain citizenship. But anything law enforcement related should be off the table. That’s insane.",
         "This is fking crazy",
         "Lowered expectations…. Wonder why they can’t find competent Americans…",
         "Democrat's: we need gun control! Too many people buying guns illegally without background checks (which isn't happening BTW)\n\nAlso Democrats: we want illegal aliens to be cops and to have guns....\n\nSo these psychos really want non citizens policing actual citizens? What in the actual fuck is wrong with them?",
         "Yeah it’s a fucking joke. Not even sure how it ended up on the ballot",
         "Considering your ballot is in the language of the invaders, you might have already lost so good luck voting against that.",
         "That’s interesting. I’m a volunteer firemen and we’re always open to anyone as long as we give you a background check.",
         "I saw this as well and thought it was absolutely insane. Had to read it a few times because it's such a dumb idea especially for any law enforcement, was shocked to see something like this",
         "Well that’s wild. ",
         "Holy fuck",
         "Knowing how much Denver likes to fuck everything up I’m guessing this will pass. 😂",
         "Wow, Denver is really aiming for new lows.",
         "I just don’t understand how we got here. It’s really insane.",
         "So then what happens if you get pulled over by a cop who doesn’t speak a lick of English",
         "Firefighters sure. Cops not at all.",
         "I'd go with NO/AGAINST. Do we really want the government hiring foreign mercenaries to murder U.S. citizens?",
         "Dang.",
         "[removed]",
         "So I’ve served with maybe a dozen guys who got their citizenship through military service. I respect that. Move to America and earn your citizenship by serving the country. \n\nIf Denver, or other cities and states, did something like this as a pathway to citizenship for legal immigrants I would absolutely support it.",
         "Just think how many fake ass ballots will be putting yes on that.",
         "To be fair, if you have a work visa you can do other jobs. ",
         "Wait you're telling me all the king had to do was pander to the left? Is he stupid?",
         "Why? You can serve in the US armed services as a path to citizenship.",
         "You don’t have to be a citizen to serve in the military tho",
         "There are several medal of honor recipients that were not citizens when they were serving. Inmigrants can hold federal jobs and do it honorably.",
         "They do now",
         "My absentee ballot from Pennsylvania had a link to access a Chinese translation -.-",
         "*laughs in spanish*",
         "Fire fighters are government employees with pensions and additional benefits paid for by our taxes. That should be limited to US citizens.\n\nI agree with Starship Troopers on this one: the only civil service that should be on the table to gain citizenship is military service. If you take an oath to defend the country against all foes foreign and domestic, and actually walk-the-walk, then after 4 years you should be granted citizenship. (assuming you're a legal immigrant to begin with)",
         "Probably cause no one wants to sit through the forced woke re-education programs government employees have to endure now.",
         "They are full time government employees, not volunteers. That means taxpayer funded pensions  insurance and other benefits. ",
         "You support foreigners governing and enforcing laws against American citizens? How the fuck?",
         "I think that that is a decent exception because it’s a pathway to citizenship and a totally different environment from something like law enforcement. Even military police aren’t really out in the community like regular police are.",
         "https://old.reddit.com/r/Conservative/comments/1gju6pv/on_the_denver_ballot/lvi9ve7/",
         "https://old.reddit.com/r/Conservative/comments/1gju6pv/on_the_denver_ballot/lvi9ve7/",
         "It’s not about holding a job.  It’s about depriving rights away from citizens by non citizens.  A non citizen shouldn’t be able to deprive a US citizen of their freedom by placing them under arrest or enforce laws of our nation.",
         "My thought exactly.",
         "I see a big difference between cops and fire.  Cops, citizens only seems obvious.   I can't understand why a legal resident couldn't be a fire fighter even if it is a government job.  If they're here legally,  allowed to work, qualified and pass a background check who cares?",
         "You have a good point, but I was thinking of provisional employee status for the firefighter role. Not full state employee but something more like an internship or equivalent that is not volunteer, but also not full status state/federal employee with all the protections. To be fair, my idea would piss off the union pretty bad.",
         "Except that wasn't true in Starship Troopers:\n\n\n\n> The Federation makes the opportunity of Federal Service open to everyone, able-bodied or not. A doctor giving a medical examination says \"if you came in here in a wheelchair and blind in both eyes and were silly enough to insist on enrolling, they would find you something silly to match. Counting the fuzz on a caterpillar by touch, maybe.\" The only impediment that can render one ineligible for federal service is if a psychiatrist determines that one cannot understand the oath of service",
         "If it was a pathway through citizenship, I’m open to the concept. Like I said, we already have foreigners in our military. Some of those guys are the best soldiers out there because they’re truly serving for the opportunity to be American."
      ]
   },
   "1gjob0r": {
      "title": "We The People",
      "text": "",
      "comments": [
         "We The Peanut\n\n1 vote for Trump = 1 justice for Peanut",
         "They came for Peanut and I did nothing …",
         "I have a grandson coming in about two months. Might be a cool onesie.",
         "“Nuts!”"
      ]
   },
   "1gjwc3v": {
      "title": "Joe Rogan Endorses Trump on Eve of Election ",
      "text": "",
      "comments": [
         "Jim Cramer thinks Harris will win. If there is one time the inverse Cramer needs to be invoked, it would be now lol.",
         "Kamala missed out",
         "🇺🇸",
         "Biggest election eve endorsement ever. Kamaru Usman UFC hall of famer did tonight as well after Rogan.",
         "Even if she went on the podcast, there is no way in fuck that Joe Rogan would ever endorse her."
      ]
   },
   "1gk5hoc": {
      "title": "Here in Pennsylvania Turnout Looks Good",
      "text": "Of course, we can't tell whom they are voting for, but lines were long here before the polls opened.  ",
      "comments": [
         "WE DONT WANT \"GOOD\" WE WANT GREAT!\n\nOur lives are in your hand PA! \n\nNo Fat Ass Harry's, EVERYONE who's Republican, Independent or Democrat who want Trump as President YOU MUST GET OUT TO VOTE! \n\nMORE....MORE ...MORE ..",
         "We stood in line over 3 hours in Ohio to vote on Sunday. Saw a good amount of Trump support.",
         "VOTE VOTE VOTE VOTE",
         "--I am certainly of the mindset that democrats (overall), would not put forth the effort to wait for anything to that extent. Trump supporters however...well they wait in line over night, in cold weather, etc. It is all part of the dynamic. Shootin' the sh*t for a lengthy amount with like minded Patriots.\nYeah. It's what we do.",
         "support for Trump in MN is looking good, my hope is we make it extremely close as a wake up call to the state.",
         "PA, go and make Scott Presler proud!",
         "Just voted in Indiana, 1.5 hour long line. Very red area",
         "We have more conviction, I agree. Would wait 8 hours to vote if that's what it took."
      ]
   },
   "1gjusyk": {
      "title": "Good luck tomorrow, American friends. ",
      "text": "From a far-right Canadian voter who is enthralled that we’ll be finally getting rid of Justin Trudeau and his Libs in 2025, I hope both of our countries are finally reunited by 2 conservative govts in 2025. Not since 2008 have we had that.\n\nAnyways, I’ve been following your politics closely all year. Praying for Trump and the W tomorrow! 👊 good luck 🇺🇸 ",
      "comments": [
         "FUCK Trudeau!\n\nI moved from Canada to Montana a couple years ago, I feel like a political refugee.",
         "Thank you. We're all praying as well.",
         "I hope things work out for you! I cannot believe he's held power for so long despite all of his failed policies.",
         "Thanks for the luck and prayers! Glad things are going good for our neighbors in the North!",
         "Lets get Pierre Poilievre in office next",
         "LFG!!",
         "Godspeed everyone!",
         "I got a bad feeling about the results, even state results in my historically red state.  Maybe I’m on reddit too much.  But look at 2020 - “ Biden’s too senile” “look at the huge rallies for Trump, Biden gets 20 people for his rally”  2022 - “it’s going to be red wave after 2 years of a terrible economy “  2024 “ abortion abortion abortion” “nazi racist White supremacy “ \n\nI sure hope we get the country back on track but I’m worried half the country doesn’t care as long as Trump doesn’t get elected.  \n\nI did just go vote and the first song on the radio was “ Landslide”",
         "Tbf, he has actually been very successful in his quest to destroy freedoms.",
         "LFGB!!"
      ]
   },
   "1gk6zee": {
      "title": "Just Voted in Missouri ",
      "text": "Despite there being awful rain and flood warnings, the voting place in my town was packed. And, just like the 2020 election, I voted for Donald J Trump for president. For those across the country, if you're able to vote. VOTE! Nonetheless, stay dry, stay sane, and stay safe today. ",
      "comments": [
         "How does your town usually vote? Just trying to sense the level of enthusiasm on both sides.",
         "Today is the day Trump re-takes the iron throne",
         "The town usually votes very Republican. But, since Trump won back in 2016, it's been Overwhelming Republican. Especially with Trump. There's been a custom Trump sign near the entrance of town since 2020.",
         "I pray that's the case"
      ]
   },
   "1gk1mya": {
      "title": "Vote like your life and the republic depend on it",
      "text": "",
      "comments": [
         "Waiting in a windy and cold hour long line in Indiana. Nothings stopping me",
         "Good morning people!! Let’s get it!!",
         "ITS GAMEDAY MOTHERFUCKERRRRRSSSS",
         "In about one hour I will proudly vote for Trump in a deep blue state. Let’s pad those general election numbers to make his win even more important.",
         "We've got a country to save!"
      ]
   },
   "1gk5je5": {
      "title": "Postal worker tosses 300 pro-New Jersey Rep. Tom Kean Jr. election mailers in dumpster",
      "text": "",
      "comments": [
         "If you read the article the good news is that they fired her.  But still makes you shake your head as to how insane these fucking morons are.  Before she got caught and fired she must have felt so special...an actual hero....for the leftists.  Never realizing that the leftist elites that control the state of NJ couldn't give one shit about her",
         "Every time you see something like this, remember: this is just what was caught.  To every one caught, there's likely nine that are not caught.  Remember, Dems are the party of win at any cost, even if that means circumventing democracy itself.",
         "This is why I encourage others to NOT do anything election or ballot related using the USPS. Vote in-person!",
         "This is why I handed my mail in ballot directly to my city clerk.",
         "This is why I vote in person.",
         "It's not enough to fire her, people who use positions of trust to undermine the election need to be prosecuted.  Even without regard to that interfering with mail is a felony on the federal level.",
         "Did they at least get the ballots out of the dumpster? Firing her isn't enough, she deserves prison time.",
         "Shouldn’t she be charged with a crime?",
         "This is just one of the ones that were caught. Having USPS in charge of elections was a mistake (mass Mail in is a mistake).",
         "Even unrelated to voting, my experience is that anything mailed to the government *does not get there.* Whatever happens in person is done correctly, whatever is done over the telephone is hit and miss, whatever is more distant than phone (mail/web) is just rocks and debris in the background.\n\nMy favorite scenario was where the static web page and the recorded phone message were both saying \"not my job, go to the other guy\" back and forth.",
         ">Even without regard to that interfering with mail is a felony on the federal level.\n\nCame to say this. Where are her charges??",
         "I was gonna say, she committed a federal crime so the consequences will be way more than getting fired.",
         "Not ballots. They we’re advertising mailers. Still bad but not ballots",
         "This is the important question.",
         "They weren't ballots just flyers.  But if she was dumping flyers she would have no problem also dumping mail in ballots from heavy republican voting areas of New Jersey",
         "If she dumped Democrat mailers she would be.  Our worthless DOJ would be all over it",
         "Unless you are paying taxes. I have never had anything happen to the taxes I mail in to charlotte, NC. They deposit that shit the moment they get it.",
         "Glad of that. Should still be a felony.",
         "I agree. Hard to have faith in early voting when stories about people dumping stuff are all too common. Glad I live in a state where it's not available.",
         "\"Bills travel twice the speed of paychecks.\" -American proverb\n\nAlso, having been in high school as an adult (a problem school where success stories get fireworks and the students usually hate people by default especially adults) people's stances change mighty fast when taxes are suddenly coming *from* them instead of just going *to* them. Funny how that works."
      ]
   },
   "1gk6c79": {
      "title": "Daniel Penny labeled 'the white man' at racially charged trial",
      "text": "",
      "comments": [
         "For them to bring his race up as if it means anything should be grounds for case dismissal. You try based on actions, not your racist bias.",
         "Obvious show trial, if you have a friend in a blue city don't just tell him to vote tell him to move.",
         "The left is still mad about Rittenhouse and will seek revenge on Mr Perry. And President Trump."
      ]
   },
   "1gk6u2l": {
      "title": "Megyn Kelly Endorses Trump in Pennsylvania; CNN's Dana Bash Shows Her Claws",
      "text": "",
      "comments": []
   },
   "1gjp29q": {
      "title": "Republicans take lead in swing-state early voting",
      "text": "",
      "comments": [
         "Until it says Trump wins, keep up the voting.",
         "Doesn’t matter, go VOTE",
         "1 - The race isn't as close as they want you to believe. 2 - There are psyops of all kinds going on right now including those being run by democrats and republicans. 3 - if everyone expected to vote tomorrow, votes, we will save our country and will have Trump along with a republican house and senate majority.\n\nThe bottom line is, just vote. Seriously. Whether you live in Alabama, Iowa, Pennslyvania, or California, vote.\n\nWe want and need to run up the score to get a Republican government, as well as make sure the message is sent to the right people you can't just install a terrible puppet candidate and win power.",
         "The margin matters! We need to send a loud and clear message that Marxism has no place in America! Tomorrow they will hear from ALL of us! The cavalry is coming 🇺🇸🇺🇸🇺🇸",
         "The Republicans are entering[ election day ](https://www.telegraph.co.uk/us/politics/2024/11/04/election-donald-trump-kamala-harris-live-updates/)with a historic lead in a majority of states, figures show.\n\nThis is the first time that registered Republicans have outvoted registered Democrats in more states since at least 2008, with early voting traditionally favoured by Democrats.\n\nAcross two-thirds of states that produce early voting data by party, registered Republicans outperformed the Democrats in votes cast.\n\nDespite the high numbers, nationally more votes have been cast for the Democrats because [some states have much bigger populations than others.](https://www.telegraph.co.uk/us/politics/2024/11/04/how-us-electoral-college-works-why-created/)\n\nCrucially, early voting among Republicans is higher in Nevada and North Carolina, two[ key swing states](https://www.telegraph.co.uk/us/politics/2024/11/01/what-is-swing-state-key-battlegrounds-us-election/) that will determine the election.\n\nThey have also overtaken Democrats in Iowa and Florida, two states that historically tend to lean Republican, but more recently went blue.\n\nArizona, another key state, was Republican before the 2016 election. In 2020, this lead went to the Democrats. However, this year Republicans lead once again with a margin of 41 per cent to 33 per cent.\n\nAcross all states, around 36 per cent of [votes cast before election day ](https://www.telegraph.co.uk/us/politics/2024/11/03/us-presidential-election-2024-when-dates-candidates-voting/)have come from registered Republicans, compared to the Democrats’ 37.9 per cent.\n\nThis is the slimmest national gap on record between the two parties and a reflection of changing views on early voting which, historically, has favoured the Democrats.\n\nIn 2020, just 30.5 per cent of early votes were made by registered Republicans.\n\nAs many politicians were encouraging early voting due to the coronavirus pandemic, Donald Trump repeatedly raised [suspicions about the practice.](https://www.telegraph.co.uk/us/politics/2024/10/31/polling-chaos-risk-undermining-us-election/)\n\nIn a series of tweets and conversations in September that year, he suggested that foreign countries could easily produce “counterfeit ballots”.\n\nHe stated that the ballots were “uncontrollable, totally open to election interference by foreign countries, and will lead to massive chaos and confusions”.\n\nBut this year, the Republican party has encouraged members to adopt early voting. This has led to a surge in Republicans voting which, in turn, has pushed early votes to historic highs.\n\nAs of Monday evening, 78,185,854 early votes had been cast, equivalent to 49.4 per cent of the 2020 electoral turnout.\n\nThis is almost two-thirds higher than in 2016, when around one in three votes were cast before the election.\n\n**Read more from The Telegraph:** [https://www.telegraph.co.uk/us/politics/2024/11/04/republicans-take-lead-in-swing-state-early-voting/](https://www.telegraph.co.uk/us/politics/2024/11/04/republicans-take-lead-in-swing-state-early-voting/)",
         "Voted last week here in Nevada! Time to tell this administration “You’re Fired”",
         "Blow them away, keep voting!",
         "The Pennsylvania portion of this is not promising so don't take it for granted. Get your friends and family to vote tomorrow if they haven't.",
         "GO VOTE!!",
         "Having the early voting lead is like having a 1st quarter lead. \n\n  \nDoesn't hurt to have, but the game isn't over yet. Gotta keep going. If you haven't voted yet, make sure to vote tomorrow!",
         ">*Despite the high numbers, more votes have been cast for the Democrats nationally because some states have much bigger populations than others.*\n\nI assume these are the pro-abort women in California who have no idea what Roe v Wade is.",
         "This is why these states are allowing 3 days of counting mail in ballots. To combat this with the same Biden playbook.",
         "This statistic is meaningless because how independent voters swing decides this and every election.",
         "I wanna be optimistic about this but also am worried tbat this could be mean less republicans going on ED than we are typically used to seeing",
         "I fear the high early turnout will end up leading to crazy statistics that make the results questionable. We will see but eventually we will have more voters than people",
         "Libs keep saying it's doesn't matter because a lot of republicans are voting for Harris - this is biggest load of shyte I keep hearing this election cycle.\n\n  \nDoes anyone think this will hurt our voting day turnout?",
         "My worry is the pull ahead effect. Pulling ahead day of voters and not really seeing a bump, just shifting the same voters a few day earlier ",
         "Cool, go vote. Don’t let early voting records or doing well in polls make you complacent.",
         "Good! But still get out there and vote red up and down the ballot.",
         "Until it says Trump wins, keep voting....they dont check IDs...... (yes, I'm kidding - don't do that!)",
         "It’s not over until the Berkley Marxists are screaming at the sky!",
         "Amen!!! keep voting",
         "THIS!",
         "Thank you for reminding me. I would have forgotten if I hadn’t seen this same exact comment for the billionth time…",
         "👆 This",
         "What do you think the real numbers will be then?",
         "That would be a good result: a resounding red wave.",
         "We are going red in Nevada!",
         "I made some kind of comment to the sweet of lady who checked me in, about how I wish I had to show my ID or something.   She nodded in agreement and then i mentioned that I know she can't say anything and once again she nodded in agreement.   Yes on 7 :)",
         "There is no \"early vote\" here. Just mail-in voting. You can drop it off in person at a single office in the county if you want. That's the extent of our \"early vote.\" I might've voted early if it was actually set up here. I won't ever touch a mail-in ballot. They are the tool of Satan. They violate every last principle of a free, fair, safe, secure election and the principle of the secret ballot. This country should be absolutely ashamed of itself for being so careless with democracy and setting such a poor, dangerous precedent for the rest of the world by promoting mail-in voting.\n\nThere is absolutely no difference between voting by mail and voting by e-mail. Mail-in voting is the camel nose in the tent for e-mail voting.",
         "Stop dooming. The margin for fraud will be so much lower this time because of circumstances. We can swamp it. Get out and vote.",
         "I'm praying the mail-in ballots are much closer than 2020 and if election day turn out is higher for Republicans like usual than Trump will win this.  I think the Republican observers will be watching the vote count like eagle hawks and there are no Covid excuses for kicking them out like in 2020.",
         "Don't forget about the democrats voting for Trump.   The libs don't want to talk about that.",
         "Vote early, vote often is the Dems catchphrase. lol",
         "That's good, I'm glad you've seen it so many times. I'll probably say it ten more times across my socials / friend groups / etc. before polls close tomorrow, because it's true.",
         "Didn't forget to vote! Call your friends, family, get them out to vote!",
         "☝️That",
         "Especially the Chicago area, which is where I lived my first 57 years... in Florida now (much better!).",
         "You can also vote in bed or vote if you're dead as long as you don't vote red.   Another catchphrase from the dems.",
         "🤘Those"
      ]
   },
   "1gk57wu": {
      "title": "Rage Against The Machine To Play At CIA Fundraiser",
      "text": "",
      "comments": [
         "I've always thought it was strange that the band thinks they are in opposition to the system somehow, but they want to increase the size of government and increase the power of the bureaucracy.  It seems to me that should be known as *Rage For the Machine.*",
         "As a Gen X grunge and metal fan I have always thought they sucked.  The “vocals” are absolutely horrible and require zero talent.  I don’t say that because of politics either.  I love Pearl Jam even though every member is a dyed in the wool hardcore leftist.  They at least have musical talent.   RATM is literally the most overrated group in rock history."
      ]
   },
   "1gjv2i6": {
      "title": "GET OUT AND VOTE to nullify mail in ballots for the sake of the country",
      "text": "I remember 2020. A lot of people were confused about the sudden surge of mail in ballots. Im sure there were people here who were upset and believed that the election was rigged. Personally, i feel that it wasnt. We got out voted. It was COVID, Trump didnt deal with it very well, out we went.\n\nNow, we must go out in droves. Droves so big that no mail in ballots can overturn the red wave. That even when the mail in ballots are counted, it cant overturn the huge ED advantage. This is our moment . Get out and vote\n\n\nDream scenario: Michigan says that they will get a result by 11. Georgia and NC promises to count votes quicker.\n\nImagine if we win GA NC and MI. We dont even need to wait for the Snails in NV, PA and esp WI. The race could be over by 12 am for the first time in forever because AZ will def be red if those three states flip. \n",
      "comments": [
         "PA will be done Wednesday, even Shapiro said so. They’re not taking breaks from counting anymore.",
         "NO FAT ASS HARRY'S ..Get off the couch, chair whatever and go to your polling location early to VOTE! \n\nLIVES ARE COUNTING ON YOU!",
         "I'm one of those who think it was rigged.",
         "To the Liberals, what the fuck is Harris going to do about abortion as well? Why would you vote Harris to “save abortion”? \n\nIf she were so serious about it, she would get Biden to sign executive orders to protect your rights, instead of trying to pass some bills only to get it clotured. Shes not serious about it. Tell me what Harris is GOING to actually do about abortion.",
         "There was clearly situations where thousands of votes were illegally counted in many places all across the nation. Whether or not it tipped the scales nationally is unknown, but in state and local elections it certainly did, especially in places where the margin was a few hundred or a thousand votes. \n\nIn combination with that,  and the democrats penchant for getting out the vote way better than conservatives we lost. \n\nThe right thinks that the civil duty to vote is all it takes to get support. The truth is we fail at every other measure of getting votes. (legal or otherwise) This is election is an anomaly, and the GOP will quickly forget just why numbers are high.",
         "My gut tells me we will have a projected winner by midnight if not sooner.",
         "Hope Shapiro is right, but Michigan specifically said 11pm Tuesday. Will be quite nice for the election to be called so early that Harris campaign chair cant pull a John Podesta.",
         "You mean no highjacked trucks from NY to PA this time? \n\nI'm shocked ..but USPS could be up to some shenanigans...count on it.",
         "They had operatives in a couple precincts in swing states in 2020. \n\nThey waited until other precincts were done counting and kicked everyone out. \n\nThen they took out boxes of “mail in ballots” and they scanned in enough of them to take the lead. \n\nThis is why we saw several states with the blue vote tally line where both lines had a clear trend, but the blue line has a vertical spike in it where it leapfrogs the red line. \n\nIt was obvious. And they got away with it.",
         "She will try to get term limits on the Supreme Court so they can pack it and do all sorts of wild shit. Of course they would need the majority house to pull that off.",
         "They even wrote articles on time magazine saying it was necessary to fortify(CHEAT) the election for democracies sake. 2020 was obvious af that it was stolen. Delays, over 100% of people voting, math not matching etc,"
      ]
   },
   "1gjj5z5": {
      "title": "WHAT IS HAPPENING IN NEW HAMPSHIRE? A massive line has formed for JD Vance in Derry, New Hampshire… These people aren't all MAGA-cap wearing partisans. They're middle class people tired of the Democratic regime - Kamala's worst nightmare.",
      "text": "",
      "comments": [
         "It's also fucking cold out there right now. The fact that they're standing out there for Vance is telling.",
         "Let’s go! Snatch NH from them!",
         "He will be a rock star after 4 years as VP.",
         "There is a NOT IMPOSSIBLE scenario where Harris wins WI, PA, MI... and almost has the election LOCKED... But HN flips and Trump wins.",
         "To go from a senator that hardly anyone knew to the VP pick and and drawing crowds like this must be mind blowing.  I've been impressed with his interviews and look forward to him running for president one day.",
         "Recovering democrat voting straight R for the first time. The biggest thing that drove me away from the Dems was how hateful they were/are if you didn’t agree exactly with the party line. They think every one of these people in line are Nazis.",
         "Calling it now, at least one of New Hampshire, New Mexico, Virginia, or Minnesota will flip trumps way by tomorrow",
         "I’m a New Hampshire resident and this will be my first time voting. Me and my whole family are voting for Trump!",
         "Full Disclosure: I live in Mass and had to pick up my dad since his transmission blew in NH. I had to go up to the Manchester area like last week. \n\nOn the highway right off the side at one point by the woods but still very viewable someone put a massive Trump banner the size of a billboard and tied it to two trees and it had an eagle on it. On the overpass next to it after it there was a guy waiving a massive Trump flag on a flag pole of sorts. \n\nDo I think NH will flip ? To be honest not sure but there is a reason why people specifically sat out in the cold to see JD Vance. \n\n**The reason why people went out in the cold to see JD is because his story talks about addiction and NH has been plagued by drugs destroying people’s friends, communities, and relationships. The fact that many say it is harder to get weed than hard drugs in most parts of the state tells you all you need to know.**.",
         "If Harris wins the rust belt and Trump wins the sun belt, Harris wins 270-268. \n\nIf Trump then flips NH, he wins 272-266. \n\nGet out and VOTE New Hampshire!!!",
         "More than Kamala can get in a warm state",
         "So a Vance is pulling in more people in a Blue area than a Harris pulls in without a fake performance in a Blue area.",
         "Looks like some people might finally be wising up",
         "After reading his book, I would stand in line to listen to Vance as well.",
         "It’s simple: Republicans have been bullied and threatened with cancel culture for supporting Trump. Now most don’t openly do it (especially in swing and left leaning/owned states). \n\nThey’ll come out to vote though. Going to be interesting to see the numbers 👀",
         "Guys if the disaster scenario is looming where Kamala wins 270 and Trump wins 268, but we happen to flip New Hampshire somehow, that puts us at 272 and her at 268. If we win by flipping a historically blue state that would be poetic justice",
         "In my best Steve Irwin voice: Crikey! Could this be a rare sighting of the silent majority?!",
         "Looks like a rally at a Costco.... It's either Vance, or those $6 pumpkin pies!",
         "Early voting shows a much better GOP turnout than in 2020 and above the margin Biden beat Trump in NH. If the in-person voting rates are the same then NH will flip. Based on these margins of early coting I have NH red and part of a Trump victort at 275-263",
         "There are a lot of people I know, some of whom are democrats, who are tired of what is going on with the Dem party and are voting for Mr. Trump. One of whom is a former coworker who \\*hated\\* Trump and believed a lot of the stuff that was said about him, before myself and others told her to actually DO some research into the accusations and learn the truth herself. Well, now she knows that a majority of the stuff said about him were lies and in some cases, even projections.",
         "good luck tomorrow",
         "Honestly, even if Trump loses, we probably take the senate and keep the house. Then we get a big mid-term and a wave election in 28 with Vance. \n\nThere is an argument to be made a Kamala win = a Vance super majority in 28",
         "Check out Lily Tang Williams running for Representative of NH-2. She just got endorsed by RFK. Solid candidate.",
         "It looks like it might happen boys..",
         "I didn't see a single blue or green hair person there ...",
         "If Trump flips a blue state, it would be better than sex",
         "I’d be surprised if we capture NH with all the massholes that have moved there to get away from the ridiculousness of Massachusetts only to vote like they did in Mass. Makes no sense. \n\nBut…if we do, it will quite a night for Trump.",
         "Man it'd be a surprise for nh to go red",
         "Tim Waltz is handing out free tampons at his rallies and still can't draw a crowd.",
         "Go NEW HAMPSHIRE!!!\n\nA small but awesome state of hard working people!",
         "Omg normal people, how refreshing.",
         "It’s not going to matter if the election is rigged again.",
         "They’re literally wearing MAGA-caps though lol",
         "I saw a Trump convoy in Carlsbad, CA yesterday. It was definitely surprising ",
         "Libertarians",
         "Heard today on average 13% of Trump rally goers aren't registered to vote.  Hope this changes very soon.",
         "Obviously just a bunch of Russian trolls and Racists",
         "This line was easily double this size by 5:40 last night… There was also 1 ‘protester’ parked a box truck next to the building covered in projectors about Ayotte.. loser just left the truck there blaring with a poor dog locked inside! Horrible human!",
         "Isn’t it illegal to wear a MAGA/Harris hat at polling stations?",
         "You all are out of your fucking minds if you think that people standing in long lines means your guy will win.",
         "They are all white…lol",
         "Derry. It's a rural area. Rural is GOP.",
         "These massive lines are an attempt at election interference",
         "There's a couple hundred people out there. It's going to overwelm thr whole state.",
         "All I see is another long line of old white people.",
         "F*** this country",
         "Paid to be there.",
         "> It's also fucking cold out there right now. \n\nyeah, got down to the low 20's last night up here (and that thumbnail looks to be a night time thing).\n\nnot \"cold\" by new england standards, but definitely not t-shirt weather either.",
         "It’s freezing here. And it’s raining a little bit",
         "It would be a nice surprise if they picked off a few other surprise states.",
         "Who? You talkin about 2028 President Vance? \n\nYea, we're a LONG WAY from BUSH McCAIN ROMNEY... Almost like MAGA didn't come from Trump or the TeaParty before it, but rather from decades of not having a conservative voice.",
         "I think he's a bit of a rock star now.  When he told what's her name \"do you hear what you are saying\", about Aurora, CO. I mean that was great!",
         "New Hampshire flipped so hard it became Hampshire New",
         "I'd laugh so hard if this happens.  Tiny New England state that's been a write off for two decades flips and saves this election (and the country).",
         "> HN flips \n\nI see what you did there.",
         "I live in NH and I think it will be close but NH is becoming Vermont light unfortunately \n\nOver the last 10 years the population moving here is more and more liberal \n\nMy wife goes into people’s homes to meet clients and she comes home everyday telling me how every single one was liberal. She could tell by the books they had out\n\nI’ll be surprised as hell if he wins NH. The smaller towns are full of trump flags and signs but anywhere with population? Completely different",
         "This would be hilarious",
         "I would die laughing. New Hampshire hasn't gone red since 2000. To have it go red at the 11th hour and *barely* stop Harris from taking the White House would be too sweet.",
         "God I hope you’re correct.",
         "Why is it not possible?",
         "Almost on the same exact grounds as you. I was, too. Now an Independent but could see myself voting Republican in the future.",
         "Welcome to the right side of history, friend!",
         "Welcome",
         "It’s funny because they’re the biggest Nazis you’ll ever meet. Even Hitler would blush ",
         "That’s just Le Redditors ",
         "Welcome.  We really are nice people.  Anyway my husband and I are and all the people we know who are conservative.....and we are from California!",
         "To be fair you guys call every other dem a communist so it evens out",
         "Voting republican because…. Democrats hurt your fee fees ? Oh wow. The projection from the right is insane",
         "Would love to see Minnesota flip. Trump came real close to doing so in 2016.",
         "I’m in VA and would love to see us flip back to red. The majority of the state is red except for the DC carpetbaggers up in Fairfax county / NOVA. Like, go back across the bridge pls 🙄 apparently internal polling only has Trump down like 2-3 here and all the men I know are going tomorrow. \n\nThe small city where I live is basically Trump country. My neighbors across the street are like the only Harris Walz signs around here. New people who moved in next door to them have Trump signs up and there are plenty of Trump signs all over the neighborhood. Around the rest of town, you see some HW signs but a lot more Trump, and plenty of people have no issue displaying stickers or wearing MAGA hats/shirts etc. We don’t do signs or stickers on our stuff but my husband is voting tomorrow and I already voted last week. Voted early for the first time ever. Paint the Commonwealth Red!",
         "Trump flipping Minnesota even after Harris chose Walz would be amazing. And if we are going by the RCP averages, Minnesota or New Hampshire has the best chance of flipping (+4.2 and +3.5 respectively for Harris).",
         "New Mexico going red would be a great curveball. \n\nHasn’t voted Red since ‘04",
         "RemindMe! 1 day",
         "RemindMe! 48 hours",
         "I'm not a snowballs chance, but if so we win. Big if.",
         "As a Virginian, I hope they do. We managed in 2021 and Youngkin has been great.",
         "minnesota no way, Virginia no way.  I guess maybe the other two, but it's so far out of the expected outcome that it's hard to believe",
         "Excellent! Thank you and please spread the word",
         "He can't even string them along no pun intended",
         "Seeing as NH is literally 90% white, this is not surprising.",
         "It’s New Hampshire… it’s pretty much an all white state dork.",
         "> Derry. It's a rural area.\n\nderry most certainly is NOT rural area. it's a normal southern nh suburban city.",
         "Not from around here are you?",
         "Derry isnt rural.",
         "Hahahaha are you serious? That's your side that does that.",
         "I heard Beyonce was dancing at the event!",
         "That would be the Kamala campaign that pays to bus attendees around and pays for celebrity appearances/endorsements to generate interest.\n\nShe can afford it; the Dems outspend Repubs 4:1 because they are the party of the wealthy elite.\n\nSee ya tomorrow.",
         "🤣ok buddy.  Not sure where the sign up for that is , I get all kinds of political spam never saw any offers for that.",
         "Again it's your side that does that. I remember seeing ads for \"demonstrators\" in the Northcoast Journal, published in my home county of Humboldt in California.",
         "Projection",
         "Definitely not cold by real England standards either.  20s, that's our summer.  Got some soft Americanos over there if that's your idea of grim weather.",
         "I want NH and 300+ EV!",
         "Like maybe MN.",
         "He is charming I have no doubt he will become a superstar in 4 years",
         "I live near Aurora CO and everything Trump has said about it is false. I had no idea what the hell he was even talking about. He didn't even go more than 100 ft into Aurora city limits for his silly speech.\n\nA true man of the people.",
         "Lmao",
         "Thanks for the joke lol, made my day",
         "The funniest thing is that it would be a 2000 redux, when Gore would have won if he had held NH or carried his home state of Tennessee.",
         "You never know. New Hampshire is only +3.5 for Harris right now. It's Trump's best chance at flipping a blue state.",
         "[removed]",
         "It would be glorious!",
         "You mean the future like tomorrow right?",
         "Make that future day today!",
         "when you silence free speech, yes you are a commie.",
         "In no world would that \"even out\". The left has way more power to indoctrinate the masses with lies. They control almost all of online, hollywood, TV and print media, the education system, entrenched government institutions and bureaucrats, the biggest most monopolistic corporations and industries are all run by democrats. The only reason the communist label sticks is because it's organic and grass roots - because it's actually true. Many democrats are even ok with the label because they agree with it and self identify.\n\nAnd those who don't are de facto supporting communist/fascist/authoritarian government by voting for democrats at this point. Cancel culture and political correctness, suppression of opposition speech, manipulation of algos, media propaganda, abuse of power and lawfare against political opponents, use of identity politics to create division, full support of the establishment and patriot act surveillance state types, the party of top-down government control... I mean they literally just murdered some guy's innocent pet squirrel and racoon the other day in NY... I don't even know where to begin or where to end in explaining how the label actually applies to them objectively from a purely factual basis but not to us... So no it's not the same at all.\n\nWe can say you are a communist because X, Y, Z and list direct examples of them supporting policies that would undoubtably classify as that. Meanwhile they call Trump and us Nazis... but can't back that up with anything real. They say because he had a dog and Hitler did too... I mean there is some serious logical problem and disconnect from reality on one side compared to the other. Trump's about to be a grandfather to both jewish and arab grandkids too.\n\nIf you don't see the difference between the two sides here then your mind is so clouded by democrat conditioning and you are far gone. Survey after survey and real life event after event shows that modern day democrats are the intolerant ones. The hate is off the charts from them they are the same people who in nazi germany would report their neighbors and family members to the state. They have a bunch of the key psychological traits of nazis even their overwhelming use of projection which is why they literally gave us the label all over mainstream news even though it obviously makes no sense to anybody who spends more than a minute to think about it and has a brain larger than a pea.",
         "BTW I just started listening to Musk on Joe Rogan. He completely debunks your \"both sides\" argument in a long detailed segment that begins around [11m 30s](https://www.youtube.com/watch?v=7qZl_5xHoBw&t=11m30s) in.",
         "This is an issue, but I'd say that this is more an exception than a rule on the Rep side, but more a rule than an exception on the dem side.",
         "To be fair most of you are!",
         "When you say you guys, I’ve been a Dem my whole life. I don’t do that.",
         "Eh, I don't like to generalize.",
         "Weak",
         "My feelings are fine. My Jewish neighbor shot in the shoulder by a radical Islamist allowed into this country by Biden/Harris, who Kamala said their heart was in the right place, is also fine. Because evil never wins.",
         "Cringe",
         "If I’m told I have no place among the democrats then why would I vote for a democrat?",
         "You hide behind an alt-account like a loser. ",
         "I’m from Minnesota, Hennepin county actually, and everyone I know (family, friends, neighbors, etc) are voting red this year. No yard signs, bumper stickers, maga hats, or anything like that. We keep to ourselves. It will be close but rest assured r/Minnesota does not represent our state.",
         "Hopefully. If he could pull off a flip in one of those states, and gets az, nv, nc, ga, it would mean a win regardless of how pa, mi, wi go",
         "Agreed! I’ve lived in the nova area all my life, and I hate what it’s become. I really hope he can swing it.",
         "Did you even need to ask? Bonus points if he is European!",
         "What side is my side??!",
         "Dance party with Beyoncé….",
         "> 20s, that's our summer. \n\ni'm talking real temperature, not your monopoly measurements.",
         "Fahrenheit",
         "Interesting thought, anyways... Here's Wonderwall",
         "Keep going!! Why not VA too?",
         "I've seen it mentioned as a swing state. That would be great to take from Walz.",
         "As an Ohioan with facial hair, I look forward to ending our drought of both Ohioan presidents and presidents with facial hair. Very long overdue.",
         "So an apartment complex was not being terrorized by gang members? It was all over the news.  Trump didn't say it. There were people who lived in the apartment complex.  That woman said it was only 2 complexes which is when JD Vance said are you listening to yourself.  So all that is a big fat lie?",
         "You're nuts. I grew up in Aurora and that's where immigrants go first (my family did). It's the worst part of the Denver metro area and this 100% is happening there.",
         "Imagine all the Iraqi people that would still be alive…",
         "And it was within a half of a point in 2016. If the electorate of today is to the right of 2016 by even half a percent, Trump flips NH.",
         "Typical liberal. People like you are exactly why the country is so divided",
         "Yes if they have coloring books out we can typically tell they are lefties",
         "How has your free speech been silenced?",
         "Significant amounts of anti semitic violence come from white nationalists on the far right. Those people are born and raised in the US. Seems like a weird thing to go for Trump over Kamala on",
         "> I’m from Minnesota, Hennepin county actually, and everyone I know (family, friends, neighbors, etc) are voting red this year. No yard signs, bumper stickers, maga hats, or anything like that. We keep to ourselves. \n\nSomehow polls \"aren't aware\" of this. \n\nLol, catch me answering a poll, or if I do, doing so honestly!",
         "How does everyone in Minnesota view Walz?",
         "Hi, fellow Minnesotan! Here in the west suburbs, I'm seeing very few Harris signs and more Trump than I thought. Would love a flip because Walz is the worst",
         "How amazing would it be to see the 3am machine, a billion dollars in advertising, and a non-stop media blitz win PA, MI, WI for Harris, and lose because no one watched NH in the corner?",
         "I’m in Winchester and they’re starting to come here because of the lower COL and because it’s the last stop where you can somewhat reasonably commute to NOVA (my husband does it twice a week) \n\nStill fairly red out here, especially my neighborhood, but the carpetbagging needs to stop. It sucks",
         "Damn! Born and raised in Texas, I try not to even go outside when it’s below freezing! lol",
         "That was the joke.  Lots of asshurt Americans here who can't take a fucking joke.",
         "I'm not greedy man! I just want something to flip",
         "As a Virginian, I wish we could go red again",
         "Correct. The republican mayor of the city said it wasnt true.",
         "So your family is part of this made up problem what you're saying? Got it. Hope Daddy Don wins and all your wishes come true and he deports your family.",
         "And how many more poverty stricken Americans..",
         "That’s a question best asked of Mark Zuckerberg.  He apologized for censoring due to pressure from the Biden/Harris regime.",
         "2020 has entered the chat.",
         "Nah, at least in the last year violent antisemitism is 100% a left wing thing. You’ve got the occasional right wing shithead on X spouting conspiracy theories (ironically, they are generally about the Jews being responsible for the worst excesses of the left) but they’re mostly accounts with like 10 followers and no clout.",
         "Kamala Harris’ husband appointed CAIRS as one of the organizations in charge of combatting antisemitism. On Oct 8th the president of CAIRS tweeted that “it was incredible to see Gazans walking around a free Palestine. This is what resistance can bring”. Kamala Harris has said the heart of the protestors (protesting for a genocide against Israelis) is in the right place.\n\nDonald Trump has said some things I fervently disagree with, but look at what he has done. He recognized the capital of Jerusalem as the undisputed capital of Israel. He removed funding to the PA for their pay to slay program. He instituted maximum pressure on Iran. \n\nOk buts that’s all Israel and I’m an American first and foremost. What has he done for American Jews? He has unequivocally denounced the pro Hamas protests. He extended Title VI civil rights protections to include Jews, those same protections are being used to sue concentration campuses today. He secured our border so Hamasnicks, like the one who shot my neighbor, don’t come in. He has called out by name a policy for deporting supporters of FTOs who are not American citizens. On the anniversary of the Simchat Torah massacre he said a prayer at the Ohel in the company of a rabbi. \n\nTell ya what, I live in PA and haven’t voted yet. Stack Kamala’s record. What has Kamala done for American Jews? Do it without bashing Trump and maybe you can win my vote.",
         "Democrats are supporting a country that attacked our ally Israel and killed thousands of Jews. They are also continuing to give them monetary consideration that is funding their expansion of their ballistic missile capabilities.  Not “weird” at all.",
         "As you can imagine some like him and some don’t.",
         "Might be even funnier if it was nm that flips, Harris did no campaigning here while Trump held a late rally on Halloween",
         "Jokes are usually supposed to be funny.  That's something a 10yr old might tell.",
         "I'm not greedy either.  I just want to win, even by as small an amount as possible.  I will take it any way I can!",
         "Maybe some tables will flip in the more leftwing households.",
         "It's amazing who you elected for Governor and Lt. Governor. There's hope",
         "We did in 2021. We just need to be again this week.",
         "[https://www.denverpost.com/2024/11/03/aurora-apartments-conditions-venezuelan-gang-cbz-management-donald-trump/](https://www.denverpost.com/2024/11/03/aurora-apartments-conditions-venezuelan-gang-cbz-management-donald-trump/)\n\nThat's weird. I didn't read the entire article, but it sounds like it was a problem.",
         "Oh look another article. [https://www.cbsnews.com/colorado/news/colorado-venezuelan-gang-activity-aurora-crime-woman-moves-video-guns/](https://www.cbsnews.com/colorado/news/colorado-venezuelan-gang-activity-aurora-crime-woman-moves-video-guns/)\n\nAnd another.\n\n[https://nypost.com/2024/10/15/us-news/media-government-downplaying-aurora-colorado-venezuelan-gangs-ex-resident/](https://nypost.com/2024/10/15/us-news/media-government-downplaying-aurora-colorado-venezuelan-gangs-ex-resident/)\n\nThere is even one with a timeline:\n\n[https://www.coloradopolitics.com/news/venezuelan-gang-tda-timeline/article\\_420e39f5-ca38-574b-bcee-4e00f18163db.html](https://www.coloradopolitics.com/news/venezuelan-gang-tda-timeline/article_420e39f5-ca38-574b-bcee-4e00f18163db.html)",
         "I don't know why so many people in your thought bubble lack so much civility- it's like trying to communicate with a rabid animal. My family entered the country legally and have been legal citizens for decades. Get a grip.",
         "Isn’t meta a private company though?",
         "Based on your comment, you already know who to vote for, my friend.",
         "Please go out and vote tomorrow",
         "Yea.\n\nNew Something, I don't care. I just want to see a flip.",
         "What 10 year olds do you know that tell celsius and fahrenheit jokes??  I think that you just lack a sense of humour and are getting salty that you didn't get it.",
         "The republican mayor of the city notes otherwise.\n\nhttps://www.cbsnews.com/amp/news/trump-aurora-colorado-venezuelan-gang-claims/",
         "Let’s go!!!",
         "*“We did have a problem. But we responded to the problem, and still are,” Mayor Mike Coffman said in an interview Tuesday, shortly after meeting with Colorado Gov. Jared Polis to discuss the law enforcement response.*\n\nFrom an article in today's Denver Post. Your article was older. I'm done arguing with a closed mind.",
         "Lolz hilarious. Did you read the article? It was about various uninhabitable aspects of those apartment complexes, and the police chief refuted the allegations in the very article you shared. \n\nFurthermore it mentioned 10-20 gang members in aurora. Do you think gangs are anything new anywhere? Do you think its a new phenomenon? \n\nhttps://www.mediaite.com/news/incredibly-false-narrative-police-chief-hits-back-on-trumps-claim-his-city-is-overrun-by-migrant-gang/amp/\n\nSo sad you believe a false narrative that is basically racist just because it went viral.",
         "You posted a biased media source discrediting something that is real. Not shocking from someone that says “lolz”. trim that neckbeard before bed tonight"
      ]
   },
   "1gjmift": {
      "title": "Early voting numbers scary for Harris...",
      "text": "https://www.newsweek.com/early-voting-numbers-scary-kamala-harris-republicans-gains-democrats-election-ex-obama-aide-1979791\n",
      "comments": [
         "Means nothing when the \"mail in votes\" get counted after everything else.",
         "To all the people saying it doesn’t matter because possible fraud\n\n\nShut the fuck up. I’m TIRED of the defeatism that has taken over a large sect of this party for the last 4 years. Holy fucking shit.",
         "She still has those 3 am ballot boxes to fall back to.",
         "Whats that in the corner? A water pipe?",
         "Let's make it Traumatizing. Vote Harder Dammit!",
         "It's no coincidence that some states are allowing \"postmarked\" mail-in ballots to be counted DAYS after the election.  That is to ensure the \"right\" amount of fraudulent mail-in votes can be manufactured and subsequently counted.",
         "Maybe scary, maybe not. \n\nRepublican voters who vote Republican NEED to show up in even GREATER numbers tomorrow. \n\nDo not settle. Do not assume. Go and VOTE.",
         "I believe people are more aware. Voters are documenting their voting experiences. More people are watching even if they didn't believe the questions in 2020. And we have a better RNC in place. We still need a too big to cheat turnout, but I feel we're in a better place than 2020.",
         "If Harris isnt winning by 7ish points in swing states after mail in and early is counted then shes screwed, liberals have to dominate that aspect of voting.",
         "I don't find any of it reassuring. If they can cheat and get away with it, they will.",
         "JUST GO VOTE!!!!!",
         "A legacy media company publishing a potentially-fear-mongering story right before Election Day about Harris being down. This is exactly the sort of thing designed to drive up turnout on The Left. I don't see this story as a positive development for Trump at all. It's all part of the game. Vote Trump.",
         "Don't care, go vote.",
         "There is a reason they flooded us with illegal immigrants. There will be potentially millions of votes from people not legally allowed to vote. This is one of those things that should be stated by every single republican, every single time they speak.\n\nThere is only 1 reason they flooded the border and only 1 reason the left constantly works to underminine the credibility of the voting process by fighting any type of ID or verification process. There is only ONE reason, period. We all know what it is.",
         "Hopefully her political career will end in the same way that it began....by blowing it.",
         "We don't have covid this time around so there is more in person voting this time around. A heck of alot of early voting. In many cases half of all registered voters have already voted. I would say more then mail ballots.",
         "Don’t let your foot off the gas…vote!",
         "still, vote!",
         "Keep voting!!!",
         "I have a feeling there’s is going to be a lot of fraud going on for mail in voting ballots like if Harris is losing in the evening then somehow votes just will be lost over night. Wish there was a system that certifies that your vote is counted officially for the party selected.",
         "Hopefully no water pipes break in the vote counting building….",
         "So what you're saying is... 10% of the female electorate are sexist.",
         "Hopefully it’s followed by a ton of great votes tomorrow!",
         "There are already reported \"power outages\" at local polling places around the Los Angeles area.''\n\nLets see if they will have any more water pipes bursting and blackouts and other delays which will hamper in person voting.\n\nThen we'll have to sit it out and see Trump lead all the way into 2am and then by 6am every swing state will have late counts that miraculously will be 100% Kamala and just by enough to win it.\n\nAt this point, I really don't think the libs care about how blatant they are with how they do it as long as they win.",
         "Well done slytherin well done slytherin HOWEVER\n\nthere are some last minute votes that we need to add.",
         "At least not in Georgia, thanks to the GA supreme court ruling today.",
         "Exactly.  The \"doctoring\" comes in at the end, not the beginning.  \n\nHarris will be behind all night tomorrow night, and then we'll wake up on Wednesday morning to her victory thanks to a 2 AM \"rally\" with the mail-in count.  Like clockwork.",
         "Yup, only chance is for the margin between Republicans and Democrats to be too large for them to be able to cheat their way out of.",
         "Republicans are also preforming very well in mail in ballot requests and returns.",
         "How come late night ballots and “mail in votes” are ALWAYS for Democrats? I never hear about Republicans all of a sudden finding 100,000 extra ballots in the back of an alley or UPS truck.",
         "Why are we thinking like this? If the election is surely going to be stolen, like last time, then it's not worth it to even fight for victory.",
         "Especially when then they're all for Kamala and no one else, just like that happened with Biden last election. I mean, at least make it look believable if you're going to cheat.",
         "\"counted\"",
         "Exactly trump was winning in 2020, until late mail in votes started coming in",
         "Means nothing when all the left will do is magically find all the fake manufactured ballots that coincidentally are JUST the numbers needed to win the electoral votes of that state.",
         "Watch for the 3am bump",
         "While I understand your sentiment, it's pretty damn hard not to be at least a little defeatist when we saw what happened 4 years ago and the brazen corruption has only expanded since then. At this point we're basically hoping for a win so fucking massive no amount of cheating will compensate for it. Because we all know there will absolutely be cheating. It's just a question of whether or not it will be enough to matter",
         "You have to tell it to Trump too. He opened his Lititz, PA rally on Sunday with a lengthy diatribe about how the Democrats were trying to cheat and steal the election. I don't think he outright said he expected to lose because of that, but he came close to it, saying things like maybe the only good that will come out of this campaign is cleaning up our elections. He was back on message today, and didn't say that kind of stuff. But the Selzer poll clearly had him disturbed Sunday morning.\n\nAnd that is on top of the narrative Trump has pushed since 2020 about the election being stolen. There's one person who's inspiring GOP voters to think like this.",
         "Yep.  The patented \"go to bed behind, wake up a winner\" democrat strategy.",
         "and 2 more weeks of trucks full of ballots after the election!",
         "the toilets have had enough time to get leaky again",
         "*EvAcUaTe*",
         "Firstly, I don't like cheating whatsoever. BUT.... I think the right should have some \"mail in ballots\" of their own. Like oh, the democrats just found 100,000 votes that are all for them, then the Republicans can then say, what a coincidence, we just found 175,000 votes all for our side. Let it keep going back and forth until it is so comical that everyone has to admit shenanigans.",
         "I sincerely hope you're wrong,  but you are likely right.",
         "They can cheat if you sit around, complain, don't call the people you know in swing states and make sure they get to the polls.\n\nNo dooming and no pre-celebrating.",
         "SaViNg dEmOcRaCy",
         "Especially with the *tight races* and knowing ahead of time the polls aren't in their favor.",
         "The big story I saw yesterday was her being up in Iowa.",
         "Well, she has been talking out of both sides of her mouth.",
         "Damn I never made the connection that Dumbledore was a democrat lol.",
         "Holy shit I’m a Slytherin fan now",
         "I can't believe it took this long to do that.",
         "Or because six million Kamala votes suddenly appeared in Georgia two weeks after the election.",
         ">we'll wake up Wednesday morning \n\nYou can sleep?",
         "Need to be vigilant, they made it harder by tightening restrictions again in some ways. Let’s see if it holds.",
         "The biggest security I feel about this is that total percentage of registered voters is high enough right now that I suspect that might have a high enough turn out that that sort of thing would be a huge red flag. If there are going to be shenanigans, extremely high voter turnout actually makes it hard to cheat because if you have more votes than registered voters, that’s a dead give away that someone cheated.",
         "yup",
         "No doubt. It’s the playbook.    \n\nRemindMe! 40 hours",
         "Yep ",
         "You know why.",
         "because resistance is never futile \"The only thing necessary for the triumph of evil is for good men to do nothing,",
         "Im not saying its going to be stolen. Im just saying I am not celebrating anything until he is actually sworn into office.",
         "Make it too big to rig. Go vote.",
         "Welcome to reddit",
         "Yeah this: “they’re going to steal the election, let’s vote harder!” Makes genuinely no sense in the slightest",
         "Stop with this nonsense until after the election. You do nothing but persuade people to stay home.",
         "AND - we now know what happens to conservatives who question election integrity.",
         "Whatever dude",
         "Zero proof has been provided to show that there was enough cheating in 2020 to change the results in any state.\n\nBoth Bill O'Reilly and Megyn Kelly have said Donald Trump lost the 2020 election, and did not have it stolen from him. Bill said he will change his opinion whenever he's shown the proof, but he hasn't been. They are common sense conservatives, not partisan conservatives.",
         "Just remember positive thoughts provide positive outcomes.",
         "This attitude and the loss of the two Georgia senate seats in large part because of it really made me lose a lot of love for him for about 2 1/2 years or so. That and the I deserve all of the credit but none of the blame 22 midterms. \n\nDon’t get me wrong, I’m a Trump donor. I make 15 an hour and threw 50 bucks at his campaign. But this is easily his worst flaw. If he could’ve just stopped talking about it he’d be doing even the slightest bit better, if he’d just accepted the loss even with the “the entire structure of this country was arrayed against me in a manner that was completely unfair” he’d be winning this outright",
         "2020 was the breaking point for me when it comes to the deep state.",
         "In which 80% of them are D votes.",
         "And the pipes get their turn to break as well",
         "That only works in a society or system where both sides are treated equally. In theory yes you can keep 1-upping the other side til everyone sees the absurdity but just about every institution that is \"trusted\" will take the left's side and hand wave their own shenanigans while hyper focusing on any perceived mischief from the right.",
         "I want them to keep doing it until there are more votes than US citizens.",
         "Yep, you have to play by the rules of your enemy if you want to win.",
         "Anything is possible, but other polls there have Trump solidly leading. I guess we'll all know soon...",
         "Explains a lot now that you mention it",
         "Well, yeah. Eventually, you got to. Not even Artie, the Strongest Man in the World, could stay wake all night.",
         "That's right! I live in California. And the expectation of Adam Shithead becoming the next senator is exceedingly high, but I still voted for Garvey because I'm going to fight! Fight! Fight!",
         "Life between tomorrow and Jan 20th is going to be extremely tense for sure.",
         "I see you would lay down and just let the Borg assimilate you",
         "If my comment persuaded people to stay home, then they need to rub their brain cells together better in order to form some synapses.",
         "he’s right, we’re fighting but it’s hard not to be upset that the democratic republic our forefathers fought for is being stolen.",
         "80%?  Remember Michigan's drop at 1:30am which 100% were all Biden votes?  Nothing fishy about that.",
         "You are absolutely right. The double standard is their only standard.",
         "Then what's the point, if the defeat is inevitable why fight at all.",
         "My question is, WHO decides who is treated in a specific way? Aren’t there AT LEAST as many Republicans as there are democrats? My point is this only works for the Dems because republicans allow it. Democrats have been openly cheating for decades. Why isn’t anyone calling BS already?",
         "Yeah, Pete & Pete!!!! Love that show!",
         "If you knew the election was rigged, why would you ever vote? Does it make you feel like you’re a part of the resistance? I loved that scene when Luke voted palpatine out of office by reaching a certain threshold that meant he couldn’t cheat",
         "Oh I didn't remember that, only the 80% from maricopa and fulton county...\nYeah statistically impossible but hey nothing to worry abt.",
         "I believe that was Wisconsin.",
         "Like 90% of the federal government bureaucrats are Democrats. Look at the voting patterns of DC and nearby areas.\n\nSo no, there aren’t as many Republicans in the federal government.",
         "If you don't do your duty, then all you do is let evil rush into the vacuum. Shame on you."
      ]
   },
   "1gjuti5": {
      "title": "Kamala Ad Targets Men, Begs Them To Secretly Vote Blue: ‘No One Will Ever Know’",
      "text": "",
      "comments": [
         "This is their entire final argument. Men, vote for us, nobody will ever know, so you don't need to be embarrassed! Women, vote for us, your husband can't control you!",
         "This reeks of desperation from the Dems.",
         "The whole \"No one will know\" campaign whether it's for men or women is just stooping to such low levels.\n\nThe Dem represents an actually dying democracy where blatant lying for voting is seen as necessary.",
         "What a great way to announce that you should be embarrassed to vote for them.",
         "Top tier cringe",
         "Why does this sound like something a predator says to a child?",
         "Well nobody will know the other way either! 😂",
         "It’s like they know it’s a shameful thing to do, lol",
         "What a pathetic approach. \"Be a real man. Hide and lie\"",
         "[removed]",
         "I’m not an effeminate man like a Democrat, I can’t be wooed with liberal illogic",
         "They’re just all about deceit and dishonesty, huh?   Is that really how they want to be seen?",
         "You have called us Nazis, fascists, racist, garbage….\n\n\nAnd now you are begging for our vote? F-off.",
         "I would run this ad with cuts to videos of leftists screaming insults and committing violence, and end it with clips of politicians and press insulting Trump voters.",
         "They are literally admitting that you have to be such a beta male to vote blue 🤣🤣\n\nNot even man enough to tell your family or friends bc it’s impossible to defend this decision with even one single critical thought in even the smoothest brain.",
         "Why would they do that? Are they suggesting it's the worst pick?",
         "Lie, we do.\n\nThat is what the Democrats tell both men and women. And they lie so much that they do not realize that telling people to lie is NOT something that people view as a positive quality.\n\nBut liars are gonna do what they do and they have no clue that their proclivity for DISHONESTY does not sit well with normal Americans.",
         "But I'll know.",
         "*limp-dick energy intensifies*",
         "Men too can get an abortion. Abortions for everyone. Buy 1, Get 1 free.",
         ">No one will ever know! \n\nYeah ... ***I'd*** know.",
         "Do they think real men are going to vote for the decline of our great country?",
         "So like Get in the Closet you guys. TODAY, Vote Trump/Vance!",
         "So this proves the “Dems wives voting Trump” then? Hahaha",
         "It's weird, right? The overarching message for both men and women is essentially \"we know you'd be embarrassed to vote for us, but if you don't tell anybody, they can't clown you!\"\n\n\n\n  \nlol like what is this?",
         "Thin of those poor women whose husbands didn’t “tell” them who to vote for - poor ladies, standing at the voting booth, confused, frightened, just wishing her husband had TOLD her what to do.\n\nAnd they call the right sexist?!!",
         "Doesn’t just reek of it, it is. And I think men will be completely turned off by it. I see it as pathetic.",
         "Right?  \"Just don't tell your parents.\"",
         "My first thought. It's very groomy.\n\n\nThe shoe fits, considering how many dems are rank in file with the Epstein pedo network. ",
         "On par for the diddycrats",
         "Did you see the Harry Sisson clip where they were going around putting cringey stickers in men's bathrooms?",
         "It's crazy considering that up until recently you had to hide that you were a Trump voter. I've never seen ads line this, they're really desperate",
         "I’m single. I just stood in the booth for hours trying to figure out what to do.",
         "This, coupled with the other ad aimed at women lying to their husbands about their vote,  are not sending a good message at all. All they are doing is sowing distrust within marriages.",
         "Stop 🤣",
         "The liberals are all about lying to your spouse apparently."
      ]
   },
   "1gjiwwz": {
      "title": "Democrats Warn That If Trump Is Elected It Will Be The End Of Bureaucracy As We Know It",
      "text": "",
      "comments": [
         "I already voted for the guy, you don't need to sell me on him.",
         "Don't laugh, I'm hoping that's true.",
         "The bureaucrats are responsible for what happened to Peanut. That will not be forgotten soon.",
         "Excellent cut the bloated bureaucracy. !!",
         "Don't threaten me with a good time.",
         "Having bureaucrat experience myself, I'd say the ones who are actually working ***will finally get actual work done*** when the dead weight is cleared out. With no actual work to do, they make themselves busy interfering in others' work both public and private.\n\nYou know that guy in every American neighborhood who gets away with scamming the government, and is richer than everybody else for a fraction of their work? That guy's magic trick was *not getting caught* year after year when the system had all its tubes clogged. When the system flows the way it's supposed to, people like that will start getting caught and suddenly their magic is over.\n\nMost people can't understand the depth of this. For entire generations cheating was the correct answer, and when it ***suddenly isn't anymore*** we'll feel the start of a cultural change. The smart but naive kid followed the rules and got punished, the cunning devil kid broke the rules and weaponized the rules at the same time. Who does ***not*** remember this from school growing up?",
         "The bee is always on fire.\n\nMusk bought Twitter to unban the bee was god's will",
         "😂",
         "Ok deal!",
         "Lol, yes please.\n\nIn all seriousness though, Democrats and Republicans both need to get their heads out of their ass and produce a sustainable budget. Reducing Bureaucracy is a great start.",
         "Looks like a Democrats Freudian slip.",
         "I can only vote once dammit.",
         "Reason #5937 to vote for Trump.",
         "Is this s bad thing?",
         "Yes please. As a former member of that bureaucracy I agree.",
         "We can only hope",
         "And I feel fine.",
         "> Democrats Warn That If Trump Is Elected It Will Be The End Of Bureaucracy As We Know It\n\nDon't threaten me with a good time.",
         "That right there is a good reason to vote for Trump! Like we already needed another reason.",
         "I’m hard already. Don’t need to keep selling me on it.",
         "Democrats warn that if Trump gets elected anything from a decline in the frog population to Armageddon will happen.  Problem is, he has already been president and none of those things happened despite the same nonsensical warnings back then.  Instead, the economy improved greatly, the US was not thrust into another war with no end in sight, and people enjoyed a quality of life that Dems did everything they could to take away.",
         "this november bureaucracy is on the ballot!",
         "I've said it 1000 times, The bee is not supposed to be legit news.\n\n  \nYet here we are, unsurprised at the Simpson level premonitions of the Bee.  rofl",
         "[removed]",
         "I suppose they all wipe before they poop too.",
         "GOOD",
         "Guiding the lily much?",
         "The future of bureaucracy is at stake.",
         "You're damn skippy it will be.",
         "The Bee is usually way ahead of the curve in predicting the future through absurd parody. Let's hope this is another one of those times.",
         "Stop, I can only get so errect.",
         "Yes. It will have actually work again and given them the result they hate.",
         "Thank God!!!",
         "Sold!",
         "After Trump is elected, all conservative media should ask Chuckie Shumer, \"Now that President Trump has been reelected, when will you be retiring?\"\n\nJust hit him with that question every chance they get...",
         "That's what I'm hoping for.",
         "I don't see the downside.",
         "Yes, this is the major selling point",
         "We already saw this in action during his last presidency with the \"One In, Two Out\" executive order on regulations. \n\nGranted, not a lot came out of that, but still better than not having that guideline.",
         "In Chicago it was anyone working for streets and san",
         "'nuff said.... o7 salute o7",
         "I firmly believe that the bureaucracy has become the fourth branch of government. In some ways it has more power than the other three.",
         "Let's see what Beyonce has to say first. I don't want to think for myself. ",
         "Me too! The airport I worked at had FIVE layers of management to oversee about 40 TSA screeners. Ridiculous!",
         "Frogs are annoying though.",
         "If Trump is in but it's a 50/50 congress then it'll continue being *not a lot.*\n\nIf people don't like what congress does then people need to start putting different people in congress, sounds simple but voters make a hell of an ordeal out of it.",
         "I’m calling Taylor Swift as we speak!",
         "😆",
         "Trump is the head of the executive branch. He may be authorized to run a department... is he required to? Can we fire them all? could we put the ATF headquarters on Guam and then blow up the airport stranding them there? prolly...."
      ]
   },
   "1gk6vg7": {
      "title": "Joe Rogan Wrecks John Fetterman in Border Debate, Leaves Him Sputtering",
      "text": "",
      "comments": [
         "To be fair, almost everyone leaves him sputtering these days 🤣",
         "Credit to Fetterman for having the balls to show up, but Rogan's not gonna beat around the bush and lob softballs. If you aren't ready for him you'll get exposed."
      ]
   },
   "1gjdww0": {
      "title": "It’s always darkest just before the Don ",
      "text": "",
      "comments": [
         "I voted GOP down the line.  \n\nBut, I always hate this kind of cultish shit.",
         "Save US!",
         "For Freedom, for a safer world and for Peanut !!!",
         "Vote!!!!!!!",
         "God bless Trump!",
         "No",
         "It’s just someone goofing off, brother",
         "It makes voting easy, but I’m right there with you. I hate voting down party lines because it reinforces the “us vs them” mentality, but with the cockamamie horseshit coming from the left these days, and with your average Democrat policy maker staying lockstep with the party narrative, you feel compelled to give them nothing.",
         "I think its a funny meme, wouldnt look that much into it lol",
         "Silly thing to get upset over.  The left makes up shit constantly to be malicious, even funny stuff like this.  \n\n  \nSometimes funny is just funny.",
         "It's just fun.  Can't fall into the trap of the far left where they are angry all the time",
         "Meh, it's fun. Could be worse.",
         "Have you seen what they done to Peanut and Fred? This can happen to anyone in the future, if the communists will somehow win. This are very dark times, with a prospect to become the darkest in the future.",
         "To me this is \"dress my kid up as [my politician of choice up for election] for Halloween\" levels of cringe.",
         "I did see that and it was heartbreaking to read what they did to those poor rescue animals. It’s a total breach of rights and I hope the people involved are investigated.",
         "I don't feel like that's the same at all but you are entitled to your opinion ",
         "I finally heard the entire story today and it was shocking and horrible.  Oh I know, it was on Outnumbered."
      ]
   },
   "1gjw13o": {
      "title": "Joe Rogan just officially endorsed Trump!",
      "text": "",
      "comments": [
         "I typically couldn’t care less about celebrity endorsements because they are usually ineffective, but this might sway a couple minds. \n\nGlad he’s on the team.",
         "Let’s goooo 🔥🔥🔥",
         "Might just head on over to the JoeRogan sub to bathe in the radioactive glow of the meltdown for a while.",
         "Why didn't he do it when Trump asked him? ",
         "Brandon!"
      ]
   },
   "1gjlyy1": {
      "title": "Vote Trump to protest Peanut’s murder",
      "text": "MAGA 2024! For Peanut! ",
      "comments": [
         "That seconds image is the funniest thing i've seen all week, thank you.",
         "If that squirrel were a kalama supporter half of New York would be in flames right now.  Firey but peaceful. You know what I mean",
         "dude I live in NYC and someone it broad daylight with me in the room by the window stole groceries from my front. And you know what I could of done about it? Scream at him and let him take anything else he wanted while I wait 3 hours for cops to come and do nothing",
         "Avenge Peanut",
         "What a world we live in!\nThis is nuts!",
         "Conflating issues is what Democrats do. Please do not stoop to such levels. \n\nThis was a LOCAL, non-federal bureaucratic issue that had nothing to do with the federal government or the president.",
         "The last one made me laugh a lot, too!",
         "The third one as well.",
         "“Mostly peaceful protests.”",
         "Remember this is true for your life as well. If it doesn't serve their own wealth and power they don't care about you. We care about all lives no matter what your politics. Just a couple weeks ago I watched democrats laugh and gloat over a gold star 70 year mother be put in prison for the rest of her life for a non-violent so called \"crime\" with no victim and for doing what other democrats have done and even admitted to with no consequences. This is who they are. Vote accordingly.",
         "It's not conflating issues, it's the mindset that infects all bureaucratic institutions. That the bureaucracy is correct and justified in its actions because they are following regulations written by that bureaucracy. It's basically caused by Pournelle's iron law of bureaucracy, that organizations are eventually taken over by people dedicated to the bureaucracy, rather than the mission.\n\nThis has nothing to do with state, local, or federal, it's a succinct demonstration of what happens when you let these agencies run wild and don't keep them reigned in. You want an example at the federal level? How about when Chuck Schumer warned Trump that the intelligence agencies had \"six ways from Sunday to get back at\" any president who dared to cross them. In other words, a bipartisan admission that these agencies have amassed so much power and have gone rogue and no longer answer to the elected head of the civilian federal executive as they are required to by law. And in fact they will take down anybody who tries to get in their way. Some unelected bureaucrats are completely above the law. That's far worse than this squirrel, right? The squirrel is not about one rodent being killed, it's the symbolism. The squirrel is us.",
         "It is a Democrat issue. They do this kind of stuff all the time. Waco, Elián González, and I believe there was a dispute with ranchers more recently. This horrific tragedy is a direct result of the \"government knows best\" Democrat mindset. Reagan's famous joke about the scariest words in the English language being, \"I'm from the government and I'm here to help\" come to mind. What happened here was entirely predictable coming from a Democrat-run government. It is an exact mirror to the violent tyranny they routinely exact on the federal level, on tax issues, environmental issues, property issues, privacy issues, and others. Kamala said Trump would use the American military on our citizens, but it is a Democrat government who just invaded a citizen's home armed to the teeth and murdered their pets.",
         "It's not far worse. I can hardly think of ANYTHING worse that a government can do than violently invade a private citizen's home and murder their pets. Other than murdering the people themselves. This is a staggering invasion of privacy, violation of property rights, and infliction of emotional distress. No citizen in a free country should be subject to such brutality and terror."
      ]
   },
   "1gju63d": {
      "title": "‘Essential That He Wins’: Megyn Kelly Announces She’s Appearing With Trump In PA",
      "text": "",
      "comments": [
         "She really wants back on the wagon after that failed stint at NBC",
         "Darn, wish she was at the Reading, PA one I went to on Monday. We got Mike Pompeo, Lara Trump, Marco Rubio and Sarah Huckabee Sanders as the main lead-ins.",
         "Still waiting... I bet she's getting annoyed \n\nWould be a great attorney general though",
         "She said recently that she voted for Trump in 2020, after some painstaking soul-searching. Ultimately, she decided she had to vote on policies over any other factors, and she liked his policies better. I assume this meant she voted for Hillary in 2016, but she didn't say that specifically. She claims she has gotten more conservative over the years, and just recently placed herself at, if I recall, a 6 or 7 on the 1-10 scale of conservatism. Which surprised me a little that it was so low, because she sounds more conservative than that these days. She even implored her viewers to re-elect Ted Cruz.",
         "The number of people butt hurt about her asking perfectly legitimate questions at a debate is astounding to me. It’s as if many republicans are no different than democrats and are only accepting of those who think exactly like them. Turns out there are republican NPC’s too. I say this who has now voted for Trump 3 times. The general election. This kind of attitude is embarrassing."
      ]
   }
}