{
   "1gkh9af": {
      "title": "Kamala Harris pretends to have a phone call with a voter. Unfortunately it shows she only opened her camera app.",
      "text": "",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "She's just so fucking fake it's unreal\n\nShe makes Mark Zuckerberg look downright human",
         "lol no fuckin way",
         "Her entire campaign is like a reality show.   Nothing real about it.   All lies, deceit, and fakeness.  All because she hates Trump.",
         "I can understand why people vote Democrat, even if I don't agree with it. But the fact that her thorough and routine exhibits of being out of touch and inauthentic don't turn off so many of her supporters, I'll ever understand.",
         "You can open your camera while on a call though, right?",
         "TBF, you can run your camera app and be on a call at the same time.",
         "Harris: most fake person alive?\n\nHell, if she loses, maybe she would be a great actress! She can muster up plenty of referrals in that business. I mean, we wouldn’t pay to see her but Dems would",
         "What if it rang mid fake calls? 🤣",
         "Amazing how she was prosecutor. <slurp>",
         "Any other video of this other than a video on Reddit? Not doubting OP but I’d like to see multiple\nsource because we can’t even trust what we see anymore..",
         "It's sad to think people would vote for that.",
         "*”Hello human, I am a fellow human. Let us engage in activities that us humans do. Would you like to play the human activity with me of hopscotch or perhaps something else?”*\n\nI can’t get over how much Trumps rise really put the magnifying glass on how inauthentic these people are.",
         "If you swipe up from the wrong corner it goes to camera, I'm not much of a smartphone person and I do this all the time too.\n\nOn the other hand, better smartphone skill might be expected from someone who is actively running a campaign. (might)",
         "She and her Hollywood celebrity supporters are fake. After all they are actors!",
         "😂 Not surprised. Everything about her is fake.",
         "![gif](giphy|5PvdsQmoZQx9Ej4xaJ)",
         "I tried to do this with my iPhone and yeah, if you try to use the camera you can bring up the app, but not use it. Unless it's an Android, or if she's on another iOS version, she wasn't on the phone with anyone.",
         "Zuckerberg started working out and doing combat sports, got his testosterone up. It literally turned him from a flaming lib to a borderline conservative. Same exact thing is happening to Bezos.\n\nFunny how that works 😂",
         "She is fake!\n\n**However... It is not impossible to be on phone and camera at the same time.**\n\nYou don't see on the notch you're on a call, just the green dot indicating the camera and mic are on. \n\nSo, it isn't impossible. Nothing concrete here. Don't jump on it.",
         "The voices in her head giving her false realities",
         "she pays people to attend lol and many are invite only.   lol",
         "My thoughts, also. \n\nRepublicans laughing at this like it validates how fake as fuck she is. \n\nThis is a non story.",
         "Actresses have to be convincing, or at worst pretty. ",
         "Bruh, it was against her ear the whole time. ",
         "Your claim was debunked on X already.  Enhanced photo shows no green dot on top of screen to indicate there was an active phone call.",
         "You would see the call banner at the top of the screen. There is no call banner",
         "Not to mention that the screen turns off while its up to your ear and does not instantly snap back on when removed, theres a slight delay. \n\nYou dont see that here, its just the front camera the whole time.",
         "I simply said swiping wrong, the rest is not included in my post.\n\nThis fireball of anger is uncalled for and inexplicable, whatever though. Just because my statement is not the same as your statement does not mean I am your enemy.",
         "iPhone > Make a call > Open Camera > No banner. \n\nJust a green dot in Dynamic Island.\n\nWhoever upvoted you, go back to r/Politics.",
         "Well I'll be damned you are right. The screen when went dark when she held it up to her face which probably means she was on a call."
      ]
   },
   "1gkidie": {
      "title": "Reddit is almost unusable",
      "text": "In the last 2 weeks. While scrolling I’ve been getting pro Harris election propaganda in almost every subreddit. I think I’ve muted over 100 in the last week.  These subreddits usually have nothing to do with politics.  I wonder if this nonsense will end tomorrow after the election is over.  It’s terrible. ",
      "comments": [
         "I saw a post on ask politics why reddit is so left and the replies were a mix of \"because reddit requires reading\" and \"we aren't even that left\"",
         "I’ve muted tons of them. They’ve infested and ruined many that I was really interested in being part of. Moderators are a joke or non existent.",
         "All absolutely flooded with state or regional subreddits nobody has ever seen on the front page before, all spewing propaganda. \n\nI had to mute texas, and multiple texas regions. \n\nSomeone is paying money to have these posts botted to the front. \n\nKeep em coming, i can mute subs all day.",
         "Reddit in general is a radical left tire fire and is 99.9% irremeably useless.",
         "For posting on this sub in particular I get private hate messages 😂 gotta love it.",
         "I literally see subs for carpentry and birds with anti Trump posts with more upvotes than subscribers",
         "Every possibly subgroup you can think of somehow gets political and then it becomes a 2,000+ comment cesspool.",
         "Conservatives really have to mute some subs just to have a tolerable home page.",
         "If Trump wins expect the left to deny the results and riot causing death and destruction. The secret service will be extra busy as well. All the projection of the left, they always end being the guilty party. Expect nothing else if Trump wins.",
         "It shows the bias of the platform where there has been no effort to clean up the astroturfing",
         "No, it won't end. They are bored people who need an outlet and to bother everyone is their goal.",
         "The trick - only show your \"home\" feed of subs you've joined.   So easy.  No need to mute any subs.",
         "I accidently posted to r/politics about a month ago. Boy, was I beaten and bruised. \nIt said the sub was for all politics. /s",
         "Optimistic that you think this election will be over tomorrow",
         "Reddit doesn’t have nearly as many daily active users as you’d think - in “prime time” between 7PM and 10PM (when most people are home from work and online), go look at one of the top subs. I looked at /r/pics a few nights ago and it had 6,000 active users at 8PM on a Friday night. \n\nSo, it’s very easy to astroturf with bots. If you just get a couple thousand upvotes quickly, you can make anything land on the front page.",
         "I've been seeing \"I wanna break up with my boyfriend/fiancee\" or \"I wanna divorce my husband\" posts because \"he voted for Trump\". And most of the comments would suggest that person to breakup with their partner or divorce their spouse.",
         "I’ve been having the same experience. I actually emailed the CEO SteveHuffman. I’m not holding my breath, but it should change. \n\nIt diminishes and poisons the content. Everything the left touches turns to shit.",
         "Tomorrow, the election is over.  \n\nBut, tomorrow the anti-Trump resistance will be born again.  The schreaching, moaning, hyperbole, exaggeration, and out right lying will be disseminated, non-stop, across the airwaves by disgrunted leftists crushed by our course change away from Sovietization. Intersectionalists will brand themselves rebels, polish up their Che Guevara tatoos, and head out to \"re-educate\" the masses.  Reddit and other social network will certainly continue to do their part to \"get this country back on path\" to Soviet serfdom and authoritarian shitiness.  ANTIFA will crawl out of their mom's basement, put on their best combat boots you buy at the GAP, and facetime their friends to find their next best rally for kicking NAZI ass.  And the cycle begins again.",
         "I wish Elon would buy this piece of shit site.",
         "The reddit of 2010 is unrecognizable to the leftist hellhole this became.",
         "Honestly there’s been nothing that has pushed me further to the right from the center than reading the vitriolic hate leftist redditors have for their neighbors. \n\nI have never seen anything on conservative subs that has approximated the hatred, intolerance, and smugness on basic Reddit subs like “politics” which should just be called “propaganda”",
         "The Georgia subreddit is the same way. It's just a Kamala Harris subreddit now 😂",
         "The Harris team has actually been running an active propaganda campaign here. No, I'm not joking.  \nI hope that every one of the losers on that team don't have a job tomorrow. Because, by God, if she wins, they're going to have work for another 4 years (or more.)",
         "The weirdest one by far has been adviceanimals. Like if you haven't been there in awhile it's hard to explain exactly what the fuck has been going on in that sub for the past month or two without showing you. \n\nIt's surreal.",
         "[This is why](https://thefederalist.com/2024/10/29/busted-the-inside-story-of-how-the-kamala-harris-campaign-manipulates-reddit-and-breaks-the-rules-to-control-the-platform/).",
         "you need to curate your feed op",
         "I 100% agree with you. The only reason I downloaded reddit in the first place was because I had a debate with a liberal friend and a conservative friend.And they couldn't agree whether reddit was left, leaning or right leaning. I told them I would look objectively at the entire site as a whole. I came back last week and talked to both of them. It is extremely left-leaning.\nAnd the censorship is outrageous.",
         "You know what made me smile? Kamala Harris publicity stunt. \n\nYou know what's damn interesting? Kamala Harris campaigning. \n\nYou know what's an amazing picture? Kamala Harris making a speech.\n\nYou know what's mildly infuriating? Someone hanging a Trump flag outside their house.",
         "I really would like to know the top 10 most muted subs",
         "Youve made it this far without being brainwashed. Just ignore it like the rest of us",
         "It should get better but the bots don’t all go away after an election; also, if Trump wins then expect even more theatrics from the left.",
         "Yep, I've called it out on various subreddits but of course been downvoted to Hell.",
         "I am in the AEW subreddit. A mod over there made a sticky telling people to vote for Kamala and Banning people who said they were voting for Trump. lol.",
         "Oh they are filterting for sure... stop the steal",
         "I'm certain this is the only major non-bot sub (thanks to the \"flaired users only\" system and a good job by the mods) on the whole damn site.\n\nI agree. Totally unusable and basically full of Markov-chain based bots and paid shills from troll farms.",
         "Simply put, they will not stop until they are stopped. It is the duty of every decent American to determine what, and who, is allowed to exist in a moral Nation",
         "[removed]",
         "If Trump wins it will end, because instead of feverishly downvoting anything that isn't vote blue because they are programmed to, they will be out burning down every neighborhood in the country and robbing any business foolish enough to exist.",
         "Every subreddit is finding a way to sling in their liberal propaganda. I was in the vegan community and there was a post telling us that Trump is gonna take away our rights to be vegan. My comment that he doesn't give a fuck about our dietary preference got downvoted to hell. *facepalm*",
         "Just makes it more fun!",
         "“Because Reddit skews college educated and smart” \n\nBoundlessly insufferable ",
         "If leftists had more self-awareness and less insufferable smugness, they wouldn’t be leftists, now would they?",
         "> \"we aren't even that left\"\n\nIf  Reddit was any more left they would start that climb back up the other side.  ",
         "“rEaLiTy hAs a LiBErAL bIAs”",
         "I like to think for most of the NPCs, that these are their digital blunder years.",
         "I had the same thing pushed into my feed. They might be able to read, but comprehending is a whole other animal",
         "Most of them on the other sub are either paid actors or literal NPCs lmfao. ",
         "😂",
         "They are not people. Win today, go after them tomorrow ",
         "I went to check my muted subreddits the other day and holy shit dems did work on this site",
         "LOL\n\nI JOINED that Sub so I don't miss a chance to downvote.",
         "I don’t even subscribe to my own state’s/city’s subreddit. It’s just the political subs cloned.",
         "InlandEmpire (which is a relatively conservative area in so-cal) is flooded by the blue hair types 😒",
         "And yet here we are, right? \n\nI like to feel that if they can’t erase us here, they can’t erase us anywhere!!\n\nToo big to rig, mothertruckers!!!",
         "It's just propaganda and suppression \n\nRemember how Don used to run the front page? And how normal social media was for a few days after the 2016 election? \n\n\nIt's more liberal than avg, but it's not nearly as rabid as they make it appear. \n\n\nHell, top posts like here, not brigaded, top out at 2k? With a million subscribers? Bulllshittt",
         "It’s astroturfed to the core. Check out that federalist article. It’s not even so much “radical” as it is owned by the dnc \n\nE: the article  https://thefederalist.com/2024/10/29/busted-the-inside-story-of-how-the-kamala-harris-campaign-manipulates-reddit-and-breaks-the-rules-to-control-the-platform/",
         "The funniest is when they send the self harm team to message you if they can’t get you to take your comment down by downvotes, lol never works, stay strong, they’re pathetic",
         "Call my comment bs if you want but last message i got for posting in this sub someone threatened to post a bomb threw my letterbox… yea gotta love those kinda messages from the “tolerant” left.",
         "The fact they think this is an effective strategy rather than a big turn off says a lot about their intelligence. They will lose!",
         "Someone can make a pro-Kamala and anti-Trump post and it can get 10k upvotes.",
         "stay clapped.  and alert.",
         "Yep, afterall look how the radical left behaved when the “far right” were winning in the French general election… fkin crazy.",
         "Bored and miserable",
         "Yep. Unsub everything you can. Never use ALL, only HOME",
         "Then I miss out on all the fun!!!!",
         "just flipped on tv for the first time and they had Arizona AG stating it will take 12-13 days for theirs to be official.  I miss the gold ole days of inferior technology and more timely election results",
         "More like over Friday...in December...",
         "Reddit does this a lot. They will spam the same anti-Trump article on dozens of subs including non political based ones and use bots to make them front page. It's all in an effort to distort the reality of opinion. I can't tell you how many times someone says, \"I am a European, if Trump is so bad how could it possibly be even close?\" Leftists usually answer with some idiotic excuse that half the country are in fact nazis and racist",
         "wtf",
         "I have been significantly moved to the right in my politics in recent years and large part of the reason why is because these smug shitheads are just beyond insufferable.",
         "\"college educated\"? Maybe. \"Smart\"? Probably not.",
         "Every time lmao, the lack of self awareness is unrivaled. Clown show",
         "It just pushes people further to the right every time people want to discuss something and they get unrelated politics shoved down their throat",
         "this sub and PCM are the only bastions left for conservatives on this awful site",
         "I've been here longer than probably 99.5% of users. They can leave first.",
         "all and popular is utter slop",
         "> ole days of inferior technology and more timely election results\n\nAnd no cheating part. That's important too. \n\nThis is such a good read -- https://www.leelanau.gov/downloads/pc_01092024_b_wiesner.pdf",
         "Jan 21."
      ]
   },
   "1gkdqa1": {
      "title": "Meanwhile,  in PA...",
      "text": "The Amish are out in droves. God is not finished with our country. ",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "[This picture is from 2020](https://www.breitbart.com/2020-election/2020/11/03/amish-horse-buggy-trump-train-goes-viral-election-day/)",
         "Vote like it’s 1899!",
         "Thx in advance, Amish!",
         "Say what you want about the Amish. But they are world famous for following through with their beliefs. We need every bit of help we can get to get Pennsylvanias electors for Trump.",
         "Amish are usually not involved with voting.  But some Biden government beauacrats decided to go after some of them for selling farm goods.  I don't know what if any rules they violated but a couple got thrown in jail.  Somewhere around 100k amish in Pennsalvania and they are pissed.  Them coming out to vote is actually something that could make the difference.  The federal government is out of control.  The amish know it and you know it.",
         "If Trump wins, he should host a gathering off these groups that seem to be showing great support for him this time - Muslims, Jews, Amish, Latinos, etc",
         "I know the Amish community was pissed when Amos Miller got raided. I hope they show out to vote today!",
         "A very large community of Hasidic Jews is coming out en masse for Trump in Lakewood, NJ.  No one has ever seen voting lines like this in Lakewood.",
         "\n🎵 As I walk through the valley where I harvest my grain\nI take a look at my wife and realize she's very plain\n\nBut that's just perfect for an Amish like me\nYou know, I shun fancy things like electricity 🎵",
         "Amish Army!!!",
         "I am now hungry for homemade baked goods.\n  \nEspecially a whoopie pie.",
         "The Amish understand the values this country was founded on. I don’t think they usually vote in large numbers, so this could be a huge change for them. They want to protect their way of life.",
         "If PA goes red, we know who to thank",
         "RIDE OF THE ROHIRRIM",
         "Fuckin A, here come the Amish!",
         "Like most other Republicans they just want the government to leave them alone. They know that doesn't happen with a leftist in the White House.",
         "PA FOR TRUMP! PLEASE VOTE!",
         "This is so sick. I love this",
         "The estimated Amish population in PA is over 81,000. LFG.",
         "that is fake.   I know it because Joe, kamala and the entire left said that if people did not take the jab they would 110% die.",
         "I think this picture is from 2020",
         "I live in a different Midwest state and I have heard talks of the Amish population here also exercising their right to vote. Surprising because they are typically so reclusive when it comes to govt affairs.",
         "This must be really bad if the AMISH are voting 😆 ",
         "remember when biden went after the amish for selling food goods!?!?...hopefully their votes increase the red chances!!",
         "They should have a million of those and drive over to Philly or Pittsburgh",
         "Past weeks I’ve been seeing Dems try to convince people the Amish wouldn’t be voting. They fear this level of turnout.",
         "Is this real?",
         "Send in the cavalry !",
         "At the same time, we shouldn't think that the Amish are going to vote in big numbers. Nick Shirley went out and talked to a lot of them. While yes, the ones who are going to vote are for Trump. There still seems to be a good group that just doesn't care about politics and just care about God.",
         "I kind of out of the loop with this one. I’ve seen it mentioned recently but will the Amish be a game changer?",
         "Curious why the Amish are supporting Trump, though.  Aren't they mostly insulated from economic issues?",
         "Don’t have to worry about running out of gas",
         "This picture has been recycled since 2016… that being said yes, yes they are.",
         "Politics aside—this is a fantastic image! Let’s go guys!",
         "That is bad ass🇺🇸",
         "Meaningful to note the very insular Orthodox Jewish Satmar Hasidic sect who usually abstain from endorsements, but in the past have endorsed local, New York politicians in state and local levels, has endorsed Donald Trump and instructed his followers some 50,000 strong in New York alone to vote for him. \n\nFor all the antisemites posing as anti-Zionists don’t worry they don’t recognize the state of Israel as a secular state, they await the messiah, so this isn’t a pro Israel endorsement, they just fear the state of Jews under a Harris presidency rightfully so. \n\nIf you rally the Hasidim in New York and the Amish in Pennsylvania, all should be well in the end.",
         "Amish Paradise",
         "Yinz want 1 term or 2?",
         "The Amish are with us.  Hawt.",
         "wait, are they creating a traffic backlog so the loads of Harris voters being bussed in can't make it in time?\n\nthose Amish are so clever!",
         "Gotta love the Amish. That is the best photo I have seen this group today. I love it.",
         "What a beautiful picture!",
         "When the Amish get involved, shit has done got real!",
         "HELL yes! Lets go, we need you all.",
         "I was wondering if the Amish would turn out in droves after I saw a big line of Jewish support for him yesterday. And these good people reached this conclusion without all the medias left leaning bias and propaganda. Good to see!",
         "Everybody on the Trump.... Buggy Caravan!",
         "Ugh early voting does not look good for Trump in PA",
         "CHOO CHOO!!!!! 🚂🇺🇸🇺🇸🇺🇸🇺🇸",
         "We got some real Mennonites up in here\n\nLET'S GO AMISH",
         "we been spending most our lives living in a leftist paradise\n\ntheir women all look like guys\n\nliving in a leftist paradise\n\nopen borders and fiery nights\n\nliving in a leftist paradise\n\n4 more years we wont survive\n\nliving in a leftist paradise",
         "This is awesome!",
         "Ive churned butter once or twice….",
         "Let’s go Amish!!!!! (What’s funny is they will never read this as they don’t use internet)",
         "That is nice of you, but you know, they very likely won't read that. :-)",
         "Taking \"Don't Tread On Me\" seriously!",
         "The dispute is over selling raw milk and unprocessed meat.  Every Instagram cutie is sucking down raw milk left and right, there is a high demand and the Amish can't sell it.",
         "Amishgate.",
         "lancaster county is the county to watch,",
         "I've heard they're pissed enough that they're *encouraging* their women to vote too.",
         "Amish are of the mindset not to be recognized. But improving the economy so they thrive would be plenty of thanks.",
         "The rainbow coalition for freedom!",
         "[removed]",
         "Sounds like a MAD Magazine fold-out in the making.",
         "Love to see it. \n\nPeople criticize Jews for being liberal, and by and large American Jews are overwhelmingly so, but if you look at voter maps at all the major *Orthodox* Jewish enclaves, they're the reddest counties you've ever seen. Monsey had between 90-99% of its residents voting Trump in 2020.",
         "This is so interesting-the Hasidic Jews in Monsey NY came out years ago for Hillary Clinton when she ran for the senate.  Do not get on their bad side-they vote as a bloc, and there are a lot of them.",
         "So good, right?",
         "Absolutely. This is a meme, but I work with the Amish part time, and can confirm they are absolutely voting Red.",
         "80,000-100,000 voting age in PA alone.",
         "LET'S GO AMISH!!!!!",
         "The Biden admin went after them for drinking and selling raw milk.\n\ntraditionally the amish and government have had a 'hands-off' relationship.",
         "They want freedom of religion, and yes, they still use diesel generators and buy goods like the rest of us.",
         "probably has something to do with the biden admin going after some Amish farmers and jailing one in particular over something about selling their farm goods.",
         "They still have to purchase some goods.",
         "Found the Pennsylvanian...",
         "Yes it does. Actually do comps between 2020 and this cycle. Just looking this cycle and going “trump behind early vote, uh oh” is horrid analysis",
         "lol yes it does. Dems had a 400k lead going into today. That had a million last time.\n\n  \nIf you are referring to today's numbers then there hasn't been any released from PA so how would you know?\n\nIf you are going by ED voting in other states? Well it looks like we are in for a good night.",
         "We sell quilts at discount price...",
         "Livin’ in a MAGA paradise",
         "Nope, i just het pictures of your mom through the mail",
         "No TV or magazines either.  Imagine never seeing a campaign commercial?  The Pennsylvania Amish are upset at the State not letting them sell raw milk and unprocessed meat.",
         "Never know... i live by an Amish community and they order things online and smoke. Not sure *how* but this is in the south so things maybe different from PA.",
         "Haha, many Amish have (secret) phones. As long as the Bishop doesn't know...",
         "r/amish",
         "Not until I fly to PA and sneak them a cellphone and router 😜",
         "Thank you.  I suspected that others knew more than me.  I am all for Instagram cuties sucking down raw milk.",
         "Something Trump can do that other politicians usually can't: go talk to them without announcing it.\n\nNo ceremonial handshake, no limelight, just hearing their concerns so they can be included in the governing. If a DC regular can't make PR out of it then it's stressful wasted time to them, but Trump is more comfortable going to North Korea than a lot of Dems are venturing outside the big city.",
         "Yes. I heard that if you tell them they have something nice, they actually take it as a kind of insult, because of the value they place on humility.",
         "Wow! We have keeping pushing and do what we are supposed to do which is VOTE! 🇺🇸",
         "[removed]",
         "Oh, yeah",
         "Ohioan actually but I've been around a lot of A-mish stores in my area. They grow a mean honey crisp.",
         "First I'll cast a ballot...then I'll cast anudder",
         "and.... you get a free My Pillow!! But hurry, because this deal is only while supplies last!",
         "thanks man...   now I've got that beat playin' in my head.",
         "We lynched Juicy in the snow and ice...",
         "You can only be apolitical so much before it affects you.",
         "Not a single luxury",
         "Somebody else can order for them, just like somebody else can drive them in a car.",
         "Ordering things online probably via prayer. Maybe god actually answers this stuff if you are a good enough Christian.",
         "Yeah, I heard some sneak off to party. And some do leave their community to join the outside world. I think I saw one woman had a YouTube channel who was chronicling her life after leaving.",
         "They don't want that. If you fly there anyways, just thank them in person.",
         "This is America. Instagram cuties have the God-given right to suck down whatever they damn well please!",
         "The religion is based around being humble. So publicly recognizing them, would probably be a bad call.",
         "Many more in WNY also! (just to the north)",
         "Ba dum tiss...😁",
         "Like Robinson Caruso...",
         "That doesn’t really make sense to me. It sounds like similar logic to how some young Mormons will do these things that barely skirt around “no sex before marriage” like inserting but not thrusting and having someone else shake the bed they’re on to simulate sex while *technically* not being sex? Like it seems pretty self evident by rational reasoning that’s not what you’re supposed to be doing but since it passes the “it’s not me it was someone else” test *technically* they can do it.",
         "I am not sure on if it is required or encouraged but they do leave the comunity for a certain amount of time to experience the outside world and decide which world to pick. It is actually a pretty cool practice and I think a surprising amount decide to come back to the Amish comunity but not all.",
         "Some...🤣 They all sneak off to party during Rumspringa. And after they're newly married,  too.  😁",
         "Agreed!",
         "It’s called Rumspringa.",
         "Thank you i knew it had a name but could not think of it. Other than missing the name do you know was the rest at least correct? I am no expert on it so do not want to say anything wrong.",
         "That’s a good interpretation. It’s somewhat easier for boys to make a living while on Rumspringa, they have more needed skills such as carpentry, construction, farming, girls less so, housekeeping and similar, both due to limited education. And yes, most return, they are shunned by their families when on Rumspringa so they miss them, especially brothers and sisters.",
         "It is interesting you mention boys because as I was typing my first comment I was not sure if it was just the boys that do that or both genders. What you said makes a lot of sense. I totally understand it is hard to leave all you know and most return but I still love that it is an encouraged tradition to leave and see the world."
      ]
   },
   "1gkiieu": {
      "title": "I voted for the first time today ❤️",
      "text": "I’m 18 years old from Pennsylvania and today I voted for Donald Trump. He will ensure my generation has a strong economy and can afford to live the American dream. Trump will deport illegal immigrants and make it a safer country for me and my kids to grow up in and I won’t have to worry about fentanyl running rampant in the streets. I also don’t have to worry about my future son forcibly drafted into the army in the brink of WW3. If you support peace and want the American dream as well I urge you to go out and VOTE. Polls close at 8 here. Thank you all and God bless America ❤️",
      "comments": [
         "![gif](giphy|Ov7lAOUsu4Yo0|downsized)",
         "I'm liking this generation more and more. These kids are pretty cool. ",
         "Congratulations.... Go vote again... Just kidding 🙄",
         "Conservative girls are always more beautiful! Awesome post!",
         "Awesome!",
         "So pleasantly blown away by the Gen Z Trump voters today. You all are giving me hope for the future! 🇺🇸❤️",
         "Thanks for fulfilling your civic duty!",
         "Awesome, my first president at age 21 in 2016 was also Trump, and I voted for him again today just an hour ago",
         "That is awesome! I am a fellow Gen Zer that also voted for Trump! 🇺🇸",
         "Thank you",
         "Nicely done!!  PA is proud of you!!!",
         "Ladies for Trump!!! 🫶🇺🇸🫶",
         "![gif](giphy|Qjmp5vKEERPyw)",
         "And this dooms the Dems to irrelevance for another generation.\n\nThank you for choosing sanity and logic over feelings and continued chaos.",
         "[removed]",
         "let's go!",
         "Based",
         "Cert got that rizz like for real for real. Still that lingo they be dropping be throwin up those beige flags all day tho. But they be bussin’ voting for trump do. No cap. For sure glow up. Let them cook ya know?",
         ">Just kidding\n\nBut are you though? 🤔",
         "We don't do that here. Leave that to the (D)ifferent kids.",
         "It helps that they are female.",
         "Yes, of course 🤥",
         "Damn lol"
      ]
   },
   "1gkdt3d": {
      "title": "Voted conservative for the first time ever today.",
      "text": "I voted Republican across the board. I've been voting Democrat since 2012 but the definition of insanity is doing the same thing and expecting different results. I want change so it's time to do something different. MAGA!",
      "comments": [
         "WTF is this ballot?",
         "Why do they list the candidates twice. Odd to say the least.",
         "That’s a NY ballot! Glad to have you on our side!",
         "Well hello there fellow Western New Yorker",
         "Having Harris listed next to “working families” definitely feels like a bias 🧐",
         "I have so many questions about that ballot. 🤔",
         "Thank you Patriot for voting and choosing Making America Great Again! \n\nText, call, email, social media friends, family, neighbors to come to the polls and vote.\n\nNO FAT ASS HARRY'S!",
         "Paper ballots for the win!",
         "I live in a Red State that has zero chance of flipping, so I tend to vote for whichever 3rd party candidate is most popular in order to hold up a finger to the 2 party system.\n\nSadly, the city I live in has enough lefties and democrats that they tend to win local elections, so I can't just protest vote locally and actually need to vote properly.",
         "Do they randomize the order of the parties on these ballots?  Or is it just biased for Harris?  It’s a pretty significant advantage to have the top spot of a ballot",
         "We also need more...more...more! \n\nKylo Ren style\n\nBut, we need more men to turn out so we cancel any Harris women voters!\n\nTime to stand up, go to the door, open the door, walk to your vehicle, go to the polling site and GET IN LINE!",
         "Hell yeah!",
         "More so in 2020 the GOP ticket has a big tent full of diverse people and ideas. Common sense prevails! 🇺🇸",
         "Fellow New Yorker! Did my part today with you, here's hoping for a good showing and many NYC Jewish voters realizing Trump will be better for them.",
         "Why do both candidates get two different listings?",
         "How is it legal for Harris and Gillibrand to be on the ballot TWICE?",
         "Is this a real ballot?  I cannot imagine this being real wtf.",
         "Looks like you didn't vote for any conservatives, only republicans. Missed it by one line. Oh well, maybe you'll get it next time.",
         "NY\n\nYou should see how the prop one vote on the back is worded.",
         "This is why they call it straight ticket, they used to all be this way or straight down column.",
         "In many states, candidates are allowed to run under multiple parties.",
         "It's a WNY party! Voted on the conservative party line. Go bills.",
         "I choked when I saw that, \"working families\" what a crock of shit! If they could have put \"fascists for the wealthy\" for Trump/Vance, they would have.",
         "State legislation sets the order. Blue states have Dem first,  Red states have Rep first",
         "Yes, it’s usually randomized depending on number or alphabetical draw.",
         "I think this was a joke people... calm down 😉",
         "I just voted. I was shocked by the wording.",
         "For those that don’t know, Ballotpedia is great resource to research props and make an informed decision",
         "LOL she almost get her freaking tagline as her party. Surprised it doesn't say \"Middle-Class Families.\"",
         "That should be illegal on the federal level.",
         "I mean, I think the candidates pick these parties. Trump missed a bet by not going with MAGA Party!",
         "I live in a Red state. Oliver was first.",
         "I don't think so. The law in NY is a party must get 50,000 votes on its line in statewide races in order to keep its access.\n\nIOW if the Republican and Conservative Party have the same nominee, (same with Democrats and Working Families) voters are encouraged to vote on the Third Party line so it can continue to have a place in the ballot.",
         "Vote yes if you think the ny constitution should include a new section saying all people should be treated fairly, vote no if youre a big stinky head. \n\nTranslation: vote yes if you think ny should have a law that boys can play in girls sports. \n\n\nI checked the box indicating im a big stinky head.",
         "I've just never seen a ballot like this. I'm thankful my state is short and simple, I've heard the swing states are 4 pages long.",
         "NY has what are called, \"fusion tickets\". This means you can be the nominee of more than one party. The WFP has been around for years and is generally a pró-labor party. The nominee doesn't choose the name.",
         "That's interesting. In Texas, Republican is first because that's how the legislature agreed to have it. If I may ask, what state are you in? I want to research this.",
         "Ahh, still seems so odd when they have the same nominee...\n\n(must be why \"Common Sense\" doesn't have a nominee in NY... /s)",
         "GA we had one that didn’t even mention the upto 4% tax increase",
         "My PA county does voting by Dominion machines. Was a very simple ballot, 9 offices or so to vote for, one screen for each. I heard the poll workers say they heard another state's voting went super slow a while back because they had a lot of ballot initiatives the people had to read.",
         "I have no idea what the law is. Maybe it was random. My state only had Oliver, Harris, and Trump. So RFK was removed, and Stein must not have qualified.",
         "Are you able to fill out paper ballots?",
         "Not that I know of. I prefer it this way. I grew up voting by machine too, but they were the ancient lever machines that I think date back 100 years. This new machine produces a paper print-out that goes into a second machine to be read.",
         "I have never voted on one, I'm old school 😁",
         "I only voted on paper when I was living elsewhere in the state. They had previously had electronic machines too, although they were an older model with a curtain around them. I was shocked and appalled when I showed up one year and we had to vote with a pen and paper. Fine for the Amish but not for me!",
         "😂"
      ]
   },
   "1gkdq79": {
      "title": "Trump is going to win the election and the far-left lunatics on this site are going to have a complete meltdown ",
      "text": "",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "GO VOTE",
         "If that happens, don't rub it in their faces, or do it just a little. The times we are living now require unity. More division will be very detrimental to America.",
         "I mean, i certainly hope so. \n\nId be lying if i tried to say that the *only* reason i want trump to win is because I think he’s the best choice for the country. \n\nThe salt mining in 2016 was some of the best shadenfreud or however its spelled that ive ever felt in my life.",
         "I mean I know we all remember Reddit ‘not working’ after the Trump/Biden debate 🙄 Trump winning will make Reddit implode, and it will be BEAUTIFUL!",
         "costco in my area (red) already sold out of 'bug out bags' (30 day supply of survivalist food!).",
         "Cant wait to peep at r/politics after he wins",
         "Reddits going to be a ghost town after the astroturfers leave",
         "They'll still talk about Trump even if he loses. TDS is real.",
         "Every subreddit is probably going to be locked if he wins which will be a huge bummer.",
         "Liberal tears are delicious.",
         "Politics aside, I want a Trump win so badly just for this reason lol.",
         "rpol is in full insane mode already. You can hear their orgasms over Kamala over the internet. \n\nIt's so nuts how otherwise intelligent people can delude themselves that they are actually supporting someone when all they are doing in indulging thier hate. They truly are children. All they want is a strong parent figure to take care of them. That's why they only talk about identity politics, personality traits, and everything else that has nothing to do with being president. Because they aren;t voting for a president, they are voting for a parent. They don't call her \"Momala\" by accident. They really think that if they vote for her she will take care of their problems and all their failures in life will be swept away cause Mom will take care of it. It's absolutely insane.",
         "It's going to be glorious.",
         "Go vote. I can handle 4 years of her laugh",
         "I really don't want them to have a meltdown, but the surprise of a loss would lead to violence that would dwarf that of January 6. So I would stay away from downtown metros. They are so, so certain she is going to win, and are so fully convinced that conservatives are evil, that they will lose their minds and start smashing and burning things. Mostly because they want to retain the right to murder infants. \n\nThey will expose their hypocrisy and say that the election was stolen, after making fun of conservatives for doing just that (although I agree with them in regards to the last election - I do think Biden won fair and square, if we are counting a system with massive media manipulation as being fair and square - conservatives were just being sore losers). \n\nI am pretty sure that Trump is going to win. The dems are going to be complacent and not vote, due to their arrogance. I expect continual violence throughout Trump's presidency.\n\nCould be wrong, but that's how I see things.",
         "I'm saving this thread because it will either be a complete disaster in the next couple days, or a complete disaster in the next couple days.\n\nThe only way to know the actual result is to wait, and the only way to achieve the result is to vote.",
         "Especially when it becomes a Reagan landslide",
         "I went to the Supermarket this afternoon. And the Good Omen that I saw was a man of retirement age with a Maga shirt on. But... not just any Maga shirt, a shirt that said \"MAGA A F.\"",
         "dude remember the meltdown sub? and how it quietly just died after Trump won? ahhhhhh\n\ngood fuckin times man",
         "That’s the hope. \n  \nPersonally, I want a 2024 version of the dark-haired “HES A FACIST” girl in the car and the RBG freak out girl. Those are my faves from Trumps first run in office.",
         "[removed]",
         "I can’t wait 😂.",
         "IF YOU KNOW ANYONE IN PA NJ VA NC GA AND NH WHO HASN’T VOTED, GET THEM TO THE POLLS PRONTO.\n\nFL NV AZ DATA LOOKS FANTASTIC. WE ARe WITHIN REACH!",
         "There are a couple of people in my life who have attacked me over my decision, totally unprovoked. \n\nI plan to rub it in their fucking face.",
         "Maybe when they stop calling us a threat to democracy and literally Hitler.",
         "Screw that, they have shown zero grace or compromise over the last 8 years and wouldn’t think twice to rub salt in the wounds.",
         "If they win, the first thing they intend to do is lock up Trump and begin persecuting anyone who supported them. \n\n\nF them.\n\n\nIf they lose they deserve every ounce of misery that comes with their evil.",
         "Agreed. If we lost, God forbid, we should act right, too. (Assuming there isn't any fuckery going on.)",
         "This.\n\nTreat reddit like a museum and just observe and move on. At the end of the day we are all Americans and we want unity, not further division.",
         "Tell what? I'll do unity next week.",
         "Rub it in whose face?  They wouldn't hesitate to do another covid again, and they wouldn't hesitate to take your rights.  They believe you're garbage.  Now is the time to show them that we aren't the minority voice, and their ideas are built on lies.",
         "We live in a time where there's a need to feel like being right is what everybody wants to be and everybody wants to demean the ones that are not. I hope you understand what I mean by that. We need to stand in unity regardless. I heard a report say that when Biden was placed as president, there was no rioting, but when Trump became president, there were people rioting all over the place. Now, we all know I wasn't one of them who rioted when Trump became president because there was nothing to riot about IMHO. Let's all come together no matter what happens and be American again. Regardless of what agenda they are trying to instill in us. God bless America!",
         "Schadenfreude",
         "Not to mention the riots and countless Democrat representatives that will refuse to certify the election. We will never have to hear about January 6th ever again if Trump wins because it will be just as bad, if not worse. All of a sudden denying elections without proof will be acceptable.",
         "I mean, survivalists are mostly conservative. This is right wingers thinking the steal is gonna happen again and everything will go to shit.",
         "[removed]",
         "I bought mine a few years ago.",
         "They've been saying she won for awhile now lol",
         "Just me and the bots",
         "Legit - believe my math was ~170 posts per day (& associated comments / votes - per the recent Federalist expose')...\n\n>Over the course of 15 days, this group of volunteers, directed by official Harris-Walz campaign staff, was able to make 2,551 posts to Reddit. So far, they have received more than 5.7 million upvotes and 418,000 comments on those posts, according to their own data...",
         "Goddamn it’s true.. my *best friend* of 17 years said Dick Cheney was a “better person than Donald Fucking Trump” and then followed the message with “I can’t believe anyone would vote for Donald Trump.” \n\nEven though a week ago she had openly admitted that she had 0 information on either of their policies because she (quote) “gets too burnt out to care to follow politics.” \n\n🫠",
         "Yep. I fully expect this one will be locked regardless what happens. r/Pol is going to absolutely flood this place when the results are announced, win or lose.",
         "Bad for high blood pressure though",
         "These people need to pay a visit to r/raisedbynarcissists then because that's what kind of parental relationship they're going to receive from her.",
         ">They don't call her \"Momala\" by accident. They really think that if they vote for her she will take care of their problems and all their failures in life will be swept away cause Mom will take care of it. It's absolutely insane\n\nLove her or hate her, Meghan McCain has been bringing this point up a lot on her podcast. Between the \"Momala\" stuff and trying to paint Walz as \"America's Dad\" is really weird. I'm actually kind of worried about the mental health of a lot of politically active people...",
         "It will be...\n\n![gif](giphy|8fen5LSZcHQ5O|downsized)",
         "I also expect Trump will win.  History is typically not kind to a sitting administration during economic woes.  I think Trump would have easily won re-election in 2020 if not for the pandemic.\n\nI am hoping that there is little to no violence and we don't get riots, but considering how angry people are, I expect there will be some.\n\nI also hope Trump stays safe.  People are unhinged, and all the Nazi/Hitler rhetoric is definitely inflammatory to the mentally unstable.",
         "I fucking hope nj turns red. I can't believe how little kamala signs I see around compared to 2016 and 2020...actually see more trump out.",
         "According to the AP AZ and NV haven't shown any results yet. Watching it every 15 minutes on my phone, waiting for new results.",
         "Rubbing it in their face will feel good in the moment but taking the high road will feel better in the long run because it is the right thing to do.  I’m saying this to myself as much as I am to you.",
         "I hope you’re able to. I have friends voting for Kamala and we’re ok with each other.",
         "I know it's hard to let go.",
         "Every time conservatives take the high road they use it against us. They lie, cheat, and steal. They’re sick, rub it in their face all you want. We should never apologize for patriotism and common sense 🇺🇸🇺🇸🇺🇸",
         "I'm going to liberal enclaves and slapping trump stickers on all their cars \n\nWatch em eat their own",
         "I think a lot of the people that say that, would never think of it under normal circumstances. That rhetoric is created by the system that pushes the hate in the society.",
         "I think that people are getting divided by entities that thrive on that. The worst part is that division getting to sustain itself over the time. I think the problem lies in the system that produces the division, not on the other side of the aisle.",
         "Last 16 years",
         "If President Trump wins, that will also be due to the extreme hate for him from the other side. So, in a way, they will make that win possible.",
         "I don't know if unity can be achieved, but I think less division can certainly be done.",
         "I was pretty close!\n\nThe germans call that closenscpelllen",
         "I'll be interested to see how quickly they scramble to incarcerate Trump before he can be sworn in, then claim he's ineligible and try to default it to Kamala.",
         "Before we even get to worrying about if Congress will certify the election, we first have to make sure the electoral college will follow their state's votes (especially if the EC is close).",
         "I feel like a lot of us on the right are concerned about the ~~looting, burning, & rioting~~ **mostly peaceful protests** if Trump wins.",
         "There are literally no polls closed yet\n\n[Here’s when polls are closing in your state | PBS News](https://www.pbs.org/newshour/politics/heres-when-polls-are-closing-in-your-state)",
         "These are the people that enrage me the most.  They're the most insufferable.\n\nOh you admit you never cared about politics prior to 2016 and your whole political worldview started with Trump?\n\nOpinions can be immediately disregarded.",
         "Do they make a low sodium version?",
         "It's their childish mentality. Like when you are 5 and spill a glass of milk, you cry and you want Mommy to come and fix it. Except instead of a 5 year old spilling a glass of milk they are 22 year olds who are lonely depressed, broke, working dead end jobs, buried under student debt, and live miserable depressing lives and they want Mommy to come and fix it. \n\nThat's the mentality of your average Democratic voter. They don't want a president, they want a parent",
         "So, don't mail them a poster size L? ",
         "I'm not taking the high road with people who call us deplorables, nazis, and garbage.\n\nI'm gonna do the Floss, then the Griddy, then spike the football!",
         "Yeah, vandalizing is not a good response to your side winning... or losing...  \n'R' is still the party of law and order.",
         "They're still being indoctrinated and it's not cool.\n\nThinking everyone is a Nazi, needs to be punished, etc.\n\nIt's sick",
         "But hey, it will be good to scroll the front page and see subs that have no business posting political stuff (usually just low effort posts running down trump)\n\nReddit has become unsufferable, I’ve had to block so many lefty subs.",
         "Klößenschpellen\n\nSorry, had to.",
         "Best we can do is low testosterone."
      ]
   },
   "1gke4eg": {
      "title": "Post your final election day predictions",
      "text": "",
      "comments": [
         "I burst out laughing, thank you lol",
         "Congrats to the Democrats on finally flipping Iowa!",
         "Taking CA was a real surprise! LOL",
         "Jeb comes in from the rafters and sweeps all 50 then picks Trump as his VP is exchange for a lifetime supply of McDonald’s.\n\n![gif](giphy|3o85xvYjl3CwW7BbnW|downsized)",
         "Of course it's the commie stronghold in Iowa. /s",
         "They really haven’t flipped Iowa, we are pretty sure we are going to be red. The democrats have claimed it as their flip but idk I’ve beeen and Iowan my whole life and it’s going to Trump.",
         "![gif](giphy|VGKtXfGNwH6cLifbDY|downsized)",
         "If only the mole people of west virginia would stop eating the census people it would be worth at least 20, but its probably best they stay in the dark abandoned mines.",
         "Harris wins with all the electoral votes in a landslide with an unprecedented 101% of the country voting for her!\n\nOh and never mind those burning ballots they're empty I promise!",
         "You're right about them getting only one state, but it will be Minnesota not Iowa",
         "Lol I love it. This gave me a good laugh, thank you.",
         "LOL 😆 \n\nAnn Selzer would cry tears of joy if this were the case",
         "As a Californian, I wish lol",
         "This made me laugh good man nice one",
         "God damn it Iowa",
         "As an Iowan, piss off.",
         "Holy shit, even flipped Cali",
         "Wait, you think California, a state that made it illegal to ask for ID for an election. Is going to vote RED?  That's a bold claim.  Since they past that law they've been bluer than Waltz Balls.",
         "I snorted!  That's hilarious.",
         "Pretty sure if this was the result, Iowans would be so ashamed of themselves that they'd dissolve their own statehood.",
         "if illinois went red, i would go outside , ride my zuma naked down every single street in my town and live stream it",
         "Michigan is gonna be blue, that's all I know. Rally ashamed of my city and state.",
         "Looking like a total bloodbath back East, the Dems are being blown away everywhere.",
         "Uh why is Iowa blue are people really wanting that?",
         "I think he'll win the popular vote.",
         "Hahahaha, let’s hope😅",
         "Lmfao",
         "I wish 😂 but I'll take a win by 2 votes. A dub is a dub.",
         "I have trump at 983 and harris at 0.",
         "LOL",
         "Damn, this was funny.",
         "💀🤣",
         "I wish this would happen! But I’ll take trump at 270 and be extremely happy!",
         "lol!",
         "Lmfao 😂 \n\nRealistically though I think the ghost of Harry Reid holds NV blue. Trump flips AZ, GA, and PA and Trump holds NC",
         "If California turn red I think the Democratic Party will cease to exist very soon lol",
         "😂",
         "Trump 312 electoral votes and win in the popular vote.",
         "[We will have never seen him coming.](https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2Frso45f8c21x51.png)",
         "Landslide for Jeb!",
         "OK. that one made me smile!",
         "Nice touch keeping DC blue still",
         "As an Iowan, I did a pretty loud nose snort exhale.",
         "There's always that one state in a 49-state sweep...",
         "They won’t be satisfied unless they can flip Idaho too.",
         "In my dreams. I’m so sad for my state",
         "This is my favorite gif to come out of the 2016 cycle ([close second](https://media0.giphy.com/media/v1.Y2lkPTc5MGI3NjExNHAydHZ6N3I4ZmN1engxb2kxZ3J4bWQwaWZvajh3Znl5NnBmNjlzOSZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9Zw/6L015gMEW3pFC/giphy.webp).) Just the context of Trump verbally abusing Jeb so hard leading up to this debate, the \"Oh he's got more energy tonight, I like that\", Trump offering the five, the way Jeb pounds out that high-five and looks so goofy immediately after, Trump swinging his arm back like, \"dude that kinda hurt what's wrong with you.\"   \nHistorians will point to this moment. I don't know why, but they will.",
         "JEB!",
         "We-owa",
         "Imagine if Trump actually got 100% of the vote, and the whole election was all just a weird hivemind social game everyone was in on but you.  Wednesday morning, all the headlines read 'Speedmaster1776 finally woke up!'.  Looking back, you realize there were little clues everywhere, like common phrases, things people said when you were near, etc.",
         "Ann Selzer has been a disaster for Iowan internet discourse. There's no way we're Harris+3. Every indicator here shows Trump winning big time.",
         "As is tradition",
         "lol it’s meant to be a satirical joke post",
         "woosh",
         "If DC ever voted red i'd become heavily suspicious of the GOP on the spot.",
         "Still can't get DC though 😅",
         "Yeah it’s a shithole that ironically is becoming impossible to live in unless you have inheritance. Our red cities are based though so that’s nice lol.",
         "They'll point to it. Kids will learn about it in school, it will be remembered by pretty much everyone in 2070. Nobody will ever talk about the context and just accept that it happened",
         "Ourwa",
         "Id immediately start taking an antipsychotic 😂",
         "Exactly nearly every poll for the past year has Trump ahead by a comfortable amount. Polls don’t flip like that that quick. Total outlier, completely false. They Cleary don’t live in Iowa",
         "I know, so, I can't joke with you?",
         "Technically, it wouldn’t be hard. Congress has a lot of authority to clean up DC.\n\nDC is only a liberal cesspool because nobody in their right mind wants to live there. It’s true of most ghettos in the country — Republicans don’t live there, because Republicans like nice things.\n\nSo there are two steps to fixing DC:\n\n1. Republicans getting a majority in Congress.\n2. Republican legislators actually caring enough about DC to fix its problems.\n\n2 is actually the biggest hurdle. Even though Congress is a custodian for DC, the people we elect don’t give a damn about maintaining it, because it doesn’t influence their chances of being elected in other parts of the country.\n\nAnd also they don’t have to live there. If we forced Congress to live in DC, the problems would get fixed over night.\n\nIt’s one of the things missing from the Constitution. When the Constitution was written, it wasn’t as easy to travel long distances, so nobody envisioned this as a problem.",
         "It's always that one state plus DC.\n\nFirst thought upon seeing image: *what did THEY do???*",
         "In all seriousness though: why is DC stubbornly Blue?",
         "Well yeah, I was trying to be realistic. No one's going to vote to be unemployed.\n\nThen again, there are a few million Kamala voters floating around...",
         "Well, Congress was also supposed to be a part time job originally, too. A lot of politicians spend way TOO much time there, and are corrupted by it.\n\nFrankly, with modern tech... should we still have a capital city JUST for politics?",
         "Someone can correct me if I'm wrong, but a lot of people living there either work for the government or are paid with tax payer money through contracting. ",
         "It's an East Coast city, so it's a mix of highly educated people, diversity, and government workers.  It also probably skews on the younger side.\n\n85% blue is pretty much in-line with the city limits of Baltimore and Philadelphia.",
         "You’re thinking of Northern Virginia (NoVa) and Maryland suburbs.\n\nDC itself is mostly ghetto, one of the most dangerous cities in America. And it got that way because of neglect from Congress, which is in charge of DC but doesn’t have to live there.\n\nForce Congress to live in DC, and DC would become a livable city. That won’t magically flip it red, but it would no longer be 90% Democrat.",
         "DC is mostly ghetto actually. The educated and government workers in DC proper is a minority — most actually live outside DC in Virginia or Maryland suburbs. There’s only like a couple neighborhoods in DC that could be considered gentrified enough for middle class people to live there, and even those neighborhoods are kind of sketchy.\n\nSo it’s more than being an East Coast city. Democrats have a monopoly on pretty much all ghettos in America, because sane people don’t want to live there."
      ]
   },
   "1gka7pw": {
      "title": "Hispanic women for Trump!🇺🇸",
      "text": "\nVoted in honor of the hard work and dedication and the sacrifices my great great grandparents made when they came to America from Mexico.  For my grandfather and uncles who fought and served in WW2, Korea, and Vietnam.  \n\nThey loved America and the fact that they were able to come from nothing and build a brand new life for their family should be a testament to how great our country has been, can be, and will be again.  I’d be ashamed for them to see what America has turned into but I’m confident President Trump can get us back to where we were before. \n\nLove, \nOne Trashy Mexican 🇺🇸🗑️🇺🇸\n\nMAGA!!!!🇺🇸🇺🇸🇺🇸",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "My Abuela has voted for Trump 3 times now. Hispanics, who are here legally, are typically pretty conservative.",
         "Hispanic women love their families and are a lot smarter than the DNC gives them credit for. \n\n\nMy little bro is married to a Mexican woman and she's incredibly based. ",
         "A True Patriot. She is not afraid!",
         "Bienvenidos.",
         "You must of have an abusive husband or you aren't real Latin. /s",
         "Love it, girl!  🇺🇸❤️",
         "Beautiful",
         "Yo voy a votar por Donald Trump!",
         "Latinos for trump!!",
         "That’s awesome! We are all in this together! Just voted! MAGA! 🇺🇸",
         "We got this!",
         "Good job 👍",
         "🙏🙏🙏",
         "Good for you!",
         "Odelay!!!!",
         "My great grandma legally immigrated from Mexico to the US around WW2. I asked my mom who was close with her growing up, do you think your Grandma would've voted for Kamala? \"Hell no!\" Also my dad's wife is Hispanic and obviously her family is and they are voting for Trump",
         "Good for you and thank you for taking the time to vote.",
         "Awesome! I'm a pale white woman for trump lol. But I stand in solidarity with you, as do most of my fellow mom friends!",
         "Wow!  What a great comment.  Thank you.",
         "Fantastic! Let’s keep it up gang! 🇺🇸",
         "👀",
         "LFG",
         "For a better future!",
         "¡Como mi esposa!",
         "Did your husband force you to say that? /s",
         "It's really sad when immigrants from Mexico loves this country and are way more patriotic than people born here who hate this country and won't leave.",
         "Be sure to take that sticker off at midnight.  :-)",
         "People who migrate legally know how hard and tough it is to do so and don't like those who cheat ahead of them by doing so illegally.",
         "We are conservative by nature and that’s what the dems don’t understand.  When you start throwing a bunch of wild left wing ideology out, you’re gonna lose a lot of old school *legal* immigrants and their kids. When the country starts turning into what you originally escaped, there’s obviously a problem.",
         "They are! Reason is they come from countries where communism is very close all the time.",
         "[removed]",
         "Spanish people at least in my travels have always been conservative. Conservative women in general are smarter imo tho 😂",
         "Verdadera patriota",
         "He keeps me locked in the closet and lets me out occasionally to make him tacos and enchiladas. 😅🌮",
         "Exactly. According to others we are voting against our best interests. I guess I no longer control my interest and have the state decide what my best interests are.",
         "My grandparents are probably rolling in their graves right now with the current government. This is not what they fought for.  😬",
         "Hey we stand together no matter what color despite being a bunch of Nazis! 😆\n\nWe all want the best future for our children and families and that’s why we’re all here today. ❤️🇺🇸🫶",
         "Love your username 😅❤️",
         "😂😂 much respect for you to post here to the unbearable left sided reddit! You have guts!! Lol. I'm a Latino and so is my wife, we both voted Trump. How could we not. This is the worst administration in US history and we're tired of living broke!!!",
         "such an evil man....must be Trump's fault",
         "Horrible. You should divorce him and vote Kamala and go be a single empowered cat lady",
         "The tortillas better be homemade",
         "I could so go for a taco right now.",
         "Lol I was born and raised in the country.  I ain’t scared of some liberal soyboy keyboard warriors.  😂😂",
         "![gif](giphy|3o6ZsVbs2GzgKNvVpS|downsized)\n\nLiterally a Nazi."
      ]
   },
   "1gkg8yu": {
      "title": "Voted for Biden in 2020, terrible mistake. Voted to save America and doing my part to turn Michigan red.",
      "text": "",
      "comments": [
         "Welcome to the team!",
         "I'm in SC but was in Detroit this past weekend for a funeral. I couldn't *believe* how many Trump supporters there were... on sidewalks, on corners, driving around with flags out every car window.\n\nI dunno man, I got a feeling Michigan will go red. Been to Detroit many times and never got that sort of feeling.",
         "As michiganders, my wife and I voted today, and despite  the Kamala ad, my wife wasn't scared of me when she voted me she voted for TRUMP!",
         "Sameeee",
         "OPE?",
         "It takes a big person to admit a mistake!",
         "That's the best sticker I've seen! Ours are so boring",
         "Good for you to have come to your senses. Welcome to the fight!!",
         "Damn my site just had the generic \"I Voted\" stickers left. I wanted to see some of the cool ones that have been in circulation.",
         "Got me at first",
         "No! Knock it off, thats OUR word!  - Minnesotans.",
         "Michigan is going red. The muslim vote is going to screw Harris bad."
      ]
   },
   "1gkmz7c": {
      "title": "Miami-Dade is RED!!!!",
      "text": "I knew Trump would take Florida, but being a Florida native, I never thought I'd see Miami-Dade county vote conservative! And with a 10% lead!",
      "comments": [
         "That is a big deal",
         "Much love to Florida from a Canadian.  My favourite place to vacation.",
         "They already voted DeSantis back in 2022 so this is an expected win for Trump!\n\nAlso explains why Miami is my favorite major city in the US, alongside the Latin American influence, coming from a Latino myself.",
         "There is around a 3% swing to him in heavy blue areas in Texas like Houston, Dallas, Austin and San Antonio. He gets the 3% swing in blue stronghold like that it's all over red rover. A landslide coming",
         "I suspect there will be other counties in America he flips. These kind of wins are key",
         "Shout out to our Cuban-American friends!",
         "He’s going to win all of Florida by about 1.5 million votes. Amazing",
         "Keep em coming"
      ]
   },
   "1gkj6q1": {
      "title": "Jill Biden voting ALL RED",
      "text": "https://x.com/itslinklauren/status/1853922553095688557?t=iWFuNvfFs_2X-LuLCO2utQ&s=19",
      "comments": [
         "The Biden's must *really fucking hate* Kamala. There's no way Jill Biden woke up and just decided to wear a full MAGA red pantsuit for no reason. She's a politicians wife and has been for decades, she knows about symbolism.",
         "All I can say is LMFAO",
         "She definitely knows the optics of it ",
         "That’s honestly the best outfit she’s worn in the last four years.",
         "Low key she has been throwing jabs at the Democrats for the last couple of weeks. You know like that Panda outfit last week...",
         "I wore my red shirt today on purpose so that isn’t something that goes unnoticed.",
         "I don't buy for a second that she didn't understand the optics of this. Between this, and the not-so-secret secret that she HATES Harris, I'm sure she's rooting for her to lose.",
         "That's the happiest Jill's looked in 4 years xD",
         "Wow",
         "Jill Biden was reportedly the one pushing the hardest for Joe to stay in the race. She loves the power, the dinner parties, the traveling, all on tax payers dime.\n\nShe fucking despises Kamala. She knows exactly what she’s doing with that outfit.",
         "Anyone can be redeemed from the dark side, even Darth Vader…",
         "At first I thought it was a body double but it's Link Lauren",
         "Hell, Jill was probably the one making decisions the past few years anyway and could have argued her experience. Haha. Should have run herself. At least she wasn’t totally rejected by voters before because she never ran.   Man, you know kicking President Biden out sure got her panties in a wad.",
         "Honestly I think she’s just too clueless to know the potential optics behind it. \n\nI think she hates the dem establishment and Kamala now, but that doesn’t mean she would vote Trump, more likely she would write in someone else. ",
         "Hell hath no fury",
         "LMFAO",
         "She is the wife of a career politician. She knows EXACTLY what wearing all red shows.\n\nThat said, I don't think they could bring themselves to vote for Trump. I bet all the Bidens wrote Joe's name in, except Jill who clearly wrote her own. \n\nAlso... Funny that this is the best outfit she has ever worn in public. Most things aren't ironic, but this is.",
         "Oh Jill absolutely detests Kamala. Has ever since Cackles took swipes at Joe during the 2020 primaries. She called him a racist under the “that little girl was me” lie on bussing, only to follow up with “I believe his accusers” on sexual assault and “he should make that decision” on dropping out. Only to end up accepting his VP offer and giggle incoherently to Stephen Colbert in summer 2020 that “it was a debate”!\n\nIt is delicious to watch Team Biden slice at Kamala’s ankles after she stabbed Joe in the back and shoved him into the basement this last summer.",
         "I 100% agree, I think the Bidens want NOTHING to do with Kamala. But to be fair, Melania wore blue this morning!",
         "I was gonna say...I think she looks great!",
         "Same here.",
         "Reportedly? Absolutely. Her dream denied.",
         "It's been widely reported. \nRemember how Joe handed the cabinet meeting over to her?\nThat's why she's so angry. Not just the trappings of the office.",
         "They are 100% writing in Joe",
         "Don't be silly. She is furious",
         "Red hoodie, there were no accidents on that.",
         "I would not be surprised to learn that Jill Biden has never voted for anyone, rather writes her own name in for every office.",
         "I agree she is furious and hates the establishment but I honestly would bet everything she is not voting Trump. And I don’t think she’s with it enough to think about the red outfit signifies Trump. "
      ]
   },
   "1gknm4n": {
      "title": "Virginia is LEANING REPUBLICAN! ",
      "text": "47% reported\n\n1,109,097 (49.7%) Trump \n\n1,093,364 (48.6%) Kamala \n\n38,166 (1.7%) Other \n\nUPDATE:\n\n51% reported \n\n1,216,643 (49.6% Trump)\n\n1,194,590 (48.7%) Kamala \n\n42,972 (1.7%) Other \n\nUPDATE 2:\n\n57% reported\n\n1,360,526 (49.9%) Trump \n\n1,319,922 (48.4%) Kamala ",
      "comments": [
         "I'd love to see it, but I fear Northern VA gonna sink it since so many DC live there.",
         "Honestly, 47% in means nothing...  sorry to be blunt.",
         "We here in VA have lived this scenario enough times to know that the R leads every time and then D rockets past after midnight when NoVA is fully reported. It’s a hard state to flip back.",
         "Means nothing, still long night to go and anything can happened so lets just hope he keeps up.",
         "Why has ap already called this for harris while shes still behind?",
         "The swing is wild there",
         "Really depends on the counties. If Dem countries are leaning red, hooray. If it's just R countries reporting first, uh oh",
         "I’ve never paid much attention to VA before. Is it always this close this early?",
         "It's the northern virginia counties that haven't been called yet.  That's the actual swamp that needs to be drained, they will go to Kamala.",
         "Sure, but generally it means nothing.  If for some reason all urban votes are in and it's just rural remaining then fine.",
         "Yeah it was this way in 2020 as well",
         "Does it hurt you if we express an optimistic thought? There's been a giant wall of *'STOP ACTING GLEEFUL'* on this sub, as if people look at a towering pile of only one ingredient (\"don't care go vote\") and conclude we have a shortage of that exact thing.",
         "Yes, it's fake like the Kamala campaign.  Proactive celebrations followed by VA going 53/47 to Kamala makes conservatives look like fools.",
         "Some people like to get excited by anything that looks good on the surface, some prefer to only be optimistic when the real numbers actually mean something solid. \n\nYou’re telling them what it feels like from your point of view and they are telling you what it feels like from their point of view. You can’t criticize them too much because you’re both doing the same thing."
      ]
   },
   "1gkgqkw": {
      "title": "18 Years Old and Proudly Voted for Donald J. Trump – A Momentous Choice for Our Future",
      "text": "This is my first time voting, and I’ve chosen to cast my vote for Donald J. Trump. As an 18-year-old, I believe this is one of the most significant decisions I’ve made, a choice that carries the weight of my hopes and dreams for America. God bless this country, and may the Father, Son and Holy Sprit guide us towards peace, joy, and prosperity. We need providence and benediction from above to help us restore a sense of normalcy, simplicity, and unity in our nation. America needs a return to common sense and grounded values, to a place where we can all feel secure, free, and heard. Let’s make this election too big to rig – a true movement of the people to Make America Sensible Again. This isn’t just about a vote; it’s about bringing back what makes our country strong, united, and great. Here’s to hoping for a brighter future, rooted in faith, common sense, and the values we hold dear.",
      "comments": [
         "Hey a fellow Oregonian! I’m 22 and sent mine in last week 🇺🇸",
         "Hell yeah, Youngblood!",
         "Made my first vote for Trump today at college, as a 19 year old. Had a smile on my face the whole time!",
         "Good for you.  Good for us.  I was still impressionable at that age.  Didn't vote for anyone in the two major parties but I have realized the errors of my youth, throwing away my vote.  You are smarter than myself at your age.  And, good on you for that.",
         "I'm proud of you for your vote, and hope you voted a straight Republican ticket for your State and City. I sure did, because we don't need anymore Soros backed prosecutors that let crime waves flourish.",
         "28 year old woman and lifelong Portland native and our family cast votes for DJT/JD also!❤️🤍💙"
      ]
   },
   "1gke38u": {
      "title": "Trump on Election: 'We Want the Answer Tonight'",
      "text": "",
      "comments": [
         "I want that too, but I don’t expect anything finalized until tomorrow morning.",
         "We don't always get what we want",
         "I would caution Trump- if the results are against him he's going to VERY quickly insist we wait for mail ins.",
         "You mean the way it was forever until 2020 for some reason? Makes sense to me. ",
         "Florida, in 2 time zones, will have the election finished tonight. There is zero reason for states to not have it finished tonight.",
         "If he wins WI or MI, he's going to win and we'll know tonight. \n\nIf the election hangs on PA, who fucking knows when. \n\nHe's going to get AZ, NC, GA.",
         "There's no reason to think we won't know tonight. When Fox called Arizona in 2020, we knew then. The official results are never finalized on election night but people like Dave Wasserman that cover elections for a living know the kind of numbers both sides need in certain counties and can call it based on that.",
         "And I want a republican candidate who understands how elections work, but as the poet said, “you can’t always get what you want.”",
         "We should, this never was a problem before 2016 really. Ever since Trump won the first time, certain states all of sudden forgot how to count. If any other country can get their election results the day of,  no excuse why we can't do the same.",
         "I do fear the longer we don't know the bigger the chances the democrats cheat",
         "There is zero reason why every state can't have their final results tonight.  I don't care what their excuse is or what their supposed rationale is.  If you need \"more time\", you are cheating, and I will stand on that hill and defend it.",
         "Helpful reminder that, back when PA was considered \"reliably blue,\" they had their results posted on election night.\n\nIt's only since it has become a swing state that they suddenly forgot how to count.",
         "Sounds like Georgia and NC are going to count fast MI PA and WI could be done tomorrow and our desert swing states are snails",
         "That's because the (d)ems have to check the grave yards for their votes.",
         "And we are going to get it. LFG!",
         "Vote counting will be halted in a few key democrat inner city strongholds due to a water leak, gas leak, fire alarm, bomb threat, medical emergency, technical difficulty with machines. Counting will resume when the number of needed votes is determined and finished once enough fabricated ballots have been introduced. If needed boxes of ballots will be mysteriously found days later.",
         "Seems like a reasonable ask....given almost all (say but one) elections have done so.....what's changed?  lol",
         "It's going to be neck and neck with PA casting the tie-breaker vote I think.",
         "Your old enough for your wants not to hurt. \n\n\nGranny",
         "I'm sure when I go to bed it won't be decided but will be when I wake up",
         "We already kinda know how it’s gonna go, I said it like 2 years ago ^and ^I ^hope ^I’m ^not ^right  ",
         "If the margins are within half a percent, some of the swing states do automatic recounts, and others let the candidates request them. So, that's another reason the closeness of the vote will determine how long it takes to declare a winner.",
         "Or in 13 days if it depends on Maricopa…",
         "If the votes are as close as the polls, it won't be called tonight.\n\nOnly way that it gets called tonight is if Trump just demolished Harris in every swing state.",
         "I don't think the vote will be close. News & Polls only made it seem that way to keep viewers viewing and to not 'influence the vote'.",
         "It won’t be finalized till an unmarked box truck brings in the rest of the votes at 3am.",
         "Dad?",
         "Do you really not know why it took so long? There were almost 40m more mail in votes and most states aren’t allowed to start counting until Election Day",
         "Election day is more like election week in some states.",
         "Like in 2000, when it took weeks? Ah, the good old days.",
         "Every state should start counting mail in ballots as they come in. Another example of FL doing it right.",
         "Well, we all know the reason why.",
         "No but you understand now that we have high tech ballot readers and early voting it takes longer than collecting every ballot and hand counting them in a single day. For some reason. But not cheating. Reasons I say!",
         "Same where I live. Probably could go ahead and call it right now but by 7:30 at the latest.",
         "Yep. There's a few early scenarios for how long a night it's going to be.\n\nIf both GA and NC go blue, it's over, Trump needs all three of PA/MI/WI to win, which is unlikely. So the moment any of those flip blue as well, it's over. Early night. This is almost impossible unless the polls have been **MASSIVELY** off, but it's the only early night for Harris scenario.\n\nIf one of GA/NC go blue, it's not looking good for Trump. He has to win 2/3 of PA/MI/WI to take it. Most likely scenario, unless both WI/MI flip blue early, is we're waiting on recounts and legal challenges in PA.\n\nIf both GA/NC go red, we're just waiting on any of PA/MI/WI to go red. If they do, it's an early night. If both WI/MI go blue, we're back to the PA scenario above.\n\nIn any scenario, if PA calls early due to overwhelming numbers out of every county except Philly, it's an early night.\n\nI think those are the only realistic scenarios. If we have something crazy like Trump taking VA or Harris taking FL, it throws everything out the window.",
         "I live in Pittsburgh Allegheny county says they can call it tonight. Its on Philly the rural counties normally call it quick",
         "Yep, but, if it's close, then it takes days to figure out the winner, because you have to count every single ballot before declaring a winner. And it may be close enough to require a recount. It comes up more often in lower ticket races, like the Minnesota Senate race with Al Franken and Norm Coleman. There is no guarantee that a winner is determined on election night, and it is unrealistic to demand that.",
         "That’s a feature not a bug. Democrats started saying a couple years ago that we should stop expecting to have results on the night of an election. I wonder what all of a sudden changed?",
         "Agreed",
         "Indeed.",
         "In Canada, we aren't allowed to use machines. Everything is done by paid government employees (there's a government elections board that hires/fires staff to run the election each time it happens), and each vote is counted by two scrutineers manually across the entire country, 5000 km wide with about as many people as California.\n\nThe election results are calculated each hour as the votes are being counted as the world rotates to the largest time centres in Ontario, then the results are broadcasted an hour after the last polling station closes on the east end of the country. \n\nNot only can it be done, but it can be done without voting machines, and it can be done quickly. There is no excuse. (Oh, and each voter has to provide ID to ensure they match up with the voter roll on their voting station)",
         "I'll attack your hill! What about cases where voting get's delayed due to some malfunctioning equipment or where turn out was so much higher than usual that they will have to wait until all the people in line got to vote?",
         "Yep. Wait for the other side to post their official numbers -- noted here as variable X -- , then magically \"receive\" a few boxes that total X + 1000 ballots in the wee hours of the night.",
         "LFG. Let's Freaking Go?",
         "Yinzer here. My county (Allegheny) is saying they can be done tonight. Its on those weirdos in philly now, the rural counties normally call quick",
         "If the polls are as accurate as they have been the past few elections (drastically underestimating Trump) we'll have a winner before midnight.",
         "Yes, what do you want now",
         "But only starting in 2020. We've never had to wait for results like this, except for Florida in 2000..",
         "Gotta close the gap.",
         "And you had to ask for a mail in this year, explains why 1/2 million less urban votes 🙄",
         "I don't think any state is ever \"finished\" counting on election night, most don't even have to certify their votes until mid-December, but eventually math becomes impossible to overcome. People that call elections for a living, like Dave Wasserman, know the math at a county level and can confidently call the election when it hits a certain point. \n\nTo not know tonight/tomorrow morning, not only would it need to be incredibly close(closer than 2020), there would need to be some point of contention that can be challenged and possibly changed, like what happened with ballots in Florida in 2000(even though most people knew the challenge ultimately wouldn't change the results). The likelihood of that happening is incredibly small and there's no evidence to think it will happen this year.\n\nI'm fairly confident we will know the next president by 2am eastern time, if not before.",
         "I don't know, I agree that we should be a lot more efficient than we are but Canada's population has to come into play here in comparison to the US when making this point right?",
         "I don't care.  This isn't a surprise, special election. It's been scheduled for four years.  States need to get their shit together, manage issues that arise expeditiously, and count their votes by midnight.  Period.",
         "I would believe that if it wasn't so widespread. The only reason states delay results is to pad the numbers for kamala",
         "Looking For Group?",
         "Liberals fucking gone!",
         "Philly can't do anything right",
         "It only started being called weeks later when Trump became a clear and present danger to the deep state globalists.",
         "Because of a massive increase in overall votes, as well as mail-in ballots.",
         "Absolutely a factor.\n\nThe main reason it's so efficient is because a non partisan (and I actually mean non-partisan) elections board is hired by the government to execute the elections to a certain standard across the country.\n\nI don't think the US constitution allows the federal government to do that in the US, so you just have to trust that each state is doing it the best possible way.",
         "Yes, but you can't disenfranchise legitimate voters because the corrupt, partisan officials at a voting location engage in tomfoolery. \n\nThat will only spur on *more* corruption (e.g. intentionally sabotaging red/blue voting districts).",
         "I think to say that this is the ONLY reason that it's happening is just as unreasonable as to assume that they NEVER would do that.",
         "Lefties Fail Generally",
         "I don't have a r/ one but have other resources.",
         "Thanks!",
         "they can, it's different.\n\nstep 1. dont let republican poll watchers near enough to watch mail in ballots\nstep 2. put up giant plywood covers on all the counting windows\nstep 3. count for 4 days\nstep 4. wow magically we won!"
      ]
   },
   "1gkfn4s": {
      "title": "Biden will skip Harris election watch party  ",
      "text": "",
      "comments": [
         "not surprising. it's going to be passed his bed time.",
         "Those awkward moments when the campaign room starts emptying out.",
         "I like what Shapiro said: forget whether or not he hates her (which he does). If she loses, it's better for his legacy. People will say that he was the better candidate, and that his own party betrayed him. If she wins, what they did to him will come across as justified, and he'll be seen as little more than a placeholder.",
         "He's probably going to be at Trump's!",
         "This is a sign that they are running scared... or they just hate each other.",
         "Skip or not invited?",
         "I remember reading an article about a Presidential candidate (was it Romney? can't recall).  On election night he rode to the venue with a 12 car motorcade and SS.  After he lost he got a drive home from his son in a Honda or something.  I hope Kamala has to catch the bus home tonight.",
         "He’ll be at Mar-a-Lago",
         "She's planning on being the 47th president whether it's for 4 years or 2 months",
         "More like he was told to GTFO. It's never been well hidden that Joey and Kamala hate each other.",
         "Well… he mad at her\n\nHe REAL mad at her\n\n“The nominee was supposed to be me!”",
         "If he didn’t like her why did he even pick her as vp in the first place. Oh wait, cause he was just a puppet just like she is\n\nEdit to add missing word",
         "Past his bed time.",
         "Bro is salty for sure. Part of him wants Trump to win as much as we do because he probably hates Harris just as much",
         "Well he does have to have his glass of warm milk at 5:30pm and be in bed by 6.",
         "Ah shame. He should have shown up there with his MAGA hat.",
         "He can’t be caught rooting for Trump haha",
         "Too late for him and he knows",
         "Yeah he’s been absent at the wheel his whole election informally and literally on vacation since he was ousted so I sometimes forget he’s still the president",
         "Bet he doesn't skip her concession speech...",
         "[removed]",
         "He’s probably in Delaware, yes?",
         "It will be after 4pm. Of course he is skipping it.",
         "frosty.  He will just have a puddin' and be put to bed by his nurse.",
         "Came here for this comment lol.",
         "It will be past my bedtime and I am on the west coast.",
         "Plus, he's a vengeful bastard.",
         "Oh, I want that to happen. The meltdown on Reddit over would be insane.\n\n  \nEdit: Would also be a perfect opportunity to pull up all these \"Dark Brandon\" memes again",
         "Eating ice cream in the back",
         "Biden is mad about being couped out of the presidency, no doubt about that lol.",
         "He hates her",
         "I remember as early as Thanksgiving 2021 when Biden started swiping at Kamala in interviews. If he didn’t like her then, he absolutely despises her now after she stabbed him in the back and was coronated as the Dem’s nominee over him.",
         "Well, imagine being stabbed in the back and told you're mind is gone. I'd be pissed too.",
         "He hates her",
         "Or both!",
         "It’s both - and so much freaking fun to watch!! \n\nWell deserved",
         "This is the real question.",
         "Subway. And meets up with some Venezuelan \"voters.\"",
         "That would be absolutely wild if Kamala loses and then Biden steps down.  I wouldn't put it past them.",
         "He is absolutely “big mad” at her.",
         "Same here, I have work in the morning.",
         "flavor: left wing tears",
         "No kidding. She didn't even face a primary battle",
         "He should’ve stayed in the election out of pure spite. Agree with and back up everything DT says or does. Be like:  Yeah, this dude knows what he’s talking about” just to throw the whole goddamn thing lol.",
         "Does anyone actually like her?",
         "I remember the 2020 primaries too. They went at it with each other.\n\nTheir relationship without a doubt is carefully curated. Unlike say Biden and Obama who I generally think had respect and were friends throughout their administration",
         "Until you forget about it. ",
         "I think they took advantage of his dementia and basically tricked him. That weird letter that was released was prob done without his knowledge. Later they hold it up and said see, you quit when he got testy.",
         "Liberals do now, after they've been told to.",
         "LOL",
         "Someone in r/politics said she’s a “master class public speaker”. That shit is scary if they’re that deluded. They probably have not watched anything but short, edited snippets; But it’s crazy nonetheless.",
         "I get liberals and conservatives watch different media and have different values, but that feels certifiable",
         "“Master Class Public Speaker”??  Wow-they’re nuts!",
         "Well, the do have people literally part of her campaign posting on reddit. \n\nThey've got to pay rent."
      ]
   },
   "1gkfvjs": {
      "title": "This “we might not know tonight” stuff is a vote suppression tactic, IGNORE IT",
      "text": "Democrats are so desperate right now that they’re trying to scare Republicans into thinking we can’t win. It’s actually the opposite. There can’t be shenanigans if all of us vote. Ignore polls. Ignore the media. Just get in line, stay in line, vote, and report any silliness you see.",
      "comments": [
         "I think it’s going to be pretty obvious as the night goes on. I don’t see 2020 happening.",
         "Vote. Even if it only mean you increase the popular vote for Trump. Its very important.",
         "We definitely won't know tonight unless one party is absolutely running away with it in enough swing states to call the election. I just don't see that happening unless the polls are grossly underestimating one of the nominees.",
         "\"We might not know tonight\" is Dem wishcasting that their *November Surprise* can save them again. \n\nThe fact that ***we might indeed know tonight*** is what's putting them in a sour mood today.",
         "It’s not, it’s just a fact.",
         "I am not expecting a 2000 result.\n\nIt seems to me that since that happened, the media always brings this up each election.",
         "We very well may know tonight if either candidate is overperforming polls.",
         "Dems want to get to the 3am electorate.",
         "Delays = fraud\n\nThey will attempt to stall, water main breaks, etc.",
         "Not knowing who wins on the night of an election is a sign that something’s wrong with that election.",
         "They are freaking out on r/politics and really understanding that people are for Trump.",
         "![gif](giphy|YYfEjWVqZ6NDG)\n\nFirst time voting! 🇺🇸🇺🇸Trump Vance 2024 🇺🇸🇺🇸",
         "2016 I was led to believe Hillary would win. I think this can happen again.  But yes. Vote vote vote. All ya can do",
         "This. That had unlimited mail in votes in every state, people were terrified to vote in person too. This is completely different, as long as everyone votes Trump wins. We have more registered voters this year, so it’s that simple.",
         "If Kamala wins we won’t see 2025 happen.",
         "> polls are grossly underestimating one of the nominees\n\nthat never happened before  /s\n\nalso the press has a financial interest in a close race - it's always a close race - even Reagan was 'a close race'  \n\nTime Magazine \n>John F. Stacks\n>December 1, 1980\n\n>Reagan’s landslide challenges the pulse-taker profession\n\n>For weeks before the presidential election, the gurus of public opinion polling were nearly unanimous in their findings. In survey after survey, they agreed that the coming choice between President Jimmy Carter and Challenger Ronald Reagan was “too close to call.” A few points at most, they said, separated the two major contenders.",
         "2020 people were terrified to vote in person+every state mailed ballots to everyone. That’s not the case this time, for those reasons alone this is completely different. If everyone votes today it *should* be an easy win.",
         "We knew Biden won on election night 2020. When Fox called Arizona for Biden it was over. Win or lose, we'll know tonight as well.",
         "Right, and the rules for each state on when they could open the mail-ins were so wonky. It seems that most states, especially in battlegrounds, have tried to come up with a better system. AZ and NV are still a little iffy, but I just heard from someone on Fox that Michigan plans to have results by midnight tonight. \n\nAs much as I dislike Josh Shapiro, he has said PA won’t take that long and should see results tonight, possibly early tomorrow.",
         "There were only a few states that auto mailed this year. Not sure if you saw the graphic, but swing state urban turnout is way, way, **way** down this year. Fucking duh, the uninformed arent going out of their way to request ballots, and will no show. I’ll be super bummed if trump loses, but ill also be stunned.",
         "What? As in project 2025 or the year?\n\nScrew project 2025",
         "Dude, I'll be stoked if Trump is outperforming the polls by 2-3%. That means that he absolutely skunks Harris in every \"close\" race. I'm just calling it like I see it.\n\nIt would be epic to watch the media go from happy and charismatic to utter dismay as the night proceeds like 2016, but I really doubt it.",
         "Ohio sends ballots to everyone.  That is the most ridiculous thing I have ever heard.  The only mail in votes should be for the infirm, military and those who are not or have not been in their precinct for early voting.",
         "Haha, the year. No one cares about project 2025, Trump included. \n\nIf Kamala wins we’ll starve to death before we get another birthday.",
         "Ohio does not send ballots to everyone. They send a form for us to get a mail in ballot if we want one. Ohio has their shit together with voting, won’t see magical votes appear here."
      ]
   },
   "1gko18o": {
      "title": "Texas declared",
      "text": "Great news and looks like a 3% increase making it a safe hold. Teddy up by about 400k in the senate race too. Well done Texas. ",
      "comments": [
         "R/Texas in shambles. FUCK EM. Red state subs are fucking pathetic",
         "VERY NICE 😎🇺🇲",
         "Cruz wins!!!",
         "Can’t be./s  R/Texas told me the state was going blue. ",
         "The 5 subreddits i muted today from Texas must not be happy about that",
         "Thank God, nice to see all the Californians need to wait another two years to try fucking it up again.",
         "I had to read that a couple times before I got it, thought you were trolling. Yes, I believe you are correct, all the red state sub reddits are probably losing their minds. Hopefully more red flips tonight, PA is not looking that great right now, but still a tight race any way you look at it.",
         "Just peeked in to see the shitshow, and it is rather glorious.  One post about Texas turning blue posted at 1 PM is now locked.  \n\n🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣",
         "He and Rick Scott were seemingly in tight races with the news trending that they were losing support.",
         "They lied",
         "Reddit's subreddit recommendation algorithm is awful. I open one post related to Texas and suddenly start getting subreddit posts from 10 different Texan cities in my feed. I had to mute all of them.",
         "Local subreddits are awash in bots"
      ]
   },
   "1gkfdn9": {
      "title": "I’m 19 and just voted for Trump for the first time",
      "text": "Hey guys, I am a first time voter and I’m proud to say that I voted for Trump, PLEASE PLEASE do your part, it doesn’t matter if it’s rain or shine just please go out there and show what you believe in! As a republican in a quite liberal college it’s quite difficult for me but nothing will ever stop me from holding on to my own values and beliefs, never trade a truth for a lie so VOTE ",
      "comments": [
         "Thank you!!",
         "Always be true to your beliefs",
         "I  just graduated from a very liberal college (Amherst college). Don’t let them brainwash you. Stay true to yourself! Proud of you!",
         "I'm 27 and I voted Trump, it's not about age but about choosing what's right for the future of this country. Trump is going to get us back on track, Kamala isn't.\n\nThank you for fulfilling your civic duty!",
         "Wishing I could vote for Trump too! You got support for Nova Scotia, Canada! 🇺🇸🇨🇦",
         "Great. My faith in the future of our country has been restored.",
         "Awesome, my son is 16 and is looking forward to his first vote in a couple years. You have chosen wisely!",
         "Wonderful! I'm sure you took the time to do your research and decided  based on your beliefs. Unlike so many others on here! Congrats to you. Now....... LETS DO THIS!",
         "Love all this first time young voter energy for Trump!",
         "We thank you and are very proud of you."
      ]
   },
   "1gke9lh": {
      "title": "I did my part in PA",
      "text": "Straight R down the line! ",
      "comments": [
         "My grandparents who haven’t voted their entire lives in their mid 70s asked me about voting today because they couldn’t sit by and let Kamala get the win without doing their part. \n\nLet’s turn PA red!",
         "Good job!  Get all your like minded friends and family to vote too.",
         "Good luck with the brigade that's going to hit this post...\n\nMy post from this morning about voting in PA for Trump went from >500 upvotes to negative upvotes in the matter of an hour.",
         "Good. Now go grab grandma and drag her ass to the polls. Call up that stoner buddy of yours who thought voting was on Friday, and drag his ass to the polls. Reconcile with your HS girlfriend, and drag her now fat ass to the polls. Let's go pal.",
         "I did too!\n\nAnd when there was a position with only a Democrat? I wrote in Donald Trump.\n\nTrump might be some meaningless local politician too!",
         "Did my part I. Wisconsin",
         "Thank you",
         "Hell yeah! Just did the same! PA could very well be very red this time around",
         "I hit R on the two big ones in PA, but sprinkled in some libertarian votes locally.",
         "Bradford county here, deep red, but did my part!",
         "Right there with ya!",
         "Thank you! People sometimes forget that it is essential that we have a Republican congress too.",
         "Yes, we need all the votes we can get! We have to stay positive we did our job! 🇺🇸",
         "God bless! Winning your state is absolutely crucial",
         "Ugh early voting does not look good for Trump in PA",
         "I drove my mom and my sister to the polls as well. All 6 of my immediate family members are voting to MAGA",
         "Who gives a fuck? Oh no, muh internet popularity points!",
         "I could give a sh't about fake internet points.\n\n\nWhen trump wins, I fully expect to have my account banned by the end of the week. ",
         "Nice job fellow Pennsylvanian!\n\nOut of curiosity, I checked my post. Mine is at 0. I don't care about internet points, but it is interesting that on this sub it would be 0.",
         "I've been a lifelong PA Democrat and have been open about voting for Trump.\n\nKarma doesn't mean shit to me. This site is run by a bunch of degenerates.",
         "\"Go ahead, THROW YOUR VOTE AWAAAY!\" -Kang & Kodos",
         "We don't have early voting. It's all mail-in, and Republicans correctly hate mail-in voting.",
         "The upvotes are irrelevant. What is relevant is that the DNC uses this website as an astroturfing exercise and propaganda wing that silences and discourages conservatives from contributing.\n\nThis should be fought back against.",
         "It has nothing to do with the points. It's that they can try and hide information from you."
      ]
   },
   "1gkgic0": {
      "title": "Nervous is good! ",
      "text": "",
      "comments": [
         "I think EVERYBODY who voted / will vote is nervous.",
         "If you got to some of the other subs (sewers) you hear people talking about how terrified trump is of Kamala. How she has his number and how smooth and smart she is. My god, I can’t tell if these are bots righting this shit or real people. If it’s real people I am terrified there are people so delusional and insane walking amongst us.",
         "I CHOOSE TO BELIEVE THIS",
         "Just wait for the after work vote from males.",
         "Hopefully! The only thing Charlie got wrong there is “smart Democrats.” \n\nKidding (but not totally kidding lol).",
         "FORWARD BOYS, WEVE WAITED FOUR YEARS FOR THIS DAY, FINISH THE FIGHT!",
         "The incoming meltdown if things work out is almost enough to make up for these awful 4 years.\n\nAlmost.\n\nI’ll still savor it though.",
         "Harris has an uphill battle to climb and nobody inside this echochamber of reddit will admit it. She likely has to win ALL of PA, MI and WI. I think she carries Wisconsin but thats it. Michigan should go Trump by 2-3%",
         "Charlie Kirk was hyping Trump all night in 2020 only for Biden to win. Frankly I’m taking his word with a bigger grain of salt",
         "I’m like nauseous with anxiety",
         "Reddit is an insanely small population representation. And it’s entirely liberal leaning. If you base your metrics on what you see on Reddit to anything, you’re going to get a fucked answer. \n\nReddit has about 74-260 million active users. This includes literally all accounts including bots, people from outside of the US, and everyone’s throwaways. Only 50% of that is US made accounts. I’m inclined to say there’s MAYBE 50million active Americans using Reddit on the regular, which honestly is probably on the higher end. A significant number of those are liberal, and a good portion of those users won’t even vote for any of the top reasons people don’t vote. \n\nAll that to say, who gives an actual fuck what you see on Reddit lol.",
         "They have to be bots. I refuse to believe I walk amongst actual people like that.",
         "My \"recommended posts\" from subs I don't follow have been nothing but meltdowns about Trump and the like for a couple weeks now. I genuinely can't fathom that it isn't majority bots because there's now way that level of stupidity is that rampant.",
         "Comment of the day and I agree!!",
         "Yup. Literally quitting time right now in CST. \n\nI’m scarred by 2020 but I have a really, really good feeling about this one (and weirdly still super anxious)",
         "*Once more into the breach, dear friends, once more..*",
         "I mean, I get it. You hate trump and need to talk up your person. I can understand that but circle jerking on how she is so smooth and eloquent is a bridge too far."
      ]
   },
   "1gkd516": {
      "title": "Democrats Remind Everyone A Winner May Not Be Declared Until 110% Of The Vote Is Counted",
      "text": "",
      "comments": [
         "\"We don't cheat...you do!\"\n\n\\-Democrats",
         "That 3 AM voting bloc is so critical to them.",
         "I heard she needs 700k votes in Philly to win that state. Need to give her time to find those votes",
         "Funny but true",
         "Sad, but it's closer to the truth than satire.",
         "Even the dead ones.....",
         "Dims will not stop until they get the desired result.",
         "Literally 110% I’m sure",
         "Purchased a lot of suit cases.",
         "Or the ones in prison"
      ]
   },
   "1gknx6l": {
      "title": "Amish turn out for Pennsylvania vote in 'unprecedented numbers': source",
      "text": "",
      "comments": [
         "They go trump. All of them. They want the govt to leave them alone. \n\nPs the amish showed up in DROVES in western nc to help rebuild. This is GREAT news for us 🙏🇺🇲",
         "Do you think those Amish women saw that commercial from Harris about women not telling their husband how they voted?",
         "What about the Mennonites and Pennsylvania Dutch?",
         "They dont watch tv. If they did see it its an even bigger plus for us. Im from the burbs of philly about 2 hours east of amish country. Went all the time to the outlets in Lancaster. If they vote its solid trump country. The amish are possibly THE most family oriented group of people on the planet. Talk about traditional family values. Any hint of the amish busting voting records is nothing but EXCELLENT news for us. They are an isolated, closed society, and they hate the govt.",
         "It was a joke.",
         "Oh sorry, whoosh. A lot of people (on the left) are taking that super seriously thinking those commercials are going to create a glut of new trump voters lol."
      ]
   },
   "1gk8j4e": {
      "title": "Ron Paul Throws His Support Behind Trump, Revels In the Collapse of the Mainstream Media",
      "text": "",
      "comments": [
         "![gif](giphy|vv41HlvfogHAY)",
         "that's a rare endorsement, Ron is pretty reserved.",
         "Ron Paul Army 08 Checking in!",
         "Ron Paul was my main introduction to politics. I've strayed slightly off from where he is on some things, but he's a big reason I hold many of the views I hold today. Fantastic person to have support from. Kind of represents that his support is far and wide. From former Dems, former never Trumpers, Libertarians, or moderates, Trump is grabbing support.",
         "Based and should’ve been president in 2008 pilled",
         "Gotta love Ron.",
         "Wild how much reddit has changed since he was everywhere here",
         "Wow",
         "![gif](giphy|L4fv5eLVk6geaVmkaO|downsized)",
         "My favourite politician ever bar none. Were that we could clone him.",
         "Remember when Reddit used to love Ron Paul 🤣 time to cancel him, along with Tulsi, Elon, and Joe Rogan",
         "Love Ron Paul. Wanted him to win in '08.",
         "I wouldn’t go as far as to say that constitutes an endorsement, but it’s closer to one than I’ve ever seen him make.",
         "He is so awesome",
         "Always loved this meme, glad to see it back lol",
         "Ron Paul as transparency Secretary?!",
         "I'm loving this, this is one helluva great endorsement!🇺🇸🇺🇸",
         "It isn't red trolley vs blue trolley this time, it's keep America vs end the first American republic with no promise of another republic anywhere in sight.",
         "We live!",
         "Ron Paul Army '12 veteran checking in to provide support",
         "THE R3VOLUTION CONTINUES",
         "NY Reserves reporting in!",
         "He got my vote back then.",
         "He got my vote! Still have his book!",
         "It really started to decline when Pao took over.",
         "The majority of reddit became whoever the current front runner of the DNC is.\n\nSure you might have a grass roots candidate pop up and get headlines, but they're basically only famous until the DNC says no and props up their person instead.\n\nDitto with the news media.\n\nLeft wing populist candidates to me sound like an illusion that only goes as far as drumming up social media support before the career politicians do whatever they think keeps them in office.\n\nThe fact that Trump actually beat out the career politicians and derailed the system for 4 years is entertaining.",
         "The government will be so transparent it won't even be there",
         "Audit the Fed!",
         "Regime vs Anti-regime.. Managed Decline of Western Liberalism vs The Resurgent Republic... Being drafted into a nuclear WW3 vs Mean Tweets^tm",
         "I think the republic is headed to an end regardless, Trump just buys a little time to figure out the possibility of continuing it.",
         "Was bad before Pao, but it certainly got a lot worse."
      ]
   },
   "1gkc8ei": {
      "title": "My final prediction",
      "text": "",
      "comments": [
         "If you’re right, I owe you a beer!",
         "Only part I disagree with is Nevada. I think Trump will win Nevada. If he does win any blue wall states it’ll either be only Pennsylvania as you show here or Pennsylvania and Wisconsin.",
         "i’m sticking to 312, if NH and Virginia are too close to call, Trump will have an amazing night",
         "I don’t think it will be close. I expect Trump to win at least 6 of 7 swing states, and around 300 electoral college votes.",
         "To be honest, I really don't think it is going to be this close. He's going to win way more than what is shown here. What you're showing is basically what the polls show, and Trump over-performs. Early voting results suggested he's over-performing more than both 2016 and 2020.\n\nAll the data indicates an incoming blowout.",
         "Me thinks my old home of Nevada is finally going back to RED !",
         "Bold choice to predict the \"blue wall\" splitting. Has WI, MI and PA ever voted differen't from eachother in the last 50 years? Definitely haven't since 1996. They vote the same.\n\nEdit: just checked and those states haven't split their votes since the 1988 election.",
         "Wi will go red",
         "This map is very close to how I'd put it, as well.  I think it will be close, but God willing he'll pull it out in the end.",
         "Believe it or not, for the first time in a very long time, it is not a forgone conclusion that Oregon electoral votes will go the the Democrat candidate. Likely, but not definitely. Time will tell.",
         "My optimist prediction is this, but Trump also wins Nevada, Wisconsin, and Michigan. Stretch optimist prediction adds in MN, NH, and VA.",
         "I went to the Supermarket this afternoon. And the Good Omen that I saw was a man of retirement age with a Maga shirt on. But... not just any Maga shirt, a shirt that said \"MAGA AF\"",
         "I hope you’re right!",
         "Minnesota is the only state that should be blue.\nAlso D.C., but that's not a state",
         "I confidently think he takes WI as well.\n\nI also think he takes NV, that ones more up in the air though",
         "[My prediction is 272 (Trump) - 266 (Harris).](https://www.realclearpolling.com/my-map/6gE)\n  \nHarris takes NV, MI, & PA.\n  \nTrump takes AZ, WI, NC, & GA.",
         "I really hope that you're correct!",
         "Nice conservative estimate ",
         "We really need to lock down 1-2 more states as regular red states. It's too close and dependent on things breaking our way",
         "The '24 election will be solid GOP, in my learned opinion, gathering 382 electoral votes.\n\nCoolidge gets a second term!",
         "I don't think hes winning PA but not WI",
         "We can only hope, maybe even stick it to them good, take NV and WI as well.",
         "My map exactly",
         "This is my prediction verbatim as well",
         "That's exactly the way I had it, too.",
         "i think he'll get nevada and wisconsin.",
         "Even NM has a chance. Kamala has ignored them and let the local machine do the heavy lifting. Meanwhile, locals are fed up with border issues and economy.",
         "You mean \n(my prediction if there is no election interference)*",
         "[deleted]",
         "WI and PA broke away from each other 3 times in 100 years or so.\n\nI don’t think this seems likely this year.",
         "Trump is going to win Nevada and that makes me happy",
         "Maybe New Hampshire as well...",
         "Yeah, I really do think he's sweeping all 7 swing states. I'd be happily surprised if VA or NH flip, but the fact that it's even a possibility bodes very poorly for Kamala.",
         "Okay fam I am going to save this comment and we'll revisit it tomorrow",
         "Based off recently polling I really doubt he’ll win Michigan. But I hope you’re right.",
         "We need it to be so clear that there is no doubt",
         "I don‘t have that much confidence in my home state of Michigan to not vote blue.",
         "I got 310.",
         "I'm worried. I hope you're right. We will see, not much longer",
         "i 🙏🏻 ur on it but i do feel that way too just by observing social media stuff theres so many young poc pro trump",
         "What about 2022? We certainly didn't overperform then.",
         "I hope this holds true.",
         "Doesn't mean they won't.",
         "Yeah and before 2016 nobody thought any of them could go red again, and they all did. This map is entirely possible. ​",
         "I would say PA is more likely for Trump and WI is more likely for Harris.",
         "I've thought WI would be the surprise state to put him over. Which I'd prefer, since they'll most definitely get their results in before PA. \n\nHanging the election on PA is going to be a nightmare for this country. \n\nBut... the blue wall hasn't split their votes since 1988.",
         ">When will they rebalance the EC #'s per state? \n\nThey'll do that when congressional representation is reapportioned after the 2030 census. This is all in the constitution.",
         "So which way are you assuming they lean?",
         "He won't win Minnesota, and Wisconsin is questionable...",
         "*end of the week. We won't know shit till Thursday I bet. Maybe even push that to Friday.",
         "muslim vote will help MI",
         "I don't even know about the \"much not longer\" part, what with all the \"it could take weeks\" bullshit outta PA.",
         "people are not motivated for midterms unfortunately",
         "I worry about that too, but Democrat turnout was *definitely* boosted by the abortion stuff. It worked for them, that's why they're still trying to act like it's an issue this election",
         "It’s gone red plenty of times. Just saying they rarely split.",
         "More than possible, I would say LIKELY",
         "After how the Biden admin treated the states affected by Hurricane Helen I’d say they better vote for Trump. Their treatment was abysmal and after the fact I can’t believe people still willingly support Harris.",
         "IDK. If you look only at the fundamentals of a bad economy and the concerns people actually have (not abortion)…\n\nIt looks to me like WI and PA go red. No idea on MI. But all three had “issues” at 3am in 2020.",
         "I never for a million years thought Minnesota was in play, and anyone who did was probably selling something. MN isn't a swing state. The last time they voted for a Republican, Disco and Jimmy Hoffa were both still alive.\n\nWisconsin, on the other hand, looks pretty good. I don't think it's a lock, but I think there's a higher than not chance that Trump wins it.",
         "The question ends up being how reliable is the polling data? They were wrong in 2020 by a lot. Biden was up 6.7 points on Nov 5th in 2020 and only won it by .7.\n\nIf these errors continue into 2024, it will be a very good night for Trump. If pollsters have over corrected then we’re in for a Harris win possibly. Or maybe they’ve figured it out this time and they’re accurate and it’s a nail biter. \n\nNate Silver thinks pollsters are publishing old or incorrect data for example. ",
         "We'll see! If it's as big of an landslide as OP is thinking, it may be a done deal by 6 AM tomorrow",
         "If he does win Michigan then you may be right about that being the reason.",
         "If enough other states are called the two or three \"new normal\" states that take weeks to count won't matter. ",
         "True. They rarely split but 2020-2024 is different because of remote work. Pennsylvania has seen more inward migration than the other blue wall states. If they split, I think this is the year.",
         "That's what I think as well. I also believe the disgruntled Muslims could play a role in a MI flip as well (That one is more hoping anyway).",
         "I'm down for that.  If that's the case. Lol"
      ]
   },
   "1gkiei6": {
      "title": "STAY. IN. LINE. ",
      "text": "",
      "comments": [
         "Stay in line even if they call your State."
      ]
   },
   "1gkl40d": {
      "title": "President Biden Won’t Attend Kamala’s Election Night Watch Party",
      "text": "",
      "comments": [
         "Yeah, it turns out that the nightly news is past his bedtime",
         "He was forced out, why would he then go celebrate that.",
         "I don't think this is so much a reflection on Harris, it's a reflection on him. This is just more evidence that he is completely incapable of performing at this level, and this event is WAY past his bedtime.",
         "Past his nap time anyhow. He wouldnt understand whats going on.\n\nTell ya what Joe, since this job is so overwhelming for ya, if Trump wins lets just do the swearing in on Friday and you can retire to the nursing home.",
         "Came here to say something along the lines of past his bedtime, lol",
         "Nothing to celebrate anyways. If she wins, she stole it from him. If she loses (which appears the likely outcome at the moment) then she still stole it from him.",
         "Don’t confuse this for support of Biden, but I think the actual reason is he just hates Kamala lol",
         "The establishment didn’t have faith in him to beat Trump again, choosing Kamala instead. Thats the real reason. Even after he was forced out he couldn’t help but lament the way he was treated by the Dems. It’s an open secret that he didn’t actually want to step aside"
      ]
   },
   "1gka0rg": {
      "title": "Voted!! MAKE AMERICA GREAT AGAIN!!!!",
      "text": "",
      "comments": [
         "lol not even two seconds after this post gets approved the Kamala campaign advisors and bots spam by inbox. \n\nHOW SAD!!!!",
         "GET OUT AND VOTE!!!!\n\nMAKE AMERICA GREAT AGAIN!!!!\n\n🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸",
         "Been reported there are issues with malfunctioning machines in PA so they are already extending voting times",
         "Is it not illegal in your states to take a picture of your ballot?  When I voted there was signs all over the place that said it was illegal to take pictures of our ballots and they told us numerous times we couldn't and that we couldn't even have a phone out or in our hands when in the voting room.",
         "the only correct answer!",
         "Very nicely inside the lines too!",
         "I have gotten 2 people already spamming my other posts in other communities with Anti Donald Trump posts... ridiculous.",
         "Only in a couple counties.",
         "I live in PA so as long as I don’t try to take pictures of other ballots and coerce other voters, I’m fine.\n\nhttps://www.fox29.com/news/ballot-selfies-can-i-take-photo-my-ballot-pennsylvania.amp",
         "Literally the only choice stopping America from turning into a one party totalitarian state…\n\nVOTE!!!! VOTE!!!! VOTE!!!!\n\nMAKE AMERICA GREAT AGAIN!!!!\n\n🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸",
         "Thank you for clarifying that the source I got that from wasn't too detailed"
      ]
   },
   "1gkn8lo": {
      "title": "Huge surge in Latino voters for Donald Trump, exit poll reveals",
      "text": "",
      "comments": [
         "He flipped Miami Dade County. That's huge",
         "It was trending this way in 2020 too iirc",
         "Donald Trump has seen a huge surge in support among Latino voters, according to [a presidential election exit poll](https://www.telegraph.co.uk/us-election/presidential-election-2024-harris-trump-latest-results/) released on Tuesday night.\n\nThe former president is up 13 points among Latinos compared to his performance in 2020, when he lost the race to Joe Biden.\n\nThe boost comes despite a comedian at his Madison Square Garden rally last month [comparing Puerto Rico to “garbage”](https://www.telegraph.co.uk/us/politics/2024/10/28/trump-speaker-compares-puerto-rico-island-trash/) floating in the ocean.\n\nLatino [support for Trump](https://www.telegraph.co.uk/us/politics/2024/11/05/us-election-latest-news-polling-trump-kamala/) is especially strong among men, where Trump has surged by 18 points to a majority of 54 per cent of the vote share. Kamala Harris attracted 44 per cent of the vote in that group, the poll showed.\n\nOverall, 53 per cent of Latinos said [they would vote for Ms Harris](https://www.telegraph.co.uk/us/politics/2024/10/31/inside-pennsylvania-puerto-ricans-vote-kamala-harris/), compared with 45 per cent who said they would vote for Trump.\n\nThat is [a significant boost for the Republican candidate](https://www.telegraph.co.uk/us/comment/2024/10/30/latino-voters-are-abandoning-kamala-harris-and-reshaping-us/) on historic numbers, which generally show Latinos voting in droves for Democrats.\n\nThe estimated proportion of Latino voters in the 2024 election is 12 per cent, and the effect of their decision on the overall race will be determined by how many of them live in swing states that will decide the result.\n\nLatinos make up around 30 per cent of the electorate in two key battlegrounds, Arizona and Nevada. Trump lost both of the states to Mr Biden in 2020 but is looking to capture them this year after running a campaign heavily focused on border security.\n\nSeparate polls, taken before election day, show Latinos are most likely to have concerns about the economy and immigration – two issues on which Trump is generally more trusted than Ms Harris.\n\nTuesday night’s exit poll gives a snapshot of the result of the presidential election among certain groups, according to 16,604 voters surveyed after casting their ballot.\n\nAlthough it cannot be used as a predictor of the winner, because it was taken before polls even closed, the data gives an indication of the likely demographic themes of the results.\n\n**Read more from The Telegraph:** [https://www.telegraph.co.uk/us/politics/2024/11/06/donald-trump-huge-surge-latino-voters-exit-poll/](https://www.telegraph.co.uk/us/politics/2024/11/06/donald-trump-huge-surge-latino-voters-exit-poll/)",
         "Yes, but I think there's been a huge shift since.  Latino men moved like 30 points to Trump and women 10-15ish.",
         "Honestly, this really shouldn't be that surprising.  Legal Latinos are the group that is being most directly harmed by Biden's open borders policies."
      ]
   },
   "1gk5suo": {
      "title": "Vote! Make it Too Big To Rig! ",
      "text": "",
      "comments": [
         "Stood in line over 3 hours on Sunday to vote. First time voting and even though my county is blue we saw a good amount of Trump support.",
         "Just Voted straight red down the ballot in PA.\n\nI'm a 23 year old Conservative, working out now! Let's go trump.",
         "My daughter voted for the first time today.  She and her friends from school had a registration party this summer where they all got together and got online and registered to vote.  And they are all 19-22 and are voting Trump.",
         "Mailed in my ballot on Saturday, it got to the polls Monday.  Straight red all the way down.  I want the clowns out of office.",
         "GET OUT AND VOTE!!!!! VOTE LIKE YOUR LIFE DEPENDS ON IT",
         "I just felt like making a red velvet cake yesterday, but my husband and daughter pointed out I picked the appropriate color. \n\nIf we pull this off, I’m going to make it a tradition!",
         "I early voted; but I’m a 23 year old female from TX and I voted for Trump and Vance!! Vote people; your future depends on it!!",
         "I voted in SC when the polls opened at 7:00am.  A lot of people showed up early, so the line was a little longer than when I left 45 minutes later.",
         "As Hugh Hewitt used to say, \"if it's not close , they can't cheat.\"",
         "21 year old female conservative getting ready to vote, buffalo ny!",
         "Voted in person today on election day.  No better way to do it.  Glad I'm rural and with no waiting line, that would suck!",
         "Gonna do my part in Maine!",
         "My sole concern with all the early voting is I hope the early voting is in addition to our normally strong Election Day voting. I hope our leads in places is because democrats failed to vote early and not cause we had a huge surge in early voting that might take away from our Election Day voting stronghold we usually have. \n\nI know some places we have 3000 more early votes than normal but democrats have 100k or so LESS.\n\nOne article said we have 30-60k high propensity voters left while Dems have 60-100k low propensity voters left. I hope that’s true, that helps us big time. Dems are far less likely to vote on Election Day especially in big cities",
         "VOTE! \n\nVote like our entire country depends upon it! \n\nWhy? \n\nBecause our country DOES depend upon it!",
         "And tell everyone to stay in line! Even if they call a race while you're in line, follow thru and vote anyway. In 2020 Several states called the race and people left the line and it still ended so close.",
         "Oof. Took me 10 minutes just now lol.",
         "Pre gym voting 🤝",
         "I live near Wilkes-Barre PA and Im going to vote straight red right after I get out of work at 3:30",
         "Great job! Your vote could actually determine the presidency",
         "Same",
         "Same here. Used to think Trump was evil years ago. Then I started thinking.\n\nAll red baby. 😎",
         "My 20 year old daughter and all of her friends are voting in their first presidential election today.  They are voting red down the ticket in California!",
         "Maybe the grocery store has decorative cake candles to put the number 47 on it.",
         "The Democrats greatly underestimate how much the younger generation is tired of having wokeness shoved down their throats."
      ]
   },
   "1gknv7n": {
      "title": "AP Race Call: Donald Trump wins Ohio",
      "text": "",
      "comments": [
         "Here is my prediction - Trump wins and Reddit shuts this sub down..",
         "Yes! They are going to melt down in that state sub! They really thought the dogs  and cats eating thing was going to help them. They were so egotistical over there, when I posted.",
         "Karl Rove is ejaculating.",
         "First time Ohio voter here, red all down the ballot 🇺🇸",
         "And i think we'll manage to kick that senior senator to the curb too 😁",
         "Then Elon buys Reddit and makes us all the new mods of the other subs to make up for what we’ve been through.  Or more likely deletes all the bots and we find out there were more of us all along.",
         "This is very funny if you watched the 2012 results btw..."
      ]
   },
   "1gkewiy": {
      "title": "Study: 100% Of Elections Are 'The Most Important Election Of Your Lifetime'",
      "text": "",
      "comments": [
         "Yeah, I said the Obama/McCain election was that. I said we wouldn't be able to recognize America pretty soon after electing Obama. I was right. If we don't turn this extreme leftist slide around, his election will always be seen as the tipping point that started the downfall of America.",
         "The Bee lost me for a while there but they've been spot on lately.\n\nNo matter what happens, life will go on. No point in stressing about it. All you can do is vote and once you've done that any worry should go out the window.",
         "100% of elections in which Democrats are involved are the LAST ELECTIONS of your life if you don't vote blue!",
         "Love the Bee, but nah. \n\nI never said that until this one. After seeing a wraponized DOJ and new regs that allow the feds to turn the military on us for political protests?\n\nNah. Never seen one like this.",
         "or as Kamala says, [This is the most election of our lifetime](https://nypost.com/2023/12/20/news/kamala-harris-serves-up-another-word-salad-as-discusses-most-election-of-our-lifetime/)",
         "I mean it’s necessarily wrong. The threats around the world only grow stronger each day, which makes the leaders of the free world more important each election.",
         "Same. Before I would roll my eyes. This time I am taking it seriously, because this time it is serious. Freedom of speech is on the line, your right to bear arms are on the line, your 4th amendment rights are on the line, the constitutional republic as we know it is on the line."
      ]
   },
   "1gkmzqt": {
      "title": "Why the AP called Florida - Trump up 12.7% with 90% Reporting",
      "text": "",
      "comments": [
         "Florida was a battleground state 8 years ago, it is a Red bastion now.  That is wild.",
         "Im old enough to remember when Florida was a major swing state. Oh how the turntables",
         "Honestly that's too close even.",
         "Yeah I think we can say Florida officially lost its status as a battleground state this election cycle. Was predicted to go this way, but it's definitely cemented now.\n\nCongratulations Florida!\n\nI think?? I won't lie, enjoyed elections when I lived in Pennsylvania, felt like my vote counted more.",
         "YES WE WILL FIGHT AND WIN",
         "We got the two biggest states. Texas and Florida:) That negates Harris win of California and New York . Not quite as much, but close.",
         "Going from 3% last time to 13% this time is wild."
      ]
   },
   "1gklzal": {
      "title": "BLM leader Mark Fisher is voting for Donald Trump",
      "text": "",
      "comments": [
         "Largest plot twist of the century",
         "I’m confused but hey I’ll take it",
         "A vote is a vote!"
      ]
   },
   "1gko5sq": {
      "title": "NBC Exit Poll: Latino Men Swing for Trump Over Harris by 10 Points",
      "text": "",
      "comments": [
         "Bad Bunny endorsement wasn't enough guys ://",
         "Harris puts on fake accents and panders like the phoney that she is. We know better. Trump 2024!"
      ]
   },
   "1gkhkut": {
      "title": "Google accused of election interference after showing Americans maps of where they 'can vote for Harris' - but not Trump",
      "text": "",
      "comments": []
   },
   "1gk4v6c": {
      "title": "TODAY IS THE DAY! TIME TO SAVE AMERICA! 🇺🇸",
      "text": "",
      "comments": [
         "Get out and vote! I hear it's raining in some of the swing states. It doesn't matter. We have to have a historic turnout this year!",
         "It's been storming here all night in the greater Houston area.  I voted a week ago. I'll be praying all day.  Maybe I will gather up some food and take to my church food pantry.  Great way to celebrate Election Day!",
         "Trump, Vance, Elon, Tulsi, RFK, and Ron Paul. Or. Kamala and Liz Cheney  ***VOTE***",
         "Only other time I voted was 2016. Skipped 2020. Voting TODAY.",
         "kamala ya fired",
         "Let’s fucking go!!!",
         "Hey y’all.  Best place to track voting results? I swear in 2020 there was an interactive map on google, but I can’t find it now",
         "God save our Republic.  \n\n![gif](giphy|C1L8yq5ZEz0cg|downsized)",
         "We are going this morning. It's going to be a long day!",
         "Voted and it feels good!",
         "Today is the day America is saved",
         "Voted this morning. 30 minutes in and out. EZPZ. There is no excuse to not do it. \n\nThe turnout at my location was order of magnitudes larger than it was in 2022. Things are looking good.",
         "Why, is something happening today???",
         "Get out and vote.  Sure he is ahead but he is going to have to be way ahead because there is going to be fucking boatloads of late Kamala mail ins being counted for days.",
         "Voted in PA today! 🥳",
         "Please God. We need this win! Save America and beat the media machine!",
         "Canadian here. Good luck today boys, we're 100% rooting for you.",
         "I hope we do the Trump victory dance.",
         "People, get out and vote! I'm voting after work here in Iowa.",
         "I like no tie Trump.",
         "Me and my daughter were 10 and 11 in line this morning when the polls opened in Indiana.  maybe reddit fatigue but i’m not very confident even at lower level races.",
         "[removed]",
         "Currently standing in line.\n\nI’m in an extremely red state (AL), but I have never seen turnout like this before, and I’ve been voting since 2004. The lines are *huge*.\n\nOf course this is just one meaningless anecdote, but I’m praying this is indicative of very strong Trump enthusiasm and a potentially historic turnout.",
         "First 10 min of FL voting R+29 blowout! Keep it up!\n\nhttps://x.com/ericldaugh/status/1853773645006434327?s=46",
         "We have some scattered showers here in rural NC. I voted early, but I’m hoping the weather doesn’t discourage others from showing up! ",
         "I've seen so many posts on other subs about people planning to get so drunk/high celebrating if they win this was a refreshing alternative.",
         "No brainer of course",
         "YA FIRED",
         "I definitely remember the interactive google map in 2020. It will probably show up once polls close and results start coming in. ",
         "Pick a streamer any streamer, I'll be watching mine but I don't link them on Reddit because they've been swatted by internet kids and then told by authorities to take it to civil court instead of the police.\n\nThe *world* is in trouble if this system sticks.",
         "I have been told New York Times has a good tracker.",
         "I have the Axios one up, not sure how it compares but it looks solid enough. ",
         "270towin has an interactive map\n\nNYTimes has a map that lets you check county turnout individually",
         "I've seen you doom on a couple of posts, not having a go but just want to address your concerns constructively. \n\n\nYou say in 2020, people said Biden is senile, no one is at his rallies, but the truth is it was over for Trump as soon as Covid became a big deal. No matter who was in office, they were always going to get blamed and people wanted change for the sake of change to fix things. \n\n\nIn 2022, the economy hadn't really bottomed out and the border issues hadn't really become as mainstream yet. Also, it really came down to a handfuls of races being lost by poor candidates. Sure, Trump picked them but it's common that a Presidential candidate's appeal can't transfer over regardless of endorsement. \n\n\nTrump honestly has everything going for him this time. He's much better campaigning as the opposition then he is as the incumbent, the economy, immigration, foreign policy all on his side. \n\n\nKamala had to replace a guy who was going to lose in a landside, she's barely a better candidate and she's part of the current admin. Not even leftists wanted her to be picked. All she has is abortion, Biden had that and was still losing heavily. \n\n\nKeep the faith. ",
         "🙏😁",
         "Whoa that’s a good sign that Florida should be a massive win! \n\nI hope we see these numbers everywhere",
         "Update!!! \n\n https://x.com/ericldaugh/status/1853791861015495155?s=46 \n\n GOP turnout in FL more than D and no party affiliation combined! And at least half the NPA will be voting red.",
         "Unless it discourages more weak Kamala voters, that is!",
         "I’ve considered fireworks!",
         "been walking around the house all morning yellin this",
         "Wow! Broward country currently voting Red! Insane!\n\nhttps://x.com/ericldaugh/status/1853778450810548246?s=46\n\nFL probably going double digits",
         "i'm so happy about how much Florida's changed. It's no longer the must win battleground state that needs tons of resources to flip, it's a solid 29 electoral vote pickup. (Same with Ohio)\n\nMakes the path to 270 so much easier",
         "True, but there aren’t many of those around here. It needs to rain in Charlotte and the Triangle area 😂. ",
         "Even with the recent rain, it's too dry here.",
         "Probably because Republicans actually have jobs and want to vote before work!",
         "In this economy even the far-left have to report to work!"
      ]
   },
   "1gkhu2z": {
      "title": "Google Claims ‘Bug’ Causes Different Results on ‘Where to Vote for Trump’ Vs. ‘Where to Vote for Harris’",
      "text": "",
      "comments": [
         "Funny how these “errors” always favor the same side.",
         "It's a feature, not a bug.",
         "\"Bugs\" always go against Republicans. If you haven't already, GO VOTE!!!!! We cannot let the demoncrats hold the presidency for 4 more years",
         "I can think of two remedies: a company divestiture and a lawsuit. That should get rid of any “bugs.“",
         "Bugs…. Every single election cycle. Bugs….. benifits the same side every cycle. \n\nEnough of the bullshit, start prosecuting these companies for election fraud, voter fraud, election interference, misinformation ( as the left loves to say) put an end to this trash.",
         "Amazing how many times we've let google get away with these \"bugs\". Wtf dude.",
         "The only platform we have been conditioned to use...and it's biased. This isn't the first time, remember when Google suppressed searches about the assassination attempt on Trump?",
         "F-ck Google! there are other options out there. I personally switched over to DuckDuckGo recently. I don’t know how biased or unbiased it is, but it’s definitely worth the switch.",
         "Thanks to Twitter community notes, we know “Harris” is a county in Texas. Results show for most county names. Same non-results show up if you google “Where to Vote for Kamala”. Or “Where to vote for Walz”. Google is a horrible company and you can bet they’re skewing search results as much as they can, but this particular report is a nothingburger.",
         "Google needs some serious pesticide to get rid of these so called bugs that happen to Google, Google Gemini, Youtube and any Google products.",
         "Im actually confused why this would be a question though? You vote for them at your assigned polling place. Google is obviously garbage and bias but why would anyone need to ask this question?",
         "Came here to say the exact same thing.  Due to the one-sidedness of these bugs, this is intentional.",
         "They don't even try to be transparent anymore...",
         "And YouTube burying the Trump/Rogan podcast.",
         "I’ve de-coupled from all google platforms."
      ]
   },
   "1gkik1s": {
      "title": "Donald Trump Presses Americans to Stay in Line to Vote: ‘Do Not Let Them Move You’",
      "text": "",
      "comments": []
   },
   "1gkh87z": {
      "title": "Harris Benefitted from Unprecedented Bias among Major News Broadcasters, Study Finds",
      "text": "",
      "comments": [
         "Because they carried her water. She’s only gotten this far because the media collectively polished a turd.\n\nKamala has no substance, no personality, and is utterly helpless without a teleprompter or friendly interviewer to lean on. The media has treated her with kid gloves instead of scrutiny outside of a handful of times, like Bret Baier’s 20 minute session.",
         "Water is wet",
         "This announcement is just a tad late to the party.",
         "You didn't need a study to know this",
         "This should at some point fall under the equal time rule or something. The old media were nonstop promoting her",
         "No duh",
         "This is the last time because people are dumping disreputable media for podcasts"
      ]
   },
   "1gkg2da": {
      "title": "Ron Paul rallies libertarians, gives his closing argument for why America must elect Trump",
      "text": "",
      "comments": [
         "The fact that he'll be advising Musk on cuts is amazing. Never thought Ron Paul would be on the 2024 ballot, makes up for 2012.",
         "Preach Ron, preach! \n\nHow can someone vote for Harris, an empty suit backed by a list of P Diddy party goers? Go vote for greatness, not stupidity.",
         "Did he actually make an endorsement?  I know the NH Libertarian party just endorsed Trump."
      ]
   },
   "1gknqha": {
      "title": "'PRAISE GOD!' Florida defeats radicals' attempt to enshrine nearly limitless abortion as a right",
      "text": "",
      "comments": [
         "That's fine for Florida I guess, but I pray GOP doesn't think that 6 weeks is reasonable because of this.  It isn't and it will lose you many elections."
      ]
   },
   "1gki24l": {
      "title": "You got this one Joe",
      "text": "",
      "comments": [
         "He has already won.  He has distanced  hisself from stupidity..",
         "Joe Biden will go to his grave thinking that he would have won a second term if only they didn't force him out.\n\nHe will be completely wrong, of course, but he and his family will never forgive Pelosi, Obama, and whoever else forced him out of the race.",
         "If he really secretly sabotaged Kamala campaign for backstabbing him and voted for Trump then yes, if Trump wins the election he will have won as he gets his revenge.",
         "Let’s go Brandon",
         "He has become unburdened."
      ]
   },
   "1gkjhb9": {
      "title": "IF YOU ARE IN LINE STAY IN LINE!",
      "text": "",
      "comments": [
         "And if you havent voted yet, get in line!"
      ]
   },
   "1gkgopy": {
      "title": "Stay in line when voting tonight",
      "text": "",
      "comments": [
         "This needs to be pinned to the top. Hold the line!!!",
         "This is why early in person voting is so important and I don't understand why every state doesn't do it. People have lives and jobs, not everyone can afford to or is physically able to wait in line for 6-7 hours even if they wanted to."
      ]
   },
   "1gkkvmd": {
      "title": "Exit Polls: Most Voters Prefer Donald Trump on Top Issue of Immigration",
      "text": "",
      "comments": [
         "If we can establish border security and fix the immigration system in a way that welcome law abiding immigrants, we can lead this country for the next generation!",
         "Well he'll. Not like he could be any worse. "
      ]
   },
   "1gkasmi": {
      "title": "Kamala Harris Is the Most Inauthentic Nominee in History, and the Trump Campaign Just Proved It",
      "text": "",
      "comments": [
         "OMG SHE SAID FIGHT. ACCORDING TO MSM WHEB A CANDITATE SATS FIGHT THATS ANGRY RHETORIC, RIGHT?!?!??!",
         "Boy, the lib bots are active today!!!",
         "The Trump Campaign doesn't have to prove Kamala is fake as fuck; Kamala proves it herself, every day.  \n\n#🤷‍♂️",
         "Trump campaign didn't need to do anything, if people knew that no delegates or anyone for that matter, voted her in.  The Democrats are the hypocrites, they forced out their puppet, and installed another.\n\nKind of like Obama did in Ukraine...  I wonder how many billions flowed through there to their pockets!?",
         "Of course, she acts like a robot.  She can not think for herself,  and she can only say what she's told to by the deep state. \nThis is why teleprompters are her friend. The only time she really spoke of the cuff was in the debate, and then she was acting like the trial lawyer she is, attacking the other side.",
         "If the results swing for Trump today to show a clear victory, I want to see the Kamala impersonator do a video parodying her post 2020 election congratulatory call to Biden. But instead it’s of her crying “We didn’t do it Joe! 😭 We didn’t do it!”\n\nEdit: Impersonator’s name is Estee Palti. She’s got that cackle down to a T!",
         "And yet some Americans can't see that she can't run a lemonade stand let alone a country",
         "Anyone seen The Terrifier?",
         "They didn’t have to. She proves it every time she opens her mouth.",
         "I know it's the lighting in the picture, but she looks to have empty, soulless eyes. In fact, the more you look at that picture in the thumbnail, the more her face looks distorted and creepy... like those scenes in Devil's Advocate where all the people's face turn to demons when interacting with Charlize Theron's character.",
         "Some of them are paid staffers",
         "They sure are.",
         "Not just bots. Sneaky little trolls coming into the subs making little comments and asking questions. Trying to bait people.",
         "She repeated all the lies about Trump and got away with it. It was three against one.",
         "And I picture tampon Tim in the position of Walmart greeter.",
         "Dude she can't run her vibrator up her snatch.",
         "<Willie Brown enters the chat> Not /every/ time…",
         "It's fun to fuck with them.",
         "\"Hi, welcome to k-mart, ummm I mean Walmart! Sorry I misspoke\"\n\n-tim walz probably",
         "*rimshot",
         "<Montell Williams enters the chat> mmmhhhhmmmm"
      ]
   },
   "1gkjesu": {
      "title": "Milwaukee forced to recount 30,000 ballots due to tabulation error",
      "text": "",
      "comments": [
         "All \"anamolies\", glitches, and mistakes will come from: Milwaukee, Detroit, Philadelphia, Atlanta, and/or Maricopa County.  In striking coincidences, the anamolies and glitches will all be in favor of the democrat and detrimental to the republican.",
         "\"The decision to recount the ballots was \"was made in consultation with both Republican and Democratic officials,\" the MEC's statement says.\n\nAs much as I'm worried about fraud, did people commenting not read this part?\n\nThis means that they'll both be observing the recount carefully. If Republicans were somehow kicked out and Democrats were allowed to stay in then that would be worrying.",
         "Here we go... funny how all the news is about problems in the battleground states... funny, ain't it?",
         "![gif](giphy|3P0oEX5oTmrkY)",
         "Fuck Democrats",
         "RNC better have eyes there watching and counting  every.single.ballot that gets fed in",
         "Tonight's going to be an absolute shitshow.",
         "And guess what.  Kamala wins by 27359 votes in Milwaukee",
         "So strange how that happens right?  What a coincidence.",
         "Yeah I think people are just a *little* too quick to put on their tin foil hats right now. It's like ANY minor hint of something going wrong as a sign that the election is being stolen.\n\nBut so far anything that has gone wrong has been correctly dealt with in my opinion. In Pennsylvania the (Republican-lead) county asked for a polling extension and it was granted by the courts. And here officials on both sides decided it was best to recount the ballots.\n\nSo as far as I can tell everything is working as intended. Sometimes things happen as stuff goes wrong, but the checks and balances in the system are working.",
         "Seriously, first PA now this. Well at least voting got extended to 10p in affected PA counties.",
         "In all fairness, problems in states that are not in contention probably don’t make the news. ",
         "But if you point it out you're a racist fascist Nazi.",
         "Very true.  Good point."
      ]
   },
   "1gknalz": {
      "title": "Ron DeSantis: Amendments 3 and 4 enshrining abortion and recreational marijuana in Florida fail",
      "text": "",
      "comments": [
         "Eugh I hope this doesn't inspire the GOP to ramp up anti-marijuana nonsense.  It's a losing issue overall.",
         "I'm not an anti-abortion hard-liner, but Amendment 4 was *insane*. I'm very glad it failed.",
         "*Whew!*",
         "One thing our country doesn't need is _more_ people on drugs. Such an insane thing to have to debate people about.",
         "It was 55.7 or 56% He knows thats a losing fight. Im pissed it didn't pass but I see why people are mad they can't grow.",
         "It was such a disaster in Oregon that they’re considering reversing it already. And that’s PORTLAND. Huge increases in car accidents and a bunch of unexpected consequences.",
         "Facts, but this is the problem with a democracy where people can vote themselves money and drugs",
         "That was a total drug decriminalization -- not the same at all."
      ]
   },
   "1gk57dr": {
      "title": "VOTE VOTE VOTE ",
      "text": "",
      "comments": [
         "MAGA!!",
         "For a safer world, for Freedom and for Peanut !",
         "First time voter of Trump, just got done",
         "This IS our last chance, especially now that Soros purchased 200 conservative radio stations that Biden fast tracted FCC approval for. We have NO control if the election is lost and will be fed lies for generations to come!"
      ]
   }
}