{
   "1gk7fwo": {
      "title": "47 just voted for the first time",
      "text": "I not only did this for our freedom but for my mom.  She passed away December 3rd from ALS and she was a huge Trump supporter.   I’ve never voted before and I knew this year I had too. Come on mom, work your magic in heaven ❤️",
      "comments": [
         "Ok, I get it now. I thought this picture depicted a 47-year-old and I was all....WHAT?! 😂\n\nCongrats!",
         "I’m so sorry about your mom! Seems like a great way to honor what she loved.  Welcome to the party!",
         "Welcome to the family OP.",
         "47 voting for 47 :)\n\nSo sorry for your loss",
         "Sorry about your mom, and good for you for voting and honoring her memory.",
         "Yes sorry!!  I am 47!!  My mom was 75….RIP my spunky lady! 🪽",
         "i thought that was supposed to be you until  i read the description and was like \"damn, that's a rough looking 47\"",
         "Love you! 🙌",
         "I'm very sorry about your mom, ALS is such a terrible disease😞\n\nPlease make sure she doesn't vote for the Dems this year",
         "I was just thinking to myself that theres no way youre 47 only to read that the pic is your mom. Lol! Good on ya for getting out to vote!",
         "I will say a prayer for your Mother. Thank you for joining us and voting",
         "So sorry for your loss 🙏 And thank you for your Trump vote.",
         "God bless you and tysm",
         "Atta girl!!!",
         "Stronger as one nation under GOD!",
         "Same here 😂",
         "Thank you…miss her but know she’s with me always and will work magic tonight! ❤️",
         "Thank you!!! Proud to be here!!",
         "Ahhhhh that is a sure fire sign!!! 💪🇺🇸❤️",
         "![gif](giphy|3o7TKwOvjlnqQ9KQY8|downsized)"
      ]
   },
   "1gka7pw": {
      "title": "Hispanic women for Trump!🇺🇸",
      "text": "\nVoted in honor of the hard work and dedication and the sacrifices my great great grandparents made when they came to America from Mexico.  For my grandfather and uncles who fought and served in WW2, Korea, and Vietnam.  \n\nThey loved America and the fact that they were able to come from nothing and build a brand new life for their family should be a testament to how great our country has been, can be, and will be again.  I’d be ashamed for them to see what America has turned into but I’m confident President Trump can get us back to where we were before. \n\nLove, \nOne Trashy Mexican 🇺🇸🗑️🇺🇸\n\nMAGA!!!!🇺🇸🇺🇸🇺🇸",
      "comments": [
         "Bienvenidos.",
         "A True Patriot. She is not afraid!",
         "You must of have an abusive husband or you aren't real Latin. /s",
         "Love it, girl!  🇺🇸❤️",
         "Beautiful",
         "My Abuela has voted for Trump 3 times now. Hispanics, who are here legally, are typically pretty conservative.",
         "Be sure to take that sticker off at midnight.  :-)",
         "Hispanic women love their families and are a lot smarter than the DNC gives them credit for. \n\n\nMy little bro is married to a Mexican woman and she's incredibly based. ",
         "Wow!  What a great comment.  Thank you.",
         "Good for you!",
         "We got this!",
         "🙏🙏🙏",
         "He keeps me locked in the closet and lets me out occasionally to make him tacos and enchiladas. 😅🌮",
         "Exactly. According to others we are voting against our best interests. I guess I no longer control my interest and have the state decide what my best interests are.",
         "such an evil man....must be Trump's fault",
         "😂😂 much respect for you to post here to the unbearable left sided reddit! You have guts!! Lol. I'm a Latino and so is my wife, we both voted Trump. How could we not. This is the worst administration in US history and we're tired of living broke!!!",
         "The tortillas better be homemade",
         "Horrible. You should divorce him and vote Kamala and go be a single empowered cat lady",
         "![gif](giphy|3o6ZsVbs2GzgKNvVpS|downsized)\n\nLiterally a Nazi."
      ]
   },
   "1gk5suo": {
      "title": "Vote! Make it Too Big To Rig! ",
      "text": "",
      "comments": [
         "Stood in line over 3 hours on Sunday to vote. First time voting and even though my county is blue we saw a good amount of Trump support.",
         "My daughter voted for the first time today.  She and her friends from school had a registration party this summer where they all got together and got online and registered to vote.  And they are all 19-22 and are voting Trump.",
         "Just Voted straight red down the ballot in PA.\n\nI'm a 23 year old Conservative, working out now! Let's go trump.",
         "GET OUT AND VOTE!!!!! VOTE LIKE YOUR LIFE DEPENDS ON IT",
         "I just felt like making a red velvet cake yesterday, but my husband and daughter pointed out I picked the appropriate color. \n\nIf we pull this off, I’m going to make it a tradition!",
         "I voted in SC when the polls opened at 7:00am.  A lot of people showed up early, so the line was a little longer than when I left 45 minutes later.",
         "My sole concern with all the early voting is I hope the early voting is in addition to our normally strong Election Day voting. I hope our leads in places is because democrats failed to vote early and not cause we had a huge surge in early voting that might take away from our Election Day voting stronghold we usually have. \n\nI know some places we have 3000 more early votes than normal but democrats have 100k or so LESS.\n\nOne article said we have 30-60k high propensity voters left while Dems have 60-100k low propensity voters left. I hope that’s true, that helps us big time. Dems are far less likely to vote on Election Day especially in big cities",
         "As Hugh Hewitt used to say, \"if it's not close , they can't cheat.\"",
         "And tell everyone to stay in line! Even if they call a race while you're in line, follow thru and vote anyway. In 2020 Several states called the race and people left the line and it still ended so close.",
         "Oof. Took me 10 minutes just now lol."
      ]
   },
   "1gk8j4e": {
      "title": "Ron Paul Throws His Support Behind Trump, Revels In the Collapse of the Mainstream Media",
      "text": "",
      "comments": [
         "![gif](giphy|vv41HlvfogHAY)",
         "that's a rare endorsement, Ron is pretty reserved.",
         "Ron Paul Army 08 Checking in!",
         "Gotta love Ron.",
         "Ron Paul was my main introduction to politics. I've strayed slightly off from where he is on some things, but he's a big reason I hold many of the views I hold today. Fantastic person to have support from. Kind of represents that his support is far and wide. From former Dems, former never Trumpers, Libertarians, or moderates, Trump is grabbing support.",
         "Wow",
         "Based and should’ve been president in 2008 pilled",
         "Wild how much reddit has changed since he was everywhere here",
         "He is so awesome",
         "I wouldn’t go as far as to say that constitutes an endorsement, but it’s closer to one than I’ve ever seen him make.",
         "Always loved this meme, glad to see it back lol",
         "I'm loving this, this is one helluva great endorsement!🇺🇸🇺🇸",
         "It isn't red trolley vs blue trolley this time, it's keep America vs end the first American republic with no promise of another republic anywhere in sight.",
         "He got my vote back then.",
         "It really started to decline when Chao took over.",
         "Regime vs Anti-regime.. Managed Decline of Western Liberalism vs The Resurgent Republic... Being drafted into a nuclear WW3 vs Mean Tweets^tm"
      ]
   },
   "1gk4v6c": {
      "title": "TODAY IS THE DAY! TIME TO SAVE AMERICA! 🇺🇸",
      "text": "",
      "comments": [
         "Get out and vote! I hear it's raining in some of the swing states. It doesn't matter. We have to have a historic turnout this year!",
         "It's been storming here all night in the greater Houston area.  I voted a week ago. I'll be praying all day.  Maybe I will gather up some food and take to my church food pantry.  Great way to celebrate Election Day!",
         "Trump, Vance, Elon, Tulsi, RFK, and Ron Paul. Or. Kamala and Liz Cheney  ***VOTE***",
         "kamala ya fired",
         "Let’s fucking go!!!",
         "We are going this morning. It's going to be a long day!",
         "Voted and it feels good!",
         "Hey y’all.  Best place to track voting results? I swear in 2020 there was an interactive map on google, but I can’t find it now",
         "Get out and vote.  Sure he is ahead but he is going to have to be way ahead because there is going to be fucking boatloads of late Kamala mail ins being counted for days.",
         "Today is the day America is saved",
         "Voted this morning. 30 minutes in and out. EZPZ. There is no excuse to not do it. \n\nThe turnout at my location was order of magnitudes larger than it was in 2022. Things are looking good.",
         "I hope we do the Trump victory dance.",
         "God save our Republic.  \n\n![gif](giphy|C1L8yq5ZEz0cg|downsized)",
         "Canadian here. Good luck today boys, we're 100% rooting for you.",
         "Only other time I voted was 2016. Skipped 2020. Voting TODAY.",
         "Please God. We need this win! Save America and beat the media machine!",
         "I like no tie Trump.",
         "Me and my daughter were 10 and 11 in line this morning when the polls opened in Indiana.  maybe reddit fatigue but i’m not very confident even at lower level races.",
         "Voted in PA today! 🥳",
         "People, get out and vote! I'm voting after work here in Iowa.",
         "[removed]",
         "Currently standing in line.\n\nI’m in an extremely red state (AL), but I have never seen turnout like this before, and I’ve been voting since 2004. The lines are *huge*.\n\nOf course this is just one meaningless anecdote, but I’m praying this is indicative of very strong Trump enthusiasm and a potentially historic turnout.",
         "First 10 min of FL voting R+29 blowout! Keep it up!\n\nhttps://x.com/ericldaugh/status/1853773645006434327?s=46",
         "We have some scattered showers here in rural NC. I voted early, but I’m hoping the weather doesn’t discourage others from showing up! ",
         "I've seen so many posts on other subs about people planning to get so drunk/high celebrating if they win this was a refreshing alternative.",
         "No brainer of course",
         "YA FIRED",
         "Pick a streamer any streamer, I'll be watching mine but I don't link them on Reddit because they've been swatted by internet kids and then told by authorities to take it to civil court instead of the police.\n\nThe *world* is in trouble if this system sticks.",
         "I have been told New York Times has a good tracker.",
         "I definitely remember the interactive google map in 2020. It will probably show up once polls close and results start coming in. ",
         "I have the Axios one up, not sure how it compares but it looks solid enough. ",
         "270towin has an interactive map\n\nNYTimes has a map that lets you check county turnout individually",
         "I've seen you doom on a couple of posts, not having a go but just want to address your concerns constructively. \n\n\nYou say in 2020, people said Biden is senile, no one is at his rallies, but the truth is it was over for Trump as soon as Covid became a big deal. No matter who was in office, they were always going to get blamed and people wanted change for the sake of change to fix things. \n\n\nIn 2022, the economy hadn't really bottomed out and the border issues hadn't really become as mainstream yet. Also, it really came down to a handfuls of races being lost by poor candidates. Sure, Trump picked them but it's common that a Presidential candidate's appeal can't transfer over regardless of endorsement. \n\n\nTrump honestly has everything going for him this time. He's much better campaigning as the opposition then he is as the incumbent, the economy, immigration, foreign policy all on his side. \n\n\nKamala had to replace a guy who was going to lose in a landside, she's barely a better candidate and she's part of the current admin. Not even leftists wanted her to be picked. All she has is abortion, Biden had that and was still losing heavily. \n\n\nKeep the faith. ",
         "🙏😁",
         "Whoa that’s a good sign that Florida should be a massive win! \n\nI hope we see these numbers everywhere",
         "Update!!! \n\n https://x.com/ericldaugh/status/1853791861015495155?s=46 \n\n GOP turnout in FL more than D and no party affiliation combined! And at least half the NPA will be voting red.",
         "Unless it discourages more weak Kamala voters, that is!",
         "I’ve considered fireworks!",
         "been walking around the house all morning yellin this",
         "Wow! Broward country currently voting Red! Insane!\n\nhttps://x.com/ericldaugh/status/1853778450810548246?s=46\n\nFL probably going double digits",
         "i'm so happy about how much Florida's changed. It's no longer the must win battleground state that needs tons of resources to flip, it's a solid 29 electoral vote pickup. (Same with Ohio)\n\nMakes the path to 270 so much easier",
         "True, but there aren’t many of those around here. It needs to rain in Charlotte and the Triangle area 😂. ",
         "Even with the recent rain, it's too dry here.",
         "Probably because Republicans actually have jobs and want to vote before work!",
         "In this economy even the far-left have to report to work!"
      ]
   },
   "1gk57dr": {
      "title": "VOTE VOTE VOTE ",
      "text": "",
      "comments": [
         "For a safer world, for Freedom and for Peanut !",
         "This IS our last chance, especially now that Soros purchased 200 conservative radio stations that Biden fast tracted FCC approval for. We have NO control if the election is lost and will be fed lies for generations to come!"
      ]
   },
   "1gk9dm7": {
      "title": "This type of rhetoric makes the left look delusional. Oprah tells women voters that If they don't elect Kamala, they will lose voting rights.",
      "text": "",
      "comments": [
         "Imagine being so twisted that you can just come up with lies like this.",
         "This is something that is hilarious. Oprah LOVED Trump until he became president. Same with all the morons on the view.",
         "Who are the conspiracy theorists now?",
         "She's nuts.",
         "Scare tactics 101.",
         "Funny as she asked him.in the 80's to think of running for President.\n\nWas always good \"friends\" like other celebrities until you run, then the sour  faces come out.",
         "And yet the vast majority of Democrat voters actually believe this and more.  The truly believe Trump is Hitler, is a fascist, is a racist, will suppress voting rights across the board, is anti-abortion etc etc.\n\nWhen one actually listens to Trump, you understand, while flawed, he is about as centrist a POTUS as one can find on almost all topics and just doesn't knee jerk to a partisan position.  He may end up at a partisan position, but he takes a measured and logical approach to getting there....which is so unlike the Dems where they hate all things not-Dem because they don't know why....lol",
         "In a just society, this would be actionable slander.",
         "Those same people want to control \"disinformation\".",
         "They can't campaign on reality, so they just spew blatant lies. It's crazy how far off the reservation they've gone this campaign. Especially this past month.",
         "Just like last time?",
         "What a load of horseshit.",
         "What universe is this Billionaire in?",
         "She recruited for Jeffery Epstein, \n\nPedophile pile of human waste.",
         "I don't care what the content is.\n\nI will never upvote anything Oprah says.\n\nSTAY FOCUSED.\n\nCALL YOUR CONTACTS IN SWING STATES.",
         "I love rhetoric like this. It drives sane, moderate voters away.",
         "This sure borders on incitement, and if Trump does win and violence breaks out, I would support a criminal indictment for Oprah and a few other Hollywood people.  Joe said this would happen, so we got to listen.",
         "Sounds like something you'd hear out of her. She'a at that stage in her life where The View would probably suit her well",
         "The same Oprah who welcomed Trump on her show with a hug and music and applause.... when he was on \"her\" side. \n\nThese people are disgusting",
         "Oprah has had a terminal case of TDS for years, lol. She's unhinged, and it's scary that she has influence over people.",
         "[removed]",
         "You can't just arbitrarily take away a constitutional right.\n\nHow do these people not understand this.",
         "Maybe they should.",
         "“The party of joy” in action lol",
         "Brought to you by the same people who openly call for throwing people in jail for spreading misinformation.",
         "Because Conservative women don't exist to the left.",
         "Our society needs to be better at penalizing this kind of lunacy.",
         "Thankfully people aren't buying that like they expected.",
         "They're telling on themselves again.",
         "This is all they have. They can't get people to vote for them based on their policy or track record, so they just fear monger and scare the hell out of people to get them to vote for them",
         "She’s just salty because Trump did not, in fact, choose her to be VP.\n\n[Oprah](https://www.youtube.com/watch?v=ky43cKxg3SU)",
         "While our side is being pulled over for the placement of a comma or the crossing of a T, their side is delivering verbal *bad acid trips* to an effectively global audience.\n\nPolitical correctness is just a rule that says we have to yield to collectivism.",
         "She knows there will be no consequences or accountability.",
         "Well they can't campaign on policies also.  Notice how during the entirety of Biden's presidency and now Kamala's campaigning we always hear \"Joe is working very hard on \\_\\_\\_\\_\" or \"We are working to make sure \\_\\_\\_\\_\"\n\nBUT THEY NEVER EXPLAIN THEIR PROCESS!  It's always a forecast or a pipe dream...never \"We are going to do this by doing this this and this and the goal is to provide this that and some of this\"\n\nEverything is behind closed doors.  Nothing about their processes are laid out.  It's always just a message of \"Trust us, we are totally doing this and we are totally working hard on it\"\n\nDemocrats are working too hard figuring out how to launder taxpayer money than to actually DO things.",
         "The one in which she has less privilege than a random Swiss retailer worker.",
         "I have bad news for you...\n\nOprah is a terrible person no one should take seriously, and yet, wildly popular. :/\n\nThe crazies are the ones hearing this, moderates, probably not even on their radars at all.",
         "We need to do the same thing.\n\n\"If Kamala is elected all males will be subservient to females.  Men will not be allowed into higher education.\"",
         "Not apostrophes though, those are (D)ifferent."
      ]
   },
   "1gk1643": {
      "title": "Thus ends the last MAGA rally, get out and VOTE! ",
      "text": "President Trump needs you, needs all of us. Get out and vote people. We cannot have 4 more years of this disastrous administration in office. ",
      "comments": [
         "Just turned 18, first vote",
         "Did my part to try and turn Michigan red. We cannot have 4 more years of Kamala. I know SO MANY people at work voting Trump who voted Biden its crazy. We WILL win.",
         "In Ohio, but did my part still.",
         "Voting for President Trump for the 3rd time in a few hours!",
         "We really won’t have a country if we don’t vote out Kamala. The reckless border policy will continue and next time there won’t be enough citizen votes to ever oppose the machine. There is no other country left to go to. Vote!!",
         "I'm not even a conservative.  I am a pro-choice, atheist Libertarian.  And I am voting for Trump tomorrow.  I am voting for Trump for two reasons: 1) the Biden/Harris Administration has lorded over the ugliest bastardization and overreach of government in my lifetime 2) Trump has managed to align himself with all the people who I believe will fight against the rot and corruption in DC.  Honestly, I cannot wait to see what existential horror awaits the democrats and the old guard neocons.  I think Trump will be much more of a gentlemen about it than he should be, but I hope he does make the next four years painful for them.  ",
         "Sucks to see five thirty eight go from Trump to very narrow Kamala win but hoping I wake up to better news tomorrow! Please vote!",
         "This will be my first time voting. Getting out of work in a couple of hours, right when the polls open near me.",
         "I voted early in NC for trump. Rip peanut",
         "Voting tomorrow! (IL)",
         "He needs to win. Show up today and take our country back.",
         "This is the proudest vote I've ever cast.",
         "Voting for 45 for the second time tomorrow \n\nGodspeed Mr. President",
         "Just voted in a deep blue state. Even so, feels great to vote for Trump/Vance.\n\nThose in states that will make a difference, please get out and vote no matter what. Even if you're in a deep blue state go vote and let's pad the general election numbers.",
         "Did my part and voted early, don't wait till the last minute today people! 4 years of Kamala would make Joe look like child's play; Lets turn #45 into #47!",
         "Was number 10 in line at opening for my district.",
         "I’m bartending tonight , outta be fun lol",
         "I did my part and got my mother who's apolitical to register and vote for Trump.\n\n(My first time too, as i just assumed he'd win my state easily and there'd be no point but this year, i had a change of heart)",
         "I've flown my flag upside down ever since they took the mug shot. Hopefully that will change after today.",
         "If Harris wins we are essentially in a dictatorship. It will be Obamas 4th term. If they can get 4, there is no way they ever relinquish power and it will be 5,6,7, and so on. \n\nHarris winning would mean one of two things:   \n1. The majority of people in the US actually want this, or  \n2. Those in charge can get away with anything, and will continue to do so.",
         "I proudly voted by mail weeks ago.",
         "Yes people we can’t do 4 more years of Harris, Vote TRUMP!!!!",
         "It will NOT be the last MAGA rally, only the last one with Trump at the top of the ticket. MAGA and American First is more than just him now. We are a unified movement. This is not the end, it is only the beginning. \n\nIf we win, we have a deep bench to continue the legacy. \n\nIf we loose, we are a loud and proud movement. Are you going to roll over and take what the deep state tries to dish out? No! I’m not, and we’re strong if we stand together. Our eyes are open, and we’re not going back to sleep. \n\nMAGA for the Future! America First for the Future!",
         "Good luck to all honest agents, both sides",
         "Last Trump rally... sad. It's the end of an era, but God willing, we will still have four more years of him in office ahead. Maybe he can throw the occasional rally as president just for fun. :)\n\nI'm sure we'll have good MAGA people ready to lead for future elections, like Vance and DeSantis, but there will never be another Trump. He is something special. A once in a century kind of president.",
         "No, this is the beginning of the 4 year MAGA rally.  Go out and VOTE!",
         "Same bro, NC Trump vote here!",
         "I also was able to vote for the first time when I was 18. It was an amazing feeling. We were lucky!",
         "Let’s go!!! High ho silver!\n\nhttps://youtu.be/GqHNZPkl0qE?si=TIAd9dK2hibV5Wqh",
         "Really wish i could be voting in a swing state... i'm stuck in Washington feeling like my vote is pointless, and all i can do is pray that folks like you get out there and have Trump's back. Thanks for doing your part brother🫡",
         "Was driving through Michigan with family in 2016, en route to Traverse City.  Along the way, we noticed a ton of Trump signs; nary a Hillary sign.  At some point I commented, *\"Call me crazy, but looks like the polls may be wrong.\"*\n\nCouldn't make the trip this year, but the family did.  Asked dad about the signs.  He admitted, *\"Looks like 2016.\"*",
         "Dixville Notch New Hampshire 50% swing right! From 5-0 dem in 2020 to 3-3 Trump.\n\nhttps://x.com/ericldaugh/status/1853770565791687053?s=46\n\nGo go go!",
         "Just did my part too",
         "This will be the third time he has won",
         "That’s my thing. We’re different. Your atheist & im Christian. But we can share some similarities, we can be civil. I feel Harris aligned herself with Hollywood celebrities who aren’t remotely affected by inflation. Oh and a list of Diddy party attendees. I’m the same I hope trump unleashes hell on those that went after him. I’ve noticed a demeanor change with him. He seemed to be having fun. Doing things that resonate with the everyday people more.",
         "I'm sure that was a typo, but I hope you meant you're voting for Trump *today*, not tomorrow. :)",
         "So weird to see a steady Trump lead 1-2 weeks ago then many polls giving Harris a slight lead the final few days before the election. I wonder if it’s to bring momentum to the Democrats",
         "Can 538 even be trusted? I’ve been skeptical ever since ABC News bought them.",
         "I mean, they went from 52-48 Trump to 51-49 Harris.\n\nThat's barely a difference.  For all intents and purposes, it's 50/50.",
         "Did 538 ever go for Trump? The national polling always had Harris ahead, although today is the lowest she has ever been.",
         "going by 270towin at least, thankfully most of the polls are tied, a couple have Harris outright winning but others have Trump taking AZ and GA",
         "🙏🇺🇸",
         "And if the election is stolen again? What options do we have to take our country back?",
         "They never sent me my absentee and I’m too far away to drive as a college student ☹️",
         "No more Bush Cheney Romney warhawks, All republicans to embrace America First would be a dream",
         "Feels so wrong reading a Stephen King citation there.",
         "Its not pointless, vote in local elections, those are sometimes the most impactful ones.",
         "Even if you're in a deep blue or red state, your vote still matters, cause you're inching Trump ever so closer to a popular vote win",
         "Your vote still counts. Even if it just helps turn the popular vote, it makes a statement.",
         "Doesn't help when CNN, Ipsos, and Marist dump garbage polls two days before the election. Take heart - Atlas Intel and Rasmussen have been steady for weeks. Judging from Harris's campaign schedule - she is in real trouble in PA. We shall see.",
         "I think a lot of independents are breaking to Harris. I also think a lot of elderly women are like \"screw it, I want to see a woman president\"",
         "Maybe, Maybe not, they're as biased as everyone else.",
         "Wow, I just saw 1.2. Her biggest lead was around 3.7 in late Aug...post convention. I keep saying trends, people, look at the trends!",
         "100%  I live in Texas, a red state for many years, still need to fight the local fights, all votes matter.",
         "They are. That’s how Soros managed to be so influential in American politics. By funding local DAs and board elections.",
         "If Harris wins because women who want to legalize murdering babies push her over the finish line we deserve whatever ruin God brings down on us"
      ]
   },
   "1gk67ty": {
      "title": "Its confirmed, Imane Khelif medical report leaked. Read and decide for yourself.",
      "text": "",
      "comments": [
         "So typical, the left bashes people who say that this was clearly a man boxing in a woman’s sport and then the “correction” comes out later and gets buried.",
         "So everyone with eyes and a brain who had serious suspicions was right. \n\nAnd everyone who refuses to acknowledge the basic truths of biology who used this person as a sort of victory lap to dunk on us for being wrong were actually making fools of themselves. \n\nThis reminds me of when i heard there was a lab basically called “the wuhan covid 19 virus creation research facility” 20 feet away from the first reported covid 19 case and i said it probably leaked from that lab and got called racist.",
         "Another 'conspiracy' proven true. We are on a roll this year.",
         "They need to bring back chromosomal testing.  Why they stopped is beyond me.  You’re XX or XY.  I don’t want to hear about those 1 in 100 million people with some strange mutation going on.  We need to stop catering to the statistically extreme.  You know what?  If you’re one of those non xx or xy people, tough shit.  Such is life.",
         "Those poor girls he beat on, so sad.",
         "Oh, that gold medal boxer.\n\nThis was a \"duh\" moment at the Olympics, but obviously not to the Olympic committee.",
         "Not surprised.",
         "JFC ",
         "Also note that Imane is Algerian, where it is [illegal to be trans](https://www.equaldex.com/region/algeria).",
         "\"No Shit\"  comes to mind first",
         "Someone do a wellness check on the lib subs. Guess that doesn't really narrow it down huh",
         "My theory is some private high school should have a group of boys compete in girls basketball and obliterate a girls team with mostly POC on it.  The left will not know what to do.",
         "#That's a man baby",
         "From the first sentence the article is already incorrect:\n\n\"A shocking new development\"",
         "So an obvious situation gets proven to be true. Its in his name -I Man e!",
         "Tbh Conservative conspiracy theories are batting 1000 lately.",
         ">This reminds me of when i heard there was a lab basically called “the wuhan covid 19 virus creation research facility” 20 feet away from the first reported covid 19 case and i said it probably leaked from that lab and got called racist.\n\nIt's racist to think it came from a Chinese lab that was attempting highly advanced genetic manipulation techniques. It was obviously just a stroke of bad luck from those disgusting bat-eating Chinese peasants who wallow in their own filth.\n\nedit: Whoever downvoted this comment needs to recalibrate their sarcasm detector. JFC.",
         "The reason they stopped is because people went through their whole life and athletic career thinking they were women, qualified for the Olympics, and only found out they were XY when they got their medals taken away. This felt unfair to them, understandably, and the proposed fix was to expand the Olympic definition of women to include them. \n\nAnother possible solution would have been to check at an earlier stage if your Olympic hopeful is XY, so they don't get that nasty surprise on the podium. \n\nIt might not surprise you to learn that XY people who present as women are hugely overrepresented in women's athletics. So I guess they thought that excluding all the top performers would have damaged the cause.",
         "Actually I don't think so, I think they need to push ahead with this stuff, I'm cheering it on. It's radicalizing normies against the global communist agenda, and it's entirely inconsequential to me. It's exactly the kind of wedge issue the globalists themselves use against the common people, only this time its backfiring on them and we can use it against them.\n\nIt does harm female athletes themselves, but it's entirely up to them if they want to take a stand and put a stop to it or not, they could stand up and end it all tomorrow if they chose to. The rest of us shouldn't stick our necks out, just bathe in the flames of the dumpster fire.\n\nI want to see male and trans athletes dominate all womens' sports. Tennis, soccer, basketball, olympics, golf.",
         "In feel so bad for that one woman who was just besides herself during the Olympics. Imagine working your evoke life for this one brief opportunity to compete at the pinnacle of your profession only to be matched up to this monster. \n\nI’m so proud of this girls from UNLV that stood up for themselves and didn’t allow this to happen",
         "I hope women sue the Olympic committee, especially Angela Carini who took punches from Imane.",
         "Well, she's not trans, she was born that way, if this is true. You can't outlaw genetic mutations, lol.\n\n\nShould it have been allowed for her to compete? Hard to tell, it really is one of those extremely unlikely cases (again, if this report is true) that we keep hearing about in lgbt discussions.",
         "As if they’ll allow facts to stand in the way of their delusions",
         "No need. It will either get downvoted to oblivion or won’t even allowed to be posted. ",
         "You’re not wrong here.",
         "To be fair, Helen Keller could see he was a dude from a mile away.",
         "It seems to me that they would have got tested at some point before the olympics/world championship level.",
         "Fairness to a few special cases > fairness to every actual woman trying to compete.  Makes sense.",
         "In the mean time girls and women lose out on achievements they **earned**, lose scholarships, and in some sports get physically hurt.  But you dig the idea because it’ll “wake people up”, so fuck those girls and women.  \n\nNice…",
         "I think that is a little extreme.  The problem can be nipped in the bud now.",
         "Even with this news you still call him a \"she\"?\n\nImane Khelif was born a man, with all the parts men are born with. Regardless of the genetic mutation Imane shares nearly *nothing* with a women as far as his parts, bones, and muscles are concerned.  (Bone density, muscle mass...etc)  \n\n>Well, she's not trans, she was born that way, if this is true. You can't outlaw genetic mutations, lol.\n\nImane has XY chromosomes which means he has all the important male physical properties *important for boxing*.  There is no argument here that Imane could partake in this sport even with his genetic mutations.  Its not outlawing mutations, Imane is free to compete with other dudes.\n\n>Should it have been allowed for her to compete? Hard to tell, it really is one of those extremely unlikely cases (again, if this report is true) that we keep hearing about in lgbt discussions.\n\nThe cognitive dissonance here is insane.",
         "Well, the blind \"see\" by touch and feel.  And, all you had to do is feel for a nut sack.",
         "You'd think, right? It's even more blatant than sending an athlete full of steroids, if you know they're testing for that",
         "It's not being nipped.",
         "> Even with this news \n\nWas this confirmed by any serious news source?\n\n> The cognitive dissonance here is insane.\n\nWhere's the dissonance? I don't like trans being pushed on kids, but at the same time we need to have compassion for people with actual issues. Also, I don't think men should be in women sports.",
         "Maybe this was an issue at the time.  I don’t know how expensive genetic testing was 20 years ago, but it’s cheap now.",
         "I think it will be in the next couple of years once the novelty wears off for the virtue signalers."
      ]
   },
   "1gk50zm": {
      "title": "Trump's Final Message to America: 'We Do Not Have to Live This Way'",
      "text": "",
      "comments": [
         "I’m ready.\n\nLet’s get started making America great again! \n\nMAGA 🇺🇸🇺🇸🇺🇸",
         "MAGA",
         "Last night final door knocking, a household told us, we don’t want to live 4 more years of this. Hopefully voters will show up to vote for Trump and not an accident of voting machine issue or closing polls etc"
      ]
   },
   "1gk6egh": {
      "title": "Elon Musk warns if Harris wins she will 'sic the DOJ' on X to shut it down",
      "text": "",
      "comments": [
         "I believe it. If they win they will really clamp down on free speech since they are realizing that alternative media threatens their control on the narrative.",
         "And Rogan. Anyone that almost cost her the election or would be an issue in the future.",
         "We desperately need X, it's one of the last places free speech exists",
         "100% they have plans on doing it.",
         "Make the Ministry of Truth fiction again!",
         "TRUTH!....we can already see it happening!!!...truth is NOT the truth, truth is what the media and government TELL you it is!!...anything outside of 'their' narrative is considered false information, violent and hateful.....\n\nSoros must purchased 200 conservative radio stations with the help of Biden pushing it through the FCC...free speech is no longer free :(",
         "They already did!  How many investigations are ongoing by the commies?",
         "Just imagine what they are going to do to ordinary Americans.",
         "The idea that one side would actively suppress journalism/reporting they don't like, via government intervention no less, is absolutely sickening to me.\n\nI don't know how anyone could support that.",
         "Because they don't like what's being said so shut it down."
      ]
   },
   "1gkb2lt": {
      "title": "Odds on Donald Trump winning US election soar to 62% hours after polls open as Americans pile in on The Don beating Kamala",
      "text": "",
      "comments": [
         "When I voted just now all the right answers had an R next to them when I was filling in all the bubbles.\n\nMade it really easy and fast!",
         "I won't believe it until it's fully declared. Get out and vote.",
         "Have never seen lines like this in my life. MEN GO VOTE AND KEEP VOTING UNTIL WE TURN AMERICA RED! 🇺🇸",
         "I honesty hate these articles. Don't trust the polls vote.",
         "It's not just about whether you like the candidate. It's about the future. Our children. Freedom or communism. So yeah, if you haven't yet - get out and vote! MAGA",
         "Voted early but I love seeing the swarm, it banishes any idea of election day being Dems' day when we got all our stuff up front. We need to speak so loudly and clearly that any crooked actors behind the scenes start saying *\"you know what, forget this\"* instead of saying to themselves *\"it's GO time!\"*",
         "Betting odds have been slightly dropping since. Getting a bit nervous.",
         "This is a step removed from even the polls, it's betting markets that use polls for people to get information. ",
         "If it makes you feel better, they aren't odds.  They trade more like stocks.  It's profit taking.  The people betting are degenerate gamblers and have no more info than anyone else.",
         "I know.",
         "Betting odds are historically more accurate than polls.  Partisanship is left at the door when it comes to making money.",
         "Maybe that used to be the case before online betting sites.  Go to predictit or polymarket and read the comments of the people betting.  It's more toxic than the worst of social media.  Partisanship runs wild."
      ]
   },
   "1gk9zjn": {
      "title": "Widespread voting problems reported in 2 heavily Republican Pennsylvania counties",
      "text": "",
      "comments": [
         "We need to go 100% paper ballots.",
         "they better fucking fix this shit I stg",
         "Arizona is watching closely, this happens at their conservative polls all the time too. Accidentally, of course.",
         "The saving grace is we use paper ballots in PA, so they can be scanned once the machines are fixed.",
         "And so the steal begins.  Have you ever seen a report in the news about voting machine problems in a democratic voting district?  No?  Me either.  It's not a coincidence.  In fact it's all planned well ahead of time",
         "**The Cambria County Board of Election learned early this morning that a software malfunction in the County’s Electronic Voting System has prevented voters from scanning their ballots**",
         "Thankfully we have a new RNC chairman in Michael Whatley, they’ve been on top of any issues and keeping everyone updated. GO VOTE.",
         "This is why Kamala didn’t pick Shapiro, she needed someone high up to help her cheat here",
         "A friend of mine is active duty military with his home of record in PA.  The mail in ballot arrived a few weeks ago and it said “unofficial ballot” on the top.   He called and asked why they told him it would be fine.   Why would they said and an unofficial ballot to an out of state service member?",
         "More of a \"Malfukution\"",
         "Suprise suprise",
         "And so it begins",
         "Noooo you're joking.... 🙄\n\nOf course there is issues at Republican locations not at Democrat locations. \n\nHopefully Chairman Whatley is on it as I hear he did send out teams on the ground and people on the ground to report issues immediately so they can take action. \n\nWe shall see....more strong letters or wagging fingers or real hard as nails action.",
         "This is why voting early was important. The same thing happened in Arizona in 2022.",
         "These are paper ballots.  The scanner of the paper ballots isn’t working.",
         "[removed]",
         "Since she shafted Shapiro he should immediately have this investigated and when they find the people who \"just happened\" to cause the malfunction they should be arrested",
         "I don’t think Shapiro is going to bend over backwards to help Kamala. Dude is focused on running in 2028. Much easier to win if Kamala loses this election. Not saying he wants her to lose, just saying he’s probably not going to try too hard to help her",
         "Yeah this is ultimately not a big deal, no need to blow this out of porportion.\n\nIt's all paper ballots in Pennsylvania, and the courts granted an extension in the counties impacted by the issue. All it really means is we may see a delay in the count from those counties.",
         "Unfortunately, he doesn’t want to step too outside the dem circle. there’s no doubt he’s setting himself up for a 2028 run, and if he goes against the status quo now, he’ll go the way of Biden",
         "I understand people not wanting to put their ballot in a box to be counted later once they are working given it’s another set of hands touching their vote, but lots of places don’t have you scan your own ballot.",
         ">All it really means is we may see a delay in the count from those counties.\n\nYou say this like it isn't a big deal. We've had a whole week or more to vote. The count needs to be done. The longer it takes, the more opportunities for fraud and impropriety.",
         "Means we will get a nice big dump of Republican votes late at night for once, nice!"
      ]
   },
   "1gjw31l": {
      "title": "It’s JOEVER",
      "text": "",
      "comments": [
         "I'm sure after interviewing fetterman he decided he needed to lol.",
         "As someone who has been listening to Rogan since he was recording in his house this is a wild time. Never thought in my lifetime Rogan would endorse Donald Trump for president.",
         "And the official New Hampshire Libertarian Party endorsed Trump.\n\nI feel like that's bigger news. New Hampshire has more Libertarians than any other state in America (as a % of the total voter base), and NH is IN PLAY if Trump can outperform by just 3-4%.",
         "Would have been nice if it was 3 or 4 days ago!",
         "Finally",
         "LET\"S FUCKING VOTE! THIS IS FOR P'NUT!",
         "This is a great endorsement but I’m worried about female voter turnout for the GOP.",
         "oh fuck!!!",
         "Hot damn, the slogan makes a strong comeback!",
         "Bro jogan we praise you",
         "Will this actually sway people?!",
         "Again. Like I said. Rogan effect. This will drive more men to vote",
         "🇺🇸",
         "Woohoo!",
         "“GET OFF YOUR ASS HARRY” VOTE!!! Our lives depend on it! 🇺🇸",
         "Joever and Hoever. Never been so over.",
         "Do endorsements actually do anything? Seriously asking. I vote for who I want, IDGAF who someone endorses",
         "I feel like Trump has so much momentum that if he wins an EC landslide I wouldn't be surprised but I am still nervous",
         "Glad to have him but who cares about a celebrity endorsement?",
         "I have no idea who's going to win, but this coalition is ... fascinating.\n\nI can't be the only one curious about Elon and D.O.G.E.",
         "The most feckless endorsement ever.  Maybe a week ago would've been useful, but nobody is voting on election day anymore (which is another gripe of mine).",
         "Fetterman is the least troublesome of Democrats IMO. He seems to have a lot of common sense and has recovered well from the stroke. \n\nI’d never vote for the guy, be he seems like an okay, genuine dude who’s willing to buck his party for what he believes in. I wish we had more transparent politicians like him.",
         "I remember all the times he said he would NEVER have trump on his podcast due to the controversy. The moment i saw he had him on, i knew rogan realizes how important this election is",
         "Because the last 4 years has really pulled the wool back from over the eyes of a lot of middle aged -- older Americans and exposed a lot of the corrupt and tyrannical motivation and policies of the Left. Middle Aged and older Americans remember a time when being American was awesome, when people loved their country, was seeing real strides in overcoming the last slivers of racism, and remember their schooling on the Constitution, Bill of Rights, and know what freedom, liberty, and the pursuit of happiness is really all about. It's no wonder people who aren't already radical leftist, aren't bougie elitists, or Hollywood pervs are changing their minds about what they were spoon-fed as reality.",
         "ALOT of people came out for trump this time around than even in 2016 and 2020....This time we really need to save this beautiful country from the woke left.",
         "Please God let NH be in play.\n\nIf we could flip that it would be a massive help",
         "Libertarian here: Sometimes the NH libertarian can be wacko’s but other times they are pretty based. This is the latter. \n\nA lot of conservatives completely missed who the libertarians “voted for” on their on primary for party ticket. Dave Smith said there was nothing amiss but there’s a part of me that think Oliver was picked just so he wouldn’t siphon votes away from Trump. \n\nOliver is the least popular libertarian with right leaning libertarians and libertarians in a while because of things he’s said and done in the past. When you have support of Dave Smith + Massie + a possibility of Ron Paul cutting government spending + the opposing candidate being a massive gun grabber it makes choices very very easy.  \n\nThe people who vote libertarian this year aren’t going to be the normal people who vote libertarian. They likely are going to be disenfranchised democrats as a protest vote.",
         "People on the fence are likely to wait til the last minute anyway",
         "Nah probably best the night before the election tbh to drive turnout",
         "I actually don't mind it. There's been a lot of effort over the last few days to try and tank Trump's momentum and push a \"Trump's stalled, Harris is on the rise!\" narrative.\n\nBy making today a good day for Trump there's no time left for the MSM to try and shift the narrative again.",
         "Internet age, baby. Three of four days would have had its advantages too, but there is a lot of upside to this type of thing the night before.",
         "Undecided voters, as well as people rightly worried about election fraud, generally don't vote early. \n\nThis is a great time to drive conservative turnout.",
         "I think he was waiting cause he wanted to get Kamala on. She 100% wouldn’t have come on after a public endorsement.",
         "Honestly, this is a massive, massive W for Trump. Can't wait for tomorrow 😎",
         "**LETS GO!**",
         "PNut was an American Hero! 🇺🇸 He went down fighting! Tomorrow we fight for him!",
         "It's offset by the lack of male turnout for the dems. Not great but will help balance what is already going to probably be the biggest gender gap in politics in a long time.",
         "This female is currently waiting in line in PA to vote straight red",
         "I think Trump's campaign is too. They got Megyn Kelly to endorse Trump at his Pittsburgh rally tonight (she had already endorsed him on her show). At the Reading rally I attended Monday, they put a wall of women with pink \"Women for Trump\" signs right behind him. And they've been using a lot of female speakers in recent rallies, Tulsi Gabbard, Lara Trump, Sarah Huckabee Sanders. In Reading, they also had a female campaign staffer give a speech who I had never heard of before (all I remember now is she said her parents immigrated from Russia).",
         "White women largely skew red as a whole",
         "Not meant to sway. Meant to drive turn out.",
         "I think that it actually will sway a fair number of holdouts, and drive turnout.\n\nJoe is a HUGE voice. He is bigger and more trusted than all the A-list celebrities combined. 50 million listeners, hundreds of millions of impressions on his social media posts - mostly all 18-35 year old dudes who have a low voting %.",
         "This will drive people to the polls...big dick energy. Hell yes.",
         "Dude has massive pull in the young male demographic. ",
         "I doubt a celebrity endorsement does. An endorsement from a fellow, popular politician means a LOT though. Trump got a ton of candidates to win in primaries by endorsing them as the preferred MAGA candidates.",
         "Democrats will vote for who a celebrity tells them because they’re simple minded. But less simple minded people I could see being pushed to vote by a Rogan endorsement because he’s not just a mindless “celebrity”, but rather an intelligent human being that people listen to his opinions on as they put trust in things he says.",
         "Pennsylvania is. All we have for early voting are mail-in ballots, and a hamfisted way of voting \"in person\" by going to the county office to get your mail-in vote and filling it out there. It's extremely inconvenient. GOP early voting numbers had a small increase in PA this year compared to other states. Election day will still rule the day in PA for the GOP and Trump. I could see this endorsement swaying some young male voters in PA who may still be on the fence. Maybe college kids who are on the white collar path. The sensibility in PA is a good fit with Joe Rogan. People are pretty independent and anti-establishment here.",
         "Yes I agree with all that... However Joe made him admit the border stuff is all BS and with Joe being in Texas I would feel like Joe feels strongly about border security.",
         "I think people believed this when he spoke out against antisemitism, but his appearance on Rogan convinced me he still shouldn't be in Congress. As soon as the topics around immigration and voting integrity started, he seemed to not just fall into the Democrat trope replies, but answer a different question than was asked. It seemed like either his transcriptions were off, he wasn't understanding the questions, or he was intentionally trying to avoid them.\n\nThis was a one-on-one, casual conversation. The idea that he had transcription problems or didn't understand the topic are both bad, given he should be operating in busier, noisier environments. He made comments on Rogan's show about doing better following music he knows better than stuff that's new. I think he struggles with unfamiliar topics or ideas still, and that he showed difficulties in following the conversation properly on there. Despite having respect for him on a personal level, I think he just isn't in a good enough state to trust in that position.",
         "> Fetterman is the least troublesome of Democrats IMO. He seems to have a lot of common sense and has recovered well from the stroke.\n> \n> \n> \n> I’d never vote for the guy, be he seems like an okay, genuine dude who’s willing to buck his party for what he believes in. I wish we had more transparent politicians like him.\n\nIt's all an act to retain voters. Despite what he says, he still votes the same as all other Democrats on everything. It's the same as when Democrats say \"I support the 2nd amendment\" but go and vote in support of every 2nd amendment restriction bill they come across. Actions speak louder than words.",
         "No, it’s all an act because he’s in a purple state. Just like Baldwin, Tester, and every other “common sense” democrat, Fetterman votes at a 95%+ clip with the other Democrats. He votes straight in line with Warren, Sanders, Schumer, and all the other far left wackos. Fetterman is NOT to be trusted. Always check the voting record!  \n\nThe only Democrats you can trust to think independently and regularly break from the leftist insanity is Krysten Sinema (who left the Dems in 2022 to become an independent and is not running for re-election) and Joe Manchin (who left the Dems this year to become an independent and is also not running for reelection). ALL the rest of the Dem senators are party shills.",
         ">and has recovered well from the stroke. \n\nI noticed this from a clip shared from a segment he did the other day on one of the news channels. His speech has really come a long way. I'm happy he's made great strides in his recovery.",
         "He wasn't transparent about voter ID lmao",
         "This is his podcast with Fetterman in python code: \n\nWhile true:\n\nprint(\"Ok, Immigration is a good thing, but you say you want a secure border, what should we do to secure it?\" )\n\nprint(\"Well, you gotta start with saying immigration is a good thing.\")",
         "Yeah for sure",
         "With New Hampshire and the Sun Belt Trump wins and doesn’t have to win any of the Upper Rust Belt states.",
         "I'm not a libertarian, but I listen to a lot of Dave Smith and it makes sense why more Libertarians are likely voting with Republicans. Seems like a perfect storm of a terrible LP candidate and the left completely losing their marbles. I honestly don't understand how someone like chase oliver even got the nomination.\n \nIt was funny Dave Smith was thanking God that he ended up dropping out because he would have pulled a lot of votes from Trump and would likely tilt the elections to the Dems. Funny how things work out. ",
         "My thoughts exactly. The downside to doing it this late is he’ll lose out on changing the minds of those who already voted but the upside is the media can’t drown it out (at least not as well) so this will be in people’s heads when they vote. \n\nI hope the calculus pans out in our favor. Like Musk said, if Harris wins our elections will be reduced to Democrat primaries.",
         "Along those lines, Nate Silver and 538, at the literal last minute, just changed their election model predictions to Harris. They had been Trump for at least a month, it seems like. I don't know if it's a conspiracy or a function of the polls. Still seems fishy, since the polls don't seem to have changed much in the last few days, except for the wild Selzer Iowa poll. They gave Harris the slimmest margin over Trump. So it seems like they want to give Harris a publicity bump, while still being able to claim they had \"barely\" given her the edge if she loses.",
         "Not necessarily in states where registration is not allowed on election day, if you're trying to motivate first-time voters. Of the swing states, only Wisconsin and Nevada apparently have \"easy\" same-day registration. Michigan looks like you have to go to your county office to do it, a trek an apathetic voter is not likely to make.",
         "Mark Cuban didn’t help himself by the women comment",
         "Do you think it will?",
         "Great point tbh, I hadn’t considered that",
         "Problem is they can't register to vote in most of the swing states anymore. Not in Pennsylvania, the most important one. I would also think Rogan being friendly and agreeable with Trump in his interview would've already swayed them if they were on the fence.",
         "I listened to the whole interview and I have no idea what you're referring to. Trump never said any such thing.",
         "I seriously get the feeling when he is being less DNC line carrier, and more common sense American - it’s because his mental issues have him forgetting, or his filter is “broken”.",
         "Shit politics, but happy for the dude and his family",
         "I never wish for poor health for anyone, so I'm always happy to see a recovery story going well. That said, I do not trust him politically, and I will always feel that it was ridiculously irresponsible to continue to run for office in his condition. \n\nAlthough I guess his cognitive health doesn't really seem to matter that much. I know that as far as voting goes he is just a democrat rubber stamp, and the public there would vote for a shoebox of dead spark plugs if it had a D next to its name.",
         "I don't think anyone who cares about his opinion would have voted for Kamala. He's been pretty critical and the things he cares about clearly don't line up with the left's current platform. \n\n\nI think this is more about getting apathetic men out to vote and doing the endorsement as late as possible for them makes sense. \n\n\nIt would have been awesome though if Kamala had have done the show and then Joe came out soon after to endorse Trump, that would've been the ultimate middle finger. ",
         "Pretty much. Also, Reddit tries to call RealClearPolitics right wing propaganda but its averages by state were much closer to the actual result than 538 was in 2020. \n\n\nIf we go off of RCP, Trump is ahead in enough states to win. \n\n\nNate's model also conveniently barely factors in national polls when the truth is if Trump is within two points of winning the popular vote he almost certainly wins the presidency. ",
         "Republicans need men to turn out tomorrow in order to win and this puts a jolt in a respectable portion of male voters who are indifferent towards politics but would go vote for Trump if given the right push",
         "Yes, creating hype works.",
         "What it does is provide motivation to the guys who say \"leave me alone I just want to watch sports.\"\n\nThey aren't listening to political talk, probably because it's been glowing radioactive for a decade, but they'll listen to JRE.",
         "10k voters could make the difference, yes",
         "In the comments you are responding to, they were talking about Fetterman.",
         "Funny thing, you'd never see this chain of well meaning wishes if Fetterman was a republican and dems were talking about him. Shows how unhinged they've become.",
         "Great point"
      ]
   },
   "1gk7rli": {
      "title": "ELECTION 2024 COVERAGE - Updates here all day 🇺🇸",
      "text": "",
      "comments": [
         "Is this a r/Conservative gameday live thread or do we have one?",
         "Praying that no pipes burst in battleground state ballot rooms 🙏",
         "Let’s go!",
         "Feeling really good about Georgia (my home state) and North Carolina. Hopefully they are a bellwether for the election. \n\nVery, very nervous about PA, MI, and WI. \n\nPennsylvania bros how are we looking??",
         "OK, this thumbnail is just gold.",
         "Go VOTE!!!!! Lets put trump back in office!",
         "If President Trump will win, don't rub it in the face of the liberals very much. Their hate (which is manufactured by the mainstream media mostly) is one of the components that will make that possible.",
         "Put on your war face!!",
         "Needs to win one of the rust belts",
         "I need a shot of Liberal Tears Tomorrow!!",
         "That's what I'm looking for rn\n\nLooks like op took the initiative before the mods, we'll see what they do",
         "It will be made later in the day. We are busy organizing that and our discord (which is surging right now in activity).",
         "The title of my post was simply the title of the Not The Bee webpage.",
         "Following, I've also been spending a lot of time on X, watching the boots-on-the-ground videos.",
         "MODS make it official!",
         "I’ve got a sneaking suspicion we’re gonna sweep Idaho. 🇺🇸",
         "PA looks as solid as it did in 2016 if you’re judging just based on the margin of signs you see on lawns.  It was a solid indicator in 2016 even when polls disagreed.",
         "As much as I want too this is the best advice. ",
         "Not gonna lie dawg, I don’t think I have that level of self control. \n\n\nWe’ve had people gaslight and crow to us about how great things are the past four years and how Trump was going to die in prison and the rest of us ~~deplorables~~ **garbage** aren’t far behind him.  \n\n\nIf he wins I’m going to be so insufferable to those folks.",
         "Trump will win Ohio",
         "Sorry, the Seltzer poll indicates a 100% sweep for Kamala",
         "I know that's a hard thing to do. But that will be a historic possibility to tone down the division in the American society. These are very perilous times, and more division will be detrimental to America.",
         "Botched by all the mail in ballots!"
      ]
   },
   "1gk7q2v": {
      "title": "Turnout is going to be HISTORIC here in PA and nationwide!",
      "text": "I’m at my little podunk voting location here in Berks County, PA (I’m about 1 hour drive from Philly) and there’s usually like 4 people in here…there’s like 80 people in this place which I’ve never seen in 10 years living here. It’s the social hall of a fire station and the line wraps around the entire inner perimeter of the hall. I think this turnout may beat all records.",
      "comments": [
         "Good, we gotta make it too big to rig",
         "Solid red Trump support or is there a mix of Kamaltoes in there?",
         "Good. PA needs to be landslide because it is already known as the state deciding the election, and since early voting there has already shown Trump in the lead, the Harris campaign has already tried claiming that we won't know the results in PA for several days.",
         "Glad there's no Fat Ass Harry's there! \n\nHelp us PA, your holding our life's in your hands!",
         "My fiance and I voted Trump in PA today ❤️🇺🇸",
         "An overwhelming victory would be excellent, but still skeptical of any victory until it’s certain.\n\nPopular vote and down ballot are always in play regardless. Take someone with you, wait in line and vote!",
         "I'm in a blue AF county (Dane Co, Wisconsin) and even here I saw a couple trucks with Trump flags and folks MAGA hats.\n\n###Too Big to RIG -- let's go!",
         "This sounds like the elusive Trump vote that doesn't show up in the polling.  We'll see, but the there's been some pollsters talking about how they think they're missing something in the polling again.",
         "Don’t forget the fuckery happening in Lancaster as well (and God knows where else). Republicans really do need to win by a wide margin here",
         "Yeah we can all hope they’re underpolling Trump voters again like they did in 2016 and 2020. If so, it’s gotta be a huge Trump win."
      ]
   },
   "1gjxu1e": {
      "title": "Heavy downvoting from Marxist troll farms",
      "text": "Kamala trolls are in full swing inside our Sub. Keep your head UP and go vote and let’s defeat them once and for all. WE MUST PREVAIL DECISIVELY! 🇺🇸🇺🇸🇺🇸\n\nTomorrow we will end the cancerous Obama Marxist experiment once and for all. THEY ARE PANICKING!\n\nTrump has run the greatest campaign in American history! We will never see anything like it again! LETS WIN! 🇺🇸🇺🇸🇺🇸",
      "comments": [
         "Reddit is nothing more than a Bot Farm.  Getting on any political post at this point is an endless stream of undifferentiated thought.  No hot takes.  No dissenting opinions.  No creative thought.  No unique ideas.  No neutral perspectives.  This reminds me of Reddit during the height of the pandemic, when you got instantly banned from almost every sub for saying true but inconvenient-for-the-forced-narrative things like \"the vaccine doesn't stop the spread of the virus\".  The overall site is garbage.  I honestly don't know why I come back.",
         "fight fight fight",
         "Even on this sub my comments start off downvoted before trickling back upwards. Crazy.",
         "Not surprised, This vid for a fantastic ad for Trump \n\nhttps://youtu.be/ypaLXHzpOj4?si=Hde6YbPhapMUnqbm\n\nHas been posted here and was instantly down voted that you couldn't see it.\n\nJust wait till tomorrow, if Trump wins which of course most of us want him to, the down votes will be on steroids and everyone will be getting one.",
         "When the brigade is going badly I recommend posting more often than normal. You can post up to four times per hour, even if all four are right after another.\n\nThe websites leftists use to pay for downvotes charge by the downvote, rather than by the hour of labor. So more posts means you drain their pre-paid account more quickly. Because posts downvoted to “zero” tend to have more than one downvote, when there is more posts, paid brigading is more costly than when there are just a few posts, but with some upvotes.\n\nThat is a strategy against paid brigading, but it is not as effective against volunteer brigading. To wear them out, you’d need even more posts.\n\nWhen the brigading is really bad, the mods might consider putting a sticky note up announcing that the four posts per hour limit has been suspended temporarily. Then conservatives could just post dozens of links each at a time until eventually it wears out the brigade.\n\nWould this actually work? I don’t know, but it would be interesting to give it a try.\n\nAll leftists need is a credit card, and there are white collar workers in third world countries who will be happy to downvote whatever they want.\n\nSome Reddit users have described in the past spending what appears to be in the thousands of dollars on paid votes. It isn’t cheap to put food on the table for hundreds of people halfway around the world.\n\nThe cost of 50 downvotes is $16.99, which comes out to $0.3398 per downvote. According to [https://www.numbeo.com/cost-of-living/country\\_result.jsp?country=India&displayCurrency=USD](https://www.numbeo.com/cost-of-living/country_result.jsp?country=India&displayCurrency=USD) , one pound of white rice in India costs $0.33.\n\nI don’t know how much of the fee actually reaches the base level worker, but even if it is only half, it still adds up over time.\n\nPaid Reddit voting makes you think about the kind of people who pay for downvotes. Same kind of people that might mess with an actual real life election.\n\nBut I accept that Reddit is twisted as sort of a fact of life. What I’d be interested in seeing is a stickied title modeled as a charitable drive.\n\nLike\n\n**Today lets try and feed people from far off lands. Posting frequency limit is suspended for the next 24 hours. Post away so leftists employ people who need money more than they do.**",
         "Remember that Reddit only allows brigading in right wing subs",
         "When you don’t work and have no life I guess you have to find ways to stay busy! I pity them!",
         "They are so weak with no testosterone that it takes them 3-4 times pushing the downvote button to actually work.",
         "Their education system failed them.",
         "Voted DJT and down ballot red.\n\n\nGod Bless America!",
         "Lefties gonna hate",
         "The devil works hard but Kamala works way harder. What a pitiful last ditch effort haha.",
         "They're too busy engaging in election interference by suppressing posts on Reddit",
         "Good. they'll be crying on wednesday.  I imagine they'll do something insane.",
         "MAGA 🇺🇸",
         "Let them cry a river after tomorrow",
         "Vote Donald J Trump tomorrow if you love America",
         "I've been commenting here for the last couple months and only the last day or two I have started getting DMs trying to change my views and some hateful DMs also.",
         "\"troll farms\" - for when your position is so terrible, you need to artificially create negative optics to fight the opposite view point.\n\nLOSERS",
         "They literally use staffers and volunteers to astroturf Reddit.  It’s pathetic and undemocratic, (while, funnily enough, very Democratic)but hey, that’s show biz baby!",
         "Stay strong, fellow racist deplorable fascist pieces of garbage! Let’s get out there and re-elect the convicted felon mothertrucker already!!",
         "They are in every sub :/",
         "Kamala's staff are really active with the astroturf right now it seems!",
         "I look forward to seeing these freaks screech and cry if they lose.",
         "They're gonna seethe hard tomorrow lmao 😂",
         "GOD BLESS YOU GOD BLESS DONALD TRUMP AND GOD BLESS AMERICA",
         "They think downvoting hurts my feelings  pfffft",
         "The panic is definitely real.  I did check up on the lefty subs and the language they use is \"there's still hope for kamala!\".  They are high on copium.",
         "I'm up in upvotes.   But the more I peruse reddit the more honor I get from receiving downvotes.   And I made a few comments in my local city's subreddit.   I'm ready to have a bad reputation in there for speaking truth.   But I'll avoid it the next few days after Trump wins.",
         "It’s Reddit, you should see the main page. Never seen nothing like it.",
         "It's reddit. What did you expect during election season?",
         "EVERYBODY in this sub needs to issue a rebuke of the left and get off your arse and vote.  You have to assume a smal amount of cheating is going to take place favoring the communists.  Make it so much of a victory, any of their cheating is irrelevant.",
         "We can do this. Not going to let them destroy the country.",
         "10 pm tomorrow the Kamala bots will disappear",
         "Liberal slacktivism at its finest. Can't count on them to critically think or recognize the dimensions of their own hypocrisy, but can always count on them to troll en masse on the internet - the only place they can find the courage fight.",
         "Gotta spend all that money",
         "Kamala’s team is distracting everyone from her interview with the Islamic influencer whose question about the war was dodged and she told him bacon was a spice.",
         "God Bless America and may God save our Republic in this election.  Trump '24!!! LFG!!!!!",
         "Go Vote Trump/Vance, you’ll feel better.",
         "I voted but nervous . I have a bad feeling it will end up a loss . God I hope I’m wrong and he wins . \n\nAt this point polls don’t matter, votes do.  Get out and vote and encourage your friends to vote and your family to vote .  I believe Elon, if Trump loses it’s the last election",
         "Thanks Reddit. All the downvoting this past year made me continue to vote for Trump even more",
         "all morning I've been driving my family up a wall.\n\n  \n\"KAMALA YA FIRED!!!!\"",
         "No matter how this turns out, the leftists won't be happy. They'll either have 4 more years of Trump and then he's gone for good, or they'll have 4 more years of him campaigning and then running again. As long as he's alive, he's the only candidate for the right.",
         "it's a hate site.",
         "Y’all know how the home feed sometimes recommend you subreddits? \n\nI got one pics sub post recommended to me which was another “I voted for Camala post”. I checked the comment section and a mod stickied their comment saying that post’s image was taken outside of Reddit.\n\nWhen even a pics mod acknowledges bot posts, you know it’s bad.",
         "The sad truth here is that this generation relies so much on social media, online dating, navigation apps...their entire being is fed to them. They have no beleifs or values other than upvotes. Sure, they may be conservative but out of fear of downvotes they will just go along with the narrative....",
         "Their covid banning was all I needed to know about the site. It really showed its true colors for the real totalitarians they are. Hopefully someday they’ll have some clarity to know it’s not healthy to live like that with constant hatred or where hate is their primary emotion.",
         ">The overall site is garbage. \n\nI came to this sub when the rest of the site was shut off one sub at a time (just about everywhere but here) for mandatory \"\"grass roots\"\" activism. I think it was about an interface redesign or something.",
         "It will go out the same way Digg did. It will just take longer.",
         "The cabal is in full force. The one place on Reddit that disagrees with them is one place too many",
         "Weirdo liberals refreshing the sub just waiting to downvote a fresh comment. Fucking pathetic losers the whole lot.",
         "What a sad existence to just linger in subs of people you disagree with, going through and downvoting comments. I really do hope they find meaning in their life",
         "The botnet downvotes are largely up front, so posts are hidden with the intention of having them never seen by non-bots.",
         "I assume it’s all bots and not real people or else the down votes would continue at a relatively steady pace. It’s always a cluster of instant down votes because the bot recognizes a new post, but then the up votes start to come in because they have run out of bots to down vote with.",
         "Damn is a fantastic ad.  I love that they put him dancing in it, i don’t know why, but I do.  Also, what’s a metal code conservative?  Just a conservative who likes metal core?",
         "Who was that other lady in the ad?  Not Tulsi Gabbard.  I’m not very familiar with American politics.",
         "People pay others to downvote?  Just when you think you've seen it all.   Let them waste their money.   Or more likely, mommy's money.",
         "So this explains why my first couple comments are down voted, and the last few tend to be upvoted in certain subs.",
         "Yeah, I've gotten some pretty nasty DMs also.",
         "Democrats have been manufacturing optics for longer than the Republican party has existed.",
         "He has said he will not run again. He really started something, though. The right is changed now because of Trump, which is wonderful. The days of establishment Republicans are over. I would happily support Vance, Vivek, Tulsi, etc for president after Trump is done. Imagine the state of the Republican party if Trump hadn't come along. I didn't even vote until 2016 because I didn't like any of the candidates and just didn't care. Trump lit a fire in me and many others. I'd love to see him be president these next 4 years, and see him endorse someone like Vance for 2028.",
         "Most of those are just bots designed to automatically downvote comments",
         "Bots… not people. Read about “Dead Internet Theory”",
         "It’s because it appears under “latest”. Reddit isn’t limited to America and the majority of the English speaking world will inevitably downvote right-wing self indulgence, when forced to see it. It will then leave ‘latest’, eventually only getting shown to those subbed in the communities it is posted to, the people who actually want to see it.",
         "Yep. I watched the Joe Rogan endorsement post go from 1.1k last night, down to like 600 something upvotes. Now it's back to over 1k.",
         ">People pay others to downvote?\n\nThis inevitably exists, but is also not the only system.\n\n*Partly* they pay for downvotes, partly they grind all day all night like MMORPGs for downvotes, partly they flagrantly break Reddit's rules for downvotes and if we complain a strike is issued on *this* sub. (It's happened.)",
         "What’s even more ridiculous is that it’s probably our tax dollars paying for this shit.  Fucking ridiculous clown world we live in.",
         "UK voters just asked their dommy mommy government to go harder.\n\nCanada re-elects *Pretty Boy Darth Vader* every chance they get, they don't *want* something different unless they emigrate. Australia sounds tough until you look at their politics, NZ is similar but moreso.",
         "That, and bots."
      ]
   },
   "1gjvs3d": {
      "title": "Joe Rogan endorses Donald Trump for President.",
      "text": "https://x.com/joerogan/status/1853614670764015762?t=xNY58kOY7eqdtmHVnN90mA&s=19\n\nSeems like Musk convinced him. Here's what he wrote:\n\n>The great and powerful @elonmusk.\nIf it wasn't for him we'd be fucked.  He makes what I think is the most compelling case for Trump you'll hear, and I agree with him every step of the way.\nFor the record, yes, that's an endorsement of Trump.\nEnjoy the podcast",
      "comments": [
         "We are living in the wildest timeline. 8 years ago he hated Trump",
         "I don't follow Rogan a lot, but I wasn't too surprised. His subreddit seems to be having a meltdown though. ",
         "Trump was right. Rogan wasn’t going to support Kamala lol",
         "All those clips of him saying the N word are coming back out tomorrow",
         "Reddit/MSM will surely be even more kind to Rogan from now on.\n\nWhats the over/under on how many accusations against him *come to light* in the next 24 hours?",
         "2024 bingo card currently on fire",
         "Surprised he gave him the explicit endorsement. Didn't have to do that, especially after hosting him/JD/Elon, the endorsement was implied. Joe must feel really convicted to put his reputation on the line. Good for him.",
         "Pin this mods",
         "r/politics is very upset!!!",
         "Wow, never saw that coming.",
         "Fuck yeah, Rogan!",
         "We're gonna win. His endorsement trumps any celebrity endorsement.\n\nGo vote! Vote no matter what! Bring your friends, family, drag them to the polls!\n\nEdit: I'm receiving hateful DM's! This must be an even bigger deal to those on the left!",
         "Excellent, he finally endorses.",
         "AHAHAHAHAHAHAHAHAHAHA COME ON PEOPLE, ITS OURS TO LOSE",
         "King of bros just knighted Trump, never expected that",
         "I did not expect that.  I think it is awesome, but also at the same time I enjoy a Joe Rogan who operates at a more non-partisan view.",
         "I did not expect that whatsoever but holy shit is it exciting. Get out there and vote people!!",
         "Biggest podcast in the world. It’s about time he figured it out. Love how he genuinely looks at all issues. Hoping he can embrace Christianity soon. 🙂",
         "And oh boy is the hate from the left at nuclear levels.",
         "This sub is so slow . Mods should be pinning this post at the top….\n\nOur country is at stake!",
         "About time...",
         "holy shit....endorsement i care about. Joe Rogan and elon musk. God bless the timeline cops.",
         "Huge",
         "Yeah the day before he does it. After a lot of people have voted. But better late than never?",
         "Let's go Joe! This is huge!",
         "So i did some quick head math on how this endorsement might impact vote totals.\n\nIn U.S for listeners we expect in the U.S around 140-150 million. Election season I  would think more, but let's be conservative and say of all listeners who is able to vote 50 million.\n\n0.10 percent of those listeners gets swayed tonight and votes Trump tomorrow.\n\n50000 more votes.\n\nThat could be impactful with some states so narrow in 2020.\n\nImagine if it  was only 1% of rogan listeners who got motivated to vote tomorrow because of Joe.\n\n500k more votes for trump.\n\n\\---\n\nNot that Im saying any of these totals would happen. But its fun to see how little of a percentage of his listeners submitting a vote could impact the election.\n\nTruly the sign of classic media being dead.",
         "Thank you Joe. (Also though, It’s about time.) \n\nI’m putting myself in his shoes and even for someone who is unapologetically himself it takes moxie to endorse someone as hated as Trump when you have the top podcast in the world. But that’s why he’s Joe Rogan. He don’t care. So many people will try to use this against him. No fucks given. Well done indeed.",
         "This endorsement is to grab the independent and libertarians that were going to stay home. If RFK Jr wasn't enough, Rogan was to push them over.\n\nThe timing is perfect.",
         "Wish he would have done it sooner but this is awesome none the less.",
         "/r/JoeRogan is seething and I'm here for it lol",
         "Let’s go!",
         "HUGEEEEEEEEEEEE",
         "Isn't he a bit late with this endorsement? I know election day is tomorrow but a lot of people have already been voting early. \nAlso I can only imagine how much of a meltdown the Joe Rogan sub is having.",
         "Hopefully this helps!",
         "He avoided it when Trump asked for his endorsement on the podcast. I wonder what made him go public.",
         "Trump has built a coalition unlike anything that anyone was expecting. Vance. Musk. Gabbard. Kennedy. Rogan. Kelly. Heck, Ron Paul publicly expressed interest in potentially working with them. No campaign or candidate is perfect, but it's hard to imagine what more he could have done in this election cycle.",
         "Get to the Polls and Vote Today. Trump/Vance need your Vote Today!",
         "Don't think anyone was really surprised by this, it was just a matter of time (little late than never).\nYou know damn sure the left is going to go full blast more and dig up every little tiny thing they can on him. The vaccine stuff they tried to go after him for, is going to look like a cakewalk compared to what they will try to do now against him.",
         "Really glad he endorsed him, but it would have been much better had he done it earlier since we have so many people early voting.",
         "That's actually insane and I never thought I'd see the day",
         "I wish he hadn't. now ,la will feel justified for skipping.",
         "Same could be said about JD Vance.",
         "I will comfortably say that 8 years ago it was an entirely different campaign, so many supporters which have broad viewpoints and even disagreements have come together, it's actually beautiful to see as an American.\n\nIn the event that he wins, it might be one of the most historic Presidential campaigns ever",
         "Lots of people hated Trump, but after 4 yrs of this shit show Trump looks really good to them now😁",
         "He might still do. Its just that the other candidate is terrible",
         "YOu can lie to people for only so long before the smart ones wake up.  Also, seeing them trying to bury Trump for 4 years makes anyone question whether they are the good guys or bad guys",
         "That’s Sabrina has been Astroturfed to death \n\n\nEven before the election insanity began, the entire sub bread. It was just a place dedicated to hating Joe Rogan because Redditors aren't smart people",
         "Don’t believe anything manipulated by the Kamala troll farms. They’re paying a lot of money to shape public discourse. It’s all fake just like her.",
         "I think its more about ensuring that future dems have to go on his podcast on his terms.",
         "He probably wouldn't have said something if she had come on the podcast like he did.  But she is so fake and untalented she couldn't.  Her weakness is that she can't act like a normal person, she's been manufactured since the start, crammed down Americans throats, and Joe Rogan just wanted a conversation with her and she couldn't even do that.",
         "This is why he waited until the day before, hahaha",
         "Lmao yup",
         "He will be a top priority to try to destroy \n\nBut then again after his covid stance he was already high on the list",
         "Kathy Griffin coming out to say he inappropriately touched her on “News Radio”\n\nNah, not even the most dyed in the wool lefty will believe that!",
         "Joe Rogan bout to join the Team of Hitlers on MSNBC",
         "It’s too late. The election is tomorrow.  Rogan timed this well.",
         "Who cares about Reddit",
         "This is exactly why he waited until the last second to endorse Trump. If he had done it any earlier the MSM would’ve ended his career.",
         "\"Rogan touched me on a plane 40 years ago and i'm just now remembering, can i have hundreds of millions of dollars please?\"",
         "I don't know, this seems consistent with Rogan being an anti-establishment type.",
         "The interview with Vance, and the latest one with Elon pushed him over from the silent supporter into just coming right out with it. I respect the hell out of him for doing it too. He really, REALLY seemed to like JD Vance. Like, he doesn't get on with some of his comedian friends the way he did with our future VP.",
         "It’s honestly pretty crazy. I read a few years ago that Trump and Rogans relationship was tepid at best and now they’re homies.",
         "Maybe Elon showed Joe the internal numbers haha",
         "[deleted]",
         "\"Ree who cares\"\n\nYeah, who cares about the biggest podcaster on the planet endorsing a candidate. Lol.",
         "I can’t wait to think of what they are going to smear Joe Rogan with now. The Left really is a hateful group.",
         "GOOD!!",
         "When are they not?",
         ">Edit: I'm receiving hateful DM's! This must be an even bigger deal to those on the left!\n\nLmao fucking cuckolds foaming at the mouth on the other sub",
         "> Edit: I'm receiving hateful DM's! This must be an even bigger deal to those on the left!\n\nI only came in here to note that I can smell the meltdown and I've barely been paying attention.\n\nAlso:\n\n>843 points (58% upvoted)\n\nFlair only for virtually all posts was the best thing the mods ever decided to do for the sub.\n\nProbably 4 years too late, but eh.",
         "He realizes what's on the line.",
         "His recent episodes over the past few months have lead me to believe he's converting to Catholicism privately, honestly.",
         "Amen!",
         "I wouldn't be surprised at all if he wasn't already a Christian or at least strongly considering it.\n\nHe's been open to Jesus and Christianity a lot the last year or so, especially with how insane the Left is becoming.",
         "Most people, especially Republicans, vote on Election Day. Endorsement the day before is arguably stronger than a week out when the news cycle will have buried it after 24 hours.",
         "honestly, that interview with Trump was probably as good as an endorsement, since Trump looked so good on it",
         "Brandon!",
         "This endorsement is to grab people that weren't on planning on voting at all. The timing is fine.",
         "He wanted to give a fair shake to Kamala, is the most likely answer.",
         "I'd say I was a little surprised. Not that he wouldn't, but didn't expect it since it was literally the night before.",
         "Megyn Kelly as well.",
         "And me",
         "People keep forgetting the context from actual quote from Vance. \n\n\nHe said he wasn't sure if Trump would become our savior, or be the next Hitler. \n\n\nEveryone hyper focused on the Hitler part of the quote and forgets he gave equal weight to Trump maybe becoming great.",
         "And Ted Cruz.",
         "Trump won over a lot of us over time. I didn’t support him in 2016 but still saw him as the lesser of two evils with Hillary. By 2020 I was fully on the Trump train.",
         "Honestly, a lot of people, including my family were skeptical about a Trump win in 2016 and what he'd actually do, but then when he actually started doing great things as president, they all switched",
         "The only problem is, a lot of his haters hate him more now than ever. Their views have become cemented and entrenched over the years to where it's almost a plank in the leftist platform that you must think Trump is Hitler.",
         "Trump can be frustrating at times. But hate him? Nobody who sees through the media lies hates him. Rogan has gone into this enough to know [Trump isn't who they make him out to be](https://youtu.be/WjhMYv1z0ws)",
         "Nikki Haley had the right take: “He’s not perfect, but he’s the better option”",
         "I mean, let's not beat around the bush though: Rogan's key audience, males aged 18-45, have broken sharply toward Trump over the past 4 years. Siding with Trump means Rogan goes where most of his listeners already are.",
         "If he survived peak COVID insanity he can survive anything. I don't actually like his show but I love that he's doing it.",
         "You're underestimating how much they'll believe ANYTHING when it comes to someone they don't like. There was no evidence that Trump called the military lovers, but took it as gospel. The truth doesn't matter to them. All they care about is destroying anyone who goes against their rhetoric ",
         "Kathy Griffin was not on Newsradio. Vicki Lewis was their redheaded secretary. As I recall, some in the Newsradio cast criticized Suddenly Susan for copying a lot of what they did (that show debuted a year and a half later).",
         "I’d submit his timing would be better yet if he’d have endorsed a couple of weeks ago.  But I absolutely don’t judge private citizens decisions on such things, ya gotta do what ya gotta do.",
         "Call me crazy but i think this move wasnt for the broader audience, its for lazy young men who listen to rogan. Lazy young men wont remember joe rogan said go vote for trump a month ago. They remember it today, the very last election day, when rogan said it yesterday. Both these campaigns seem to bo going after low propensity voters HARD. My guess is bc they know peoples minds are made up and its such a 50/50 they need to get new voters out to the polls to win. The left has women esp gen z women and the right has some minority men and are now going after first time or apathetic gen z/millenial males.",
         "honestly, i don't think he needed an official endorsement. I think the interview that got millions of views was enough, especially since Rogan talked to him like a normal guy and not trying to get brownie points",
         "Never underestimate importance of just sitting down and talking to person. I think that would help a lot of things these days.",
         "Thank Uncle Dana for that. And Elon. And RFK.",
         "What would that conversation even look like? \"Hey Joe, we are really down in our internal polling and could really use your endorsement.\" I don't think so.\n\nI don't doubt it's a tight race and the Trump campaign will take any vote they can get, but they have always wanted Rogan's endorsement. Who wouldn't? That's why Trump went on the podcast.",
         "Yet when some dumb former stripper dog shit rapper endorses Kamala they act like it’s a huge deal.",
         "Really? Very interesting take. I’ve listened to him since 2009 and still listen pretty regularly. What makes you think so?",
         "His stance on abortion has a long way to go.",
         "For sure 👍🏼",
         "Except that’s not really the case this election. A lot of us voted early. My county is very red and 50% of us voted early",
         "I love Megyn Kelly, what a great podcast!",
         "And Ben Shapiro, who went from not voting for president in 2016 --> voting Trump in 2020 --> donating money and campaigning for Trump in 2024. \n\nTrump proved himself from 2017-2020. He changed the minds of a lot of people with his record as president. \n\nIt's time to take out the trash today.",
         "Same here, I think a big part was the media. I also think Trump is just more likable this election.",
         "And this was apparently in a private Facebook message. I'm sick and tired of people attacking politicians based on private text messages. There is a total difference between speaking out loud in public vs. texting someone in private. Private conversations are where you TEST ideas and theories before you settle on what you really believe. That can be done by playing devil's advocate. Or essentially trolling, where you say something provocative to try and get a discussion going. Not to mention a private conversation with a friend involves shorthand, where you do not need to put in the same qualifiers and explanations that you would in a public speech. They know that something you say may not be meant to be taken literally.",
         "We're not supposed to care about those people, any time spent interacting with them is more wasted than TV time or booze time.\n\nThe swing voters aren't the ones who spend 10000 hours watching MSNBC and pretend they've done 10000 hours of self-improvement. They go on Twitter and they chat with their bros, largely unaffected by the political ecosystem because Twitter is *a chat with their bros* instead of some MMORPG they're playing all day the way Hillary-left plays Reddit.",
         "Why don't you like his show?",
         "Today I learned",
         "I can’t upvote this enough.  It makes me mad and at the same time breaks my heart how the left has made politics us vs them, good vs evil.  In the pursuit of political power and celebrity, they’re torn apart our country.  It’s ALWAYS the lefty who can’t set politics aside.  **ALWAYS**\n\nThe right didn’t do this, we haven’t moved - hell - we’ve moderated.   I have people in my orbit who’ve managed to de-family themselves, some kicked out of families, friendships decades old torn apart.",
         "And that Austin has been getting progressively worse under the Dems",
         "[deleted]",
         "It’s not about swaying people, it’s about getting them out to vote. There will be a non zero number of Rogan fans who will vote tomorrow because of this, every vote counts and we will get some because of this",
         "It's still less than half of all votes and Republicans doing well with early voting was unheard of before this year. I'm not saying it necessarily was strategic on Joe's part, but personally I think it's more impactful only hours before the majority go out and vote.",
         "75 million votes have been cast already. That's probably 50% of the vote. That's still another 75 million votes to be cast.\n\nThe timing of his endorsement is perfect. It would have gotten buried a week ago. Besides, the people voting early for Trump were going to vote for him anyway.",
         "Hands down the best conservative podcaster, in my view. I would have never believed that five years.",
         "Trump has become less \"mean\" which gives the left one less thing to grab onto whether their grabs are legit or not. He's doing pure pro-America and nothing else at this point, the way the left still speaks of him like he's the devil incarnate only highlights their own extreme childishness.\n\nA: ***HAVE YOU HEARD WHAT TRUMP JUST SAID--***\n\nB: I'm sure you haven't heard what Trump just said.\n\nA: ***MSNBC JUST SAID--***\n\nB: That's not Trump, and you were doing the same exact thing about Ron Paul in the 2010s.",
         "I'll start off with what I do like:\n\n1. He's open to having anyone on. He had Dr Malone on during peak COVID crazy despite the left trying to destroy him for it. He had Trump, Vance, and Fetterman on in the last two weeks and would have had Harris on if she had a brain.\n\n2. He's long-form. Short-form is just a series of soundbytes and recitals of obedience to dogmas. Rogan basically made this format and it's wonderful.\n\n3. He's generally libertarian and moved to my hometown because California is bullshit.\n\nWhat I don't like:\n\n1. I don't care about MMA, feats of strength or chimps.\n\n2. He doesn't push back enough with bullshit artists. I'm talking Eric Weinstein. I've been made to watch his interactions with this douchemonkey and it has left me irreversibly annoyed with him.\n\nI like Rogan as a person and like what he's done to national discourse, I just don't want to listen to his show. I'm not throwing shade at him or people who enjoy him. My initial comment maybe was too extreme sounding.",
         "Yeah you always see the “I’m sorry but I can’t be friends with someone who literally wants to genocide all non whites” or something to that effect.\n\nThey can never look inward and ask that maybe people that disagree with them actually aren’t evil. They’d rather nuke every relationship they have than admit they were wrong. Their entire political ideology is based around avoiding any sense of personal accountability.",
         "Kind of a trend for everywhere with Democrat controlled government.\n\nNot like anybody is pointing at Chicago or Detroit as paragons of well run local governments.",
         "No worries,  I just think Joe wants to put his stamp on it and is willing to take the arrows. I also think he must believe it's at least a toss-up, as he wouldn't want to be on a sinking ship.",
         "Neither am I. He had Trump and Vance on which was great for the campaign",
         "I loved her Fox show too. O'Reilly and Megyn back-to-back were must-see TV for me for years. I can't stand any of the Fox prime time lineup ever since they booted Bill. It's totally predictable listening to three hard-line conservatives say the exact same talking points every day. The fact that Bill and Megyn were more unpredictable, and at least made it a point to challenge conservatives, simply made their shows more interesting to watch. If a Republican makes a mistake, the Fox prime time hosts now are so partisan that they will not acknowledge it. They'll just spin for them.\n\nMegyn has definitely said she's become more conservative now. I think she rated herself a 6-7 out of 10 recently on conservatism, which seems a little low. Years ago when Howard Stern asked her what her politics were, she said conservative on economics, liberal on social issues. She also said she voted for Trump in 2020 and 2024, and I assume that means she didn't in 2016. Her show now is definitely more to the right of her Fox show, but she will criticize Republicans if she thinks they made a mistake (she didn't like the non-Trump speakers at the Madison Square Garden rally much at all).",
         "Rogan doesn't seem to be in the \"pushback\" business. He actually reminds me more of Johnny Carson than any other talk show host these days. No guest had to worry about Carson digging up dirt on them or trying to debate them on the show. Some people blame Carson for helping promote Paul Ehrlich's devastatingly wrong junk science population doomsday theories when he had him on as a guest. But Carson's style was not to debate, disprove or discredit anyone. He simply gave them a platform and let them make whatever case they wanted to make. Watch him interview Siskel and Ebert, two supremely opinionated guys, and, even then, Carson never brings strong opinions of his own into the interview. He always maintained the kind of agreeable tone that Rogan had with Trump.\n\nFull disclosure, I've only watched a handful of Rogan interviews. But the Trump one gave me major flashbacks to Carson, in that Rogan did not insert his own opinions into the discussion very much, and was very gentle with how he addressed any controversial topics.\n\nI'd theorize that this moderate and even-handed approach is why Rogan is at the top of the heap of his industry, just as Carson was.",
         "Why do you hate chimps?",
         "You're a good human."
      ]
   },
   "1gjsezm": {
      "title": "A Hell of A Campaign ",
      "text": "",
      "comments": [
         "It's easy to forget so much craziness that happened this election cycle. But it will all be Decided Tomorrow if it was Worth it or not.",
         "Photo #9 is the most iconic photo of my lifetime.",
         "I truly believe this will go down as one of the greatest presidential campaigns of my lifetime. It was a wild, crazy time. Full of laughs, tears, tragedies, divine intervention, and a hell of a good time. Kind of sad it’s over. But it’s time to get him back in the White House.\n\nGood luck tomorrow, Mr. Trump. We’re all behind you.",
         "He laid it all on the line. Now we wait",
         "This campaign has been brilliant. If Trump doesn’t win, he literally gave everything he had. Unfortunately we live in a corrupt country with many bad actors that control the media and most of our institutions. It takes a miracle to overcome them.",
         "The present time has been incredibly mean towards Trump, but I honestly believe this campaign run is the kind of stuff that will take a good chapter in high school and college history books sometime in the future.\n\nAlso, VOTE",
         "It can only end in victory this has been the greatest campaign I’ve ever witnessed",
         "It’s amazing how the DNC doesn’t learn from their faults. \n\nIt’s the night before the election. \n\nWhere are the candidates? \n\nTrump just did an interview with *Bill Belichick* on the SiriusXM NFL radio channel. \n\nEarlier he was in Raleigh, NC.\n\nThen he was in Reading, PA. \n\nLater he’ll be in Pittsburgh, PA. \n\nHe’ll end his night in Grand Rapids, MI. \n\nHarris? \n\nShe’s only in PA. \n\nAllentown. \n\nThen Philadelphia, where she’s hosting a huge concert full of celebrities. \n\n\nThis is literally the 2016 script all over again. \n\nI just doing get it. What is the DNC/Harris Campaign thinking?",
         "What about \"As I was saying\" ?????",
         "I voted Hilary in 2016 and was so upset when she lost. Now in hindsight I'm glad she didn't win. I'm one of the Latino voters who went Republican for the first time this year.",
         "This man took bullets, worked at a McDonald’s, went on Joe Rogan and drove a garbage truck\n\nAll within the past 3 months\n\nOne heck of a quarter of a year for this guy\n\nHopefully it was not all for nothing",
         "Like him or not, this man has campaigned like hell. God willing he will be #47",
         "Missing the iconic photo of the mic malfunction ",
         "I hope our boy makes it back in. We need him now more than ever. \n\nI don't know if I can survive 4 years of Kamala as president. I don't know if ANYONE would.",
         "Trumps near miss should have been an iconic time magazine cover. Too bad every media has been infected with TDS hopefully that will change in a few hours.",
         "Wait.....i thought his rallies were empty.   Or was i just reading the msm again?",
         "God bless President Trump!",
         "Go vote everyone!!!!\n\nGet your fat pig husband from the couch and go vote",
         "I know this has been said before, but this really is “the” election. \n\nIf Team Trump 24 can’t beat the machine, nothing can.\n\nAnxiety levels 🔋",
         "Iconic",
         "Trump has run the greatest campaign we will ever see in our lifetimes and perhaps all of American History! We love you Donald, thank you! 🇺🇸",
         "It honestly baffles me that there are a sizable amount of people who will vote for Harris. It's not even close, even if you are left leaning. It feels like the only people that would vote for her are just never Trumpers who hate Trump so much they're willing to put up with a cackling maniac who has no policy lol",
         "DJT has fought long and hard.   All the traveling, rallies and personal media appearances.  I HOPE HE WINS, IF WE GET STUCK WITH KAMALA...HERE COMES THE MARXISM.   I can't go there in my head.   Because I personally believe if she \"somehow wins\" (most likely by cheating) that will be the end of the US.   We are at a serious precipice.",
         "Keep in mind, this man was written off entirely. I think he wins tomorrow, and when it does, it’ll be one of the greatest comeback stories of our time. And his campaign masterfully pieced it all together.",
         "Lol shit has been so crazy I forgot about his mugshot. It's been one hell of a ride.",
         "Vote vote vote",
         "\\#10 is still the hardest mugshot ever , change my mind",
         "The demorats killed peanut. He will be avenged.",
         "Pic 9 goes so hard",
         "We've got a country to save",
         "I love him like a grandpa I never had.",
         "Man, this has been such a long year.",
         "This is the most insane election cycle ever and it’s not even close.\n\nAnd now I wait for a historian to correct me.",
         "Great photos! Gave me goosebumps.",
         "I live in Butler County PA. PPG arena is packed. I have friends there sending pics. Harris is at a small venue with a small crowd compared to Trump. My friends are reporting that it is overwhelming and a magical night at the arena. Trump is going to win!!!",
         "I really hate how they were making fun of Elon for jumping and skipping. He's literally the richest man in the world, building cars, owner of Twitter, autistic and catching rockets, let him be",
         "That is a nice montage.",
         "It's been real guys.",
         "No matter what, he'll always be MY president! Trump Vance 2024 & Vance Vivek 2028",
         "Deciding which image to post in my stories tonight in the case of a win. My FB friends are like 90% MAGA, but will still feel good to annoy the remaining libs",
         "Bigly",
         "I don’t know that there will ever be another candidate like him. Now let’s just all say an extra prayer tonight that tomorrow goes the right way",
         "I already have 🫡 🇺🇸 \n\nMAGA! USA! ✊️🙂",
         "Please, God. Please 🙏 please give us Trump tomorrow. Signed, a wife, mother, and a true American 🇺🇲",
         "There will never be another like him. I don't even know if anyone will ever try. This is literally peak, everything after this will be a pale imitation. JD Vance is my next president, but the spectacle will be so drab compared to Donnie. Who do you think they'll run against JD Vance, if he chooses to run in 2028?",
         "🔴🇺🇸TRUMP❤️2024🇺🇸🔴",
         "Number 5 is a pretty important moment too.",
         "Iconic that Georgia was  very recently sued over ‘early voting’.",
         "They really threw everything they could at him",
         "#9 is iconic",
         "The garbage collector bit was pretty funny!",
         "He's not only a president but he's also an entertainer.",
         "Great time to be alive, a world hero",
         "Think about how crazy this whole cycle has been. Everything that happened with Trump and a back door coup by the Dems. I really hope Americans see through all the BS and vote Trump.",
         "It trump doesn’t win off pic 9 I will be surprised I think the base is very motivated to vote this time around",
         "Great photos, we have to win this.",
         "No matter what happens this week, we had this incredible experience with an American hero",
         "That McDonald’s picture is just great",
         "Rfk and Tulsi got me more. Tulsi and vivek, honestly was the seal. Hopefully Vivek is head of the SEC. and Tulsi head of the military honestly.",
         "Literally, what has Kamala done to make her campaign a fraction like this",
         "Good luck! Just if we lose, let’s not go to the capital this time. But mark my words if the dems lose they will 100% do something similar and not a single one of them will call it an insurrection",
         "Kamala takes three days off and trump picks up three jobs.",
         "I wonder if the candidates sleep at all tonight.\n\nI’d be up all night",
         "an assassination attempt alone is crazier than any other campaign.  Someone yesterday randomly mentioned the eating cats and dogs thing so so many things happened.",
         "I hope he takes both the EC and the popular vote. This must be a stomping, that way the Dems have no choice but to concede.",
         "Well I have my doubts it’ll be decided tmrw. \n\nJust praying for no 4am vote dump, broken pipes, and never ending mail in ballots that are 99% dem votes",
         "Just wish he hadn’t done that microphone fellatio 😢",
         "I’ve had hope for a few months, so to me, it’s been worth it.",
         "We’ll see",
         "He needs to win or that will be the demise of the US under Kamala.",
         "Get out and vote! Go go go!",
         "I am surprised they didn't run that more in ads.",
         "God bless Trump and all of us in this country; bless each and every citizen no matter who they vote for and help Trump bring freedom back to the USA.",
         "To understand how corrupt democrats are realize that this image isn't anywhere to be found on the [wikipedia page for this event in history.](https://en.wikipedia.org/wiki/Attempted_assassination_of_Donald_Trump_in_Pennsylvania)",
         "What's crazy is when you zoom in you can literally see the wound to his ear, that leftists deny exists.",
         "I keep seeing people wearing shirts with that pic on it. And I live in Canada.\n\n\nLove it",
         "That photo will be in history books. And hopefully by the time it is, our country will wake up and won’t spew bullshit lies the media tells us.",
         "Agreed, it gives me chills.  I use it for my Lock Screen.",
         "It is truly up there with the “I can hear you” Bush bullhorn speech video.",
         "Hard to beat 2016 but with the Butler shooting, the McDonalds ploy and the garbage truck...  \n\nI'm not hearing lots of bitching about the RNC this time either... they've already had successful lawsuits too.\n\nHe gave himself just about the best chance to win that he could. He might beat the odds again.",
         "100%. He could not have given anymore.  I am 11 years younger and I would have been so tired after a week of it.  His stamina is amazing.  I really hope he gets some rest after tomorrow.",
         "And Kamala's entire campaign was atrocious to boot. If Trump loses, either gaslighting or corruption will prove to be too big of a factor to overcome and I'm sad to say I'll lose what's left of my faith in this country as a whole.",
         "We can pray that turnout for President Trump outpaces the \"easily coerced\" turnout for Kamala that was based upon an extremely dishonest media that was in bed with the DNC and Harris campaign. \n\nI am hoping for a replay of 2016.",
         "I serve a God who is in the business of miracles.",
         "Everyone here is already voting. You need to call your friends in MI WI PA NH NM VA.\n\nMultiply your vote.",
         "1: The Dems aren't voting for a candidate, they're voting for a system.\n\n2: Honest persuasion is losing more and more of its importance to Dems with each cycle. It's all about the process now. (Courts, city halls, DAs etc etc etc.)",
         "Oh is Harris doing the Springsteen concert thing like Hillary did in 2016?  That ended well last time, let’s see if it works any better this time 😆",
         "But the Dems are saying “he’s tired”…… \n\nIdiots",
         "Don’t forget she picked her tim kaine too.",
         "[deleted]",
         "Thank you.",
         "I’d like to become a homeowner within the next 4 years. Have you seen the housing inflation lately? It’s batshit insane and if Kamala wins I can kiss owning a home goodbye",
         "Literally WWIII\n\nShe will be taken advantage of day 1. Zero critical thinking skills or strategic capabilities. Couldn’t win tic tac toe against a pre-schooler.",
         "If it was a Democrat, they would have given them a Nobel Peace Prize by now.",
         "Should be time person of the year, and if it was any other person or candidate they definitely would. Maybe even a noble peace prize. But since it was Trump, they will give person of the year to Beyoncé for the awesome concert at the rally to get everyone fired up and a noble peace prize to KJP surviving nonstop attacks and persecution from the media.",
         "I was watching Nick Shirley, and it's amazing how many people said they were voting for the woman.   They admitted to not even knowing her name.",
         "I don’t have the mental or emotional capacity to speculate on 2028 right now…",
         "Glad to see I am not alone. I am a bit scared. I know if she wins, everyone will be like she is the first American Woman to be President. Cheers and parades in her honor. That will be the only focus of the media cycle for days. They will also be switching over to Trumps legal battles. Then January comes and she will change her tune on the border, letting millions in her first year. More money going out to Ukraine. More countries turning on Israel. Inflation staying high and an economic recession on the rise. The full effect will be felt by next summer. That will be the future with her winning, but the country doesn’t care. We have not hit rock bottom enough, apparently. We can only pray Republicans keep the house and possibly the senate. We will all be here whether Trump wins or loses. This sub is what unites us.",
         "Would be the first Republican to win the Popular vote in 20 years. Not happening",
         "Just the EC would be enough.",
         "You know they will try that shady crap...because that's what they do!  They can't win an HONEST AND TRANSPARENT election if their life depended on it.",
         "I guess it didn't do well with squishy moderates in focus group tests.",
         "Yes!  I hope to see one of the BEST Presidents EVER back in the Whitehouse, Donald John Trump!",
         "If it weren't for Elon, pretty much the whole modern internet would just be a woke loudspeaker.",
         "Leftists destroy everything they touch",
         "No seriously. Within minutes of it happening, like before Corey’s passing was announced, the crazies on X were claiming it was fricken ketchup. I saw ketchup and immediately thought “someone has never watched a low budget horror movie”.",
         "What's also memory holed is he made a LOT more mistakes in 2016.\n\nSome people are nostalgic because he was even more entertaining back then, but part of it was him being naive to politics and making a lot of errors.\n\nHe's a more seasoned politician now and post the debate he's barely put a foot wrong.",
         "Unfortunately, he won't get any rest either way. You can bet the left will continue their lawfare against him no matter the outcome. I fully expect him to be sentenced to jail if he wins.",
         "If I were in his position, I would have gone off into the sunset and lived out my life playing golf and fading into luxurious obscurity. It takes a great man to decide to jump into the nest of cockroaches that is politics with such an alternative.",
         "He is amazing. I saw him in Macon last night and it was clear he was tired. It was his third event that day. But he still had so much personality and spoke for over an hour. He did not shortchange us even though we were the last stop.",
         "I hope he gets some rest too, especially as president elect.",
         "Watch he goes into cardiac arrest after this election is finally over and he gets a chance to rest. His body will be in shock.",
         "The thing that gives me hope is the economy, global instability/wars, and the border crisis. Most Americans agree that the country is headed in the wrong direction. How can they justify voting for more of the same failed policies? Stumps me.",
         "The people who pretend they're doing a get out the vote drive when they're really just shouting the same thing at the same people *in every conversation* are just adding to the tedium of it all.",
         "It's also less and less about intraparty democracy for Democrats. It's been 16 years since the last time they had a truly open-ended primary in which the powers that be didn't heavily tip the scales in favor of their chosen candidate.",
         "Literally yes, with Springsteen too. But don’t worry, Lady Gaga is there too.",
         "That's really what concerns me. Joe was very, very weak on the geopolitical stage, but kind of masked it by funneling billions to Ukraine. \n\nKamala on the other hand, has absolutely no grit or negotiation sense whatsoever. Easily taken advantage of, projects an aura of stupidity. Nevermind Putin, she'd get taken to the cleaners by EVERYONE. WWIII a genuinely likely event with her at the helm.",
         "they wouldnt have stopped talking about it. they have milked jan 6th for 4 years imagine the news coverage if joe or kamala nearly got killed.",
         "The founding fathers were right to be concerned about the uninformed voter ruining the country",
         "My anxiety is through the roof!   We cannot AFFORD another crappy four years of the Biden/Kamala polices.   We just can't.   We are talking about liberty versus Marxism.",
         "They will blame Trump because they say the economy is always based on the prior president.   So will they still blame Trump or will they follow their own logic and blame Biden then?",
         "Had no Idea its been that long thanks for pointing that out.",
         "You know 20 years is just 4 terms right? Since before Obama has been elected or in other words, the last Republican president before Trump.",
         "Maybe. Or they didn't want to encourage more attempts.",
         "It’s actually crazy how quick the left has forgotten and dismissed twitter when 4 years ago “tweets” were virtually scripture to them.",
         "I won't be surprised.",
         "Honestly cockroaches are more useful than the current administration at this point.  At least roaches eat the trash instead of creating it. 🪳",
         "Not to mention we are in a political sub",
         "I’m still shocked that anyone that considers themselves left of center forgave the DNC for rigging the primaries against Bernie. \n\nI know so many people that voted for Trump that said they would have voted Bernie if he was the candidate. America wanted a pivot non-establishment candidate so bad and the Dems had the guy. Yet today MSNBC writes an article asking why Trump is popular",
         "It's because more people live in LA county than like 80% of all counties in the U.S. combined. That's why we need the electoral college - so CA and NY don't decide our future.",
         "People searching for consistency in the left can find it in their consistent attacks on non-left.",
         "Bernie vs Trump is the race that America should have had in 2016. A clear repudiation of the failed status quo, and a true choice election about the new course."
      ]
   },
   "1gkasmi": {
      "title": "Kamala Harris Is the Most Inauthentic Nominee in History, and the Trump Campaign Just Proved It",
      "text": "",
      "comments": [
         "They didn’t have to. She proves it every time she opens her mouth.",
         "Anyone seen The Terrifier?",
         "Of course, she acts like a robot.  She can not think for herself,  and she can only say what she's told to by the deep state. \nThis is why teleprompters are her friend. The only time she really spoke of the cuff was in the debate, and then she was acting like the trial lawyer she is, attacking the other side.",
         "OMG SHE SAID FIGHT. ACCORDING TO MSM WHEB A CANDITATE SATS FIGHT THATS ANGRY RHETORIC, RIGHT?!?!??!",
         "And yet some Americans can't see that she can't run a lemonade stand let alone a country"
      ]
   },
   "1gk6zee": {
      "title": "Just Voted in Missouri ",
      "text": "Despite there being awful rain and flood warnings, the voting place in my town was packed. And, just like the 2020 election, I voted for Donald J Trump for president. For those across the country, if you're able to vote. VOTE! Nonetheless, stay dry, stay sane, and stay safe today. ",
      "comments": [
         "Today is the day Trump re-takes the iron throne",
         "How does your town usually vote? Just trying to sense the level of enthusiasm on both sides.",
         "My polling place in Missouri this morning (during thunderstorms) had like \\~1,000 people in line in front of me. Absolute insanity (and this is a Trump +17 county from 2020).",
         "I'll be voting here in MO in a couple hours. Heavy rain here too. Haven't seen so much rain in a 24 hour period in years. Will report back on line size. I'm in a suburb of STL.",
         "I pray that's the case",
         "The town usually votes very Republican. But, since Trump won back in 2016, it's been Overwhelming Republican. Especially with Trump. There's been a custom Trump sign near the entrance of town since 2020.",
         "How busy was it today compared to historically?",
         "Last presidential election, the place was packed. This time around, even with everything going on. It seemed even more packed. Might be the highest turnout since the mid 2000's, imo. Have to wait until everything is tallied"
      ]
   },
   "1gk7ncj": {
      "title": "Michael Cohen announces he is leaving the United States and that he’s already working on getting a foreign passport with a new name if Donald Trump gets elected President.",
      "text": "",
      "comments": [
         "Maybe they can all charter one huge airplane and leave together. Con Air.",
         "So many of these celebs and personalities said this in 2016.. but they never did. I'd be surprised to see which countries would actually accept them.",
         "Don’t let the door hit you…\n\nWhat countries even “give” away passports?",
         "How much nicer would this country be if every one of these yahoos followed through on their “I’m leaving the country” threats?? Conservatives don’t threaten to leave be cause they love their country and want to stay and save it. The petulant left threaten to leave at every turn if they don’t get their way.  “Brats” indeed.",
         "Maybe his new name can be Felicia.",
         "Honestly, who cares? These people announce it as if our day to day lives will be worse without them in the country.",
         "Promises, promises.",
         "And nothing will be lost.",
         "NA NA NA NA\n\nNA NA NA NA\n\nHEY HEY\n\nGOODBYE",
         "Ok cool. Have fun bud.",
         "Don't let the door hit 'ya where the good Lord spilt 'ya.",
         "Definitely not guilty of anything odious.",
         "🙌🏼",
         "Okay. I’m sure he will.",
         "Mr Cohen heading to palestine perhaps.",
         "Maybe a Boeing?",
         "I do actually think this time a good few people will leave. Between Epstien and Diddy, the next Avengers movie (eww) could look a lot different.",
         "You can buy citizenship in many countries. Also check out golden visas.",
         "Interesting thanks!"
      ]
   },
   "1gk6kui": {
      "title": "Harris campaign tells Muslim interviewer he can't ask about Gaza, she talks up bacon instead: 'Taken aback'",
      "text": "",
      "comments": [
         "Muslim here. You can thank us for what happens in Michigan. Believe that.\n\nIn all my years I haven’t seen Muslims vote third party and Trump like this.\n\nWe are fed up with this war monger. Her and Biden policies have screwed up Middle East terribly. \n\nObviously we weren’t huge fans of Trump in 2016 but atleast he didn’t butcher us like Holocaust harris did. \n\nShe is going to go go go.",
         "Guess she didn't make the connection between pork and bacon, lol. What a brain dead idiot.",
         "She is unqualified in all aspects to lead.",
         "This has got to be made up bs. Her position on people taking their shoes off on airplanes? Bacon?",
         "Inshallah my man... I'd love to see the effect that they decide not to run Shapiro because he is Jewish, to then only lose the Muslim vote anyhow! I mean... That's hilarious.\n\nI believe this would be a different race had her handlers selected Shapiro."
      ]
   },
   "1gk7wjb": {
      "title": "No matter the final vote, this election’s biggest loser may be the legacy news media",
      "text": "",
      "comments": [
         "Legacy media is the riding horse and the internet is the automobile, we're not going to miss the millions of pounds of horse shit per day. Joe Rogan makes the typical A-list film actor look like a nobody, and citizen journalism tells us *what actually happened* instead of just *what they want us to think.*",
         "I sure hope this is the case. Trump is running against the media as much as he is against Harris,  maybe more. \nI'm older than many of you, and remember the days when you could depend on the news to tell the truth,  no matter how much you liked or didn't like it. Walter Cronkite told it like it was.",
         "The mainstream media is dead. Their bias is no longer hidden and the people have rejected them as the propaganda arm of the DNC."
      ]
   },
   "1gk9364": {
      "title": "FEMA failed to answer \"nearly half\" of all the phone calls Americans made for emergency aid after the recent hurricanes",
      "text": "",
      "comments": [
         "Notice the media doesn’t talk it about any longer. For many of these people it will take a decade or longer to recover; some will never recover.",
         "Another reason to vote for Trump/Vance?\n\nI think so.  Maybe he can get FEMA and other organizations within the administration to quit being so political and/or lazy.",
         "Watching the videos of the disaster, it is citizens from all over America helping….NOT fema.",
         "Never tell government agencies your skin color or ethnicity."
      ]
   },
   "1gk33d5": {
      "title": "Swing state Trump voters say groceries, housing, insurance costs are too high — but Harris supporters say they don’t feel the heat",
      "text": "",
      "comments": [
         "1. They don’t feel the heat because they’re uber wealthy Dem donor class folks\n\n2. They say they don’t feel the heat out of willing ignorance, then go home to their crappy 300 sq ft apartment in a dumpy neighborhood with almost empty pantry and fridge, and stacking overdue bills and sulk\n\nThe NUMBER ONE thing I see everyone on Reddit posting about is cost of groceries, healthcare, rent, bills, student loans debt, cost of college, cost of travel, inflation, etc. \n\nThen the election draws near….and they go silent on that, and dogpile anyone who brings it up. They suddenly claim the economy is doing VERY well and blame any evidence of the contrary on Trump. They know what they’re supporting and that it doesn’t work but they’re too proud to admit it and will still vote for it out of arrogance and ego.",
         "I don't see how anyone is not affected by rising insurance costs. They have just gotten insane over the last few years. Unless perhaps the people saying they aren't affected choose not to have insurance, which seems like it should be just as big a concern as unaffordable insurance costs.",
         "Democrats are now the elite party, mostly all white collar in control, and pandering to a coalition of special interests to maintain their power.",
         "It's very surreal. We saw how wrong the polls were in 2016, when the \"blue-wave\" never happened....and again in 2022 when the \"red-wave\" never happened. I've watched the battleground polls diligently for the last three months, noted every incremental change and I have not a clue how it's going to turn out. My guts tell me that the range of possibilities run from a squeaker Kamala victory to a substantial Trump win in the electoral college....and a squeaker Trump victory to a substantial Kamala win in the popular vote. Whatever happens, I think the GOP ends up with at least a 52-48 majority in the Senate.\n\nGod bless the United States of America.",
         "Harris voters get food stamps, Section 8, Medicaid and many other handouts funded by taxpayers. No wonder they don't \"feel the heat\" they are sitting on a block of ice.",
         "I suspect there might be some truth to it, I wonder if inflation hit HCOL areas less hard than LCOL areas.  If the price of an item goes from 1 to 1.50 that's a huge increase, but if you're already paying 5 and it goes to 5.50 you don't notice it nearly as much. Inflation did rise as a percent but I'm wondering if it averaged out with LCOL areas picking up more of the cost proportionally.",
         "They twist it everytime to blame trump on the cost of everything. Its like a superpower.",
         "Maybe their hate is making them not see reality as it is.",
         "what a coincidence, harris's celebrity endorsers reminded everyone that groceries are to expensive, the cost of living is too expensive (and it's even worse for her).",
         ">Then the election draws near….and they go silent on that, and dogpile anyone who brings it up.\n\nThese past couple of months I've frequently seen people being told they need to learn how to budget better and/or they need to find a better job, and I get the feeling these replies have been from people who fall into category 2 and the description in your last line.",
         "My favorite cognitive dissonance is when theyre volunteers at a foodbank or something like that, and theyre all proud about \"we signed up 6 new families this week that we're helping - more than ever before!\" because Progressives love to \"help\" people. Then you point out that the economy must be doing pretty poorly if they're signing up more families \"than ever before\" and they just get really angry and belligerent.",
         "What is weird is that most of them double down and think that more government control over companies is the correct solution. Of course none of them are successful business owners.",
         "exactly this. It’s like there blue programming chip gets activated the closer we get to Election day",
         "They don't feel the heat because they're paid to attend and give those talking points.",
         "For sure, some articles say that U.S. families are spending upwards of an extra $1,120 a MONTH on rising costs.",
         "well they already don't own a home, and most likely live in a city and don't own a car.\n\nBut their rent has doubled and they don't know why, so it has to be the greedy republican landowner who's doing it!",
         "I thought the red wave actually did happen, but not to the scale it predicted?",
         "they were already buying premium groceries. So the high prices were normal to them.\n\nThey didn't know $1.50 eggs existed, because they only buy free-range-non-gmo-no-pesticide $10 eggs.",
         "What gets me is they’ll post “‘budget better’ doesn’t help my situation at all” but then when told not to vote the same leadership back in, they get all defensive and claim that has nothing to do with it, this is Trump’s fault!!\n\nWhen you point out the claims that the economy has been amazing under Biden/Harris, they go nuts and say “you’re just confusing the issue. Shut up!”\n\nThen the posts stop when election time draws near. Maybe mods crack down on them closer to Election Day.",
         "My folks fell on hard times back in the late-80s as Dad was looking for work after resigning from a teaching job and Mom had resigned to take care of me and my older sister. \n\nThey broke down and went on food stamps for a couple weeks. They got off of them as FAST as possible because they didn’t want to be on taxpayer-funded programs like that for very long, which is the whole point. \n\nFood pantry charities and food stamp programs are intended to be “just until you get back in your feet” situations. \n\nBut the left wants them to be “long term, sit back put your feet up and depend on us” programs.",
         "The red trickle. Hopefully, this time is the real red wave.",
         "[deleted]",
         "> Republicans lost seats in both chambers.\n\nthat's blatantly untrue. going into the 2022 election democrats held a majority in the house. since the 2022 election republicans held a majority in the house.",
         "You're absolutely right. My mistake. Comment deleted."
      ]
   },
   "1gjtdat": {
      "title": "Tomorrow save democracy ",
      "text": "",
      "comments": [
         "God bless America,  and God bless Trump. Keep him safe from all who would like to do him harm.",
         "Will be voting for Trump for the first time tomorrow. And proudly so.\n\nEx-liberals are many in number.",
         "My wife and I are voting Trump later today! Let's get him back!",
         "Let’s fucking do this!",
         "He has twice already."
      ]
   },
   "1gkarh0": {
      "title": "VICTORY: RNC Wins Lawsuit Against Cobb County, GA's Attempt to Count 3,000 Post-Deadline Absentee Ballots",
      "text": "",
      "comments": []
   },
   "1gjvfz7": {
      "title": "I got to vote for the first time! This was a wild ride!",
      "text": "",
      "comments": [
         "Hell yea!",
         "People don’t realize what showing up and voting means. A lot of people from different eras have sacrificed a lot to make this country what it is and cast their vote. You honor them by showing up and voting. I’ll stand in line all day to vote.\n\n👏",
         "Congrats! Hopefully for Team Red, but you do you.",
         "Awesome!",
         "Sick shirt, I like that!"
      ]
   },
   "1gk7kmg": {
      "title": "WATCH: Elon Musk Makes Surprise Appearance on Rogan, Issues Chilling Warning About a Kamala Harris Win",
      "text": "",
      "comments": [
         "Elon's not wrong. I just pray that we have enough people out there with eyes wide open to what a Harris win might do to our beautiful country.",
         "Elon knows, like a lot of us do, his priority number 1 to the dems. They will most likely do what they did to Trump to him for sure if Kamala wins.",
         "I watched the whole thing on Youtube.  Elon didn't pull any punches.  If the leftists steal this one we will have another 4 years of a totally corrupt DOJ.  Elections will become a joke because there will be no one to stop them",
         "Rogan endorsed Trump on X."
      ]
   },
   "1gk08m0": {
      "title": "Trump doesn’t lose Dixville Notch for the first time, tying Kamala 3-3",
      "text": "He lost to Hillary 4-2, he lost to Biden 5-0, he’s tied Kamala. This could be a big sign of the day ahead if everyone shows up to vote. Let’s go win.",
      "comments": [
         "Democrats are already framing it as \"half of Haley's voters have flipped to Harris\" since they apparently all voted for Haley in the primary. Lol",
         "Absolutely insane how strongly the rest of Reddit is clinging to that one Iowa poll. They are literally already counting on winning Iowa lol",
         "Massive 50% shift in favor of Trump from 2020.",
         "Great start to the day.",
         "What the hell did you just call me?",
         "Hopefully this is a good sign of things to come. ",
         "Yes there are lots of signs he's going to not only win, but win by a lot.",
         "Fox's article on this split doesn't mention stats from the last 2 elections. I wonder why.",
         "Has me worried because they said it was 4 republican voters and 2 undeclared. That means at least 1 registered republican voted Harris. Cringe.",
         "MAGA",
         "I’m 30(M) and love to see the tide turn… but it is shocking whether it be friends of friends or people I know through social media.. Even my close friends fiancés or girlfriends etc.. still don't necessarily jive with Trump specifically for the abortion/roeVwade issues.. and that’s the only reason.. I feel like Ivanka could’ve helped with that demographic or am I missing something??\n\nRegardless. Big day. Excited to go out and vote. 4 more years!",
         "This post, my coffee and 3 donuts just started my day off very nicely!\n\n  \nLFG!! VOTE VOTE VOTE VOTE",
         "Poor New Hampshire about to be gentrified even more than it already is.",
         "Sometimes our voting practices feel like a superstition from the Middle Ages.",
         "The two \"independents\" are definitely Democrats who registered as independents to vote against Trump in the primary ",
         "Haley got more primary votes than Harris so Harris' supporters should switch to Haley. haha",
         "> Democrats are already framing it as \"half of Haley's voters have flipped to Harris\" since they apparently all voted for Haley in the primary. Lol\n\nthey forgot that many of \"haley's\" voters were independents who only had one primary they could vote in since biden/the dnc disenfranchised nh democrats and took away their say in the primary.",
         "They will say anything to prevent from the pre melt just is already taking place",
         "If Harris’ team thought it was legit then either herself or Walz would’ve scheduled something for Iowa after that poll dropped. That never happened. \n\nAt best it was an outlier and at worst it was an intentional shock poll meant to drive up voter enthusiasm for Democrats after Republicans showed up en masse for early voting.",
         "They also think they’re gonna flip Texas.",
         "They're clinging to that news because they are desperate for good news. Harris had not been doing well in October at all as her polling dropped.",
         "Trump won Iowa by 8 against Biden and by 10 against Hillary.   He's not losing Iowa in 2024.  He's probably  +9 there right now",
         "The one poll that admitted they over sampled \"older white liberal women\" haha. The real Iowa poll is +8-11 Trump LETS GO!!!",
         "I still think msm made it a big deal ahead of the posting on purpose because they knew the results already. I 100% think it was skewed on purpose",
         "I live in Minnesota, bordering Wisconsin and Iowa. If MN is a toss-up, Wisconsin and Iowa should be red - they are way more republican than us. \n\n\n(It could be just because so many Minnesotans hate Walz, but I digress.)",
         "From what I am reading on here she's taking it ALL no contest. The ignorance and stupidity of such individuals",
         "It seems to be true. I've been desperate to not give myself a confirmation bias but only absorbing things that support what I want. But it really seems like he is edging into a win. We shall see! ",
         "That's probably why Melania came out pro-choice in her book.  Trump for his part wants to find a middle ground.  He thinks it belongs to the states and personally supports exceptions and has spoken against a 6-week ban he considered too soon.  \n\nMost of Europe puts the ban as 12 weeks and that's really where most Americans are at.",
         "Democrat influencers went crazy posting that poll talking about “easy blue wall wins because Iowa is going to them too”. It was clearly an enthusiasm poll. One blue wall state goes to Trump and he wins, that’s it. Just one. It was a desperation poll.",
         "It's not gonna happen. I drive all over Texas regularly. I spent time in liberal AF Austn a few weeks ago as I regularly do, and I actually saw a ton of Trump signs, to my surprise. I guarantee you that is a huge sign that Texas is not going to flip. I've never seen conservative signs like crazy in Austin before. It is very uncommon.",
         "Theyve been saying this since 2016. I remember watching TYT in 16 and they actually thought Texas was in play. It may happen eventually, but it won't be this year. ",
         "Beto doesn't want to eat more dirt!",
         "i just wish they'd find a middle ground or have better messaging on this issue. I'm pro-life but i definitely think 12-15 weeks as a cap is very reasonable as a middle ground\n\nNobody even knows what Roe V Wade being repealed did",
         "Which do we think is more likely, WI or PA?",
         "Fourth day of early voting, I waited an hour plus, outside in the Texas heat, in a safe Trump county near Houston to vote. \n\nWhen I got in, it wasn't the people working inside slacking off or being understaffed, it was running smooth as silk, the crowd was simply due to the volume of people.  \n\nIt was decidedly not a Harris crowd, the Democrat with flyers kept coming around and no one would take her flyer, the Republican was having a great time handing out flyers and talking to everyone. The Harris popup nearby had one sign and one dude snoozing behind a table half the time, the Trump popup looked like a small party going on. \n\nThe demwits have the urban cities but the real Texas isn't flipping anytime soon. Fourth day of early voting, all these people standing in line in the heat could have left and come back later or the next day but no one was leaving. From what I understand that was every day of early voting at that polling location. \n\nEven Houston itself, from what I was reading the busiest early voting location was Cypress and the demographics out there (and yard signs) heavily favor Trump.",
         "I agree. I how Trump wins by evem a  percentage this time.",
         "What gets me is that these people move away from their crappy blue states and then vote the same way theu voted in the blue state. Makes no sense.",
         "As of last week Trump team thinks WI >PA>MI. They seemed really confident in WI. Not sure if it has changed since then. ",
         "Texas may go a little pink, but it's definitely not blue. Although Ted Cruz and Collin Allread are neck and neck, it could be anyone's game, but Texas will still be Trump country."
      ]
   },
   "1gk6u2l": {
      "title": "Megyn Kelly Endorses Trump in Pennsylvania; CNN's Dana Bash Shows Her Claws",
      "text": "",
      "comments": [
         "Megyn is more successful than she is, she is more intelligent, knows how to do real journalism, she's call BS on both sides, many more.\nDana bought and paid for by the left and a good portion of people see that.",
         "That is so wild after the rivalry they had haha I love it"
      ]
   },
   "1gjvudr": {
      "title": "It's Election Eve tonight. ",
      "text": "Don't forget to leave a Diet Coke and a McDonald's Big Mac out tonight. ",
      "comments": [
         "I'm putting out the Diet Coke, Big Mac and some garbage bags for cleanup.",
         "ROGAN JUST ENDORSED",
         "Trump just wished a Happy Diwali to Hindu's around the world and swore to protect Hindu's against radical Islam.\n\nMY FUCKING PRESIDENT",
         "I don’t know what to do with my hands.  I’m already wound a little tight and the waiting game hasn’t even started.",
         "r/politics leaving out a tampon tonight for Tim",
         "It's just like Christmas Eve, except instead of definitely getting presents tomorrow, it's either: \n\nA - Getting no presents, my guns taken away, my free speech taken away, WW3, 20+ million more illegal invaders, untold billions more to ukraine and israel, another great depression, lose my job, lose my house, and will have to listen to a drunk woman cackle at me from the oval office for 4 years.\n\nOr B - We all get wonderful presents (the best presents really) and the country is made great again.\n\nI, for one, am hoping for option B.",
         "The Grand Rapids rally will be electric. That's where he closed in 2016. We've come full circle.",
         "Get your fat pig husband out to vote tomorrow!",
         "My vote and well wishes coming from California!",
         "Ron Paul may get involved to help out Elon with federal cuts.\n\nTrump 2024  =  Ron Paul 2024",
         "And the left is infecting all the subs with their wails of abortion \"rights\".",
         "I don’t eat McDonald’s much but I make the Big Mac sauce at home in bulk and dip everything possible in it. \n\nhttps://youtube.com/shorts/4l7yLutlRD4?si=JDvKQ68Znw-_oQ6J",
         "I’ve been back and forth with my confidence this election, but I am feeling very confident that Trump will win. There is even more momentum for him now than there has ever been. The enthusiasm for Harris is just nowhere to be found.",
         "I just hope trump wins... The rally tonight was good in PA. Hope it gets him over the top since he needs to win Pennsylvania.",
         "Bahahaha",
         "I hope you got a visit from the MAGA Claus I know we did. Diet Coke empty, Big Mac has bites in it and he left me a signed hat!\n\nNow, time to put the nail in the coffin of Democrats and their \"Joy\" or \"Unity\" crap they been peddling! \n\nGo VOTE our lives depends on it.",
         "MAGA Claus is coming to town, and he's giving a lot of people some coal for Christmas!",
         "While that’s great, he should have a week or 3 ago",
         "I kinda forgot that he hadn't endorsed. I feel like he was holding it back in hopes of getting Kamala on the podcast.",
         "👍 Outstanding 👍",
         "And a package of Plan B for Kamala ",
         "Yep it's either the greatest Christmas ever or coal lots of coal",
         "The best present I could get is watching most of the fed get their layoff notices. \n\nI’ve been begging for government efficiency oversight for decades.",
         "Very well said👍",
         "Fist bump from the Bay Area!",
         "Why not just make your own for cheaper?",
         "Better late than never, and the fact he had both Trump and Vance on felt like an implicit endorsement anyway. \n\nI say welcome to the fight and let's F'n Go!",
         "Ok boo fucking hoo, how about when an independent decides to endorse instead of being a dick and going “hirrr he shoulda earlier” you go “wow that’s awesome!”",
         "I did. It’s just the ingredients in the video",
         "I agree",
         "Woah woah I think you took my comment in the wrong direction there my guy!!"
      ]
   },
   "1gk6vg7": {
      "title": "Joe Rogan Wrecks John Fetterman in Border Debate, Leaves Him Sputtering",
      "text": "",
      "comments": [
         "Credit to Fetterman for having the balls to show up, but Rogan's not gonna beat around the bush and lob softballs. If you aren't ready for him you'll get exposed.",
         "To be fair, almost everyone leaves him sputtering these days 🤣"
      ]
   },
   "1gk6wqd": {
      "title": "Dem Arizona SoS Loses Appeal on Releasing List of 218K Registered Voters Who Failed to Prove Citizenship",
      "text": "",
      "comments": []
   },
   "1gjtdpc": {
      "title": "Can't wait until tomorrow ",
      "text": "The meltdowns will be epic. Don't forget to stock up on popcorn ",
      "comments": [
         "Folks, be prepared for the Reddit outage",
         "#praying",
         "Let's hope we don't have to wait a week for them to \"Count the Votes\"",
         "Obviously I want Trump to win. On his inauguration I hope the screaming lady from 2016 shows up again.",
         "Youll have to wait cause the swing states will take days to count. No its not odd at all, dont worry about it.",
         "\"If you don't learn from history, you're doomed to repeat it.\"",
         "Me and the boys are playing this drinking game \n\nWatch MSNBC from 7 PM to midnight, take a drink every time you hear the word democracy or fascist \n\nI’m probably  waking up in the hospital",
         "Liberal tears are like the sun peeking out on a cloudy day.  Bring 'em on!",
         "I'll be happy either way. If he loses then everyone on the left will finally SHUT UP. \n\nIf he wins, I get the heartbroken, tear lined faces of over emotional, hysterical feminists and beta males as an early Christmas present.",
         "2016 election day on r/TheDonald was so much fun.\n\nHoping for another day like that today.",
         "IF she does win, how many of them are going to have buyers remorse within the first 6 months and actually admit to her many failures",
         "Only way to guarantee this is to VOTE! \n\nExecute and bring as many friends with you!",
         "I don’t know I think Trump loses PA and so the election, without PA Trump is dead in the water",
         "lol I hope so. Seriously gonna have a good laugh then cry because we still have a country.",
         "I hope so. The joy of hearing liberal heads pop for a while is just too much fun.",
         "Not that they are any different on any other day",
         "Crazy to think that tomorrow we will know if we have WW3 and officially an irreversible decline of our nation and the free world",
         "Pennsylvania has entered the chat",
         "I wish I could reply with gifs in here. Mods, make it happen. \n\n“Donald J. Trump is now the 45th president of the United St—NOOOOOOO”",
         "I want to know the context of the picture. What was she saying and to whom?",
         "Sock hat and glasses screaming lib will forever be a legend in the lore of American politics ",
         "What is dead may never die!",
         "It’s going to take a month to sort this out.   My friend in the army voted by absentee in PA, when the ballot arrived on the bold in bold it stated “unofficial ballot”.  Why would they sent him an unofficial ballot?   They called the election and were told that they voted would count.    \n\n\nIt’s going to be a mess.",
         "Bold of you to assume they know how to shut up, lmao. The bots know no bounds",
         "They won't shut up. They will be emboldened, and I guarantee that they will double the lawfare.",
         ">If he loses then everyone on the left will finally SHUT UP.\n\nAnyone that doesn't agree with them becomes hitler. They did it to DeSantis too. There is no end to it.",
         "No Man. The left will never shut up. Trumps loss will embolden them like nothing we’ve ever seen",
         "Happy either way? WTF?  \n\nI think you are in the wrong subreddit.",
         "Where did everyone from that sub go to?",
         "It was like that feeling of opening a Christmas present and getting that one thing you really wanted more than anything after spending the whole holiday season reminding yourself that it might not happen. Amazing.",
         "They don't have buyers remorse after 4 years of failures.  They'll be busy watching Trump get locked up in prison after 8 years of declaring law-fare against him.",
         "They’ve already hinted Saturday the earliest for PA.",
         "Absolutely agree",
         "There is an r/Trump forum, but I think they mostly came here, or went over to Truth Social and other similar platforms.\n\nI miss those days. Peak politics, perhaps we'll never have that much fun again.",
         "Now what are the odds of that actually happening?",
         "The memes were glorious. I don't think there will ever be anything like it again."
      ]
   },
   "1gk7p74": {
      "title": "Trump's closing message at 2AM this morning was strong enough to make me want to run through a brick wall 😤",
      "text": "",
      "comments": [
         "> hope that's right, I hope that's right. I hope that God did put me here to really save this country ... For every person and every citizen across this land, I am asking for the honor of your vote ... all I want you to do is to go out today ... As your president I will fight for you every day with every breath in my body. Together we will save this country ... we will defeat this corrupt system in Washington. Because I'm not running against Kamala. I'm running against an evil Democrat system ... Later on he captured it perfectly. \n\n\n>For the past 9 years we have been fighting against the most sinister and corrupt forces on earth. With your vote ... you can show them once and for all that this nation does not belong to them. This nation belongs to you.",
         "Hell yeah!!! \n\nLet’s make it too big to rig, people!!!\n\nIf you don’t vote - you cannot complain!!!"
      ]
   },
   "1gkas3k": {
      "title": "Kamala Tried to Start a Chant, and Hoo Boy She Made Jeb Bush and His ‘Please Clap’ Rally Look Like a Rave",
      "text": "",
      "comments": []
   },
   "1gjrpbw": {
      "title": "Georgia ",
      "text": "BREAKING: GEORGIA SUPREME COURT SAYS DEMOCRAT COUNTIES THAT OPENED OVER WEEKEND TO COLLECT BALLOTS ILLEGALLY CAN NOT COUNT THEM!\nThe Georgia Supreme Court Reversed A Fulton County Judge Who Ruled Democrat Counties Around Atlanta COULD Count Absentee Ballots They Collected From The Deep Blue Areas By Opening Select Offices After The End Of Early Voting IN CLEAR VIOLATION OF STATE LAW.\n\nhttps://assets.bwbx.io/documents/users/iqjWHBFdfxIU/rQSs57Ek6f9M/v0",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         ">BREAKING: GEORGIA SUPREME COURT SAYS DEMOCRAT COUNTIES THAT OPENED OVER WEEKEND TO COLLECT BALLOTS ILLEGALLY CAN NOT COUNT THEM!\n\nI don't see that in the ruling.\n\n>Consistent with OCGA § 21-2-386, the Cobb County Board of Elections and Registration (the “Board”) ***may count only those absentee ballots received by the statutory deadline of 7:00 p.m. on Election Day, November 5, 2024.***",
         "I don't think this says what you think it says - it doesn't say anything about the votes from *this past weekend* (after the end of early voting), it only talks about absentee ballots received *after election day*. I think you have the Cobb County late absentee ballots confused with the weekend shenanigans in Fulton, Dekalb, etc.",
         "Bout fucking time courts uphold the election laws we already have!",
         "Another win for election security!",
         "Fulton County.  Its where a lot of Zuck Bucks went in 20' to do the same exact things: Violate the rules to give Dems an advantage.   Fucking cheaters and liars.",
         "I have a feeling MAGA folks will be out in force tomorrow in Georgia.",
         "not seeing it. the order states absentee ballots received after 7pm nov 5 will not be counted. there is nothing there abouts the offices.\n\nCobb County Board of Elections and Registration (the “Board”) may count only those absentee ballots received by the statutory deadline of 7:00 p.m. on Election Day, November 5, 2024.",
         "Source? \n\nAnd fuck Fulton County lol always some bullshit every election",
         "🎶 We don't get fooled again! 🎶",
         "Thank God",
         "I bet they already counted them and mixed them in with the others and \"can't identify which ones they are\"",
         "\"Fuck election laws and security! They are racist! They are literally Hitler!\"\n\n- leftists",
         "What happens when they count them anyway?",
         "So I want to put a PSA out there. North Fulton and south Fulton county are very different and the Fulton you all dislike is south Fulton where downtown Atlanta is. North Fulton is mostly suburban and includes Johns Creek, Alpharetta, Milton (3 of the richest areas in the state) and Roswell. \n\nNorth Fulton tends to go more conservative, especially Alpharetta and Johns Creek. I live in one of these 4 cities and I wish we would break off of Fulton County and go back to being Milton County like we were until the 1920s. \n\nWe do not think like the downtown/midtown/hood folks. Not at all. North Fulton consistently scores nationally among elite places for raising a family, schools, amenities, housing, food scene, etc. We are not downtown. \n\n>!obligatory I already voted down ballot R including against this dork Ashwin Ramaswami up here. I hope my vote actually counts and isn’t replaced at 3am due to a “power outage” this year…!<",
         "Source? Google isn’t pulling this info up.",
         "source?",
         "[deleted]",
         "Imagine voting and your vote doesn’t end up counting because of some dumbfuck volunteer screwing up procedure",
         "So what happens now that the left knows how many early ballots were for Trump…",
         "But will it help the midnight watermain bursting and bags of ballots being brought in in the chaos?",
         "Ready for rPolitics to tell me how this is fascism.\n\nEdit: aww shit libs out in full force tonight",
         "Great news let's hope the other rigged states are being fixed",
         "Come onnnnnnn!!!!!!!",
         "So how may votes is that down the drain for them?",
         "This is HYUUUUUUUUUUUUUUUUUUUUUUUUUGE.",
         "And even this isn't the win a lot of people think it is. A Democrat leaning county is what triggered this ruling but the ruling doesn't only apply to votes from Cobb County. Republican voters have been encouraged to vote by mail this year and Democrats have been encouraged to vote in person (John Ossoff has been going on about DeJoy/the postal service for years now and Democrats no longer have faith in the postal service), all it would take is a Democrat mailman to \"lose\" a bunch from red counties. So this very well could hurt us as much or more than Democrats in the end.\n\nI know we can't have ballots showing up a week late but there needs to be a little wiggle room to prevent trickery and allow for an investigation if necessary.",
         "Possible. I snagged it from John Basham’s X post. I do not know Georgia judicial system.",
         "Fool me once, shame on you. Fool me twice. Shame on me. Glad to see the GOP got the rocks out of their pants and decided to actually do something about the fraud.",
         "First time for everything. But if this ruling is challenged who knows when we'll get election results from Georgia.",
         "They've probably already commingled the ballots.",
         "Like not purging voter rolls within a certain time period of an election…?",
         "Now we have to worry about the other states in play",
         "I'm in GA and didn't vote early. I for sure will be.",
         "Waited to vote til tomorrow. 👍",
         "We already have been and I hope we take PA and/or WI too to seal the win.",
         "They should have been out in force early and in person to help get rid of things like this. The more in person votes there are, the fewer mail in ballots can be forged.",
         "If I lived in the burst pipe precinct, wild horses could not drag me out of the polling place. \n\nA pipe burst? Then I’ll get wet. Keep counting.",
         "It's all over the top line on a Google search now.",
         "If you know how many Trump votes there are among the early ballots, you know how many Kamala ballots you need to overtake them.",
         "I thought they were counting number of ballots received, not tallyign up the vote. They can't tally votes until after the polls close.",
         "Thanks for the geography lesson! Good information to have.",
         ">Google isn’t pulling this info up. \n\nUse Bing, Google's AI they've started relying upon isn't nearly as good as soyjack subreddits chant it up to be.",
         "This is from John Basham on X\nhttps://assets.bwbx.io/documents/users/iqjWHBFdfxIU/rQSs57Ek6f9M/v0",
         "https://assets.bwbx.io/documents/users/iqjWHBFdfxIU/rQSs57Ek6f9M/v0",
         "I pulled it from X. I’ll check.",
         "https://assets.bwbx.io/documents/users/iqjWHBFdfxIU/rQSs57Ek6f9M/v0",
         "Similar to how the Republicans continue to file lawsuits in Pennsylvania to force as many mail-in ballots as possible to be rejected on technicalities such as a date not filled in, even while Elon Musk and some others are encouraging Republicans to vote early by mail. These strategies are inconsistent. Right hand not talking to the left hand. The GOP has been trying to enforce strict mail-in rules for years, but that's only because the ballots were overwhelmingly from Democrats. The strategy to reject more ballots makes no sense if they want Republicans to switch to mail-in voting (However, in PA, the mail-in vote remained overwhelmingly Democrat this year. GOP usage only increased by under 10%, I think.). Bottom line, Democrats are not more likely to make errors on their mail-ins than Republicans. And we even had someone from PA on here say his entire family's mail-ins were rejected this year.",
         "I think I'm more comfortable with a couple hundred (maybe a thousand max?) ballots being invalidated for being late than the opportunity to \"find\" a bunch of ballots after the election and just say \"oh, we received them late! But it's just enough for our candidate to win!\".\n\nAt some point, for the people who mail in their ballots, there just has to be accountability. You mailed it late, it arrived late, and now it won't count. Next time mail it sooner.",
         "I think the saying is  “Fool me….you can’t get fooled again.”\n\nI don’t blame you for fucking it up, it’s a tough one.",
         "Not sure it can be.  There’s no constitutional basis to appeal a state law to the US Supreme Court.",
         "This is the same county that the court case found 315,000 invalid votes for Biden. The democrats there are professionals at Ballot Box stuffing.",
         "It can't be challenged.",
         "By the end of the month maybe.",
         "They may not have time to challenge this one.",
         "very likely what they have done...",
         "Speaking of purging voters, how many ballots were cast in the Democratic primary for the shit for brains candidate you are supporting?",
         "I voted early but because I was out of town the week of the last EV period and didn’t want to risk anything happening Tuesday where I couldn’t go. Go cast that ballot and bring a friend. Let’s not be the reason we lose here in GA.",
         "LezDoIt!",
         "Pennsylvania is a must win for Trump, what ever way Pennsylvania goes so to will the election in my opinion",
         "They'd also have to know in advance how many Trump votes are cast *on election day.*\n\nWhich is why it was a \"bursting pipe\" last time around which prompted an evacuation.",
         "This doesn’t say anything about the ones collected over the weekend. Makes it seem like it’s ok because it says ballots collected by 7 pm tomorrow. ??? What am I missing?",
         "I don't think this says what you think it says - it doesn't say anything about the votes from *this past weekend* (after the end of early voting), it only talks about absentee ballots received *after election day*. I think you have the Cobb County mailing of 3K mail-in ballots confused with the weekend shenanigans in Fulton, Dekalb, etc.",
         "John Basham posted it on X along with a copy of the order.",
         "My point is you could mail it on time and a bad actor could sabotage it. There has to be some brief grace period to make sure people have time to check if their ballot arrived and investigate if it didn't.\n\nGovernment workers are overwhelmingly Democrats. Do you really trust some Democrat mailmen to handle hundreds if not thousands of Republican ballots?\n\nIf cheating were to occur, it would be much easier for them to \"lose\" ballots from red counties than to create fake Democrat ballots.",
         "The only way would be to say it violates some constitutional right. But it doesn't. In fact allowing them to get away with it would be what violate rights as it gives special treatment to voters depending on where they live and who they are likely to vote for. And they can't say the ruling violates the legislatures rules (which was the valid electors clause argument from 2020 even though SCOTUS was too chicken to take it) because that didn't happen here.",
         "It would be challenged as a violation of the equal protection clause of the 14th Amendment, which is a guaranteed federal right. So yes, it absolutely can be appealed to the federal courts.",
         "Surely the ballots submitted will have to be counted though, don't you think? I don't know Georgia law but the people who turned them in late were told to do so.",
         "I did a little more reading and it's 3000 ballots from Cobb county. If they're received before the polls close tomorrow they'll be counted, but they won't be accepted late.",
         "He could take Wisconsin and be ok provided Az is truly red this year. But yeah , PA certainly gives us a a buffer. I don’t see Michigan happening anymore unfortunately.",
         "So it looks like civil rights groups had fought for an extension in the counting of absentee ballots so that 3000+ ballots that are expected to arrive after election day could still be counted. The extension was granted, and then the Georgia Supreme Court said no and cancelled the extension. OPs post is incorrect. This is still a win for election integrity, but not like how OP is describing it. 3000+ absentee ballots won't be counted because they are expected to arrive after tomorrow.",
         "No. \"Ignorance of the law is no defense.\" If they were too late, they were too late, regardless of what corrupt election officials told them.",
         "AZ has the best early voting data of any swing state, R’s are outvoting D’s +9 in AZ so far, which is nuts",
         "I doubt Michigan goes red but you never know, especially with the voting shenanigans there",
         "That works for me, we know which party lives primarily in Fulton county and those nearby. I used to tell my kids that quote once they started driving, lol.",
         "Michigan has a lot of industrial union workers. Plus the Arab x-factor.  \nI also believe it is the least likely of the swing states to go for Trump, but I wouldn't write it off just yet.",
         "I’m not an expert just a guy with a laptop but none of the polls are going Trumps way in Michigan"
      ]
   },
   "1gjnr88": {
      "title": "Apparently Kamala has an issue with saying \"Merry Christmas\". Team Trump posted this and it has gained lots of views and likes.",
      "text": "",
      "comments": [
         "Never forget when Dems all coordinated the term \"easter worshipers\" and then got angry at people asking why.",
         "Is that a real video of Kamala?? The whole thing feels like parody, which I guess is on brand for the state of politics in this country 😅",
         "I'm no Kamala supporter, but her quote is terribly missing context.  Practically a lie the ways it's presented.  Notice how her clip is so short?  It's because she was saying that we shouldn't be wishing each other Merry Christmas in the face of kids having their immigration status pulled from them. \n\nWe can win this election and still tell the truth.",
         "See she's very sure of herself and to the point when she's actually honest.",
         "The most emotion she’s ever shown was over killing babies and not saying Merry Christmas. Says a lot about her character!",
         "Pffft… More practiced & rehearsed anger.\n\nhttps://imgflip.com/gif/987yiq",
         "NGL Kamala sounds like me seeing christmas stuff put up in the stores the day after Halloween. That is for the day after Thanksgiving and not a day earlier.",
         "[The people calling you weird](https://www.youtube.com/watch?v=VEFz2J56n7M).",
         "Man this is the shit they do to Trump and we get pissed about be better guys. There is plenty of negative things to post about kamala we don’t need to edit shit like this",
         "[removed]",
         "#Merry Christmas one and all!!!",
         "I will never understand this.\n\n\nI have no issues wishing Muslims \"happy hari raya\" even though I don't believe in Islam or it exists and I am an atheist who truly believe all religions are man made including Christianity. \n\n\nI believe every Holy book was a novel written by men in the past. \n\n\nBut what's the big deal to say \"Merry Christmas\" to those who believe in it? ",
         "I can’t even describe how much I love this.",
         "This has quickly become one of my favorite Christmas songs. Trump sings, *Christmas is Here*.\n\nhttps://youtu.be/nranUeNkXpM?si=C2rAQMnCm7cURvfK",
         "Meme magic is real!",
         "Never Forget Biden deemed “Trans Awareness Day” on Easter",
         "They are crazy.",
         "[Full quote](https://www.youtube.com/watch?v=fk91YYJUHus\n):\n\n> \"and only when they cleared that vet did we give them DACA status and now we're talking about taking it\naway. it is morally wrong and when we all sing Happy Tunes and sing Merry Christmas and wish each other Merry Christmas these children are not going to have a Merry Christmas. how dare we speak Merry Christmas. how dare we.\"",
         "Eh, once Kamala misquoted Trump's interview and spliced it to suggest he wanted to use the military to attack the American people, any adherence to the Marquess of Queensberry rules is out the window. Lie about the witch all day long, I say.",
         "Unlike when she's talking about ballot initiatives from her own state of California like prop 36. When asked by a reporter how she voted she refrained from comment as not wanting to endorse one side.\n\nYou want to be president but you won't tell the country how you feel about a piece of legislation? What do you think you're going to do if you win?",
         "And they say Trump is Hitler, her tone and mannerisms seemingly awfully angry Nazish....",
         "Thanks. I had blissfully forgotten that.",
         "Plus Christmas is an official U.S. holiday, and it has completely crossed over into the secular world. It's existed as a separate entity from religion for so long that the 1965 Charlie Brown Christmas special's main theme was about people forgetting that Christmas is about the birth of Christ. It's obviously a religious holiday to Christians, but it has a completely parallel existence as a secular holiday.",
         "The annoying thing was the the left came out in droves saying “It was always on that day. Why do you have a problem with it now?” It’s because the one year that Easter lands on that day, which it rarely ever lands on that day, is the year they decided to make it an official day.",
         "Theeeeeere we go. I was thinking “surely I’m missing some context here.” Still think it’s a very funny edit, but makes it feel a little more “normal” from her (whatever normal means).",
         "What's good for the goose is good for the gander.",
         "Tone seems a close match to Tokyo Rose.",
         "It also shows that Biden and his administration care more about trans people than they do about the Christian morality that tries not to validate that lifestyle.\n\nA President who claims to be Christian, while failing to uphold any Christ-like values, is nothing more than a snake.",
         "Why do they need an awareness day?  They are in women's sports and bathrooms.  Believe me, we are aware of them."
      ]
   },
   "1gjlya8": {
      "title": "I hope Trump wins.",
      "text": "Voted for him a third time yesterday. As a big middle finger to the MSM for lying about him 24/7. I'm not going to vote on the side of liars. If the media would just report facts and not add some demented spin on everything to demonize him then I'd be willing to give democrats a fair shake. But that's not what's happening. I used to think I was liberal until I joined Reddit.\n\nEdit: now I got Reddit liberals reporting me for suicide watch and going through my comments to harass me on other subreddits. I have absolutely nothing against liberals. Vote for Harris if you want, that's your right as voting for Trump is mine. If Harris wins, I'll be happy for you.",
      "comments": [
         "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
         "When the entire establishment of warhawks and career politicians come out against a candidate, that's a good indicator of exactly where your vote needs to go. Not sure where people are getting this sudden belief that politicians serve anyone but themselves.",
         "Voted for him for the first time in NJ, hopefully NJ wakes up because it's getting impossible to live here.",
         "Don’t forget you’re helping chase Whoopi outta our country lol. Get out and VOTE ya filthy deplorables!!",
         "Same! A big 🖕🏻to leftist Redditors and the left in general, another 🖕🏻to the media",
         "I just hope the polls are under predicting him again. We need to win or they will stack every state with so many illegal immigrants and give them the right to vote.",
         "Voted for Trump for the first time, as a former Biden supporter. Watching this country go nothing but downhill over the last 4 years, and how Biden's policies wrecked my family and the middle class gave me a rude awakening. As an Oregonian, I've watched the far left take a beautiful state and turn it into a crime-infested drug haven with radical socialists in Portland controlling every single piece of policy. It's about time we take our country back.",
         "3rd time in one election? That’s voter fraud!…….mainstream media probably. \n\nTaking things out of context. Their MO.",
         "MSM is nothing but lies. They lie favorably for Kamala and negatively against Trump. I literally don't even have to research anymore to see if whatever is being reported is true because it never is. Just look at the source reporting it.",
         "Anyone that called themselves center-left before ~2010 and is still a Democrat was never center-anything, they were just \"Team Blue\".\n\nI voted for Obama twice; but at some point, I just had to acknowledge that the Democrats were no longer a party of Liberals, but of Progressives. I didn't move. I just got left behind. Being a Liberal in 2024 is a solidly Conservative idea, and that's why I'm here.",
         "Me too. I voted for him in 2016, 2020, and again in 2024.",
         "I hope he wins to punish the Dems for all their Covid crap, and then for lying to us about Biden's dementia for years until he became a political liability. Not a liability as a world leader, mind you, he's been that for years and still is. But as a political liability who might cost them power. That's when everything changed.",
         "Former third-party voter here. My middle finger was to the media, government, and medical industry for lying to us about COVID.",
         "Land\nSlide",
         "Big upvote, feel the same! Voted already Trump for the 3rd time also",
         "Report the suicide watch as harassment.   They get bans for that. ",
         "I have a feeling Trump wins but I am more hoping the media has a realignment. One of my favorite pastimes is being able to read/watch the news without obvious distasteful spin.",
         "Wife and I voted for him last week. Anxious about possible election frauds but hoping whatever happens is legitimate and not some bullshit. I don't see how Trump can lose and pray he doesn't.",
         "Me too!!  vote it’s the last day, do whatever you have to do today to vote.",
         "We all do. VOTE\n\nand then hope for the best.",
         ">1,042 points (64% upvoted)\n\nLots of salty salty people lurking in this sub.",
         "\\> Voted for him a third time yesterday.\n\nOutstanding...I see your inner (D)ifferent is bleeding through.  s/\n\nEdit...lol so many trolls...see you guys Wednesday.",
         "I can’t wait for Trump to win. I’ll be watching Steven Crowder’s election coverage until it’s announced. I’ll be reading all the drama on Reddit as it’s happening.",
         "VOTE",
         "I mean doesnt it kinda feel like the dems handed him his 2nd term on a silver platter? I mean, we have Biden dropping out, years of messed up economy, scandals, all the stuff from the 2020 campaign coming out to be lies literal months after Biden takes office. Its almost like him getting re-elected was supposed to happen. If he doesnt get elected, then i will be shocked because how the heck after all that he still loses. He wont be able to run again, he might lose all support.",
         "Report every single one of the RedditCares messages.  They will ban people abusing that tool.\n\n\nEven though he's not my favorite, I hope he wins too.  Kamala has a lot to answer for, especially for lying to us so long about Biden's health.  What else would she lie about?",
         "[removed]",
         "Thank you to everyone who cares enough to vote and appreciates the ability to be a part of this decision.",
         "I relate to this…if trump doesn’t win, the media will be justifying themeselves and keep lying about republicans",
         "You and I think alike. Wear those reports as badges of honor. Anyone who takes the trouble to stalk you is really just letting you know the degree to which you triggered them. I know you say that isn’t your goal, but it brings me joy.",
         "You do, huh? Brave of you to post that here",
         "I can't lie, he is pissing off all the right republicans and democrats.",
         "When the establishment says “something is a threat to democracy” what they really mean is a threat to their corrupt bureaucracy",
         "Additionally, Iran and Russia put their support behind Harris. When your enemies want to see a specific party in power, you should do everything to make sure that doesn't happen.",
         "If America actually elects a president who’s only selling point is a bastardized argument in favor of abortion then we all deserve what happens next.",
         "Ayyy I also placed my voting gabagool on Trump",
         "Thank Murphy for that, partially. Was always a high cost state but it keeps getting worse. Min wage hike didn’t help..",
         "Get on with the times will ya. We are garbage now.",
         "She keeps saying she'll leave but never goes",
         "I didn't necessarily vote against Harris, but I was sure to vote against the Media machines, Reddit especially. \n\nEDIT: Oh, but when I filled in that Trump oval... I did think about Harris's stunt and nonsense during Kavanaugh.",
         "Narrator: they were.",
         "Welcome Mr. Ripe. I'm from Humboldt County and so happy to be a Texan now. You are right Oregon was a beautiful state just like California.",
         "Do you think your case is isolated? Do you see more switching in your family and friends group?",
         "To be honest, it took me a second to get that he meant in 3 elections. I also am only on my 1st cup of coffee.",
         "🛝",
         "[removed]",
         "Lol.....apparently not a moment in time for obvious sarcasm.",
         "This sums it better than anything we can not forget about China in the mix also.",
         "You should be in Washington State.  All the lady legislators did was run ads on abortion; I've seen ads by Maria Cantwell and Kim Schrier ad naseum this election season and its the only topic. The only thing they try to do is try to appeal to women for whom this is the only issue.  Everybody else can go to hell.  They will both almost certainly win and it just makes me ill.",
         "It's been shown and stated everywhere what the top 3 issues were that everyone is voting for and abortion was not in those top 3. I personally know a lot of women that are voting for Trump and don't care about the abortion rights. \n\nBut it's when I read all of these posts especially from the left that say the women are going to win the election this year, it's pretty damn sad just based on that alone",
         "This argument is bullshit. I don't deserve what happens next and neither do you. Neither does our families.\n\n\nIf our country elects Harris, those of us who are moral, God-fearing people just trying to make a living to support our families are going to be the people who suffer the most.",
         "\"All this from a slice of gabagool?\"",
         "I would say my case isn’t isolated. My brother has switched to the right as well, along with a couple of my friends. Some are still left though.\n\nThe vast majority of young guys like me that I meet and talk to though are conservative. I think Gen Z men are overall becoming more and more conservative because the left has either zero or straight up antagonizing messages for young men. That rhetoric is eventually going to come back to bite them hard.",
         "Can't win em all",
         "Are you telling me that Carmen Goers WON’T join extremists to push project 2025, and put doctors in jail?? \n\n/s in case it wasn’t obvious lol",
         "Not to mention the obnoxious lying around the initiatives. I was up visiting relatives and I couldn't believe what I was seeing",
         "I noticed this when I was up there in June, some of them were gleeful while talking about the sunject.",
         "Even if they care about abortion it's not realistically on the ballot so it should have no impact on anyone's vote. This is why people make fun of women.",
         "Sarcasm free day in here after 2020, haha. Cheers, man.",
         "Goers will lose, Reichert will lose.  Ferguson will be governor and Cantwell will continue on for life. My property taxes will continue spiraling upward as they pay school administrators $200-700k a year. Patty Murray, the world's dumbest senator, isn't on the ballot but she will probably continue winning re-election.  If I have a job come up in Idaho or Texas, it could mark my exit.",
         "But a lot of the libs on here are saying it does. Tons of postings on that alone",
         "We followed our daughter and family 6 months after they moved here June 2021. Left California after 64 years. My sister and brother live in Washington. Sis would love to leave, but can't leave her grandchildren. I hate to think we would still be in California if not for our daughter and retired Marine Husband.",
         "Yeah because what else can they run on? They are conditioned their whole lives that democrats are the good guys we are the bad guys. It's deep psychological conditioning so they will latch onto any excuse to rationalize it rather than change their position if they can help it. Many of them are lying about that being the real reason but they have nothing else to say because they're so obviously on the wrong side. They have to create caricatures about abortion and democracy even though when you push them on it it comes down like a house of cards. But as they say, \"you can't reason someone out of a position they didn't reason themselves into.\"",
         "[deleted]",
         "Good points all valid. Love your \"You can't reason\" line too.",
         "Yeah it's hot here in Texas, but I'm getting used to it even though I lived my first 64 years in a county where if it got to 70 degrees we all thought we were dying. Now 70 is cool (been here almost 3 years)."
      ]
   },
   "1gjnrr8": {
      "title": "New Trump ad just dropped staring Elon Musk, Tulsi Gabbard, RFK Jr., Nicole Shanahan, JD Vance and Vivek Ramaswamy.",
      "text": "",
      "comments": [
         "Banger ad. We have 24 hours to decide this country's future. Don't wait, don't be lazy, don't get complacent.\n\nIt's time to push through the finish line and WIN.",
         "Feels like the Avengers forming.",
         "Just imagine if Ron Paul got in on this too. RFK Jr put it out there.",
         "Whoever edited this deserves a raise",
         "Where is this playing? The most important thing is who sees this in the next 24 hours.",
         "Not gonna lie this gives me exactly the same vibes as that final / closing ad from 2016, where I was like dang how could you not be down with that message. Time to bring it home.",
         "Man this needs to be played everywhere. No division, no hate, no name calling, just all about our country moving forward together and achieving greatness.",
         "This shit got me so hyped. What a fuckin banger!",
         "I just don't see how anyone can be against this campaign. Biggest tent campaign I've ever seen. Former Democrats, former never Trumpers, classical liberals. Elon Musk was the champion of the left as the leading EV manufacturer until he had the nerve to have opinions.",
         "Thats a banger ad cant wait.",
         "What a world where democrats have to admit Donald Trump is the coalition moderate candidate.",
         "They should have been spamming this shit for the past week. Fantastic ad, really drives home the point that the MAGA message is for *everybody*.",
         "The ONLY one single thing I would have changed on that... Is I would have had the FIGHT FIGHT FIGHT clip. \n\nI have to be honest, NOT USING THAT ALL THE TIME has me confused. I get they don't want to encourage another try, but come on! It is ICONIC.",
         "Not gonna lie, his ticket is basically a dream team. His momentum is huge.   \n\n\nAnd I say that as someone who genuinely started off really disliking Trump.   \n\n\nHope this team wins.",
         "We need the link to this one. Dang, that is a kick ass ad.",
         "A political ad has never made me tear up before. This is amazing. So optimistic.",
         "This is great. It makes me happy.",
         "I wish the people that constantly hear about how evil and racist and sexist the Trump campaign is would actually pay attention to the Trump campaign.",
         "Wow. Amazing. What a line up we have, we have the best and most intelligent political leaders. I don't even look at them as politicians. They are the voices for us, and they want us to succeed and progress in life. They actually want what's best for our people and country. We haven't been able to say that abt the democratic side in a long time. Where you at Candace Ownens! She needs to be in this line up as well.",
         "Fucking goosebumps!",
         "Damn where's the IG reel I can repost?",
         "This is Beautiful! One of those \"Tear in my eyes\" moments",
         "🇺🇸❤️I’M LOVIN’ IT!!!!❤️🇺🇸🙏🏻🙏🏻🙏🏻🙏🏻",
         "It's a good ad.",
         "First time I watched this, I watched it muted and STILL got goosebumps. What an incredible coalition of world-changing passion, dignity, and love for this country.",
         "I hate to use emojis here, but this necessitates it…\n\n🔥🔥🔥",
         "Did this have anything to do with the whole SNL/NBC bit?",
         "Incredibly uplifting. Anyone saying otherwise has their head in sand.",
         "This is the future they want to steal from you",
         "I literally don't understand why Nicole Shanahan is being used in any of this. It was even crazier that she was RFK's V.P. Any political office is entirely out of her league and above her paygrade.",
         "Why did they wait to so long to make and play this ad? This is perfection.",
         "We've seen what _one_ unabashedly conservative Governor, Ron DeSantis, is capable of. It was a massive missed opportunity not electing Kari Lake to join him in Arizona.\n\nI pray America doesn't pass up this opportunity to bring Elon, Vivek, RFK, Tulsi, JD, and Trump to Washington to get shit done.\n\nAll the damage Kamala and the Democrats can (or will continue to) do pail in comparison to the missed opportunity this group could deliver.",
         "Is the last shot with them walking AI looks kinda odd. The rest of the add is spectacular!",
         "One word to describe this ad\n\nGENUINE",
         "This blows away any Harris ad",
         "holy shit that's a good ad",
         "The fact they even included memes…I love this!",
         "That would make Kamala Thanos? That tracks considering she only gives a crap about half of humanity.",
         "The imagery is incredible.\n\nAnd I gotta admit… Tulsi looks really good.",
         "But they actually assembled for Kamala /s",
         "It's great!I got some hope",
         "RFK’s endorsement was crucial. I think it really started to help turn the tide. We could still be toast but I’m glad Trump had so many former democrats and others with just common sense standing behind him.",
         "Hopefully in every single swing state on as many channels as they can get it on.",
         "Got a link to that?",
         "Yeah but we have had a lot of great ads this cycle not just this one. [Check out this one](https://x.com/MAHAalliance/status/1849965434898161672) that absolutely demolishes Kamala.\n\n[This](https://www.youtube.com/watch?v=AFcrA3EeVp4) and [this](https://www.youtube.com/watch?v=Ipi5JpqkTfY) one are themed to focus more on Trump and his campaign's goals and policies. They are great as well.\n\nAnd the [JD Vance one](https://www.youtube.com/watch?v=XYDRWu0Dvj0) was also really well done.",
         "Same here. If Trump wins someone needs to edit “fight fight fight” right onto the end of this ad. That picture is one of the most iconic in my lifetime.",
         "The left depends on people not hearing a word that isn't filtered through MSM first.",
         "She's not impressive enough to be Thanos. Maybe tazerface",
         "Be cool man. ;)",
         "Those are Diddy-affiliated Actors. Don't need them.\n\nThe people on Trump's team are the real deal. It's hard to tell without the smoke, wires, spandex, and steroids. You need to actually hear the words they use.",
         "Kamala Harris, Down with Democracy!\n\n\n\n\n\n\n\n\n\n\nWait...",
         "[So cringe](https://youtu.be/TDvUe8fIuNs). Everything about their campaign is fake. They even have to bring out a fake Iron Man to contrast the real life one on our side. The differences between the two paths ahead of us could not be more stark.",
         "RFK's involvement never appeared to have any affect on the numbers. I personally think he would've been more helpful staying in as a spoiler to Kamala. Remember, the Dems desperately wanted him off ballots in the beginning. He was expected to take votes away from Biden.",
         "And the “slogan” the actors came up with is Kamala: Down with Democracy. Fitting. It was cringy.",
         "He was taking more votes from Trump than Kamala. Nicole Shanahan said that's why they dropped out and endorsed trump instead of staying in. ",
         "I don’t consider her enough of a political professional to trust her judgment on that."
      ]
   },
   "1gjrxtr": {
      "title": "Here's your reminder:",
      "text": "Regardless if you live in a state that goes blue every 4 years, if you think your vote doesn't matter, IT DOES. \n\nGo out tomorrow and vote like your life depends on it, because it does, and this election is the most important in our nation's history.\n\nVOTE VOTE VOTE!",
      "comments": [
         "CNN: Trump finalizes campaign with fascist salute",
         "Let’s go baby!",
         "FIGHT!",
         "That's my president",
         "Blue Oregon warned us its going to take a few days to tally *all* the ballots.",
         "Liz Cheney would be in a Kamala cabinet. Kamala Harris and Liz Cheney would be running foreign policy. ***Vote***.",
         "Don’t give them ideas lol"
      ]
   },
   "1gk8uuu": {
      "title": "JD Vance shares closing message after voting in Ohio: 'I'm going to fight hard for your dreams'",
      "text": "",
      "comments": []
   },
   "1gk76mn": {
      "title": "Harris campaign tells Muslim interviewer he can't ask about Gaza. So she talks up bacon instead (observant Muslims do not eat pork in adherence with their faith)",
      "text": "",
      "comments": [
         "Muslims hate her\n\nJews hate her\n\nShe somehow pissed both sides off",
         "Such hardcore journalism.  Talking about bacon, anchovies, and taking shoes off while flying.  I’m sooooooo concerned about all 3.",
         "I heard about that bacon comment yesterday and did a spit take. Her instincts are atrocious.",
         "But what’s baffling is that they will still vote democrat.",
         "sheep gonna sheep",
         "There's no mystery, Democrats don't give a rat's ass about the nominee they only care about *the system.* Joe Biden proved this beyond reasonable doubt and Kamala Harris is pounding the point down into the core of the planet.\n\nTheir system does not *produce* good individuals, it churns out endless masses who learn *working the system* as a way of life. Where is the *Democrat* Donald Trump? In the past, before his party left him. There is no equivalent among the modern Dems and there's not going to be one because the *mediocre-at-best overlords* would dump wrath on him for shining too brightly in the early stages of his career.",
         "Never doing that again"
      ]
   },
   "1gkasbb": {
      "title": "Widespread voting problems reported in 2 heavily Republican Pennsylvania counties",
      "text": "",
      "comments": [
         "Weird that it never seems to happen all that much in Democrat heavy districts...",
         "The good thing is we use paper ballots in PA and once the scanners come back, they can all be fed through the machines.",
         "This is exactly why Trump and his team wanted people to vote early to avoid the consequences of this possibility.\n\nSo for anyone in Pennsylvania who chose to wait until Election Day, I hope it was worth it.",
         "Good. Some republicans better be standing over their shoulders as they are scanned."
      ]
   },
   "1gjw84r": {
      "title": "Joe Rogan Endorses Trump ",
      "text": "",
      "comments": [
         "HELLO FREAK BITCHES",
         "Well it’s about fucking time",
         "He has essentially been doing so without outright saying it. His podcast has been a powerful mechanism for exposing the legacy media’s lies, corruption and general lunacy from the left. Now that he officially made the endorsement I could see him becoming public enemy #3 right behind Musk."
      ]
   },
   "1gk7pxz": {
      "title": "Many conservative candidates - including Trump - say “I love you all”, but the Democrats never do",
      "text": "I’ve noticed Trump has been saying this a lot at his rally’s and Kari Lake literally just tweeted it. The compassion and love from one side is outright verbalized while the other side calls people Nazi’s and garbage. The difference is do clear.",
      "comments": [
         "Trump ran for us, Harris ran for money and power",
         "Maybe, just maybe, it’s because the left genuinely hates people.",
         "Conservative candidates: “thank you and i love you”\n\nDems: “they are literally the enemy. Fight like you are preventing Hitler from coming to power”",
         "Because the left hates people who don't agree with their hivemind.",
         "Dems are hateful, insufferable, vile people.",
         "Anecdotal, but I've seen this at a Harris event. But generally I would definitely agree.",
         "For the Democrats - half the crowd is of the opposite gender so that would come across as straight and offensive to LGBTQP.",
         "Because they DON’T love you, they love your VOTE.  These people are obsessed with gaining and holding power.  That’s their only true love.",
         "Anyone that doesn't agree with them at the very least"
      ]
   },
   "1gk1mya": {
      "title": "Vote like your life and the republic depend on it",
      "text": "",
      "comments": [
         "Waiting in a windy and cold hour long line in Indiana. Nothings stopping me",
         "Good morning people!! Let’s get it!!",
         "In about one hour I will proudly vote for Trump in a deep blue state. Let’s pad those general election numbers to make his win even more important.",
         "ITS GAMEDAY MOTHERFUCKERRRRRSSSS",
         "We've got a country to save!"
      ]
   }
}