{
   "1gk6wgj": {
      "title": "My wife said if Harris wins I will get laid tonight. Please, I’m counting on you people… I need this! ",
      "text": "",
      "comments": [
         "Yes, she told all of us the same thing. Vote Blue!",
         "Jokes on you. There’s a strong chance we won’t find out the winner tonight. ",
         "Looks like one way or another you're fucked!",
         "So either you get fucked or we all get fucked.",
         "Tell your wife that no matter what happens that Harris is a winner in your book",
         "Humpin for Harris.  The campaign should've thought of this",
         "Wait are we married to the same woman ?",
         "Tell your wife that if she truly cared about Democracy she'd be willing to lay some of the rest of..  oh nevermind!\n\nHere's hoping for you my dude (and the rest of the free-thinking world).",
         "It might take a few days so if Harris is still leading each night remind your wife a deal is a deal.",
         "And if Trump wins the world is fucked.",
         "I've done my part. Godspeed, brother!",
         "Go ahead and check that box.",
         "I did my part. God speed, brother...",
         "We'll get u there",
         "Good luck 🤞",
         "I’m rooting for you too!😂🤣😂🤣😂🤣",
         "I did my part, brother",
         "![gif](giphy|YYfEjWVqZ6NDG)",
         "Tell her I voted for her, maybe that’s worth at least a handjob",
         "We won't know the winner tonight. Most likely in the morning.",
         "[removed]",
         "I did it all for the nookie…",
         "hate to break it to you guys who are (actually) hoping to get laid tonight, but she's not winning tonight.\n\nby the end of the week?  hopefully.",
         "Lysistrata vibes. Hope this is a trend all over the US! (https://en.wikipedia.org/wiki/Lysistrata)",
         "LOL",
         "Probably won’t know tonight. It will take days to count all the truckload of fake votes they have to ship in.",
         "If you get laid we all get laid buddy",
         "...Yea but if she loses you're gonna be fucked for four years.",
         "So this is like an every four years thing? Lucky",
         "Lmao",
         "You got it, Doug.",
         "Heh we wont find out tonight",
         "God speed, my guy!",
         "I too choose this guy's wife",
         "![gif](giphy|YYfEjWVqZ6NDG)",
         "VOTE!!!\n\nhttps://preview.redd.it/denkrvtgd3zd1.jpeg?width=1284&format=pjpg&auto=webp&s=3a31d7dbd069815eff24d6fed41b4e2d24f032b0",
         "My wife and I are in Alabama, and we both just voted for Harris! I hope you get laid tonight! Ha ha ha ha ha ha (the voice to text literally put in my wife’s laugh) 🤣🤣🤣",
         "May the grace of Aphrodite be ever in your favor! Godspeed.",
         "lol, probably won’t know until tomorrow. Wife played the same trick on me 😂",
         "I did my part to help you by voting early .",
         "Bro, you’re not getting laid tonight. I want her to win but the election will not be called any time today",
         "Come on Donnie! Let's cockblock this redditor.",
         "You've got me in your corner... not actually because I'm pretty scared of guttural noises.",
         "We won’t know the outcome for weeks, potentially. And Trump will never concede.",
         "Not quite. She said she'll blow you off.",
         "Hey, pal, I'm just supplying the vote.",
         "Just a thought......if trump wins, we are all getting screwed....oh...and not in a good way!!\n\n![gif](giphy|LOo1Wvh984zJQzqOvn)",
         "I'd vote multiple times for you but it's illegal.",
         "Hillary Clinton is going to be jealous af if Harris gets to be the first woman president",
         "Based on the amount of recounts and lawsuits Trump will demand, you're not gonna have sex for atleast 4-5 months buddy.",
         "Make her promise you'll get laid again in 4 years when she wins in 2028 too! I suppose maybe the 2026 midterm elections too but maybe don't get greedy.",
         "Everyone congratulate u/kgmercier when she wins",
         "I voted Harris. Does that make me your wingman?",
         "Unfortunately I am not allowed to vote, not being American and all.\n\nBut if I could, I'd vote to get this man laid",
         "Remember ladies, there's nothing wrong with denying your man sex if he votes for Trump.",
         "Good luck, Mr. Gorsky",
         "Your wife is playing you, because no one will know tonight.",
         "Guess we’re all voting for Harris now… for the greater good 😂",
         "But if she loses we all get fucked!",
         "The funniest/saddest part of this statement is that you think the winner will be settled tonight....",
         "Your wife is getting you a prostitute? Nice!",
         "I really want you to get laid, too!  Go Kamala!",
         "Yes and if Mango Mussolini wins we’re going full Lysistrata.",
         "Of course a beta would have a wife like this. \n\nI’m sure she’ll let him watch her black boyfriend run her though after Trump wins",
         "Cocked more times than Rambo's Rifle!",
         "Dude… I thought I was the only one she told that to…",
         "I also choose this guy's Harris-voting wife.",
         "That’s allot of Karmamala!!",
         "OP gonna roll over at 4 am: \"hey babe, wake up...they just called Arizona\"",
         "I mean it is No-Nut November sooo….",
         "Gotta go for that blue wave",
         "Yeah I was going to say... This won't be known tonight. Assume the usual slurry of Trump and MAGA lawsuits to challenge everything they can.",
         "Donald will know who wins, I give it until 10pm he declares himself the winner lol",
         "I'm proud of you. Take this upvote.",
         "Ooh! \n\n\nChoices, choices...",
         "Porn sites did. I see banner ads all over em saying Project 2025 will ban porn.",
         "Dibs on Thursdays.",
         "All posts and comments that include any variation of the word retarded will be removed, but no action will be taken against your account unless it is an excessive personal attack. Please resubmit your post or comment without the bullying language. \n\nDo not edit it, the bot cant tell if you edited, you will just have to make a new comment replying to the same thing. \n\nYes, this comment itself does use the word.  Any reasonable person should be able to understand that we are not insulting anyone with this comment. We wanted to use quotes, but that fucks up the automod and we are too lazy to google escape characters.  Notice how none of our automod replies have contractions in them either. \n\nBut seriously, calling someone retarded is only socially acceptable because the people affected are less able to understand that they are being insulted, and less likely to be able to respond appropriately.  It is a conversational wimpy little shit move, because everyone who uses it knows that it is offensive, but there will be no repercussions. At least the people throwing around other slurs know that they are going to get fired and get their asses beat when they use those words. \n\nAlso, it is not creative. It pretty much outs you as a thirteen year old when you use it. Instead of calling Biden retarded, you should call him a cartoon-ass-lookin trust fund goon who smiles like rich father just gifted him a new Buick in 1956.  Instead of calling Mitch McConnell retarded, you should call him a Dilbert-ass goon who has been left in the sun a little too long. \n\nSorry for the long message spamming comment sections, but this was by far the feature of this sub making people modmail and bitch at us the most, and literally all of the actions we take are to make it so we have to do less work in the future.  We will not reply to modmails about this automod, and ignore the part directly below this saying to modmail us if you have any questions, we cannot turn that off.  This reply is just a collation of the last year of modmail replies to people asking about this.  We are not turning this bot off, no matter how much people ask.  Nobody else has convinced us before, you will not be able to either. ~\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
         "Honestly, that's a plus in my book. Screw Hillary.",
         "6 year old account with negative comment score, that's just embarrassing.",
         "Every vote's a chance for some extra romance!",
         "You thought!",
         "And honestly, if I'm his wife, I'm instantly wet at that declaration--let's go!",
         "he doesnt need to nut",
         "I thought that was just for jerking?",
         "My wife is on her period right now... the red wave. Will I have to ride a red wave?  What does it mean!?",
         "That late? I thought by 5 P.M., but I may be wrong.",
         "Thank you Pepperoni Dogfart!",
         "Not as embarrassing as voting for a slut.",
         "Yeah honestly this would work on me",
         "Yeah, guess Herr Drumpf qualifies as a slut... he certainly puts out for Putin...",
         "Better than voting for [Pinky and his Brain](https://youtu.be/4sPEmB87cmk?si=00CDBca1Pey-oyGj).",
         "[cracker bargle](http://i.imgur.com/1zfkFBz.jpg) ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
         "Wow. You’re still holding onto that hoax, huh?\n\nYou’re literally like Alex Jones and Sandy Hook by now. 😀🤣🤣"
      ]
   },
   "1gjrtpb": {
      "title": "Another reason to vote Harris",
      "text": "",
      "comments": [
         "yeah, I've gotten an average of 2 or 3 political fliers \"bashing\" harris every day for the last month.  Almost all the things the GOP PAC's are saying about her make me want to vote for her more.",
         "Please. I can only get so hard",
         "Don’t threaten me with a good time.",
         "If I never have to hear about Elon Musk again, it wouldn't bother me at all.",
         "If only Carson ever told the truth...",
         "Elon’s only in danger of being destroyed because of the treason.",
         "Let's be clear, he'll still be the richest man in the world but with House, Senate, and Pres. he'd actually have to start paying taxes like us common folk.",
         "I'm pretty sure Harris has this in the bag. The most destructive thing anyone could do to Musk is go back in time and make him buy Twitter.",
         "Please Harris, do this.",
         "What is all the illegal shit that Musk is up to that he’ll be “destroyed” if we actually follow our existing laws?",
         "![gif](giphy|3ohzdIuqJoo8QdKlnW|downsized)",
         "![gif](giphy|12zfAjyQ3RZNSw|downsized)",
         "This is likely true because Musk needs fellow child lover Trump to squash the investigation into the Epstein list.",
         "Seriously, I saw someone post a list of talking points against Harris the other day. Aside from \"supports Hamas\", which I doubt to be true, literally every single one was a reason I would vote for her if I could.",
         "Gold ❤️",
         "Please let him lose. Let the openly proud ruling billionaire lose. The masses will win.",
         "Elon Musk? The African illegal immigrant with a bunch of anchor babies? That Elon Musk?",
         "Didn't Fox \"News\" argue in court no rational person considers anything he says as true",
         "Musk could lose like 99.9% of his money and still be rich as fuck.",
         "lol",
         "Yeah because Tucker Carlson is a reliable source for information about the world, good point",
         "I want more details.\n\n\"Emotionally destroyed\"?  \"Financially destroyed\"?\n\n\"His national security-related businesses become nationalized and all he's left with is a social media site and some janky trucks destroyed\"?\n\n\"His off-the-books-dealings with sanctioned autocrats violating, among other things, the Logan Act in jail for life destroyed?\"\n\nI know his family life won't be affected.  He's demolished that himself.",
         "Oh, no! What did you say we were having for dinner?",
         "I can only get so hard.",
         "Destroyed is weird, what's wrong with you all?",
         "My favourite thing was that article that revealed why her staff has such high turnover, and the content described that people keep leaving her staff because .................. Kamala would regularly come to meetings more prepared than everyone else, ask questions that people weren't prepared to answer (but should have been), and overall has extremely high expectations for people working under her. They were trying to frame it as \"see, she's a demanding witch!!!\" but it honestly just read like a big endorsement rofl. So she's incredibly prepared and expects her staff to be functioning at extremely high levels? Sounds just like what a presidential office needs.",
         "I watched Hannity for a few minutes earlier, to see what they were saying to get people spun up ahead of the election, and he was trying to tie her to Biden’s handling of the withdrawal from Afghanistan. \n\nHe kept saying “by her own admission, she was the last person in the room with Biden when these decisions were made!!” \n\nLike it was a bad thing, lol. Yeah dumbass, that’s called “being the Vice President”.\n\nSMH…",
         "I haven't gotten any at all, only for local/state-level races. You must be in a swing state.",
         "“If you vote Harris, they’re gonna legalize weeed!!!!!!!!” 😂",
         "Don’t get too excited. Tucker Carlson is a lying political hack and it’s unlikely a billionaire will be destroyed because of an election.",
         "Ditto.",
         "One man apartheid. Very apartheid.",
         "You vote yet?",
         "Buying votes for one.",
         "It's kind of insane that it's reached the point where the only possible reason most people can fathom for laws actually being enforced against billionaires is due to political retribution.",
         "Rachel Maddow had a section of her show last dedicated to talking about Musk. Lots of info about repeated communication with Putin. Putin asking Musk not to activate Starlink over Taiwan. Russian troops using Starlink on the battlefield. She suggested that he may be forced to divest Starlink and SpaceX due to national security concerns. That wouldn't destroy him but if he was found to be going around the sanctions imposed on Russia there might be the potential for jail time.",
         "I'm not at all convinced that Trump is a Billionaire.",
         "Fox argued no reasonable person would consider anything FOX says is true. Yes really.",
         "13 day old account, first comment is about \"ballots having incorrect info\"\n\nCommiebot confirmed. Get outta here",
         "They weren't prepared for a real life President Bartlett.",
         "They also like to leave out the part where it was trump that brokered that deal with the Taliban to have American troops withdrawal. Just so happens that the lame duck didn't get back into the big boy chair for when the withdrawal was scheduled. Not like Hannity's viewers would care anyways.",
         "I do live in a swing state.  I even live in a county that has flip-flopped between parties in the last few elections.",
         "According to his lawyer, he wasn't buying votes- he was paying predetermined spokespeople to pretend they won a lottery. That's not an exaggeration.",
         "Always had been",
         "I was talking about Elon.",
         "Or the part that the deal included the release of 5000 Taliban prisoners and the rapid reduction of US troops from 13,000 to 2,500, all against the advice of the Afghan government and the Department of Defense who informed Trump that Taliban we’re breaching the deal and escalating violence. By the time Biden was in, Trump’s chaotic plan had already festered to the point of no return. Everything Trump touches dies.",
         "It wasn't a lottery your honor, it was a fraudulent scam!"
      ]
   },
   "1gjvnpz": {
      "title": "???",
      "text": "",
      "comments": [
         "Either way, the new President will be dickless.",
         "https://preview.redd.it/4a3m6e2rj0zd1.jpeg?width=722&format=pjpg&auto=webp&s=01defebe32bce4273fba6fd37bd9c1f2a0d0e016",
         "Most elections take a few days to count, but at least we will get those \"270-to-win\" trackers to obsess over.",
         "I hope it's a girl instead of that 'pussy'!",
         "Another woman just died in Texas.",
         "There may be some delay with lawsuits.",
         "If not, time for one of those famous post-birth abortions!",
         "Clever. Very clever! 🤞",
         "💙🌊💙🌊💙🌊💕",
         "A girl is pink, and the racist, fascist, pile of shit and bile? Brownish? Confederate/Nazi flag color?",
         "It means the president of the USA",
         "[deleted]",
         "I hope it's non-binary",
         "Ouch...True though.",
         "Either way, the new president will be wearing makeup!",
         "But one has the balls it takes to run the country. Hope she wins.",
         "The difference is that one came stock that way while the other one had had his fall off due to disease.",
         "Either way, the new president will be called 'Madam.'",
         "![gif](giphy|jErnybNlfE1lm|downsized)",
         "Not the NYT! Their people went on strike. Specifically the tech guys in charge of it lol. Good, they can eat shit.",
         "When Kornacki sees a clear path to 270, I’m popping the bubbly.",
         "Can you recommend a good one? I'd like to do some obsessing.",
         "Orange?",
         "Orange?",
         "You didn’t get downvoted because you’re trans you got downvoted cause you sound insane",
         "https://www.youtube.com/watch?v=MAKRdvLfhn4",
         "I did put bubbly in the fridge last night.  I have another bottle on standby for inauguration day.",
         "I will be eating orange chicken this evening while I watch the results come in. Orange chicken and mango habanero chicken.",
         "[deleted]",
         "I knew exactly what that was before I clicked on it.  You deserve praise.",
         "Nice! 🍾🥂",
         "Your post just kind of seems like nonsensical ramblings tbh",
         "Yes, it's true.",
         "Always quote the crazy shit."
      ]
   },
   "1gjsw3o": {
      "title": "China remembers.",
      "text": "",
      "comments": [
         "“Fixing” a problem he created was kind of Trump’s thing.",
         "That's what tariffs are really good at. You hurt everyone (hopefully they don't figure it out). Then you help the 'right' ones and are seen as a savior.",
         "Trump is really, in reality, a dumbfuck.",
         "And the MAGA farmers took the socialism money.",
         "https://preview.redd.it/5hfkysot30zd1.jpeg?width=1200&format=pjpg&auto=webp&s=b9655eb66f29c178b1e34c7e64abb6636b852265",
         "Don’t forget that farmer suicides were at an all-time high in 2019 due to Trump’s retaliatory tariffs on China (they stopped buying American soybeans, roughly 25% of the American crop). Article courtesy of that left-wing pinko rag /s [by Forbes](https://www.forbes.com/sites/chuckjones/2019/08/30/amid-trump-tariffs-farm-bankruptcies-and-suicides-rise/)",
         "Oh, don’t worry. His supporters don’t remember a thing.",
         "Iowa remembers",
         "Didn’t even fix the problem. Many of the places that would have gotten those crops now get them through other means. So these farmers still lost out on a ton of future revenue.",
         "He simple don't care about others except himself. There's a word for it: NARCISSISTIC asshole!",
         "If tariffs are so great, why isn’t Trump calling for 2000% tariffs on all of the crap he buys from China?  China pays them, right?  Tariffs don’t raise the price people here pay, right?  Why didn’t he implement this bigly jenius economic policy when he was president?\n\n‘Tariffs for thee, not for me!”\n\nOne would think he could show us all by doing it with everything he buys from overseas.",
         "![gif](giphy|PGcXQ2jkpd7KFhJg3k)",
         "https://preview.redd.it/1df6qrryc0zd1.png?width=394&format=png&auto=webp&s=9e48e900befe1299ac3978d6441ce7dd9de26906",
         "Also +23% of American Farmer went bankrupt because of this China Tariff war.  So a lot of the bailout went to the very wealthy top Corporate Farms screwing over the small American Farmers.",
         "You should really let it sink in that Trump managed to leverage the \"strongest economy in history\" into a big-boy trade war with China which he lost miserably, and had to drop billions to bail out the farmers he fucked over to do so. China said it would allow US beef to be sold there, which means little. While Trump opened up our banks to Chinese investment, which is fucking huge. We shouldn't have China anywhere near our banks.\n\n\nAnd he thinks Xi \"respects him\". Xi thinks Trump is an easily manipulated dope that is the king of easily manipulated dopes.",
         "Because \"shitty, broke, useless liar\" is Trump's middle name. Many, many people are saying so.",
         "I worked for a company that went out of business because of his China tariffs",
         "The only reason Republicans exist is to raid public coffers.",
         "Tariffs created the spike in inflation that Biden fixed with the Inflation Reduction Act. I don’t understand how more people don’t know this. \n\nIf you think inflation was bad before, wait until you see what Trump’s economic platform this election will do.",
         "the good old “thanks, Obama” preceding the modern “Biden did that” /s",
         "Tariffs are a perfect setup for corruption.  It's the ideal tool for Trump.",
         "I feel like people really don't understand the issues with Trump's tariffs and why they failed. \n\nYou can criticize Trump on these but in reality the Biden administration kept almost all of these. This isn't a \"both sides are the same\" because I believe Biden did something very important.  \n\nReality is that Tarriffs inherently aren't bad. They're just harmful and ineffective when used on their own. \n\nIn this case I believe that Tarriffs are an important piece of the puzzle. The promise of globalization was \"go and be a professional. We will retrain you. Let other countries do the heavy lifting manufacturing and we will get relatively cheap goods and you'll be able to work better jobs.\"\n\nTo start. White collar industries have a critical mass of workers they can support. Not everyone that worked in factories is going to get retrained into engineers and bankers. \n\nThe flip side of that is that there should be some level of quality vs price advantage for Made in America. There's a theoretical curve that would exist that would allow factories to function here in the US.  \n\nWhich brings us to the second problem: China and Mexico aren't playing by the rules. There's an assumption in these treaties that there's a human and workers rights cost that is paid by the manufacturing process there to maintain a standard. There are requirements on US companies that are supposed to prevent them from functionally using slave labor. \n\nThese in practicality are ignored. This drives costs down for consumers but they are driven below what is feasible to compete with on the quality/cost scale, and this kills the ability for American manufacturing to compete. \n\nThe theory is that Tarriffs balance these scales.  The idea is exactly that the consumer eventually pays the cost because it's supposed to counteract the fact that prices are driven down as a result of human rights abuses.  \n\nThe half of this that Trump ignored (because he just wanted to make it look like he did things instead of doing the work) is that you need to invest in the industries you are tariffing. Biden kept the Tarriffs and finished the job correctly by passing a massive infrastructure bill to reinvigorate American manufacturing after it was gutted as a result of globalist and consumerist policy. \n\nYes. Costs will go up. That's expected. The point is that these costs are blunted by more people having jobs to actually buy the stuff and to stimulate the economy. You can't just slap Tarriffs on things and expect it to fix things. You need to do the work to rebuild what was broken.",
         "not the pooor small American Farmers they saw almost 23% go bankrupt.  Almost 93% of the US Govt Farm subsidiary went to the wealthiest farms that earn more than $1M a year.\n\n75% of Farmers in '18 earn less than $50K a year - during trump's tariff war with China those were the ones that were hit the hardest and didnt recover. \n\n[https://www.forbes.com/sites/eriksherman/2019/12/27/trump-china-tariffs-farmers-subsidies/](https://www.forbes.com/sites/eriksherman/2019/12/27/trump-china-tariffs-farmers-subsidies/)\n\n  \n[https://www.huffpost.com/entry/farm-bankruptcies-trump-trade-war\\_n\\_5e34a2d6c5b69a19a4af1ad0](https://www.huffpost.com/entry/farm-bankruptcies-trump-trade-war_n_5e34a2d6c5b69a19a4af1ad0)",
         "Just a few days ago he promised to do a whole lot more. I hope the farmers were listening and realize it would be worse than last time.",
         "Do they?  Iowa is going heavy for trump again in '24\n\nhttps://preview.redd.it/8x2gpk0h62zd1.png?width=2256&format=png&auto=webp&s=b1ccdf5896ca97dd4176374beea478bb5cb3dd30",
         "This is why donnie pushes his \"Trump Bible\" they are exempt from China Tariffs.  \n\nhttps://preview.redd.it/mj0qievs62zd1.png?width=1762&format=png&auto=webp&s=c3680118152475bc5ea82c137be38d62f8fe930c",
         "It was a family business which was sad",
         "\"10% for the big guy\" will be donnie's legacy on the Presidency.",
         "One of the issues I read about from the '18 Tariff war was that the cost of heavy farm equipment that had to be imported from China with increased tariffs put a lot of struggling small farmers out of business.   Now the +20 Billion went mostly to the very wealthy Corporate Farms so another case of \"The rich getting richer\"",
         "Yup. \n\nPart of the answer there was to give tax cuts to offset the costs for small farmers who purchased heavy equipment from American manufacturers. \n\nBut Trump loves \"rich get richer\" and part of the point was probably to have the small farmers get swallowed by corporate farms."
      ]
   },
   "1gjo69h": {
      "title": "Those of us that have already cast our ballots are like",
      "text": "",
      "comments": [
         "This is the most nail biting election I’ve ever been alive for. And I really miss boring politics. Can we just go back to that?",
         "https://preview.redd.it/88yzxvv9xyyd1.jpeg?width=800&format=pjpg&auto=webp&s=53b7cd4ac6583201c8645e821ccf4c1a1262556e",
         "Someone stole my mail-in ballot, filled it out, and put it in a drop box I've never been to. I only found out because I never got it and went in person where they told me i already voted.",
         "canada too:\n\n![gif](giphy|p35XvxQf7kJk4)",
         "Us Canadians are also doing this. I gotta run to Fargo next weekend and really don't want to get drafted into the civil war.",
         "News reporters the next few days\n\n![gif](giphy|l0IylOPCNkiqOgMyA|downsized)",
         "Cast mine in early September.\n\nAnxiety is still high as hell.",
         "Yeah anxious as fuck. Ready to be done now.",
         "![gif](giphy|bEVKYB487Lqxy)\n\nMe",
         "![gif](giphy|32mC2kXYWCsg0)",
         "It's like waiting for a std test",
         "Mail in voting is a blessing and a curse. I'm almost grateful to be living in a state where my vote isn't likely to sway the election.",
         "I'm not all that stressed... gonna go buy a bottle of champagne. 🍾",
         "Look, I just want Jimmy Carter to see Kamala Harris get elected.",
         "I know. I’m so anxious.",
         "Texan here. Wife and I cancelled out my mom and uncle’s vote. It was the best we could do 😞",
         "You think it's scary for you guys? Think about us outside the US. There's another potential Hitler waiting to get into power with half of you fuckers fine with that. The rest of us are helpless and hoping the other half does the right thing and actually goes out and votes instead of just sharing memes and commenting online about it",
         "This meme would also work for those of us non-Americans eagerly awaiting how the decisions of some folks in Michigan affect global politics.",
         "I'm going to focus on putting Christmas lights up too early so I don't have a panic attack",
         "As is the rest of the world",
         "More like the rest of the world watching the US make its decision be like",
         "This is going to be a very long 24 hours.",
         "I voted in late September.  It seems like it was ages ago.",
         "I've never texted \"Stop\" at so many incoming text messages before this. I voted, I don't want all these pollsters and fundraisers fueling my anxiety anymore... leave me alone!!! 😭",
         "It's like waiting for the results of an HIV test",
         "More like\n\n![gif](giphy|3o7TKEP6YngkCKFofC|downsized)",
         "I'm still sad half my country chose to be nazis",
         "**O**rdinary\n\n**B**oring\n\n**A**gain\n\n**M**ake\n\n**A**merica",
         "I miss casually making a joke about whatever politician happened to be on screen knowing that they will generally keep the ship afloat. Now...please let me into the lifeboat.",
         "Last election wasn’t decided for 3 days. In 2000 it was 34 days. I can comfortably say that this is the third election in my lifetime that will come down to some bullshit. If Bush had lost in 2000 we probably wouldn’t be here.",
         "You think this one is bad, wait for 2028",
         "When did you ever experience a boring election?\n\nEver since Reagan won, it has been ceaseless anxiety at election time.",
         "Yeah! I’m more like this — https://i.kym-cdn.com/photos/images/facebook/002/165/132/d63.png",
         "Nah, we learned from that mistake.",
         "I feel more like Marge in the monorail meeting...",
         "You’re shitting me\n\nHas the election board taken any action?",
         "wtf, mind if I ask what state you're in?",
         "Did they say who the thief voted for?",
         "As an Alaskan neighbor... can I stay at your house this weekend? Our parents are gonna be fighting again..\n\n(parents  = political parties)",
         "That’s some early voting.\n\nThe only early part for me was waking up at 7:00 on a Saturday to still wait 90 minutes in line. (Missouri)",
         "A decade of that fucking guy has been way too stressful, please make him go away",
         "Same. My spouse and I already voted.\n\nI’m going to do my best to have a media blackout tomorrow and wake up to good news or bad news on Wednesday morning.",
         "![gif](giphy|6czWxJwsqAoL9kTza1|downsized)",
         "Obama was the greatest designated driver our country ever had\n\nI didn’t have to worry about shit",
         "You could switch the \"a\"s and say it in a Yoda accent.",
         "Works better as AMABO.",
         "I'm sorry. Lifeboat seats are reserved for the 1%. \n\nGet back down into steerage with you, sir!",
         "That was my first election I voted in. It seems they have all been a shitshow since the hanging chads...",
         "1992",
         "I truly hope you're right.",
         "What scares me is more people voted for Trump in 2020 than in 2016. Him winning would just fuck everything up for decades.",
         "I don't know if you did. Why else is this race so close?",
         "[Have we?](https://media.tenor.com/7gszkkwfFzMAAAAM/oww-cupcake.gif)",
         "_Did_ we?",
         "Yes, It was reported at the time of discovery and there is an investigation opened. I don't know how they could track down the felon but I need to get a locking mailbox now. They told me the signature didn't match and that vote would have likely not been counted.",
         "Washington, Thurston county",
         "Amen.  From your mouth to Gods ears.",
         "What a wonderful idea. My wife, mom, sister, and I all voted as well. My dad is out of the state working, and it would be a hassle for him to vote. But hey, we did our part. Let's see how it goes on Monday.",
         "It's something I quickly grew to appreciate with Biden. He's not perfect, but he has a steady hand and overall has done a good job as president despite the insanity in the Republican party.",
         "In fairness, Obama didn't have to deal with the current state of the middle east. His problems could be solved with bombs, which he did.\n\nAll of this TikTokganda around democrats commit gENoCiDE wasn't around then.\n\nEdit: To be clear Obama was also content to bomb brown people. It just wasn't popular to complain about then. Which is disappointing because some of us cared before it got popular on the ADHD king of social medias.",
         "Done!",
         "We’re trying but the Xanax I’m currently referring to as my best friend says I’m still very scared about it.",
         "We can make it right.",
         "If he wins, people revolt. \n\nIf he loses, people revolt. \n\nLooking like it'll be an interesting few months, at least.",
         "I'm not convinced that it is close. Guess we'll find out in the next couple days.",
         "I believe the majority of us have.",
         "Did they tell you how the ballot was filed out, or otherwise let you see it? Did it align with your voting preferences at all? \n\nI'm assuming they didn't tell you any additional information beyond the info about the signature but I'm just curious.",
         "Other than Israel/Palestine, which is probably impossible to do without half the country being furious with you, Biden seemed like the platonic ideal of \"boring centrist president who does a pretty solid job without making any earth shattering changes.\" But, like, he also never had the House and Senate numbers necessary to do anything actually cool and sexy with.",
         "When all they can attack are nebulous “economic policies” and the fact that the guy has a stutter, you know he didn’t do too bad",
         "> Obama didn't have to deal with the current state of the middle east. \n\nWasn’t Jared supposed to solve all of that?",
         "I wish I had a Xanax.",
         "If he wins the left will not revolt. We'll just up our antidepressant dose.",
         "2016->2020 saw an _increase_ in Trump voters.",
         "They didn't say.",
         "Typically when a signature is invalidated the envelope isn’t opened.",
         "It’s so infuriating that people don’t realize this. Everyone wants to blame the presidency for not pushing policies through during their time, but they fail to realize that they can’t do a whole lot unless there’s a supermajority in the House and Senate to make it happen.",
         "Israel is such a tight rope I don't know of any person in politics that could have walked it without angering someone. \n\nIt's basically a trolley problem.",
         "Pretty much.",
         "I would say the Inflation Reduction Act is a pretty big change.",
         "He did. He extracted over $2 billion from the Middle East governments for Donald Trump's personal slush fund! And with no accountability attached! A twofer!",
         "Not a Xanax fan, but I have more than enough booze on hand to cover me for either a celebration buzz or an alcohol poisoning bender. :-D\n\nPlenty of weed, too.",
         "It'll make the protests after he won in 2020 look like child's play. \n\nPeople are NOT going to take it well, regardless. \n\nI voted for Harris, but I truly think either way shit is gonna pop off. Hopefully nothing too crazy.",
         "If he WINS. If he STEALS it via GOP shenanigans after it's called for Kamala, goddamn right we'll revolt.",
         "Okay... but a lot has happened since 2020 to change that.",
         "Ignorant question I'm sure, but was there an avenue for you to still cast your vote since an investigation started or, which is what I'm suspecting, are you just forced to miss out this election?",
         "That, and if the envelope is opened, the vote is counted anonymously, and there's no way to tie a specific person to what they voted.",
         "I like that analogy, but with it there is an option to do nothing.  I would be more willing to accept \"nothing\" over what's been happening.",
         "The craziest and most prone to violence in our country are not voting for Kamala",
         "I'm not worried about him winning, but I am worried about him trying to steal it. Damn right we will put up a fight.",
         "A lot happened IN 2020 that should have changed it then, but didn't.",
         "No, I was able to vote and the fraudulent one was rejected. There were 3 ballots in my mailbox that were stolen (and possibly more from neighbors). 2 of us went together and voted in person and one already printed out their ballot and mailed it, not sure what will happen with the printed ballot.",
         "Refusing to follow defensive treaties with an ally isn’t “nothing”. Seriously Reddit, there just isn’t a morally good option with Israel/Palestine. I just promise you the conversation in the situation room is more complicated than, “President Biden, we have determined plan [x] to be the morally best option.” And then Biden says, “Sorry General, but AIPAC says no can do.”",
         "Awesome, I honestly expected a turn away. Great on ya for being able to & going forward with your vote. Hope whoever the thief is gets caught red handed."
      ]
   },
   "1gk5szl": {
      "title": "Breaking News: As American Elections Open, Trump Surges Ahead With Key Demographic:",
      "text": "",
      "comments": [
         "Can confirm: Joe Rogan has endorsed Trump.",
         "Graphic also works for illegal voting, intimidating voters, intimidating poll workers, destroying votes etc.",
         "This election is between an overworked female going up against the male version of a Karen who would like to speak to the manager.",
         "I predict that Trump will do well with incels, products of incest and sycophants.",
         "Same picture for Nazis too",
         "Thank you, I would also have accepted \"guys who believe the stripper likes them\".",
         "\"Do you know who my dad is?!?!?!?!?!?!?!?!\"",
         "ITF MAH FREEDUM O SPEEECH",
         "I think all of these comments can just be summaried by \"Guy who still uses Twitter\"",
         "Anyone that forms their opinion based on what Joe Rogan says is more than a little dumb.\n\nOf course he wants Trump to win, he's a wealthy individual and he's already licked the orange stink wrinkle.\n\nNow he just has to wait for his reward and will probably be appointed to Defense Secretary or some shit if Trump wins.\n\nHe's like Henry Ford trying to play both sides of the war but really has a clear favorite for personal reasons.",
         "I've heard the term \"Kevin\"",
         "Aww, \"Kieran\" was right there!"
      ]
   },
   "1gk0g36": {
      "title": "Democracy is fragile. Trump says you won't vote again if he wins.",
      "text": "",
      "comments": [
         "And women",
         "If he wins, the next four years will be one long dystopic comedy of errors.",
         "Time to step up voters if you don't want to go to that show!",
         "**Only 23 states and Washington, D.C. offer same-day voter registration, which allows voters to register to vote and then cast a ballot on the same day.**\n\nWashington, D.C. and most of the states with same-day registration — California, Colorado, Hawaii, Idaho, Illinois, Iowa, Maine, Maryland, Minnesota, Nevada, Utah, Vermont, Virginia, Washington, Wisconsin and Wyoming —  make the process easy and accessible. However, a handful present obstacles.\n\nSome states, including Michigan and Montana, don’t allow for same-day registration at polling places, only at other locations like city clerks’ offices or county election offices.\n\nNorth Carolina only permits same-day registration during the early voting period, and New York is even more restrictive — only allowing it during the first day of early voting on Oct. 26. New Hampshire has the opposite restriction — only offering Election Day registration.\n\nConnecticut only allows voters to register and cast their ballots on the same day during general elections, not primaries.\n\nThen, Alaska and Rhode Island allow voters to register on Election Day, only in presidential elections. Those new voters can then only cast votes for president and vice president.\n\nhttps://www.vote.org\n\n**Get out and vote Harris-Walz and democrats down ballot.**",
         "And Americans",
         "Good point. It's so easy to run out of room to write all those who he is so obviously against.",
         "What kind of Americans?"
      ]
   },
   "1gju66v": {
      "title": "This is fucking hilarious ",
      "text": "",
      "comments": [
         "Democracy or authoritarian fascism. That’s the choice.",
         "Democrats don't worship their leaders. We don't have to think Kamala is \"good\"",
         "Policing is very different from prosecuting crime. Prosecutors rarely go out and shoot somebody for the F of it, while plenty of cops do. \n\nThe Democrats are the party of law and order, but we don’t care for jackbooted thugs acting as such.",
         "A cop and a prosecutor aren't the same.",
         "I mean, prosecutors and cops aren't remotely the same thing. No prosecutor has executed an unarmed person \"in the line of duty\" for instance...",
         "ACAB, but bastards > fascists.",
         "Or it’s “people voting for an adult who values competent governance” vs “people voting for a vengeful narcissistic rapist nazi diaper baby”\n\nBut good job sane-washing the bothsidesism bullshit.",
         "A stretch, at best. \n\nThe so called ACAB Crowd isn’t tied to the Democratic Party in the same way as the Republican Party refers to themselves as “The Party of Law and Order.” \n\nBut don’t let an accurate premise get in the way of your attempt at a both sides meme.",
         "Russian Bots gonna Russian",
         "\"Back the blue\" is not about laws but about order, authority and control and the felon in charge would bring that in spades. \n\n\n ACAB is mostly about the lack of accountability and this particular prosecutor has delivered accountability time and time again.\n\n\nSurface level political understanding should be left to the pundits.",
         "[removed]",
         "Stein was a former prosecutor? I never heard of that.",
         "How many prosecutors beat up Rodney king again?",
         "TIL cops = prosecutors\n\nOP obviously never seen an episode of Law & Order",
         "[removed]",
         "Cmon folks, this is political humor and this post is actually humorous. Don't take yourselves so seriously that you can't laugh at yourself even a little.",
         "Buckley's cough syrup or diarrhea would never be my first choice for a beverage, but if I gotta choose...",
         "[Repost](https://redd.it/1gjrzbd)",
         "Rich ain't it?",
         "Since the  first part incorrectly equates a prosecutor  with the blue I would expect  the second part just needs to reference Kamala as them not backing the blue.   Two facts here. Kamala was not a cop. Trump is a felon. I don't think this joke works  if you respect these two facts.\n\n Eventually a joke post will devolve into a discussion about whether an actual turd on a chair at an art event is actually art or not. Because art and jokes are so subjective.",
         "She was a prosecutor.  He is a felon.",
         "I've never thought of cops and prosecutors as the same. Prosecutors aren't pulling people over and killing them.",
         "Crazy how Dems/liberals just want cops to treat us as the equals we are and treat us fair. Also, we don’t care what side you’re on. If you’re a POS and deserve jail time then we won’t try jumping hoops justifying why you don’t.",
         "\"ACAB\"?",
         "finally, a neutral meme",
         "This is the best",
         "Fun fact nobody voting for Trump thinks he's legitimate felon and his charges were the product of a biased left-wing political hit job choreographed by Joe Biden.",
         "Republicans and Democrats didn't like that.",
         "It’s almost like neither extreme is rational.",
         "For a subreddit called “political humor” yall sure don’t like it when ppl post humor calling out both sides",
         "It’s crazy to me that people listen to what trump says and don’t take him at his word.  Like yeah, he lies and all, but he definitely has become more and more unhinged in the last 4 years.  Even if he’s only -trying- to sound like a fascist dictator, that alone makes him unfit for office.  Let alone that he’s a criminal rapist.  It’s so sad what this country has become.",
         "To make it worse, the wannabe dictator is a fucking idiot who snorts Adderall (an amphetamine).\n\nJust like his idol, Hitler.",
         "Flawed democracy that continues to slip further and further into being an oligarchy with the veneer of democracy vs Christian nationalist authoritarian fascism.  That's the choice.",
         "If that's the only choice is not really democracy in the first place is it.",
         "She is. I don't have to whine about how she doesn't have rainbows of inspiration spilling out of her ass for me to commend her morality.",
         "Very true.  Although, there have definitely been some annoying people this election cycle that for some reason won't accept people condemning Trump, saying he has to be stopped, and saying Kamala is the only real way that is going to happen but stopping short of actually endorsing her.  They act like anything short of saying you want her to step on you while you call her Mommy means that you are secretly actually a Trump supporter.\n\nThere are always people like that on both sides but I don't remember them being as prevalent on the Democrat's side in previous elections.",
         "Could have fooled me the way ppl jump to her Defense in this comment section. Treat it like the OP was offending their god",
         "When has a prosecutor ***ever*** done that‽\n\nThis isn't snark, i genuinely wanna hear a story of a murdery prosecutor. That's a hilarious concept.",
         "Law and Order is a dog whistle for racist violence. We will be voting for the Demure racist violence, instead of the tacky fast food racist violence. Kill me.",
         "Shhhh. But how can they push Republican narrative if you won’t let them roll around in their ignorance",
         "[Assigned Cop At Birth](https://i.imgur.com/xcBLGv8.png) ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
         "It’s a page to post memes on politics. Don’t take it to heart",
         "Yeah, no issue with prosecutors. Good prosecutors generally don't fall in line to protect a bad prosecutor when they do bad shit.",
         "[Assigned Cop At Birth](https://i.imgur.com/xcBLGv8.png) ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
         "[Assigned Cop At Birth](https://i.imgur.com/xcBLGv8.png) ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
         "[Assigned Cop At Birth](https://i.imgur.com/xcBLGv8.png) ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
         "Voting for Stein in 2024? \nThat's a special kind of stupid.",
         "[Assigned Cop At Birth](https://i.imgur.com/xcBLGv8.png) ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
         "I can laugh at myself but \"Ha ha, you think cops are bad so you'll vote against the facist,\" isn't a roast. It's the only option that makes sense.",
         "[Assigned Cop At Birth](https://i.imgur.com/xcBLGv8.png) ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
         "All Cops Are Bad",
         "If you think cops are dangerous, have too much power and are lacking accountability voting against the facist is extremely rational.",
         "Anything that remotely resembles a both sides comment gets certain Dems to immediately come out and start calling people idiots for claiming both sides are the same (even though many cases never contained the claim that they were and, in some cases, outright stated that they weren't before they even replied).",
         "I've become legitimately convinced that not even most of Trump's diehard supporters *actually* like Trump.  They like the *idea* of Trump.  They like false narratives and image they've been sold of Trump.  But if they actually liked the real Trump, they wouldn't have to repeatedly and borderline compulsively ignore, disregard, or outright lie about almost everything he says, does, and believes on a daily basis.  \n\n\nThe fact that 99% of Trump supporters don't actually want to acknowledge any of the reality about who he is and what his policies are (when they even exists) tells me they have no interest in the real Donald Trump, only what they think Trump represents (usually just upsetting liberals and hurting minorities), or what they've been misled into thinking Trump is. \n\n\nPeople who genuinely like someone don't need to constantly lie about and deny everything about them.",
         "Maga's solve this with false equivalences. They literally think Harris / democrats are doing far worse behind the scenes. Trump is just more honest, because he's a billionaire and he doesn't have to appease anyone. \n\nIt's all bullshit and lies, and Maga's values are slowly boiled down to nothing.",
         "I've been following Trump since the 90's.\n\nHe has not become more unhinged in the last 4 years. The man has been unhinged forever. Over the past 8 years his handlers and cronies have been discarded or left his side. He has more sycophants at his side allowing him to expose his ideals.",
         "And that is a simple and easy choice.",
         "You're so right lol. Both sides are totally the same haha. Might as well vote for the felon and watch as America descends into outright fascism lmao. \n\n/s",
         "Arming and funding genocide means you are not a good person. Locking people up for weed so you get more slave laborers does not make you a good person — and a good person certainly does not laugh about this. \n\nPoliticians are not good people. Don’t be foolish and buy into them.",
         "Probably because the both sides argument is considered tiring when one of those sides has been Trump the past 8 years. Voting for Harris is voting for a status quo many people are tired of...but despite how much we wanna say burn it all down, you can't actually do that and start anew from scratch when we have people struggling to even make themselves aware in this current system.\n\nBut you aren't gonna have anything to progress if apathy lets in a guy who actively wants to make things worse. I'm not single-issue, but the prospect of Trump having appointed 5 Supreme Court Justices (given most people expect Thomas and Alito to be having one foot out the door sooner or later), is more than enough for me. Do I wish this country wasn't complicit on Gaza? Absolutely. But I also understand Trump would let Israel nuke everyone not Jewish. \n\nAnd there's nothing to get out of going \"told you so\" while more people die. I think it's people being less patient with those who don't understand politics is about having to bite your tongue at times and simply keep things going to even have the chance at change, and to not make it harder on ourselves. For everything that you can fairly critique her on, as every politician does, we've been known how demonstrably worse Trump is. Now's not the time to start pulling a Republican move where they need a permission structure to be told who to vote for.",
         "What a nonsense take lmao, I truly can’t believe how bad the brain rot has gotten in the US. ",
         "Harvey Dent?",
         "Right man, that’s the point. It’s called hyperbole.",
         "Your LLM broke, you’re going to want to copy and paste that over. Tell ChatGPT “use 75% less slang.”",
         "good bot\n\n  \nI had no idea what that meant",
         "FWIW, I'm not ACAB. But I know a badge or a uniform doesn't automatically make someone infallible, which is lost on the back the blues and thin blue line people. And I'm deeply skeptical of police unions.",
         "Bingo. Only mindless \"Back The Blue\" drones think that ACAB means lawless. Holding police to account for illegal things they do while wearing the badge IS law and order.",
         "They do, however, still routinely fail to pursue bad cops.\n\nAnd they *know* the cops engage in \"testilying\" and only give a shit if it causes them embarassment, which goes beyond simply \"failing to pursue\".\n\nThey're not quite the same level of bastardry as cops, but they're generally *far* from innocent.\n\nLet's not whitewash the deep, systemic problems in our legal system just because even that is preferable to outright fascism.",
         "A good share of them *do* like Trump, for multiple reasons. They lie so much about him because they understand liking him is somewhat of an antisocial behavior.",
         "Many of them are caught in a sort of psychological sunk cost fallacy too. To go back or denounce him now means admitting they were in the wrong for the better part of a decade, so out of pride or whatever they just keep supporting him because it’s actually *less* painful to back him than to change themselves.",
         "Did I say both sides are the same? Or advocate for trump? Just saying if you're only choice is between facisim and neoliberalism you never really had much of choice to begin with. Hardly a functioning democracy at work.",
         "Reading for comprehension: not a skill you chose to employ here.",
         "I say this with as much kindness as I can: \n\n\nIf you are intentionally trying to dissuade people from voting for Kamala Harris in this election, you are a bad person that wants Trump to win. \n\n\nHarris is not above criticism, but anything but an affirmative vote for her in this election is either an enthusiastic or tacit endorsement of the vitriolic hate that Trump embodies, and the regressive, fascist policies he *will* enact.",
         "She never got anybody locked up for smoking weed, so that's lie number 1, vice presidents don't have formal authority to sign ***fucking anything about arms deals***, but you're Russian, so civics doesn't real ( **lie number 2**), she's not laughing about these things which is your third lie and finally\n\nOnly a fucking jackass tries to push this 7th grade cynical bullshit a day before an election and tries to call it wisdom. \n\nAlso if the fucking United Nations, which is notoriously anti-Israel, declines to call something a goddamn genocide, that means it's not a fucking genocide. You want to talk about war crimes fine, but at least get the terms right. You always throw around words, but you never wanna learn their meanings.",
         "State prosecutors don't really handle weed cases",
         "There are far more men that have started the war in Gaza and continue it. To put that burden an on that back of a woman who has no input on ending it and the same actual power as you and I do is quite misogynistic.\n\nAll the leaders involved in the genocide are male. You are foolishly buying into Russian propaganda because you lack any critical thinking. Pretty gross",
         "She didn't lock people up for weed.",
         "Look you need to realize that trump would be way worse for the Palestinians who are under fire from the Israeli government. Kamala might not do enough but is isn’t going to do nothing about it. Trump will actually go out of his way to support the genocide and has been a vocal supporter of what the Israeli government is doing. If you really want to help stop the genocide then Kamala needs to win. Not trump.",
         ">Arming and funding a genocide\n\nThe American military-industrial complex owns American politics; NOBODY in American politics has the power to stop the \"arming and funding\" of foreign wars. If a president ever tries to defund the military, they will get the JFK treatment.\n\n>Locking up people for weed so you get more slave labor\n\nThat's the American Judicial system! Prison labor is the backbone of the American economy. Several giant corporations use prison labor to survive. It will require a constitutional amendment to change this in all 50 states.Also, until 10 years ago, most people were against weed legalization and much less accepting of recreational drug use.\n\nAmerica is fucked. As a country, we rarely actually do the right thing. Blaming Americans for working within the American system and labeling them as bad people for doing so...might as well just call them \"American\"",
         "If it makes you feel better most of them \nare Russian bots and shills.",
         "They're just projecting their insecurities.",
         "I already did that joke. I'm a little annoyed I can't think of another one with all the murder mysteries I've read\n\n![gif](giphy|8fbeFbshnfyJW)",
         "No no no you can't titillate me with a story that interesting and not deliver with the Harvey Dent shit. \n\n#lie to me\n\nBut give me something",
         "Hi u/yodels_for_twinkies. If you have any suggestions to make the bot goofier, please send them to our modmail. ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
         "[Assigned Cop At Birth](https://i.imgur.com/xcBLGv8.png) ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
         "[Assigned Cop At Birth](https://i.imgur.com/xcBLGv8.png) ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
         "no good comes from blaming indivduals for a problem guaranteed by the system they work in. prosecutors need to win cases to succeed. as a rule, they are required to ally with police to win those cases. poison that well and they'll never accomplish anything.\n\nwhat's needed is a separate team that **only** prosecutes police. such a team would have entirely different incentives.",
         "Okay, I give you 1∆ toward changing my view...",
         "Nah, they justify what he does because he makes them feel like they belong to something bigger. He attracts conspiracy theorists, “religious” folks, and people who feel like they’re being bullied by the government. They usually try to spin it at others, not necessarily protect his image like they would if they actually liked him.",
         "Have you run for office?",
         "It’s really some democracy you guys have going over there. \n\n“You must vote for this one, or you’re a monster”. \n\nThis is purely an indictment of your political sphere, which only ever offers the illusion of choice.  This one’s just much more brazenly open about it.",
         "Going straight to ad hominem, means your argument is air tight, eh? \n\nShe is a part of the ticket, if she does not speak out, she is complicit. Even today, she will not advocate against it even though she is the democratic candidate. She pushes pro Palestine ads in Michigan and pro Israel ads in Pennsylvania. \n\nBut go ahead, tout her morality. Ignore the crimes she is privy to. By no means is trump a better candidate, but this holier than thou attitude of Kamala supporters, like she isn’t just another prosecutor or politician, it’s disappointing. I always figured the MAGA folks would be more susceptible to demagogues, turns out it might just be something the whole country is good it\n\nPS - funny how everybody who wants to hold a candidate accountable for genocide is Russian. Very MAGA of the Harris camp to dismiss legitimate things as conspiracy",
         "Any unhappiness in the glorious Republic of the United States surely could only be because of nefarious outside influence!",
         "There are plenty of cases of prosecutors not acknowledging clearly exonerating evidence post conviction. I can’t google it for you but it’s easy to find. The Innocence Project is probably a good place to start. So yeah, not nearly as bad and murdery as unethical cops, but it’s significant.",
         "Have you not heard of the trail of Alex Murdaugh?!",
         "> no good comes from blaming indivduals for a problem guaranteed by the system they work in.\n\nSo you oppose the prosecution of Derek Chauvin for the murder of George Floyd, since \"cops murdering the innocent\" is a problem guaranteed by the American policing system?\n\nI agree that we need separate prosecutors to go after police, but we *also* need prosecutors who *do* work with police to approach the situation more critically and seek *justice* not just *favorable conviction ratios*.\n\nThe prosecutors are *part of the problem*: that they're not *the whole* problem doesn't make them blameless.",
         "Until one of the main party candidates became an unhinged Nazi enthusiast, it really wasn't as easy to tell how screwed up the system was.\n\nI fully belive that there will continue to be a huge push toward ranked choice voting nationwide, and the continued decline of the GOP, which will open things up abit more to be more, but that will still require alot of blue seats in the House and Senate, so I'm not holding my breath for it happening this term, but once more younger people get involved, it'll happen.",
         "No my friend, you’re just the useful idiot for the Russian propaganda machine. You’re literally parroting the talking points and that makes you the shill.",
         "She's called for a ceasefire and two state solution for months. \n\nSo what is your opinion on Ukraine then? Should the US stop aid there where even more genocide has been going on because of Russia? Do we leave Ukraine out cold for trump who was already impeached for blackmailing Ukraine?\n\nDon't be mad when all you have is Russian talking points and people can easily see through it. Do you hold putin to any accountability for the destabilizing Russia has done in the world? Or is it all just Kamala's fault for being woman a that is vice president?",
         "Based",
         "You post this while Russia is trying to destroy Ukraine. With the help of North Korea nonetheless. Makes your choices of words ironic though",
         "You don't get to make serious sentences here, you come back with a murdery prosecutor story or you don't get any dessert for a year.\n\n![gif](giphy|QJA6xiVxYpmBGXmKR5)",
         "That's not what I asked about at all. I'm well aware of the failings of the justice system.",
         "I have but i fucking forgot about him!\n\nMan, that whole family is evil as shit. I'm convinced they murdered the queer kid and covered it up",
         "Ranked choice/single transferable vote etc is the only way to improve it. \n\nThe country has been captured by the wealthy, who fund both parties, to push forward their own agenda, regardless of what the actual American people want. \n\nBut, it will take a reckoning in the US to collapse the two party system, because it’s working as intended for the funders (wealthy); they dictate who is in charge on either side. They will not concede that power.",
         "So many people don't grasp foreign policy and how absolutely crazy the Middle East has been for so long. We HAVE to stay allies with Israel if we want access to their intelligence in the region, which is world reknowned. That intelligence, especially post 9/11 serves to keep Americans safe by tracking and eliminating or disrupting terrorist plots, which is unequivocally a good thing.\n\nIs Israel wrong to strike back at terrorists who invaded and took people hostage, vaugly similar to the 9/11 attacks even, especially in the impact they have on worries for Israeli security?\n\nThat said, Israel is absolutely managed by an idiot in Netanyahu, and he SHOULD be forced from power. If the US tries to force that by withholding arms to blackmail his resigning, we lose ALOT of our position in the country, as well as propagate the whole \"US interfering in other country's buisness\" deal that serves to further weaken US relations.\n\nIt's a CRAZY fucked situation that has been bad for at least 70 years, and both sides have repeatedly resisted efforts by the international community to come to some sort of solution. Peace in the Middle East is a joke because of these very tenuous and antagonistic sorts of relations, basing a single election where democracy itself seems to be at stake on it is REALLY stupid, but yet people still belove they know what's best when clearly, NO ONE knows how to effectively handle the situation.\n\nAnd ontop of that, if Harris is a bad choice for those that are pro-Palastine, why support Trump, either directly by voting for him, or indirectly for throwing your vote away on 3rd parties that have zero chance of a win, and typically do little if anything more than the Democrats. Trump has said he will have pro-palestine protesters deported, seemingly despite citizenship. He's also made comments that Gaza should be levled and turned into a parking lot.\n\nNeither option is particularly great, but welcome to life, and ESPECIALLY politics in the Middle East. I'll still take the choice that cares more about the people, and not about sounding tough for his supporters. \n\nTo be clear, I'm not an expert either, I can only expect that this is somewhat close to what the professional politicians and diplomats think as it's all that makes sense to me with a vauge interest in historical politics and their link to war. I could easily be wrong, or missing things, but I think I generally have the right idea, if missing alot of context and even more nuance.",
         "What the fuck does Ukraine have to do with this?\n\nYou are posting this while the UAE backed RSF is destroying Sudan? Is this how this works?",
         "Sry forgot I was in a humor sub.",
         "How about pushing his housekeeper of twenty years down the stairs so he could stash an insurance payout out meant for her family.",
         "Honestly, the past decade seems to have laid the groundwork for that reckoning. With the next generation starting to take up seats in the house and senate, as well as young voters caring more about policy, we're seeing a slow shift toward more progress.\n\nThe trouble with democracy is it's so slow to change and meet this issue. I have faith that we'll pull through, and be better for it in the long run, but it's a VERY scary time, and it all comes to a head this week. There are even some places where we might not get final numbers until December, so it's likely going to keep being pretty shit.\n\nI don't expect much from the next 2-4 years in the way of actual progress, but a continuance of democracy will always be a victory, and buys us the time to get to implement the changes that will be needed.",
         "You want to put the world failings on the back of Harris so asking how much more of the world's failings we should blame on her is quite in the cards. You surprised by this? \n\nStill not bringing Putin's name up I see though. What is his record in Ukraine and their genocide?",
         "Is that your subtle way of roasting my attempts at being funny?",
         "I remember that one too. I forget where I heard all about them, but they're like the hillbilly Sopranos",
         "Sry forgot I was in a humor sub.",
         "🥺\n\nOh god, it was. Ouch."
      ]
   },
   "1gjp7q1": {
      "title": "Let the whining begin.....",
      "text": "",
      "comments": [
         "He has been saying shit was rigged for years. Like before his mother even dropped him off at the pool.",
         "Trump: \"Always remember, heads I win, tails you lose.\"",
         "Those other swimmers need heavy weights chained to their legs. To represent the GOP advantage built in to the electoral college.",
         "Hey! Don't allow him to swim without his diaper!",
         "Trump thinks he is a winner when he is actually a whiner.",
         "love this analogy!",
         "Just imagine the orange streak he'd leave in the pool. (Or don't, if you just ate.)",
         "Trump wins in the \"floating island blob of garbage\" category.",
         "nice titties tho",
         "\"Heads, i win. Tails, it's massive coin toss fraud...\"",
         "![gif](giphy|lLTuCOqB0daP6)",
         "The floaties - omg!  Priceless.",
         "This is obviously an illustration. His face is not painted orange enough.",
         "[removed]",
         "Remember when he said that if he loses then it was due to Russian interference. He said this in 2016 then won and proceeded to immediately visit Putin... I don't even know what else to say anymore",
         "Those titties are killing me!",
         "He said it was rigged after he won.",
         "He whined that the Emmys were rigged when his stupid fucking show didn't win one.",
         "Too bad she didn’t flush.",
         "Too late...",
         "Gold.",
         "Hello! Thanks for your comment. Unfortunately it has been removed because you don't meet our karma threshold.\n\n You are not being removed for political orientation.  If we were, why the fuck would we tell you your comment was being removed instead of just shadow removing it?  We never have, and never will, remove things down politicial or ideological lines. Unless your ideology is nihilism, then fuck you. \n \n Let me be clear: The reason that this rule exists is to avoid unscrupulous internet denizens from trying to sell dong pills to our users.  /r/PoliticalHumor mods reserve the RIGHT to hoard all of the dong pills to ourselves, and we refuse to share them with the community.  If you want Serbo-Slokovian dong pills mailed directly to your door, become a moderator. If we shared the dong pills with the greater community, everyone would have massive dongs, and like Syndrome warned us about decades ago: \"if everyone has massive dongs, nobody does.\"\"\n \n If you wish to rectify your low karma issue, go and make things up in /r/AskReddit like everyone else does. \n\n Thanks for understanding! Have a nice day and be well. <3\n \n You can check your karma breakdown on this page:\n \n http://old.reddit.com/user/me/overview\n \n (Keep in mind that sometimes just post karma or comment karma being negative will result in this message)\n \n ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
         "Only the popular vote, the parts he won were completely legit. He's just the world's worst loser.",
         "Yep, he lost the popular vote in 2016. The electoral college made him President. And he spent a year investigating 2016 voting fraud. Then shut it down because he couldn't find any as the most powerful man in the world.\n\n\nThey even had Cyberninjas going through Arizona's votes from 2020. And they didn't find anything.\n\n\nSnowflake MAGA just can't cope with losing And I'm doing everything I can to trigger them.",
         "…are u inferring that Trump swims in the toilet?  Oh, wait.  I get it. \n\nLol",
         ">Yep, he lost the popular vote in 2016. The electoral college made him President.\n\nThe electoral college makes all presidents... president\n\nThe popular vote doesn't make anyone president",
         "If Harris wins (and she must) I'd truly admire her if she got rid of the electoral college. It's about time the USA become democratic.",
         ">The electoral college makes all presidents... president\n\n\n\nI didn’t say it didn’t.\n\n\n>The popular vote doesn’t make anyone president\n\n\nI didn’t say it did.\n\n\n\nI pointed out that as President in 2017 Trump hinted that there was election fraud in 2016, yet his investigation didn’t prove anything.\n\n\nTry to keep up.",
         "Except she can’t do it single handed. You need the House, Senate, and States to go along.  And Republicans in the House can barely pick a Speaker.  And aren’t going to help Democrats win the White House.\n\nAlso Republicans have controlled the House and or Senate 24 of the past 30 years since Newt Gingrich’s Republican Revolution.\n\nhttps://preview.redd.it/a8zhlt9q73zd1.jpeg?width=1469&format=pjpg&auto=webp&s=664292320b01877e9485183926244fd46ca49025\n\nPeople really need to vote more in non November Presidential elections. It would be easier to change things since turnout is much much lower.",
         "Getting rid of representative democracy is getting rid of democracy",
         "Sorry you want to get rid of our democracy",
         "And your logic behind this is...?",
         "Electoral college is outdated and unnecessary. In today's age, every American's vote should be counted equally, which it will be if we got rid of the electoral college. Why should someone's vote in say, New York, have to be less meaningful and influential than say someone vote in Kentucky or PA? The electoral college punishes some individuals in terms of influence on the presidential vote depending on where they live, and benefits others in terms of influence depending on where they live. Better presidential representation aside, the system just needs to get reworked so we could get better candidates instead of having to bend to some dumbwits politicians... exhibit A would be a politician like Marjorie Taylor Greene whom thinks the opposing political party controls the weather. Like when you hear that, you dont think wtf?",
         "They're 'owning the libs'",
         ">>Getting rid of representative democracy is getting rid of democracy\n\n>And your logic behind this is...?\n\nI mean I'm not sure how to respond to this",
         "By stating the logic behind why you think a direct democracy where the popular vote matters isn't democracy?",
         ">By stating the logic behind why you think a direct democracy where the popular vote matters isn't democracy?\n\nWhere did I say direct democracy isn't democracy?"
      ]
   },
   "1gjzpia": {
      "title": "You wanna know how I got these \"I Voted\" stickers?",
      "text": "",
      "comments": [
         "If you don't vote, you're consenting to let other people decide who represents you.",
         "The bigger the popular vote loss, the bigger the bruise to rump’s ego. Thats why your vote always counts.",
         "My state has voted red in the last several elections, but the polls are already showing that Democrats are only one point behind as of a few days ago. Some of these Republican traditional States will probably slip blue. I'm totally voting.",
         "I’m contributing to the popular vote!",
         "If politicians see that more people from your generation are voting, then they will pander to your generation more with their policies. Regardless of whether your state is important for the current election",
         "This. In several states, we've been convinced our vote won't count. However, these states have gone blue before Fox News was a thing and they can be blue now.",
         "On a state level, the popular vote literally matters. More reason to vote. And flip Texas.",
         "I’m voting blue in one of the bluest states in the country, but my down ballot races include Texas-style school board candidates and we’ve had a Red mayor the past few years. Every blue vote counts.",
         "If you don’t vote, you can’t complain.",
         "If my ruby red state turned the barest hint of purple, I would be thrilled. No apathy, no defeatist attitude, my fellow blue dots- just vote.",
         "I'm planning on casting a ballot, but not voting in the Presidential race. It's about sending a message to whatever GOP political analyst digs into the results and sees folks who didn't vote Trump but did vote for Steve Garvy and other down-ballot Republicans. \n\nThe message being \"Can we please stop nominating this idiot?\", of course.",
         "https://preview.redd.it/671eouazp2zd1.jpeg?width=960&format=pjpg&auto=webp&s=5c3e966d2af4d0a67ef06bbb6f3916204a896e15",
         "It’s also worth noting that it’s important to vote in your local elections. City commissioners are a non partisan ballot so it’s much easier to organize and get the right people in. ",
         "\"Some people just want to see the world not burn.\"",
         "Trump will declare himself the winner before all the votes are counted because cities take longer to count so dems always \"catch up\" very late.\nIf democrats win trump will use that to claim the election was stolen.\nThe bigger the win in the popular vote in uncontested states the more people will know he is lying.\nSo yeah now more than ever ya gotta show support.",
         "Trying to get the Blue votes up in a Red state (and vice versa) should result in future candidates actually spending some time on campaigning in that state; or even crafting policies that help that state.",
         "**Only 23 states and Washington, D.C. offer same-day voter registration, which allows voters to register to vote and then cast a ballot on the same day.**\n\nWashington, D.C. and most of the states with same-day registration — California, Colorado, Hawaii, Idaho, Illinois, Iowa, Maine, Maryland, Minnesota, Nevada, Utah, Vermont, Virginia, Washington, Wisconsin and Wyoming —  make the process easy and accessible. However, a handful present obstacles.\n\nSome states, including Michigan and Montana, don’t allow for same-day registration at polling places, only at other locations like city clerks’ offices or county election offices.\n\nNorth Carolina only permits same-day registration during the early voting period, and New York is even more restrictive — only allowing it during the first day of early voting on Oct. 26.\nNew Hampshire has the opposite restriction — only offering Election Day registration.\n\nConnecticut only allows voters to register and cast their ballots on the same day during general elections, not primaries.\n\nThen, Alaska and Rhode Island allow voters to register on Election Day, only in presidential elections. Those new voters can then only cast votes for president and vice president.\n\nhttps://www.vote.org\n\nGet out and vote Harris-Walz and democrats down ballot.",
         "I live in a red state, it went 65% to Trump in 2020.\n\nI still voted! \n\nSend the message to these fucking idiots that we do not want republicans in charge ever again.",
         "im in california. It definitely doesnt matter haha",
         "If you didn't vote early or by mail, vote. Check a local resource, or go to http://iwillvote.com to get information that's specific to you. If you get on line to vote by closing they can't turn you away, no matter how long the line is. \n\nDon't forget the down-ballot races and proposals on the other side of the ballot. Your employer is legally required to let you go vote.\n\nIf you live outside the US or already voted, brew some tea and read some comics.",
         "Also if Trump ends up in office and decides to purge the opposition maybe your voting record will get you killed off faster so you don't have to live through the descent into the Alt Reich. \n\n\n...silver lining?",
         "Still don't care. They can pay me for my vote. And it ain't gonna be cheap.",
         "If you don't vote, you're giving nazis permission to kill.",
         "Not to mention you could help shift a congressional seat or change a referendum or something else. If you feel like you don’t know enough to make an educated decision on one of these matters  other people more clueless then you are are unapologetically voting on these issues so you are already more thoughtful about them",
         "Damn. Which State?",
         "Also even if a state doesn't flip blue getting close may setup a flip in the future.  VA was solid red for many years then it got a couple elections where Deomcrats were ony down a couple points.  That brought in national attention, additional money, got some good candidates interested at various levels, it is now pretty solidly blue although it has red parts."
      ]
   },
   "1gk67xp": {
      "title": "IDK about you, but I'm braced to respond to some ignorant bullshit today.",
      "text": "",
      "comments": [
         "That's the point. The rural counties which would lean (R) can be counted in hours, while the metro areas which lean (D) with millions would take days to weeks.",
         "The Cyber Ninja's enter the chat",
         "Dutch elections require paper ballots and hand counting.\n\nFirst we just count what party is voted on. 80% reports on election night. 99% the day after.\nAfter a week we have the complete result.\n\nBut we do have an average of 1 voting location per 1000 people. And 5 to 10 people at each to count votes. All those election workers are paid (just above minimum wage)\n\nSo. You can have fast results from hand counting. If you want to. Obviously it's not going to work if all the political parties are going to look over the counters shoulders and questioning every ballot. Over here, anyone is allowed to observe, but they can't interact.",
         "The key thing to understand is that the people who demand this are lying about their motives. They're not concerned about the accuracy of the vote count. They're just trying to undermine the democratic process itself.\n\nThe process taking five months is a feature, not a bug. It follows the Republican MO of sabotaging the thing and then complaining that the thing doesn't work. Oh well, I guess Democracy doesn't work. So much easier to declare and follow a king.",
         "They are not hand counting votes in Georgia after all ftr. https://www.cbsnews.com/news/georgia-judge-blocks-election-rule-requiring-hand-counting-of-ballots/",
         "That's the plan. And during those months you'll have pundits non stop talking about voter fraud on fox 24/7. Until public outcry makes the courts intervene and throw the election at the gop",
         "I'm gonna go back to 2000 and \"hanging chads\". What a nightmare.",
         "That’s the strategy - delay counting enough so that  republicans can just seize power",
         "And Trump *still* doesn't accept the results.",
         "The Arizona ‘recount’ wasn’t an official recount that had to be done to certify the results. It was a maga attempt to prove that the count was wrong. They hired a sham company to find problems and after five months they gave up because they couldn’t find problems.",
         "Weirdly, germany manages to vote on paper and have a first result by 6pm and a final result by 10.\n\nUsing fancy technology like pen, paper and phone",
         "That seems to be a simple problem that can be solved with more people counting... As someone said, Germany is doing paper ballots and hand counting and it is mostly finished before midnight, and if necessary a recount is done next morning as far as I know. May be people involved in the process know more details.",
         "To have equal numbers you’d need around 5 million vote counters for the USA. Not gonna happen.",
         "The Supreme Court would never just give an election to the GOP!\n\n*Cries in 2000*",
         "And it only recounted the POTUS election.\n\nAnd even when it didn't discover fraud and didn't find anything other than minor discrepancies in the machine count, they still yelled fraud and that the machine count could not be trusted.",
         "But the 6pm is just a guess from exit polls. Within hours it gets supported by real results. The official result is usually available the next day. But is it usually not that close.",
         ">Weirdly, germany manages to vote on paper and have a first result by 6pm and a final result by 10.\n\n>Using fancy technology like pen, paper and phone\n\nThe US and Germany aren't comparable here.\n\nThe US has 3.9X the population of Germany.\n\nSpread across 6X more time zones.\n\nWith 50 slightly different sets of election regulations compared to Germany's one.\n\nRunning a national election in the US is inherently a bigger, more complex, and more time consuming process than running an election in Germany.\n\nSo it isn't weird that Germany's process is simpler when their task is simpler.",
         "US would need a lot more people than Germany to hand count. \n\nA lot of work for minimal pay, would be hard to source labor. Sounds like a good job for immigrants.\n\n/s",
         "Exactly. And look at the make up of the court now.vs then. \nI also didn't mention the certification. If the Democrats don't win back the house Mike Johnson will pull shit too",
         "I mean, yeah, the first rounds of \"Hochrechnungen\" is from exit polls. We ussually finish counting by around 7:30-8pm and call in the results.\n\nSome Wahlkreise take a bit longer and then there is some time needed to verify, tally up etc etc before the result becomes official.\n\n>But is it usually not that close.\n\nNot sure what you mean by that. There is usually not a huge (as in changing the results completely) differnence from teh 8pm results to the official ones and you are told how many Wahlkreise are still missing.\n\n  \nMy point is, it is very much possible to vote on paper. \n\nEven in the digital wasteland that is germany.",
         "Do you think they count all ballots in one place?",
         "Wut?\n\nNo. The reason it is faster in germany is we have a voting location for a set (fairly low) number of citizens and each eligible voter is assigned a voting location.\n\nEach voting location services about 500 voters iirc (not 100% sure). \n\nEach voting location has between 5-8 volunteers who run the election in that location and after closing time at 6pm, we count the votes.\n\nWHen done, we phone in the result for that location. \n\nNot rocket science. Counting huge numbers of ballots can still be fast if you run that in small batches in parallel.\n\n  \nI never got the urge to use potentially hackable machines in elections when it can be done in a very transparent and still secure way...",
         "Are you a literal child? Do you think all the votes are delivered to one place where someone counts it?\n\nIt doesn't matter when each state that is smaller than Germany does it's own counting simultaneously. I weep for your country that you have people like you voting.",
         "Having more people implies.. having more people.\nBut the pay in Germany is super low, around 25€ per day, way below minimum wage. Tax free at least. Around 650000 do that job.",
         "Absolutely, counting is trivial parallel to a large extent, so it can be speed up with more counters pretty well. Summing up intermediate results is not rocket science."
      ]
   },
   "1gjsn8d": {
      "title": "I ✓oted.",
      "text": "",
      "comments": [
         "I asked my wife if she was pleased she didn’t have to cancel out my vote. She said she wouldn’t have married me if she had to cancel out my vote.",
         "Millions of men are voting for Harris.",
         "I doubled my wife’s vote",
         "Me and the wife are with you!",
         "My sticker says “I Doubled My Wife’s Vote”",
         "Doubled my wife's vote. Harris all the way.",
         "[deleted]",
         "I doubled my wife's boyfriend's vote!",
         "My wife is my best friend and I value her as a person.   I can't imagine thinking of her as property.\n\nThe fact these women have to deal with this is mind boggling.",
         "Same. Like, we had this exact conversation yesterday. Bet there’s a lot of that going on. Us non-MAGA husbands feeling pretty smug right now lol",
         "Yep. My wife didn't have to cancel out my vote; some of us men actually care about the women and girls in our lives.",
         "And with ENTHUSIASM",
         "Identity politics are how Clinton tanked her election and drove blue collar guys into the arms of Trump. Thankfully Harris didn't fall for this low hanging fruit. ",
         "I read on reddit that most woman vote for Harris, so why would they canceled their husband vote, if they vote for the same person?",
         "If you don't know him well enough to know if he will vote for a fascist racist and rapist aiming at robbing women of their body autonomy, then you probably should take time to know him and his values better before marrying him, regardless of what he says.",
         "Think of it this way- if you two are planning to have children (or even if you aren’t but have an accidental pregnancy) and something goes wrong during that pregnancy, something awful that puts your life in danger because the medical staff at the hospital refuse to perform a life-saving procedure on you because it “could jeopardise the life of the foetus”… would your future husband be comfortable watching you in agony, watching you maybe lose a wanted pregnancy, even watching you die as you bleed out from an infection or miscarriage? \nIt sounds extreme but it’s literally been happening. Even if you live in a state that’s currently allowing abortion, Trump has made it clear that a federal abortion ban is very much on the table. \nIf your future husband is comfortable with this… are you really comfortable marrying him?",
         "Not to mention the ones that actually vote for Trump. It's simply beyond my understanding.",
         "This is about women voting Harris, but their husband votes for tRump.",
         "There would be some point soon where you wouldn’t be able to get any form of birth control, either.",
         "This is correct. I have even heard of women having to report their menstrual cycle to the government. There was talk of an app for this. Talk about big government.",
         "Right? I couldn’t fathom being with someone who wanted that for me, and VOTED to have it in place. Hes not the one lol"
      ]
   },
   "1gjtu8z": {
      "title": "Robert J. O'Neill came out, Congratulations!",
      "text": "On 3 November 2024, O'Neill publicly announced his homosexuality by declaring his desire to make five young men his concubines.",
      "comments": [
         "What the fuck does the existence of social media have to do with anything? Is he suggesting Twitter is all that's stopping him from fucking young dudes?",
         "Does he... know what a concubine is?",
         "When you’re so straight and against pedophiles you openly tell a group of boys that you want to fuck them.",
         "Social media is stopping them from being molested by this dude? \n\nUh... Thank you social media.",
         "So he scrolled thru what could theoretically be THOUSANDS of related photos (women, old, poc, etc) until he found five very young looking white men and said if he had it his way, he would lay with them? Am I reading this map correctly? Just checking.",
         "Today I learned that being a war hero doesn’t mean that you are not garbage",
         "So a right wing nut job admits to being a pedophile. No surprise there.\n\nEdit- as OP points out, the reality is that the voters pictured are adults and being gay (like the nut job is) does not make you a pedophile or anything to be ashamed of. But the nut job does mention that he clearly fantasizes about having sex with young boys, so the label is applicable here.",
         "Who is this tool?",
         "Hands up, who's shocked that an overcompensating self-proclaimed \"alpha\" either 1) just admitted he likes young men and/or 2) has ZERO clue what the word \"concubine\" means?",
         "wierd flex, but ok.",
         "Yes, real men, regardless of age, do support Kamala Harris",
         "Goddamn that's creepy AF.",
         "So funny how easily a Navy SEAL can be duped by propaganda. Sad!",
         "How does social media...\n\nWhat?",
         "Typical closeted conservative. They’re all power bottoms.",
         "Congrats, Robert J O’Neill, on coming out of the closet!",
         "Embracing Pederastic relationships like ancient Sparta.",
         "He’s a NAMBLA Seal",
         "Yup, that was gay",
         "Dude wants a harem of *boys* and not *men*…… 🤔 \n\nHe confessed to being a creep not a homosexual",
         "It gets worse.. he’s not right in the head",
         "😬 that flex took an awkward turn really quick .",
         "https://preview.redd.it/69241djttzyd1.jpeg?width=689&format=pjpg&auto=webp&s=b8928b84637f5a204beb6dc7ce948e9b68c6a200\n\nSome twat named Robert J. O'Neill outing himself was not something I expected to see...",
         "I'm guessing either he doesn't know what a concubine is or he spent too much time in Afghanistan and went local",
         "![gif](giphy|J1vUzqdZJlh5AqBWxt|downsized)",
         "came out... as a sex offender",
         "Clapback is hilarious!\n\nhttps://preview.redd.it/4ochd5fbg0zd1.jpeg?width=1125&format=pjpg&auto=webp&s=37779b91abde00b89f21fc3f15db36b92f367957",
         "I believe catamites is the word he's looking for.",
         "O’Neill obviously has got off his meds again. Sad. I heard it was tough being gay in Butte, but now, that the boys in Butte know what they always thought is true…well, let’s just say they have a hard on for you.",
         "![gif](giphy|JUIYjVeZPHxjWR7rmX|downsized)",
         "Well don't we all need a little gaiety in our lives?",
         "He changed it like a coward",
         "Wierd.",
         "In light of this new information I find myself wondering if when he claimed that he “shot” Osama Bin Laden, he was actually speaking metaphorically.",
         "![gif](giphy|7E2nhc9Y5wBkosyZQG)",
         "Has anyone figured out what he \\*actually\\* meant?",
         "I saw this on another post, and I asked myself “did he just say he was gay?”\n\nGiven the sub I saw it on I decided to not ask the question.",
         "![gif](giphy|pMePjXUqNNND2)",
         "Dude managed to be racist sexiest and homophobic in one sentence… that’s almost poetry.",
         "8 year olds, Dude.",
         "Wow",
         "If it wasn’t for Democrat Obama, O’Neil would not be anything but another Vet in the wild.",
         "What the actual fuck...",
         "If they'd voted Trump I bet it's all about how they're \"the future\".",
         "Who is Robert J O'Neil? And why does he want teenage boys as his concubines?! 😩",
         "Good for them, I’m so happy for them to feel so comfortable expressing their love for newly legal young men.",
         "And maga says they aren’t weird. This is really weird.",
         "What the fuck is this lol",
         "It's always about sex with the Republicans. ",
         "Weird way to come out but ok. Good on you Bob.",
         "Literally the one good thing to come out of the world-destroying disaster of the “war on terrah” — that piece of shit Bin Laden eventually finding some FAFO — is now officially ruined forever.\n\nJFC.",
         "He has also claimed he’d use them as food.\n\nMAGA are not shrugging off the ‘weird’ tag anytime  soon.",
         "What a bizarre thing to say...",
         "What in the Diddy comment is he talking about lmaoo\n\n![gif](giphy|69BYKKHKXVY73pDmPD)",
         "I think Robert doubled down because he realizes, even through a drunken haze, that he fucked up, and this time it’s going to have consequences. Wouldn’t surprise me to hear that he checks into a loony bin tomorrow, because all of a sudden he has a “mental health crisis”. Either that, or he gets baptized into some weird evangelical church where his sins will be forgiven. Stick a fork in him.",
         "What an odd thing to say...",
         "Only way to interpret this charitably is 'no social media'=societal collapse purge rules?\n\nWhich, is a lot of simone biles tier mental gymnastics on my part.",
         "Omg",
         "I have not idea who this irrelevanto is but quick look at his twitter timeline tells me he's a vile piece of shit like his daddy Trump.\n\nHere, take a look at this:\n\nhttps://preview.redd.it/z4lqnjzi41zd1.jpeg?width=1080&format=pjpg&auto=webp&s=1f9fa9e6414bc6a00d77ef7c7c5b76da2c560cb6",
         "Robert J. O’Neil is a scared insecure little bitch who acts like a big guy on twitter.\n\nAnd he’s a closeted homosexual.",
         "basically a Pedo Gay Dude for Trump... exposing yourself to own libs lol",
         "what a weird, creepy, RAPEY...man. pathetic weirdo",
         "He only has 1 vote , you 5 guys all had 1 vote , however you kicked his vote to the Kerb 5 - 1 .",
         "\"In the days leading up to the mass shooting, police did not intervene despite countless red flags being raised\"",
         "Hold up. I gotta go check with my navy friend. He idolizes seal team six, I mean seal team dix",
         "This my feed now\n\nhttps://preview.redd.it/27le2fnvv1zd1.png?width=1344&format=pjpg&auto=webp&s=3fd880eb13b9edc249a0db9f966aab196874483d",
         "A Republicunt voter is a pedophile?? No way, this is my shocked face /s\n\nYeah, many of them are predators. But they get away with it when they have the  money to settle in court with victims and power to make people disappear. \n\nFuck em.",
         "Someone should check his hard drive.",
         "The dark part is that he says they are boys before saying they’d be his sexual slaves. Ickkkkkk",
         "I’m going to hope he has a gross misunderstanding of what the word concubine means.",
         "Well, since Trump made it acceptable to give microphones a BJ, his followers feel comfortable coming out of the closet.",
         "The f#*k",
         "Only three weeks too late for NCOD.",
         "He’s a racist drunk\n\nhttps://preview.redd.it/sfgaui9wg0zd1.jpeg?width=1242&format=pjpg&auto=webp&s=841eaefa7b725374995802717add735a53cf7522",
         "Who?",
         "this dude is a poor troglodyte",
         "🥰",
         "I wonder what other military men think of this, like is this normal behavior for them, do they all want young boys to be their concubines?",
         "Who?",
         "Dude is an absolute creep.",
         "Who is Robert O’Neill",
         "He doesn't like men, he likes boys",
         "That's kinda gay!",
         "Someone should make a porn of this",
         "Why does social media prevent him from having concubines?",
         "YICK",
         "Who is this small minded turd?",
         "Who the F is Robert J O'Neil?",
         "Must’ve drunk tweeted!",
         "Would “hate” if everyone left a 1 star on his podcast “the operator”",
         "Not going to lie. I kind of don’t mind trying to be a concubine at least once in my life.",
         "They are prepared to fuck up their own future",
         "I think it's more like \"if information wasn't so readily available on the internet like the old days I'd have sex slave\" yes.",
         "I don't know how Twitter is stopping him from raping kids and, at this point, I'm afraid to ask.",
         "I said it once and its worth saying again, these assholes tell on themselves ALL THE TIME.",
         "Seems like that's a possibility.",
         "If it wasn’t for social media nobody would find out he was into teenage boys, but then he went on social media and announced it so I don’t know what’s going on",
         "It’s a really weird response to some one’s first vote for sure.",
         "\"I would rape if I could get away with it\"",
         "Maybe if no social media people can just take young boys as concubine. But with social media they are afraid they get outed?\n\nSo this guy actually wants to make those boys his bitches is what he is saying if he wasn’t on Twitter",
         "Every time a new method of communication has come out, it has threatened the existence of code minded people. \n\nYou can go back to the creation of the postal service in the American colonies in the 1700’s and find these same kind of nut jobs ranting about how their wives will be able to communicate with the outside world",
         "That is 100% what it sounds like",
         "Wait, what? I thought that was *exactly* why /social media exists!!",
         "Yes... Yes he is",
         "I'm sure he does.He's embracing his inner desires.",
         "He actually clarified after this that he meant exactly what he said. That these kids would be used for sex and food. He ended up deleting that clarification tho, and it's too much of a pain in the ass to find it so I can't post it unfortunately.",
         "Afghan Warlord take little boys as concubines through a practice called Bacha Bazi, I think maybe he spent too much time over there.",
         "Mfer was in Afghanistan so probably very familiar with the practice of holding pederastic concubines.",
         "Bacha bāzī \n\nWe don't know that term well in the US but that's probably what he's... Trying to say?  Seems like some creepy PTSD rants but still, dude isn't well.",
         "I'm sure he meant catamites. But, ya'know, reading is hard .",
         "![gif](giphy|KmFDk6nTh0lUI)",
         "Can a guy be a concubine?",
         "He watched Arnold and Danny Devito have children and he thinks he knows how it works. That movie probably got him hard.",
         "I think the correct term he was searching for in this context would be “catamite.”",
         "Not just fuck them but put them in a harem on standby for fucking anytime you want like an emperor of China. 🇨🇳",
         "To be fair, they are old enough to vote, so he's not a pedophile.",
         "And social media has been mass accessible since at least 2003-2006 to the virality of Facebook and Twitter.\n\nSo… he’s tacitly admitting he would have 18 y/o concubine twinks in 1993?\n\nBegging the finest of pardons.",
         "In this scenario, you are a Master Cartographer!",
         "He said they would be his concubines so it sounds like he wants to rape them.",
         "being really good at killing people for probably bad reasons isn't necessarily a healthy base to build on.",
         "If this is surprising, I got bad news for you because that's very common lol. These guys are literally paid to kill people. Not that every single person in the military is a bloodthirsty psychopath, but there's plenty who are, because that kind of job tends to attract those kinds of people.",
         "Being brave doesn't mean someone is a good person. Taking risks others wouldn't could be a sign of antisocial personality disorder.",
         "Or not a pedo.",
         "There's lots of white trash in the military.",
         "I’m against war heroes honestly. If everyone who went to war was shamed maybe no one would sign up for the army.\n\nNo you don’t need an army to counter an army. Just have no armies",
         "*gay pedophile, to be accurate. ",
         "They're old enough to vote, so he's not a pedophile \nand he's absolutely not at all weird",
         "No wonder they don’t mine no abortion. Can’t get a concubine preggers",
         "Ex Navy Seal. Those 5 guys showed their support for someone he doesn't like and it triggered him.",
         "He's the guy who claims to be the one who fired the shot that killed bin Laden",
         "He’s a former Navy SEAL who was on the team that killed Bin Laden. Correct me if I’m wrong, but I’m not sure it was ever confirmed who actually shot him, and none of the other seals there spoke out, but O’Niell has taken the credit for it; he’s written a book and done a lot of media for it after his career in the Navy.",
         "https://apnews.com/article/norfolk-virginia-armed-forces-brewing-oneill-permit-6e71e20b0989b8a5ff5c91c76b2bfc95",
         "Was he in Afghanistan?  That's what the warlords do over there, take boys for sex toys.  Old practice. Maybe he misses the culture.",
         "Very weird.",
         "Considering part of the training is to break you mentally and build you back up to be a programmed killing machine, is it really that hard to believe?\n\nI had a buddy from high school go in the Marines. He came back from basic and being a Marine was literally the only identity he had after they brainwashed him.",
         "They literally teach you to follow orders without question in the military. And punish you for defying orders. That's already prime real estate for propagandists.",
         "He's not in the closet any longer.\n\nI guess ass play is ok for conservatives if it's with someone who doesn't agree with them.",
         "Good one.",
         "True.",
         "That escalated quickly.",
         "Thanks for the laugh",
         "Nice",
         "🤣",
         "It's the maga way.",
         "Thank you, I've been waiting for a conservative interpreter to translate.",
         "Fuck around and find out? How about you find out a new joke?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
         "> And he’s a **closeted** homosexual.\n\nNot anymore he ain't.",
         "Of course",
         "He's openly threatening to rape a bunch of kids over their hats. What the hell?",
         "![gif](giphy|3XH2p7BDhIeLwA6QBb|downsized)",
         "That are teenage boys",
         "Young sex slaves",
         "It's probably not 😖",
         "Social media wasn't around in the eighties when I was a teenager and raping people was still illegal. \n\n\nI don't know what protection he thinks social media gives people but let's hope he continues to believe in it.",
         "He has apparently replied and doubled down saying he meant it.\n\nPeople are trying to defend it by saying \"he is obviously saying he would make them his bitch\" ......*as if that is somehow any better?* That still implies he wants to fuck boys.",
         "I’m sure he doesn’t. Concubines were for procreation.",
         "Hey, it works for Ben Shapiro.",
         "He thinks a concubine is a secret gay lover.",
         "He’s inserting dominance to those hold views he disagrees lol",
         "...sex and *food??*  He wants to eat them?",
         "It sounds like he's upset that he had to leave.",
         "Taliban raped girls and boys.",
         "He's been trained by the best... Afghani warlords.",
         "If we think the guy is stumbling over the word \"concubines\" is going to understand what \"catamites\" are, I'd like to say he doesn't know....but this is the new GOP complete with Milo Yianopolis happily explaining why he's an upstanding citizen because he's a hebephile (likes hooking up with 12-17yo boys) and that's ok because he's not a horrible pedophile.",
         "Pretty sure he meant \"bitches\" but wanted to sound fancy",
         "Yes: https://medium.com/lessons-from-history/what-life-was-like-for-a-male-concubine-in-ancient-greece-112dafc573ec",
         "He’s the one who called them boys.",
         "*Legally*",
         "Having antisocial personality disorder doesn’t equate to being a bad person",
         "You’re a genius!!",
         "Wouldn't that require the \"boys\" in the photo to be under 18, and therefore unable to vote?",
         "Hey he’s the one that called them boys, not men. His words.",
         "Awwww, poor little man who no longer gets to pew pew pew with his friends…maybe he’s starting to crack under his incel lifestyle…",
         "Hasn't he been dragged by a few of his former squadmates for taking the credit on a team operation?",
         "One of things that those in elite forces live by is to not take personal credit for their actions. They feel that they work as a team, and the team gets the credit.\nHe clearly doesn’t live up to those standards.",
         "Like he did it all by himself with his own money and own intel.  By the same token, Obama put him there.",
         "What a stain on the armed forces.\nHe’s a tool alright.",
         "Often people who can be anything other than a marine. Say a normal 9 to 5 worker wouldn’t want to be a marine. Hell if I was to sign my career to the army or whatever I’ll be an officer. Who gets all the chicks anyways",
         "\"You boys are betas, and as the alpha it's my duty to \"dominate\" you (sexually)\" Yes pretty much the mindset.\n\nI think HE thinks he's calling them women - but still, not better.",
         "He picked up some insane customs in Afghanistan... And maybe lead poisoning and a heroine addiction?",
         "Well it was but fewer got doxxed?",
         "Good point. I guess he didn't feel comfortable saying fucl< toy.",
         "That was the implication. I suppose he could've meant that they'd be slaves and would fetch food for him but that was not my impression of it and it would be a strange way to word it if that's what he meant.",
         "Perhaps he's also an ass eater.",
         "Yeah, and our pet warlords kept underage concubines, which we then handed things like viagra as bribes.\n\nAfghanistan was a sh*tshow.",
         "I see your point.\n\nMaybe that's just his weird conservative fantasy but technically they are adults.",
         "'Boys' doesn't generally refer only to kids. If you're going drinking with your mates it's reasonable to say 'I'm going out with the boys' even if they're in their mid 30s. ",
         "That's a good point. ",
         "Yup it’s a huge burden",
         "For the literal definition? Yes.\n\nYou think this dude stops being attracted to soft young men because they’re 16 or 17? \n\n‘Cause I don’t. ",
         "concubine boys at that",
         "True.",
         "Yep. Apparently there's a code of silence that means they shouldn't take credit for something like this. This Trumpian idiot claimed the others all missed and he was the one that killed him. \n\n\nThen his orange Messiah claimed that Bin Laden wasn't killed and that it was a body double and this cuckold thanked him for it",
         "Has he?",
         "Also you don’t want to be revenge killed. Isn’t the whole point of being secret ops being the secret part.",
         "Yeah sometime def changed over time after the GWOT - operators in the past used to gradually do memoirs and interviews over decades and often aliases. This guy did a FOX News special 3 years later.",
         "Well, that's what sex is to guys like him, right?  It's not about pleasure or intimacy or anything girly like that.  Sex is about power and dominance.  \n\nPretty Freudian red flag to me.",
         "Aaah the old Russian Army mindset.",
         "No he clearly uses the word boys",
         "Brother, you can type fuck. Nothing will happen.",
         "Just going to double down on the key question of whether the sex slavery and food fetchery would, hypothetically, be occurring in Pennsylvania. Cause that might be enough votes to win it all.",
         "Yeah but he got horny cause he thinks they boys",
         "\"barely legal boys\"",
         "He’s still doing the power dynamic thing and putting a weird sexual element in there too.",
         "Do you usually want the “boys” you go out drinking with to be your sex slaves if they don’t do what you want?",
         "[Who's a cuckold?](https://i.imgur.com/dTnV0jD.png) ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
         "![gif](giphy|nKFXQkxLRiEhy)\n\nAnd what we really need to know is if these would be Pennsylvania concubines. You know…to have some idea about the margin of victory for Kamala.",
         "Fuck. Typing fuck broke the Reddit.",
         "That’s a 10 thousand dollar fine and community service for you!",
         "Good point. I guess he didn’t feel comfortable typing fuck toy.",
         "True, that is weird.",
         "Fuck...",
         "I'm TELLING on you."
      ]
   },
   "1gjij5p": {
      "title": "But but but the Weave",
      "text": "",
      "comments": [
         "But but but.... tan suit!",
         "You might send the wrong message.  One speaks eloquently and intelligently, and receives an overly enthusiastic and loving reaction from the crowd.  The other speaks like an absolute dumbass and receives an overly enthusiastic and loving reaction from the crowd.  Such a comparison might make a person wonder why someone would go through the trouble of being so eloquent when the people are so easily manipulated by sloppy populism.",
         "Here’s a comparison Jimmy Kimmel did of an Obama vs trump speech and it’s comedy gold. \n\nhttps://youtu.be/OsBOWSjOLsE",
         "And then have your kid respond:  \n  \n\"Obama worked his ass of in law school. Trump's didn't have to do shit and never worked a day in his life. But they both got to be President and Trump is a millionaire. Why is education important again?\"",
         "I mean, for fucks sake, you can show a GW speech and a Trump speech side by side and exactly how fucking dumb Trump is and how senile Trump has become.",
         "Funnily enough, we did exactly this for my A-levels in English in Germany. We analyzed and discussed Obamas inauguration speech as preparation for the exam and had to work on Trumps in the actual exam (2017).\n\nIts almost staggering to see the difference between those two.",
         "\"Basically a functioning illiterate\"",
         "Trump was educated by Roy Cohn.  They're both very very good at manipulating people.",
         "The “Weave” … boomer speak for gibberish",
         "Hilarious and dead right.",
         "\"So i don't have to be smart to be successful? I just need to be racist?\"",
         "\"I never really understood wind.\" - words of the Orange Raisin prior to explaining how windmill power generators are killing all the birds.",
         "Facts. Barack looks like a colored Einstein with swagger next to Donnie.",
         "Trump went to a good college. He is an educated facist that loves the uneducated.",
         "Or a debate.",
         "Show them a Michelle speech then a Melania speech.",
         "And a Michelle speech and OldDon, a Harris speech and DonOld, a Hillary speech and Old DonOld, an Oprah speech and tRumspter, Tyler Perry speech and DonOld, A talking piece of poo speech and OldDon.",
         "Without an education the two speeches are just two politicians using different methods of speaking.",
         "Unfortunately half of America will watch both and assume Trump is smarter because he uses more words they can understand.",
         "Almost all the republican people I know insisted that Obama spoke like a thug gangster.",
         "sorry the stupid will go for trump. \n\nMany people finally understood what a politician was saying when trump spoke, this is because they are and him are stupid and speak at about a 3rd grade level.... an adult at a 3rd grade level. \n\nPolitical speech should not be dumbed down to the more base among us but should strive to raise us up.",
         "I think the problem with this is 1) they don't ask and 2) they will stop listening after 7 seconds. It is alarming how short the attention span of young people is today.",
         "I tried, but after analyzing trump's speech the school decided it wasnt proper educational material, and it was too descriptive",
         "1000% plan on it.",
         "LMAO!  Good one!",
         "He speachifies like Cheech and Chong after toking a 2 gram joynt. I swear the only time that I hear that level of incoherent babbling is from a group of wasted adolescents. The only weave is in his hair.",
         "I remember the day my mom got me in a headlock and scraped a bar of Ivory soap on my teeth because I called my sister a dummy. Now my stupid boomer parents support the microphone fellater. Please make it make sense!",
         "His weave is like a drunk driver in traffic.",
         "If you ask Fox News whose speech was better they will give you a hilarious answer",
         "I used to work for a Brown alum that told me Penn was a diploma mill for rich pricks 😂",
         "Show them a Bush speech while you're at it. He wasn't always the most eloquent but it's night and day between him and Trump.",
         "All you really need to do is have them try to read the transcript of one of his speeches",
         "A'men",
         "The Weave is just his way to get out of answering questions. It's not \"everything is woven together\".\n\nIt's \"Bob, Duck, and Weave\" to escape.",
         "👏👏👏💯💯💙💙💙",
         "Technically Trump is \"educated\". \n\nA better comparison would be someone who worked for and earned what they've got and someone who was given everything they've got.",
         "Trump went to an Ivy League school…I don’t think a lack or education is the issue",
         "He died like a dog.",
         "While I don’t disagree, it’s also the very people like Trump and the GOP who’ve made it incredibly difficult to obtain a post secondary education. What’s more, if you have health issues or other unforeseen circumstances that get in the way, it may not be feasible to go to college. Everybody’s circumstances are their own.\n\nWith that said, conventional post secondary education is only one way to learn. Unfortunately, it is also, typically, the only acceptable way for many jobs. Obviously, this is necessary for some careers such as a doctor or a pilot. But, to me, education, formal or otherwise, comes down to a willingness to do the work and humility in not understanding, which can be terrifying and exciting.\n\nIf worth noting, I do have health issues that have made it so I haven’t been able to go to college, and I can’t afford to. However, I love to learn through the resources I have. I’m very fortunate to live in a very liberal area and have access to many great resources and research tools at little to no cost.",
         "...and make my kids say \"wait that guy went to an Ivy League school? I thought they were supposed to be good.\"?",
         "But waddabout Hunter's laptop and Hillary's emails?  Oh, and they all lie.",
         "Showing them the video isn’t that important. Trump has an Ivy League education I believe, he was just too stupid for it to stick. Showing the kids the the educational achievements of those who voted for each of them. The lesson: if you don’t learn how to pay attention and think critically, you’ll be one of the fuckwads that falls into the NEXT Trump cult.",
         "But Trump went to Wharton!  /s",
         "Trump git the best education money could buy. He just needed to buy some business accumen to go with them diapers.",
         "Doesn’t really work. Trump is dumb, yes, but he does have a formal education.",
         "He might still win after all that. So what are you really teaching the kids? It is ok to be stupid if you are white? I don’t think a person of color with trump level stupidity could have risen to the top",
         "This is what they should be showing in every school in America.",
         "That's intelligence. Not education. They both had expensive education. Trump is just dumb as fuck.",
         "It's telling that this meme uses Obama and not Harris",
         "And then there's Tim Walz, who talks like a channel surfing television set.  The guy can't seem to sustain a verb tense.  \"Hey who are what is I was and I said oh they're, well\"",
         "How about Biden or Harris?  Right there with Donny.",
         "Kids love having things explained to them filtered through politics. It’s a fact.",
         "Both are too stupid to realize killing children is bad",
         "And both became president.\n\nWhat's your point?",
         "But but but black!",
         "Hides the Dijon mustard stains.",
         "Seriously,  I could have done so much better in my schools fake elections if I just lied my ass off and called everyone else every name possible. Wonder what Mr. Carey would have said about that",
         "Honestly, I don't even think it's a good argument either. \n\nConmen are quite often eloquent and charismatic, while also being sociopath devoid of any morals.  The list of radio or podcast host who are easy to listen to, but constantly talk out of their ass is insanely long as well.\n\nInversely, there is plenty of scientists who struggle to string words together, but have incredibly smart ideas to shares to the world.\n\nOration is insanely important to get your message across, but I would be warry about anyone who tries to correlate it to the quality of the discourse. Kind of a containers vs content issues.",
         "Then the next step is to show the comparison of crowds. You didn't see klansman and neo-nazi's at an Obama speech. Well, maybe you did, but it's not because they agreed with the message.",
         "Sloppy populism with a heaping helping of straight-up racism and misogyny",
         "To be fair he’s always been hated by most of America and is a likely two time loser including as an incumbent while Obama sailed to victory twice.",
         "\"Son, you'll never be as popular as Trump, so you better study hard.\"",
         "Yikes",
         "This is actually super funny",
         "\"Because I can't give you hundreds of millions to get started, like Trump's dad did.\"",
         "Followed up with \"Trump was offered the best education his entire life\" it was a personal choice to not take advantage of it.",
         "Then show them a picture of maga and gravy seals. And remind that’s why.",
         "Because we aren't rich....",
         "Supposed millionaire - I suspect he is actually broke af - rally sites would indicate as much because they never get paid - seems like a theme for him….",
         "Either wharton is a way worse school than I thought, they donated a building to the school, or Trump paid someone to take his exams. There's no legitimate way he passed those courses. \n\nGranted he was fighting tooth and nail to hide his school transcripts from being released so maybe he just barely passed with daddy's money. Even still I'd love a deeper investigation into it.",
         "GW may have choked on a pretzel but at least he didn’t choke on a microphone",
         "Did you know that if you added obamas iq and trumps iq it would equal Obamas iq ?",
         "Who looks like an orange shit.",
         "https://preview.redd.it/h6l5fuunexyd1.jpeg?width=615&format=pjpg&auto=webp&s=97e855a45cd79543cf78b101c111323af59d29bd",
         "Educated? Nope, daddy bought him degrees. His academic performance records have never been released. His professor referred to Trump as the “dumbest student ever” and that was long before Trump ever announced his was running for president.",
         "I don’t he actually loves anyone. He’s a sociopathic manipulative power hungry asshole",
         "He went to a good college but didn't learn anything.",
         "Did he though? Him getting a degree make me think less of Penn.",
         "Perfect, it will become more obvious how uneducated he is.",
         "Well....those would be the same speech lmao",
         "Not even young people, just people.",
         "His diplomas are also bought and paid for",
         "Do you really think he paid attention or even attended most classes ? Those diplomas are bought and paid for",
         "Hi u/Ok-Elk-6087. Here's the real truth behind the latest email controversy: [https://i.imgur.com/Ztrqpya.jpg](https://www.youtube.com/watch?v=xfr64zoBTAQ) ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
         "Trumped most likely paid to pass and never actually listened to most classes. That would be my bet",
         "Ah the perfectionist voter, who focuses on one issue so much they vote for someone who is even worse and more corrupt like Jill stein.",
         "One talks to the poor and college educated people who have empathy and the other talks to people gullible enough to fall into a cult,racists and the ultra elite",
         "Conservatives are stupid and vote for stupid people.",
         "Are you talking about Barack HUSSEIN Obama?",
         "Not gonna lie. I read this and looked down and I have mustard stains on my pants and had to laugh a little bit.",
         "Honestly I would have watched my schools debate club debates if this happened regularly",
         "Fake news! Like Trump ever actually showed up for class. \n\nSeriously, there's credible claims that he paid people to take tests for him. Don't think anyone will ever be able to actually verify one way or the other, but if Trump ever did actually attend college, his dementia must be even more advanced than we think.",
         "and he's also threatened to sue any school that releases his grades...like you do when your grades are good.",
         "It's obvious his Daddy bought his degree!",
         "That doesn't change the fact that he had the opportunities. If he was to dumb to avail himself of those opportunities that reinforced my point.",
         "The same!",
         "Rock their worlds and show them a Michele Obama speech and compare it with a Trump speech. Dayum. That woman is 🔥 Two of our countries greatest, most effective orators are married. Crazy ☀️ 🇺🇸",
         "Covid covered my clothes with spots."
      ]
   },
   "1gjj84z": {
      "title": "Thanks For Nothing, Ronnie! ",
      "text": "",
      "comments": [
         "Yeah, but he had a LOT of help.",
         "Reagan talked a lot about “getting the government off your back”. \n\nWhat he did was get the government regulation removed from corporations so they could crush the worker under their boot.\n\nReagan was elected 40 years ago and is still fucking Americans.  So think really really hard about the motivations of any Republican you vote for.  \n\nNixon fucked our healthcare system half a century ago and we still haven’t recovered.\n\nHere’s a worthwhile video. \n\nhttps://youtu.be/e9I71PzIYiA",
         "\"And I was also the one who started taxing Social Security benefits!!\"",
         "GOP...fucking YOU for decades.",
         "Hey, don't forget, he also ignored the outbreak of HIV, allowing it to become a full-blown pandemic.",
         "I remember clearly arguing in 1982 with a devout Republican that trickle down economics was total bullshit and all of us working people would suffer.",
         "Don't forget Milton Friedman.",
         "People have to stop hiring bad actors for president.",
         "and the religious right, forcing mentally ill out on the streets, crack, the list goes on",
         "Good o'l fashioned Reaganomics yeah it took a while to fuck us over but it most definitely did",
         "Ronnie and Donnie, the disastrous duo.",
         "I don't understand how this seditious piece of shit was never impeached and charged.\n\nHe negotiated with the Iranian terrorists to make sure the hostages wouldn't be released until he was in office, meanwhile Carter (whatever you may think of him) was literally on the phone until he had to vacate the white house because his term was up trying to secure their release.\n\nThen there was the whole Iran-Contra thing, which is a complicated mess all its own. And to round it out, around 300 people in his administration, including his Attorney General, were either charged, or convicted, of violating the law and/or government ethics codes. He invaded Grenada for... reasons. And who could forget ketchup as a vegetable on school lunches. Not seditious really, but just a serious dick move.",
         "The only good thing he ever did in his entire life to was leave the planet. Sadly he did it 70 years too late.",
         "You forgot, lowered taxes from 50% on billionaires to 28% or whatever ridiculously low number he pulled out of his demented jelly bean addled brain.",
         "Trickling down any day now...",
         "Ronnie was the man who began the mass exodus of US companies to China. This subsequently began the collapse of the middle class.",
         "Reagan is literally quoted as saying, \"why do I want to pay tax dollars for someone to go to college just to protest against me?\"\n\nHe was a piece of shit that got polished in Americana mythos. Glad he gets brought up for the BS he passed instead of the whitewashing conservatives try to pull with him.",
         "His administration set forth many policies that would change American society for the worse. In fact, almost everything that is wrong with today's America can be traced back to Reagan's administration.",
         "This asshats 8 years still negatively impacts everyone in multiple ways nearly every day.",
         "And all the mentally ill homeless people making living in a city awful for everyone else",
         "https://i.redd.it/uyesunejexyd1.gif",
         "“Ronald Regan.. The ACTOR?!?!” - Dr. Emmet Brown.",
         "I personally know of a few facts about Ronald Reagan. He would give you the shirt off his back, if he thought you needed it. But he sure screwed me. I had just bought a house. He eliminated almost every tax deduction I had coming to me. His voodoo economics affected America for decades.",
         "And he ended regulations on the media that would have prevented the wealthy from taking most of it over.  And he accelerated toxic masculinity with the cowboy myth he started.",
         "Yet so many Republicans make him a Demi-God. Guy hurt so many things in the name of the wealthy and corporations.",
         "It wasn't just Ronnie. Ronnie was doing the work of the GOP and millionaires who wanted to be billionaires. \n\nThe GOP is still doing the job. Keep them out of office.",
         "Fuck you, Ronald Reagan.",
         "[Listen to Cody.](https://youtu.be/3WfgGDkWzYU?si=8vT58oFVlJQpZZjP)\n\n[He has a Showdy.](https://youtu.be/E5eTGbxJxl0?si=kC8oRd6Rjt2xfQqL)",
         "Only positive thing this GOP POS did that affected me was to raise the pay for the military. Everything else has been a bust.",
         "Always six degrees away from being rat fucked by that coward of a walking corpse.",
         "It's almost funny how terrible Reagan was, and still is better than anything the party has to offer.\n\nTrump is not the problem, the Republican party is the problem. Trump is a growth from the cancer that is the Republican party.",
         "Trickle down this, Ronnie. 🖕🤬🖕",
         "Yup, I can't vote because of his say no to drugs bullshit.",
         "Everyone should read *Evil Geniuses: The Unmaking of America* by Kurt Andersen.",
         "And the heritage foundation (you know the authors of project 2025) they're the ones that wrote most of those devastating to the middle class bills that Reagan got passed.",
         "'Trickle Down' economics that Ragan put into high gear is the biggest driver of inequality in the last 100 years.",
         "He also created the social security income tax for seniors.",
         "He was the physical manifestation of pulling the ladder up while giving all of the younger generations the finger.",
         "https://preview.redd.it/cbt1dm2fhxyd1.jpeg?width=2048&format=pjpg&auto=webp&s=d27be8d85f992739ea94a8f04ddf1cef8782888c\n\nYep! Saint Reagan’s Republican battle cry against blue collar working class families!",
         "💩\n\n🪦\n\n>*Trickle Down by HarambeWest2020. 2024*",
         "I've hated this president for 30 damn years. I remember the first time I pieced it all together. 10 year old me had my eyes opened a lot that year.",
         "And since no one else is mentioning it, when you hear a GOP MAGA idiot bang on about the budget deficit this is the guy that blew it into the stratosphere, and every Republican president since has followed his example",
         "And the boomers LOVED him.",
         "https://x.com/KobeissiLetter/status/1695809591047491857",
         "The whole fucking crew was a lie from the start.",
         "Truth!",
         "Ron ruined everything.",
         "This is the guy that MAGAs should be railing against",
         "Ah yes, Ronnie Reagan, The Match That Lit the Dumpster Fire That is the Current GOP.^^^TM",
         "Would be nice to know why and what he did and how he did it. otherwise, this is just a low pixel block of text.",
         "Ronnie was evil enough but wasn’t smart enough to do it on his own. He had plenty of help from other republicans.",
         "That, and Jay Powell selling your future down the river to save the market. \n\nWhy did home prices skyrocket? Jay Powell gifted sub 3% mortgages to everyone who owned a home before COVID.\n\nHome prices skyrocketed and as a result you’re rewarded with a 7% interest rate on a home that costs twice as much as it did in 2019. \n\nOh, and your landlord knows that, and that’s why they raised your rent an insane amount. \n\nFuck Ronald Reagan, but Powell and the Fed are the more recent villains.",
         "Killer Mike has an absolutely fire song about Reagan",
         "Hollywood actor who once was a dem and spoke on behalf of unions, became president for the Republicans and extinguished unions.",
         "Regan was a sad old man, but Newt Gingrich was his right hand man. Newt \"Party Over People\" Gingrich. Let's not forget the two are linked.",
         "I’m from the SF Valley and every time I drive by his library I flip it off and realize why it’s in fucken Simi Valley",
         "This is so important to remember, just because he didn't spew crazy bullshit all day like the current Republican frontrunner doesn't mean he wasn't a piece of shit.\n\nI worry that once we're done with Trump, the average, run of the mill asshole Republican is going to look a lot less offensive by comparison.",
         "I fucking hate anything that’s rhymes with Ronald.",
         "Wall Street and he as their representative / puppet.   Don't forget it was the CEO's who led the way at the destruction of American middle-class prosperity, and Reagan was re-elected too!",
         "Like Killer Mike said, I'm glad Reagan's dead.",
         "Loved that guy and voted for him twice. It is a pity he was such a shit when it came to working Americans! Most of the MAGA movement can directly be contrubited to his policies. I also found it the ultimate irony that he blocked all T cell research on Alzheimer's desease and later died from it!",
         "Ronnie taxed tips.",
         "Truth.",
         "Ronnie really changed the equations and the GOP and he was actually a traitor.  He managed to decimate the middle class and put to lie the idea that the GOP was the party of fiscal responsibility.  He played footsie with the Theocracy in Iran and negotiated the hostage release to get himself elected.  He is praised as having single handedly destroyed the Soviet Union where in reality he was lucky enough to be (almost) present at the demise of the corrupt regime in Moscow.  \n\nHe is still a Saint according to the conservative cause.  History will judge his watch harshly.",
         ">**Hey  millenials...**\n\nand hey, its not just you guys..   i am a boomer and his policies^1 forced me to go off of any aid to dependent children, causing me to have to get a full time job or go to college to get a better paying and more parenting friendly career.  ..this resulted in separating my kids and me for three years... its complicated but  what it amounts to is that it was not friendly or helpful to single mothers *at all*   And then there were the loans i had to pay back afterwards... which i never got clear of until 20 years later.     ...   ... yeah  ... never been a fan of Reagan.\n\nI remember that, at the time, there had been alot of talk about \"welfare mothers\"   who wore mink coats and drove fancy cars.   ..which we struggling single moms laughed at because we didnt realise that those stories were  part of The Plan.  *my own church turned their noses up at me because they thought of me as a freeloading welfare mom*  lolol  of course i didnt know they were doing that..  i  really was a big dummy (naive)  when it came to lying liars lolol\n\n______________\n1.  [He had signed the Omnibus Budget Reconciliation Act of 1981 to cut funding for federal assistance such as food stamps, unemployment benefits, subsidized housing and the Aid to Families with Dependent Children](https://en.wikipedia.org/wiki/Ronald_Reagan#Government_spending)",
         "https://preview.redd.it/lf3555lja1zd1.jpeg?width=495&format=pjpg&auto=webp&s=c4a9ec0b71e1188c46646c16ff8eba329af0bf0c\n\nYes, and you refuse to do something about it: You chose to suffer instead of getting rid of it",
         "Don’t forget come commodifying college educations. What used to cost a few thousand now cost over 100,000.",
         "Don’t forget all the mass shootings by people with untreated and undiagnosed mental conditions. Ronnie closed all the mental facilities to save a buck.",
         "And it will continue if we allow republicans to keep a majority in Congress or get the White House. \n\nI keep seeing on reddit these comments and posts that blame Reagan or Trump for things. You guys need to realize that it’s ALL republicans, even the “good ones” who want to make life terrible for poor people.",
         "lol all these fucking dumbass republicans coming out wanting a pat on the back for voting for Kamala, because \"this GOP isn't the party of Reagan anymore\" Disrespectfully, fuck you and shut the fuck up. \n\nJust because you were too much of a useless braindead fuck to understand what the GOP stood for, doesn't mean the party has changed, whatsoever. It's beyond ridiculous.",
         "Yeah it was, one of the worst presidents this country ever had",
         "In 2009, my friends and I were super edgy and literally danced on his grave. A couple of our classmates claimed to have pissed on his grave to give him that trickle down effect, but I think they were just bullshitting.",
         "Still waiting for that trickle down money to hit us. But they keep giving the rich tax breaks and telling us it’s for our own good, the money will trickle down eventually like rain… and half the country still believes it.",
         "reagan was a mediocre actor, a great politician, and a lousy president, still waiting for some of his trickle down economic policy to trickle down...50 years later, that sucker is stuck",
         "It's gonna start trickling down any decade now.",
         "He pressed F to send crack to inner city neighborhoods.",
         "He instituted them. They were developed here: https://en.wikipedia.org/wiki/Mont_Pelerin_Society\n\nIt's called neoliberalism",
         "White supremacy lite!",
         "Ronald was so effective he even fucked it up for us in Canada",
         "Not much trickled down to anyone other than big corporations. So trickle down economics, trickles no more. Not then. Not now. ",
         "He fucked over Gen X as well as Millennials, and he can fucking rot in hell.",
         "It wasn't just Reagan.  It was the boomers who voted for \"greed is good\" after they got out of their cheap educations and they didn't want to pay taxes once they hit stride in their careers.  They got their subsidies as youth and pulled up the ladder behind them.  Now they're all going to retire and bankrupt the pension system by the time they're done because they didn't contribute enough.",
         "One of the best Redditt posts EVER!!!!!!!",
         "For conservative millennials, Ronnie also took our guns in California.",
         "https://preview.redd.it/7qa1zrb380zd1.png?width=1424&format=pjpg&auto=webp&s=b429b712f0a57c6c3932395dec358d92b5e3eea3",
         "Trickling down yet??? Regulations help consumers and workers not get taken for a ride..",
         "Democrats never reversed or countered any of it.",
         "Money printing did and does this",
         "We defeated communism... but at what cost?",
         "From other Republicans.",
         "He had a “Mandate for Leadership” from the Heritage Foundation as well. He enacted more than half of its 2000 or so policy proposals in his first year in office.",
         "Reagan and Margaret Thatcher put the neoliberal economic policies in place that gutted the middle class, and they were continued by every republican president since then. But we need to own up to the fact that Clinton and Obama continued the neoliberal policies without really trying to end them. It's only been Joe Biden that's been trying to start turning the ship around, and I trust that Harris will continue that process. I wish trump supporters would see that Harris would get us a better economy while trump would just auction everything off to the oligarchs.",
         "Don’t forget. He also broke a large union(flight controllers) and wait for it… made it so if you do finally get social security, they’ll tax that…again",
         "He was backed by neo conservatives, religious fundamentalists, racists, oligarchs and others who wanted to turn back the clock to pre civil war slave owning days when non whites and women were property.\n\nHe was just the first time they got a President who would do what they wanted.",
         "The Gipper is the gift that keeps on giving…",
         "The people who have helped Regan the most are Gen Z and Millennials themselves.  Exit polling shows they only makeup 9% and 11% of the voting population in 2024.\n\nYou have two jobs and don’t have time to vote? Gen X voters are not retired and their turnout is 38%.\n\nYou think both sides are the same?  Watch how bad Trump will fuck your generations once you put him power by failing to vote.\n\nStop posting memes and VOTE!",
         "He had dementia, so help might be underselling it. \n\nGOP really likes installing mentally handicapped talking heads and then riding them like dick puppets for billionaires.",
         "Also, what did the Dems do to reverse these?",
         "every problem in america can almost directly be traced back to reagan",
         "Yeah what he meant was \"get the government off *the rich peoples'* backs (while passing the tax burden onto you)\"",
         "Don't give Reagan all the credit... his ties to the heritage foundation (yes the same group behind project 2025) is how most of those bills were authored and passed.",
         "he also had very little to do with the fall of the soviet union.",
         "sometimes i wonder if we really should have [rescued him from ninjas](https://external-preview.redd.it/sValqHoyHq8oSGDX8QdU_GofUM7TDhReOCiiv32BZ4o.jpg?width=640&crop=smart&auto=webp&s=468cdc8615bc88faa81d3fe2c2d8b07df7c5a5bd)",
         "Not just crush workers but crush customers/consumers too. Cable tv prices increased 40% in areas where monopolies existed because of his cable communications act. The deregulation of the airline industry led to unsafe flights in the 80s. Deregulation of the banking sector introduced today’s banking fee hell. He reduced food safety standards which led to a major listeria outbreak. \n\nThe list goes on and on. When monopolies and oligopolies enjoy deregulation it’s always the consumers who come out behind due to the lack of competition. Regulatory capture was Reagan’s thing. America was for sale at bargain prices through political donations.",
         "The \"don't tread on me\" crowd sure loves to get trampled and reamed by corps as long as they can say the government isn't doing it.",
         "And more decades to come.",
         "Not if you're a corporation, particularly a large corporation.",
         "It's not that he ignored it. It was hurting and killing the people they wanted to see hurt and dead. At the time they pretty much joked about it.",
         "It took Elizabeth Taylor, Bono, and Jesse Helms to do something about it. Of all people, it was those two unlikely characters..Jesse Fucking Helms turned against his own kind and became a decent person for a millisecond. Clinton kinda sorta helped but it was Dubya (again, an unlikely character and god knows why he did) to use more federal funding that should have been done 20 years prior. The fact that it was ignored by Reagan because \"only gay men and drug users are a problem\" is revolting. \n\nI *think* that's what happened. It's been a long time.",
         "> HIV, allowing it to become a full-blown pandemic.\n\nKind of like when Trump ignored COVID",
         "Trickle down might work if bank accounts had limits or if you were taxed at 100% after a certain amount of wealth. But of course suggesting that is enough to give most people the vapors.",
         "George H. W. Bush argued that trickle-down economics was bullshit. He called it voodoo economics in 1980 when running against Reagan. And he was right. But he fell in line with his fellow Republicans once he was in the Oval Office.",
         "Ooo yeah Uncle Milty, who won a Nobel Prize for an economic theory that was never proven to work",
         "Also a pair of celebrities prior to entering politics. It's like soul-less famous people will do literally anything to make money and have power over others or something. Everyone should check out \"Bedtime for Bonzo\" the movie. Easily Reagan's greatest achievement. And the baby chimp was the real star and the better actor. Nicer too.",
         "one broke the economy the other is breaking people's minds",
         "> Iranian terrorists to make sure the hostages wouldn't be released until he was in office\n\nThat is because the same thing worked for Nixon and Vietnan",
         "I am beginning to suspect the alzheimers was already at work on him before he gained the presidency.   aaaaaand i have always felt that Nancy wore the pants in that family.",
         "> He was a piece of shit that got polished in Americana mythos\n\nMark my words, Trump will receive the same treatment.",
         "you say those as if one is not the reason for the other...",
         "well, now, looking back on it all,  its easy to see that praising him all the time, in the press,  kept the myth alive and groomed the public mind to be more susceptible to all the criminals who followed him...",
         "I received that raise, too.  However, I read somewhere that the Carter admin had worked on it.  Never researched it.",
         "He cut funding to mental hospitals and dumped them all into the street because he really, really hated the mentally ill. Then he dies..FROM ALZHEIMERS!! Ahhahaha!\n\nSeriously, he survived cancer 8 times. Shot numerous times and lived. The man was a ghoul.",
         "really?  lol yeah there is that line on my tax form lololol ....that absolute and depraved *bastard !* Meanwhile,  back at the ranch, he  was giving some of the biggest tax cuts, that had ever been, to the muckety mucks!",
         "You forgot he fucked up the handling of AIDs as well.  \n\nHim and Nancy figured it was a disease you contracted for being gay.  \n\nIt wasn't until Ryan White that the country started to figure out the truth.",
         "Not liberal and progressive boomers, of which there are/were tens of millions.",
         "*ahem*  boomer here, and i did not love him..  of course, i was a screaming freak anti-war hippy turned mountain mama turned *single* mountain mama  so maybe that is why?",
         "If Reagan were around today he would have been primaried years ago as a 'RINO' if only because he did grant amnesty to illegals. They'll never admit this, though.",
         "naw i bet they did it.. i mean..  why not?",
         "yes that is a mystery.  and possibly grounds for divorce.   But tell me this,  is the person who doesnt fight back as bad as the one who starts the fight?",
         "That’s a toddler level understanding of monetary policy. Here ya go 🧸",
         "Yup.",
         "And the neo-liberal democrats that sprouted up in Reagan’s wake. \n\nReagan’s elections were so absolutely crushing that the Democratic Party basically abandoned all their previous pro-worker stances and went full on neo-liberal pro-corporation economics, but with a slight lean towards preserving entitlements and some forms of regulation. They still managed things much more competently than the Republicans, but there wasn’t a ton of air between their actual policies. It’s really only nowadays that we’re finally seeing a growing awareness and rejection of these ideologies that basically became gospel and “common sense” in the aftermath of Reagan.",
         "I am going to drop a name here, Jack Welch who is a legendary CEO that started the everything for shareholder style, which contribute a lot to the wage gap.",
         "Exactly... The name was different, but Ronnie implemented most the \"Project 1981\", they just called it \"mandate for leadership\".   \n\nTrump has the same backers and the same plan from the same people, just with a modern name. \"Project 2025\".  We need to learn from history, so we don't repeat the mistakes made.     \n\nVote Blue to save America and Harris for President!",
         "Ya know... \"Heritage\", not \"Hate\".",
         "You misspelled \"grift\".",
         "Yeah, the better choice ain't a great choice.... But it's better. I mean, that nut-job Perot was right about NAFTA. But he woulda been a crap president.",
         "Well, really it was the selfish 80's boomer pricks that voted for him.",
         "You sure?\n\n\\*Points to the Confederate South that has been repeatedly dragging this whole country into their shithole swamps*",
         "100%",
         "Honestly a big step before him was not punishing the south harder and letting them keep much of their leadership.",
         "Even gun control laws.",
         "[Bill Hicks had a lot to say about him.](https://www.youtube.com/watch?v=MXezjbuzh14)",
         "But, but, but, Fox News says immigrants and the democrats are the reason for all my problems?",
         "https://preview.redd.it/ygok7ys15zyd1.jpeg?width=336&format=pjpg&auto=webp&s=651d4cde06c394b1d954087aff88182336f8c50a",
         "Yes, they figured it was a \"gay disease,\" and that was a good thing. \n\nMuch in the same way Trump let COVID loose because it was hitting blue states first. \n\nTurns out viruses don't discriminate.",
         "> Trickle down might work if bank accounts had limits or if you were taxed at 100% after a certain amount of wealth. \n\nThe tax rate at the highest bracket at one time was 80%.  Before Reagan cut it, it was 50%.",
         "Have you *read* *A Monetary History of the United States*?",
         "And Republicans claim to hate \"elites & Hollywood\". Wheel out any d-list celebrity, coach, player, etc and watch them trip over themselves to worship that celebrity. These peoples beliefs and principles are fuckin play-doh, or they're just VERY easily manipulated!",
         "[If by Nancy you actually mean Nancy's Astrologer, you're right.](https://www.latimes.com/local/lanow/la-me-ln-nancy-reagan-astrology-20160306-story.html)  \n\nYou can't make this shit up.",
         "yeah, I just saw a little clip about him v. Dukakis. Calling him an invalid... so... the math checks.",
         "yep yep..  me, for one.",
         "Whatever you say",
         "It wasn't just his election victory, the public fell for the[ Two Santa Theory by Jude Wanniski](https://en.wikipedia.org/wiki/Jude_Wanniski#The_Two_Santa_Claus_Theory) which manipulated them into thinking that tax cuts for the rich were somehow good, but New Deal programs were a waste of money and all government debt was to be blamed on Democrats. Democrats only turned their backs on the pro-worker, New Deal policies because the public already had embraced Neoliberalism and Trickle Down Economics. Instead, the Democrats should have fought for control of the narrative, not capitulated and played into the hands of the GOP.  Time and time again, messaging is the downfall of the Democrats.\n\nEdit to add image:\n\nhttps://preview.redd.it/jc68i8r2e0zd1.png?width=394&format=png&auto=webp&s=fb19516f39969721c113c9d0c02535c5d7d5d19a",
         "The triumph of corporate interests",
         "This is Reddit; here we pretend Bill Clinton and Barack Obama were what they campaigned as and not what they actually ended up being",
         "Isn’t it ‘Project 2025’?",
         "The 2025 edition still says \"Mandate for Leadership\" on the cover.",
         "You misspelled 'historical blight on the Republic'.",
         "It was the knee-jerk reaction to Carter saying that Americans would need to adjust their expectations and spending habits after the 70's oil crunch. Well boomers didn't like that, after all the growth in the 50's/60's. They dubbed him the worst president in history. Reagan and Republicans then rode a 12 year wave of ludicrous consumerism. Knocking down any safe guards that would keep corporate america from trampling everything in sight. Even when Dems finally got back in power, they were barely better at holding the ultra-wealthy in check. Nobody wants to be another Carter, and tell us greedy morons that fixing the problem isn't just a matter of making the Wallstreet line go up.",
         "Boomer voters wanted to give Jimmy Carter a second term.  Older voters didn't agree.",
         "It wasn't selfishness. It was sold as a way to help everyone. It sounded reasonable and logical at the time. \nHowever, in hindsight it was just another money grab for corporations that bought back thier own stock with thier new found wealth and used thier profits to expand and buy competitors. Hard to know you're being sold a bill of goods when they paint such a rosy picture of the benefits that would trickle down through the economy benefiting the middle class. Seems like every politician promises lower taxes and a better standard of living. Not many have been able to deliver. How does that go... Oh yeah, \"I'm from the government and I'm here to help you\". Trickle this! ",
         "Absolutely cursed, also absolutely have to show this to my coworkers",
         "[deleted]",
         "it was up in the [90%s during the 40s-60s](https://files.taxfoundation.org/legacy/docs/fed_individual_rate_history_nominal.pdf).  back when we could build highways, bridges, and rockets that went to the moon.",
         "No but I’ve read Piketty’s *Capital and Idealogy* and Chomsky’s *Requiem for the American Dream*",
         "Good job 🍭 \n\nHousing prices in N America are largely high because the lowest inventory in history, along with single family homes being the only style built. You think housing prices doubled in five years because sometimes deflationary monetary policy going back 45 years? 😂",
         "The public fell for it because campaign finance laws were deliberately gutted by the courts, allowing money to flood in to the U.S. political system and pay for mass propagandising of the voters.",
         "there was a guy named Paul Tsongas who ran in the Democratic primaries in 1992.  He campaign slogan seemed to be \"I'm not Santa Claus\" as he kept saying that all the time.  The public basically just laughed him off.",
         "And Reagan's Director of OMB, David Stockman pushed the supply-side line, and then he got religion and decries it as a myth and became a pariah to the right...",
         "Only excellent marketing will let you tell everyone you’re going to build a wall, make Mexico pay for it, do neither of those things, and half the country will still vote for you",
         "“Sometime shortly after Bill Clinton was elected, Republicans seemed to forget what the 1980’s had actually been like and mythologize Ronald Reagan. Many of the “facts” we argue over about Reagan simply aren’t true.\n\nA good example is the myth that Reagan turned around the pitiful economy of Carter by cutting taxes in a supply-side effort. This ignores the fact that federal taxes consume nearly as much GDP at the beginning of Reagan’s Presidency as at the end (19% to 18.4%). Federal taxes actually consumed less of GDP in Bush’s 8 years than in Reagan’s 8 years.\n\nIf Bush is a greater supply-sider than Reagan, then we’ve got to adjust the Reagan myth a bit. While Bush never signed a single tax increase, Reagan signed several of the largest tax increases as percentages of GDP. Reagan signed tax increases every year of his Presidency except the first and the last.\n\nEven on spending Bush performed better than Reagan. During Reagan’s presidency government spending was \\~22.5% of our economy. During Bush’s terms government spending was only \\~19.5% of our economy.\n\nReagan benefited from a get-tough Federal Reserve that finally got inflation under control in 1982. That victory over inflation paved the way for job creation and economic growth not only that decade but also in the 1990’s.\n\nHowever, Reagan did attempt deregulation, which ended up being a mixed bag of successes and failures.\n\nReagan revitalized and rebuilt the pathetic military he inherited in 1981.\n\n\\[*Doug Forrester missed a lot here, Reagan actually gutted the military through ineptitude as I was one of many in the military in various branches who lost their slots in military flight school because of Reagan. By cutting taxes so much and exploding (defense) spending, Ronald Reagan created an unsustainable situation whereby Senators Warren Rudman (R -NH), Phil Gramm (R-TX), and Ernest Hollings (D-SC ) enacted OBRA, Omnibus Budget Reconciliation Act (Colloquially known as ‘Gramm-Rudman), which clamped down on the deficit spending Reagan had passed. It resulted in many of us not being able to attend flight school -Copernicus\\_Brahe*\\]\n\nReagan faced down the Soviet Union not with meaningless gestures (boycotting Olympics) but instead with might.\n\nReagan used his charisma and communication skills to re-frame our political arguments in America.\n\nWhat we need to do is detach from Reagan the myth so we can look forward realistically instead of looking back to a 1980’s that never existed. This also involves facing the Bush era without comparing it to fantasy.\n\nOur party needs to get past its myths about Reagan before it can address the problems of today.”\n\n\\- Doug Forrester, 2005 Republican nominee for Governor of New Jersey, writing for a conservative republican website…",
         "Apparently trickle down isn't even new. It used to be called horse and sparrow economics with the idea being that if you overfeed a horse the sparrows can pick seeds out of the horses shit. Yes, it was originally horse shit economics.",
         "Yes, dang thumbs the size of 4 buttons on the phone's tiny keyboard.   I edited it to fix the typo.   :)",
         "America. Worships. Greed.",
         "Yep.",
         "We were switching to the metric system and there was solar on the roof of the White House. The olds have been holding us back forever.",
         "I don't think so, the boomers at that stage were yuppies and only cared about money if I recall correctly. Would be interested to be proven wrong of course...",
         "Nah, they knew. However they were happy to pretend it was good for everyone as long as they were getting big capital gains from housing. The 80s sucked hairy goats ass because of all the yuppies being selfish.",
         "Not exactly obscure history...\n\nhttps://en.m.wikipedia.org/wiki/Ronald_Reagan_and_AIDS",
         "That's great and all, just not sure if that has anything to do with the work that earned Milton Friedman and Anna Schwartz the Nobel Prize.",
         "Look up how many dollars have been added to circulation in the last 3 to 5 years",
         "Ah, yes. The Powell Memorandum played a part in that.",
         "TIL, thanks!\n\nFrom the wiki page:\n\nWhen asked why he did not have a tax cut plan like the other candidates, Tsongas famously answered, \"I'm not trying to play Santa Claus.\"\n\n[https://en.wikipedia.org/wiki/Paul\\_Tsongas](https://en.wikipedia.org/wiki/Paul_Tsongas)",
         "It still is horse shit, tbh.",
         "4? That sounds great. I can only see Q, V, and P.",
         "“Greed, for lack of a better word, is good\" - G Gecko ‘87",
         "https://ropercenter.cornell.edu/how-groups-voted-1980",
         "Nominal house prices actually declined slightly in the 80's. It's verifiable with a quick web search. So your assumption is incorrect. I remember distinctly reading the WSJ and magazines that went into detail on how the trickle down effect would benefit everybody.\nPoliticians aren't always truthful and they don't always represent you and me.  Newspapers and the media take sides. Big money wins. I lived through that time. I voted for a better life for all of us at that time. \nPolitics wasn't as messy and mean spirited then as it is now. But the one thing that hasn't changed is how big money dominates our politics and adversely affects our well being. We now have people that are trillionaires. We have homelessness to a degree that is unfathomable. Young people that will be paying back student loans into thier senior years and well educated and hard working people that can barely pay the rent, nevermind buy a house. This is not a boomer issue this is a political issue run by corporate greed and bad politicical management. \nGo look at the Supreme Courts ruling, Citizens United, and tell me it's not corporate greed. Boomers are plentiful and like the general pop some are a holes. But this isn't a boomer issue. It's purely greed. It affects us all. Where is the path for the average person? Boomers are plentiful but the issue is much larger and more dynamic than boomers sitting on thier capital gains. Just saying... ",
         "Ok. At the end of 2023 it was $2.3T and at the end of 2020 it was $2.05T. 😱 \n\nAgain, you have a child’s understanding of monetary policy. What a dollar can buy vs the cost of homes is like…a moronic measurement. A strong dollar would push up the cost of homes, but don’t let that stop your ignorance.",
         "The lever podcast was fascinating. It's such an incestuous little group of people that have almost succeeded in buying out the republic.",
         "Yeah, he sure wasn't going to beat Bill Clinton by just saying that over and over again ;)",
         "Was is and will continue to be.",
         "According to your link, everyone over 30 voted 55-45 for Reagan. It was the boomers.",
         "Your info is not correct. Just a simple google search shows differently. Houses arent more expensive per se. Money is worth much less",
         "Boomers were 16-34 years old in 1980, so all of the under 30 voters were Boomers, and as you can see, didn't elect Ronnie.  Voters over age 30 did, but they were mostly not Boomers.",
         "Home prices in Canada and the U.S. have gone up almost 50% in four years. Google is not your friend when it’s a filter bubble, kid. \n\nhttps://fred.stlouisfed.org/series/MSPUS",
         "fair enough",
         "Do you not think printing money like crazy makes prices go up?",
         "One, monetary tightening hit record levels last year and interest rates went over 8%. There isn’t just “herp derp money printing!” going on. \n\nYou literally DO NOT KNOW how monetary policy works, so you should not have a strong opinion on the subject. Go study the economics and you’ll feel a little better.",
         "bro, you're way the fuck out of your league on this one. Back up what you're saying rather than just repeating it. He's already refuted what you said and you haven't actually provided any new information to support your claim."
      ]
   },
   "1gk4qzw": {
      "title": "Center for Countering Digital Hate names Musk and X as the epicenter of U.S. election misinformation",
      "text": "",
      "comments": [
         "Elons involvement was the closest thing we had to an October surprise. We’ll find out today if propaganda can buy an election. ",
         "Who needs the Russians when you’ve got Elon",
         "Musk and Xhitter leading the charge to lie to American voters?  I'm completely shocked.  What's the next announcement going to be, that water is wet?",
         "Drawing so bad they had to put the names in it.",
         "Missed opportunity.... he should have said \"Leon!\"",
         "https://preview.redd.it/p9wafmyz03zd1.jpeg?width=960&format=pjpg&auto=webp&s=a77ef7d412418e544aa07857d01928793d39e569\n\nCan’t wait till Trump wins.",
         "Or some time this week"
      ]
   },
   "1gjulcb": {
      "title": "Closing argument",
      "text": "",
      "comments": [
         "Boomhauer gives better speeches than Trump\n\n![gif](giphy|9hNrFUhR7Pp0A)",
         "Concepts of a plan\n\nhttps://preview.redd.it/fp6g4vq8gzyd1.png?width=640&format=png&auto=webp&s=6a6651545a3cc3072968ef112e8892864be035bd",
         "That MF is NOT good at Connections.  Pathetic.",
         "Hah! I play Connections every day. Good shit.",
         "The weave 😂",
         "I got the purple first today!",
         "Still can’t believe they’re parroting the name for his nonsensical rambling.",
         "It’s the weave!!!!",
         "IYKYK",
         "Don't make him relatable",
         "This is so insulting, Trump can't paint squares!",
         "It's the weave with colors. Only other geniuses can decipher Trump's genius color pattern.",
         "You forgot to make it look like he used to sharpie to color in the rows",
         "Real Trump would have cut them all out and glued them in a new page to look like he got it. Then claimed he got the secret red connection no one else got.",
         "Connections",
         "https://preview.redd.it/jnh81gx7n0zd1.jpeg?width=526&format=pjpg&auto=webp&s=a585395a3fea04b8b40a4b856556319ce5dab2f2",
         "It's the weave, only the biggliest smarties will understand.",
         "You gotta “weave”",
         "Should be smeared with shit too",
         "I don't understand...",
         "There should be some red, black and white in Trump's chart.",
         "Harris would get purple first",
         "All I see is proof of Trump's weave /s",
         "Eh, bad day for that when ny times people are striking and asking others not to play wordle and connections.",
         "I can connect with this humor",
         "There's a strike!!",
         "It’s called a weave!",
         "\"I dunno, Kamala didn't get the purple answer first... Is that really presidential material? I don't know who I'm going to vote for\" /s",
         "The weave",
         "That’s actually really funny.",
         "So they both cross picket lines?",
         "Boomhauer also always gets consent from ladies.",
         "I like how that image can apply to every one of his plans.\n\nBuild wall ? Mexico pays for it.\n\nTariff goods ? Other countries pay for it.\n\nTax cuts to the rich ? Reduce deficit.\n\nEtc",
         "![gif](giphy|uwGSfGgQFt1AM1McxX)",
         "FYI that the tech workers who keep those games running just went on strike and are asking fans to not play during the strike",
         "I'm so disappointed that their ads start with \"it's all fun and games\" but don't finish with \"until someone loses an i\"",
         "Me too!",
         "Same! Connections, Wordle, and Strands everyday!",
         "Same. It's one of my favorite puzzles lol.",
         "ahaha I thought this was wordle at first and wondered what kind of magic bullshit Harris was supposed to be pulling off",
         "I get it now, he's a loser!",
         "Hank Green calls getting purple first perfect “hard mode.”",
         "It would be more accurate if it was one of those color blindness charts and if you squinted only very slightly you saw a swastika in the middle.",
         "https://preview.redd.it/vuf3wtzlu0zd1.jpeg?width=544&format=pjpg&auto=webp&s=eec0ca15ea91079c8889d5e24c712c28ebe08c94",
         "its a game on the new york times called connections",
         "Glad someone else knows about the strike!",
         "Sorry, but one can’t take anything for granted anymore, so just in case anyone has any questions about this…\n\n[Tariffs will cost US consumers.](https://www.cbsnews.com/news/trump-tariffs-proposal-10-percent-1700-cost-per-us-household/)\n\n[Tax cuts for the rich ran up the national debt well before covid.](https://www.propublica.org/article/national-debt-trump)",
         "Not now, they're on strike. Break your streak",
         "I love the new strands!",
         "Sometimes I see the purple connection right away and then miss the yellow one... 😣",
         "Remember when spotify bought heardle and then killed it?",
         "Ugh, yes"
      ]
   },
   "1gk51te": {
      "title": "weird",
      "text": "",
      "comments": [
         "Remember, if we vote, not only do we make America normal again, but Trump also goes to prison and then we don’t have to think about him anymore. His sentencing hearing is soon!\n\n![gif](giphy|3oz8xveS8JKSkUJI52)",
         "MAKE TRUMP NOT PRESIDENT AGAIN\n\nVote!",
         "I love this."
      ]
   },
   "1gjfb2r": {
      "title": "Do it!",
      "text": "",
      "comments": [
         "Let's turn the page on the MAGA nightmare",
         "Flick that booger!",
         "[Higher and Higher](https://youtu.be/U0nlEcKSjmY?si=6284wapqf7kNZ7qo)",
         "![gif](giphy|wi8Ez1mwRcKGI)",
         "I’m so sick and tired of hearing about this orange turd and I’m sure many others are too! Let’s flush him once and for all!!!",
         "![gif](giphy|3rgXBOmTlzyFCURutG|downsized)",
         "Tomorrow is the big day!",
         "Again. \n\nDonold, we went over this the last time. \n\nYou’re fired. \n\nWhy you bothered to apply again, is beyond most people.",
         "![gif](giphy|3o72FbQrknCCUSLHRm)\n\nLove it when your angry",
         "![gif](giphy|10Jpr9KSaXLchW|downsized)",
         "🤞🏻🤞🏻🤞🏻",
         "![gif](giphy|bKnEnd65zqxfq)",
         "Regardless SCOTUS will uphold corruption, destroy civil rights legislation and labor protections for the foreseeable future",
         "Hopefully the statue of liberty doesn't get punched in the finger like Wyzen.",
         "Vote 🌊",
         "https://preview.redd.it/elc14tfk31zd1.png?width=582&format=png&auto=webp&s=314bda06b245970a749ea63da9524ec49c3b68b6\n\nYeah, no more of THAT!",
         "Tomorrow he gets the Big Flick!  Wahoo",
         "Flush the orange turd! REALLY make America great again.\n\nAnd not stinky and disgusting and ugly and foul....",
         "![gif](giphy|3o84sw9CmwYpAnRRni)",
         "I would love to see how far he will go.",
         "I've always said that there's only one thing America likes more then building someone up and that's tearing them down.",
         "Turning the page doesn’t get you a different story.  They are only going to get worse, either because they lose and their feelings can’t take the facts, or even more terrifying, they win and see it as a mandate to be even more deplorable.  One way or the other, this week isn’t going to bring any positive changes",
         "![gif](giphy|xUA7bgLCTSGnh1Qxe8)",
         "Going…Going…Gone! 🤞",
         "Definitely do it,but sanitize the absolute hell out of that finger afterwards.",
         "Today is the big day!",
         "Aye, captain!",
         "![gif](giphy|jivGITd768psP80B2i|downsized)",
         "I love democracy",
         ">this week isn’t going to bring any positive changes\n\nDon't you mean it's not going to eliminate the negatives? I see a Harris/Walz win as a positive change even though it will not eliminate fascists in the public sphere.\n\nImprovements must be made one step at a time.",
         "Cool. We shouldn't normalize their bullshit. Its okay to punch nazis. Throw on some punk rock and take a stand. Fuck MAGA.",
         ">Turning the page doesn’t get you a different story.\n\nDemocracy is a choose your own adventure book!",
         "Who would have thought a Weird Al's song would become an  American anthem, \"I got booger... I got a booger... I got a booger on my finger and I can't get it off!\"",
         "That is a fair analysis",
         "Right. Harris winning at least puts the present danger at bay, though there's certainly something looming on the horizon."
      ]
   },
   "1gk0cji": {
      "title": "Vote this loser out.",
      "text": "",
      "comments": [
         "Rafael Cruz. The biggest turd in TX.",
         "The trickle down Texan turd himself",
         "I did my part to get that fucker out",
         "no dont I need my KRUZ ETF to soar </s>",
         "Lol i don't even live in Texas and hope they vote this turd out of office.",
         "So, then, if it's true that everything is bigger in Texas, Cancun Cruz is one yuge ass turd!"
      ]
   },
   "1gjree9": {
      "title": "Politics, it was good while it lasted. ",
      "text": "",
      "comments": [
         "Scarier:  Next president if Trump wins and croaks.",
         "God dammit just please vote everyone. \n\nI feel like not enough remember 2016",
         "So, will he wait until Jan 6 again to call for his hanging or will it be right on Nov. 6 ?",
         "No, his replacement, it is the goal of the heritage foundation.",
         "Oh yeah, he’s gonna get thrown under the bus before he has a chance to get off the couch.",
         "Today: The Guy who's only job not bought & paid for by Peter Thiel was Marine Corp.\n\nTomorrow: Peter Thiel's ass-licker still in a job paid for by Peter Thiel.",
         "worst case scenario: he spends the next 4 years as president\n\nbest case scenario: he spends the next 4 years in the Senate",
         "Let’s hope so. 💙💙💙",
         "Thursday it’s Maybeline",
         "Why is this funny? I dont get it",
         "On the third day, Vance will invoke the 25th amendment. Trump will be ousted, and Vance will become president.",
         "Tbf he has a very scapegoatable face.",
         "Vance…is…new eric.",
         "Building a 15 feet Guillotine in Ohio was a real power move....",
         "The goofy Sarah Palin at least brought a little buzz to the GOP ticket at first.  Vance has been a dud from day one.",
         "Creepy Couchfuc\\*er has done nothing to help, and has only been a detriment to the campaign. At best, no one is even paying attention to him.",
         "Is it pretending to suck something as well?",
         "If he works real hard, he can be Trump's cell mate.",
         "The real question is will JD take it like a good little fall boy or will he attempt a “how do you do fellow democrats?” heel turn?",
         "When the kids use Ohio as a bad thing, they mean this guy.",
         "\"Hang Vance\" - Donald Trump",
         "Kinda have a bad feeling they might win and an even worse feeling they’ll invoke the 25th Amendment and put couchlover in charge.",
         "Unless Trump dies before he throws him under the bus. Then he will be in line to be the next candidate. I'm not sure what scares me more to be honest.",
         "Donnie Jr pumped him into the trump sphere but of course Daddy donnie would never throw his son publically under the bus :-)\n\n![gif](giphy|26DNfbqR0qRPeHWQo|downsized)",
         "Dont kid yourself.  Trump's ordained replacement.",
         "He will go the way of Pence. \n\nHe will take all his kickback money and run for president of some HOA in Florida. \n\nHe will rule someone else’s neighborhood with an iron fist and imposed many fines on octogenarians who dare paint their fence a non-pastel color.",
         "Or he gets removed via 25th amendment.",
         "This is the actual plan of the GOP. They want this cryptobro mouthpiece in office, not the decrepit dementia ghoul.",
         "Peter Thiel is Trump’s VP pick.",
         "Young, idealistic and polarizing to both young and older male voters. An UNO reverse Kennedy. \n\nThe worst part of this election is the Republicans have learned the craggy old veterans are out. The younger and more charismatic men are in. And they can just keep pulling one after another from the bottom of the ranks to the top seeing who works best.",
         "Oh... Vance and his handlers will make sure that becomes a reality.  Then the Oval Office will be renamed the Futon Funhouse.",
         "trump 2.0",
         "Not enough people seem to remember the never ending cycle of dumpster fires that Trump created by pouring gasoline onto every situation that should have been handled with steady handed leadership.",
         "Completely this. The GOP are going to use Trump as their fall guy, signing into law their most unpopular legislation, then replace him with JD Vance saying Trump is becoming mentally unfit. This will shield the bad actors from the blame while pushing through their agenda.",
         "Get off \"ON\" the couch.",
         "Candidates for POTUS should have to step down from Congress.",
         "He can always be a spokesperson for Maybelline guyliner.",
         "Worst case he spends ten of the next twelve as president...",
         "He’d be pwn’ed as president",
         "If (when,  I hope) trump loses, he will blame Vance.",
         "Or if the plan is to pull a Nixon and get a pardon from JD day one",
         "this is the plan. shhhh",
         "I can see the right being filled with jubilee should the orange person win only to remove him fairly quickly leaving the world with this Vance character.",
         "Biden has Presidential Immunity, baby!  Thank you Supreme Court",
         "donnie is Putin's pick",
         "If they learned charismatic men are in why did they pick Vance?",
         "This would require Trump to know or care about the GOP Agenda, which is very much facts not in evidence. See him throwing the Project 2025 folks under the bus. See him moving in a pro-choice direction on abortion. See Trump's complete lack of any sort of coherent ideological position on just about anything.",
         "I get that. But dont see how the meme is funny.",
         "That's possible but only works for federal crimes.  Not state crimes.",
         "Trump doesn’t want to be president he wants to play golf and not go to jail. There is a nonzero chance trump plans to resign in exchange for a pardon. Of course this is a bad move because a trump can’t help but commit crimes they have bad genes. Seriously look it up not just his father but his grandfather as well",
         "His ability to lie without being shook is creepy. It's like watching *V* knowing the skinsuit could disappear at any moment.",
         "I'll say again what I've been saying for months: my fear is that he'll just do it anyway and the Supreme Court will call it totally okay.",
         "I read Mary Trump’s biography of the family",
         "No, Thomas and **Sotomayor** and maybe Roberts Jr have hinted they might step down from Supreme Court so a trump/vance ticket would opportunity to put maybe two more Supremes on the court.",
         "Sotomayor better not under a Republican"
      ]
   },
   "1gk5450": {
      "title": "Spot the difference\n",
      "text": "",
      "comments": [
         "One comedian and one clown.",
         "The comment section isn't going to end well."
      ]
   },
   "1gjeco4": {
      "title": "They're already set to protest, a day before the election, still with zero proof",
      "text": "",
      "comments": [
         "Gotta love the morons who say \"trunp got more votes than he did last time so he can't have lost\" because they can't wrap their minds around the fact that Trump was so fucking bad at being president that people turned out record numbers to kick his clown ass out of the white house before he embarassed/killed us even more than he already had.",
         "These are the people that “love the constitution“ until their guy doesn’t get elected. Then they try a coup and run around wrapped in old glory, pretending that they’re patriots, instead of the treasonous, anti-Democratic scum that they are.",
         "How early on Tuesday will Trump start declaring victory? My guess is 2pm EST",
         "It’s more than that. It’s a few cynical people knowingly lying to an entire group of citizens that are primed to literally believe the lawful results of a massively distributed voting system were overturned by nefarious and international “others.” This time around, the liars better understand the importance of a few key areas, and learned a lot from the less pointed chaos they caused 4 years ago. This time, their actions will be directed at the handful of districts affecting entire swing states, like the Lehigh valley in PA. \n\nThe calculus is different when the opposition is fueled almost entirely fact-free and committed to an existential battle. They WILL be carrying out their plan to obfuscate the vote counting. They WILL do whatever it takes to throw out results they don’t like, because every negative outcome in a key area will be branded as fraud. **They WILL work very hard to ensure key states will not certify votes and thus force the election to be decided by the House of Representatives**",
         "I just dont get how these morons dont get they are unpopular nation wide. Trump lost the popular vote by 2million in 2016 and by 7 million in 2020. 2016 reality was that Hilary was just unpopular enough (80k votes total) in three states for him to win.",
         "***\"I lost by a whisker... err I mean I DIDN'T LOSE\"*** \\- Trump",
         "The faster this whining orange fuck is out of my life the faster I can go back to plotting my seduction of \nJessica Lorde. Help me make it happen",
         "Worse, there is plenty of evidence of election fuckery, and the GOP is responsible for all of it.",
         "Calling them \"adults\" is being very generous.",
         "Can we get a big fucking asterisk after “grown ass adults?” I’ve seen toddlers handle disappointment better than most republican adults. They might be decades old but they have less control over their emotions than literal toddlers.",
         "This same thing happened in France when the people voted to approve Napoleon’s first constitution. People that lose always think the vote wasn’t done fairly.",
         "AND the DUMB fuckers DADS. GRAND dads FOUGHT & DIED for the DEMOCRACY these fucking MORONS wanna VOTE AWAY!!",
         "The irony is that the only stolen election in recent history was when the Supreme Court handed it to W. Which is exactly what they are hoping for again, hence the lawsuits.",
         "Russian operatives only want to sew CHAOS in the USA the same way the CIA operatives destroyed much of the Caribbean, South American, and Middle East countries. This is a game of Chess in which Russia has compromised Tucker Carlson, several Trump staffers, and possibly the big man himself. It's all an attempt to cause CHAOS.",
         "My neighbor is flying a “TRUMP WON - I know it and you know it” flag.\n\nI think he may actually believe it.  Lol",
         "I'm prepared for four years of \"SHES NOT MY PRESIDENT\" as well.",
         "Talk about anticipating a Republican loss ....",
         "If they cared about believing in real things they wouldn't be supporting Trump",
         "PLEASE NOTE!  If trump says it, *that* debunks it.",
         "This is what you get when you think politics is a sport.",
         "This meme really stretches the definition of \"grown ass adult\"",
         "Red Snowflakes",
         "Oh, they're adults in the legal sense. They're just not grown.",
         "If Trump wins he stole the election",
         "Is there a \"Trumpists on Election Night\" Bingo Card out yet? I'm already preparing my eyes for rolling as the exact same people trot out the exact same BS as they did in in 2020, apparently failed to learn anything at all the system.\n\nSquares featuring such classics as:\n\n* Stop the vote when Trump is leading, keep the vote going when he's behind\n\n* Confusion over how news outlets can call races before counts are done\n\n* Confusion over how anything and everything to do with early/absentee vote counting works\n\n* Confusion of how early leads based upon counts from tiny rural populations can be completely reversed once votes from cities start getting counted\n\n* Confusion over how not every race will be called election night, insistance any votes not counted election night should go in the bin... unless Trump is behind, then obviously count every vote\n\n* Baseless claims about fraud based on Twitter and Facebook rumors that can be traced back to Russian sources and/or based on lack of understanding how elections and counts are conducted\n\nAnd so on and so on.",
         "Democracy? \n\nThe people voted for Joe Biden to be the nominee.",
         "Can we also talk about the million plus dead from covid, at very least some of whom would have voted for Trump.",
         "Half of American's don't vote. Turnip was so bad that he actually motivated people who don't vote, to register just to fire him. It will be easier for them to do it the second time around if they don't fall back into their old habits.\n\nIt doesn't help that his terrible covid policies thinned his numbers. Deciding to go off the deep end and say even more outlandish things really hasn't helped him win back moderates.",
         "How did Trump win in 2016?\n\nBecause far too many people assumed he would lose.\n\nRepublicans are much better at consistently voting. Democrats, not so much.",
         "Fuckers haven't got over losing the civl war",
         "I appreciate the freeway system. I hate traffic jams. I do not drive on the shoulder bypassing other vehicles because I am a grown adult.\n\nYet when it comes to democracy, they are emboldened by Orange Julius.",
         "And then they have the audacity to call Harris taking over the campaign a coup, but still won’t acknowledge Jan 6 as a coup. Unbelievable.",
         "They don’t even know the definition of a coup!",
         "My guess is any time now. He's not even going to wait till tomorrow.",
         "I thought he already did. It's monday.",
         "sIlEnT mAjOrItY. They think their echo chamber represents most people.",
         "they do, they just don't care.\n\nHypocrisy is their super power",
         "[removed]",
         "The people voted for the Biden/Harris ticket, comrade.",
         "Yes, and then Biden dropped out and Harris was chosen as the nominee following the rules of the primary process. \n\nAll is well with Democracy. Weird things happening if a candidate drops out after every state has voted doesn't mean it's an attack on democracy. It just means it's an incredibly uncommon occurrence.",
         "Political parties are private organizations, not part of the government.\n\nThey don't even *have to hold primaries* - and in some states, they hold caucuses instead.\n\nJoe Biden - the current President - decided to end his re-election bid too late for an actual primary to be held, so his Vice President (who was already elected) became the nominee.\n\nDid you complain in 2020 when the GOP canceled primaries entirely, or is your complaint *purely* bad faith?",
         "And then he dropped out. You think he should be forced to run?",
         "the one difficulty I think we have is the folk who just like to vote opposition. my uncle claims to be one, but I'm pretty sure he just votes R anyways and says he votes against the incumbent to sound politically informed.",
         "Trump lost the popular vote in 2016. Won electoral",
         "[deleted]",
         "No, no, you got it wrong, Jan 6 was a peaceful protest, but it was also done by antifa to make Republicans look bad!",
         "Doesn’t help when social media algos amplify their garbage to add to the delusions. The only reason republicans even have semblance of power is through gerrymandering and voter suppression tactics, just shows how fucked they have been for so long.",
         "Hello! Thanks for your comment. Unfortunately it has been removed because you don't meet our karma threshold.\n\n You are not being removed for political orientation.  If we were, why the fuck would we tell you your comment was being removed instead of just shadow removing it?  We never have, and never will, remove things down politicial or ideological lines. Unless your ideology is nihilism, then fuck you. \n \n Let me be clear: The reason that this rule exists is to avoid unscrupulous internet denizens from trying to sell dong pills to our users.  /r/PoliticalHumor mods reserve the RIGHT to hoard all of the dong pills to ourselves, and we refuse to share them with the community.  If you want Serbo-Slokovian dong pills mailed directly to your door, become a moderator. If we shared the dong pills with the greater community, everyone would have massive dongs, and like Syndrome warned us about decades ago: \"if everyone has massive dongs, nobody does.\"\"\n \n If you wish to rectify your low karma issue, go and make things up in /r/AskReddit like everyone else does. \n\n Thanks for understanding! Have a nice day and be well. <3\n \n You can check your karma breakdown on this page:\n \n http://old.reddit.com/user/me/overview\n \n (Keep in mind that sometimes just post karma or comment karma being negative will result in this message)\n \n ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
         "That's weak, but ok. The people voted for the Biden/Harris ticket, but not the Harris/Walz ticket?\n\nIn my state, there was no mention of Harris. Only Biden. The results say \"Joe Biden,\" again no mention of Harris. I'm not sure you understand how primaries work.\n\nI'm not sure why you called me \"comrade\"?",
         "So, the illusion of democracy. Got it.",
         "No, I'm fine with how it was handled. It's just not democracy.",
         "That’s dumb as shit especially if the incumbent is doing a good job",
         "He will undoubtedly lose the popular vote for the third time.\n\nI hope to God enough people do the right thing. And give us a landslide win for Harris - Watz.",
         "I'm fairly positive if the Democrats actually made an effort to abolish the electoral college they would never lose again. I live in a heavily blue state and know way more people that would have voted Hilary over Trump but didn't even bother voting because she had this state locked down than people who actually did vote. The popular vote usually looks close but if everyone's vote actually mattered, I think heavily blue states could easily find another 10,000,000 voters.\n\nSame goes for people that don't bother voting democrat in heavily red states, because unless they're in a state that splits electoral votes it's pointless. In their mind anyway.\n\nBut yeah if they also ran just about any other candidate in 2016 they probably would have won as well. \n\nRanked choice voting would also be a great help. If my vote could go to Harris after De La Cruz inevitably loses that would up her numbers.",
         "Really dumb move",
         "and therefore we need to pardon the antifa hostages ....erp",
         "Except Ashley Babbit, she was a brave patriot and definitely not antifa!!",
         "I'm calling you Comrade because you're repeating the same talking points used by all the Russian bots. From my reading of your post, you are intelligent enough to go google how primaries work. Spoiler alert: Nothing was stolen, everything was above board\n\nIt's funny how it's only MAGA-morons and Russian shills who are complaining about this. There isn't a single democrat out there who is upset about it, just Trump sycophants trying to sow division\n\nSo how about you fucking stop doing that, comrade?",
         "OK so, try to follow along.\n\nHarris was voted to be Vice President. Vice in this case means \"in the place of\".  In other words if something were to happen to President Biden like his death, or in this case, his choice to step down, his Vice President Kamala Harris would take over in his place, as the definition implies.\n\nSecondly \"comrade\" was a common greeting for Russian communists.  In this case it is being used to imply you are doing the work of trump's Russian allies, if not being one yourself.\n\nI hope that clears things up.\n\nSource: https://www.merriam-webster.com/dictionary/vice",
         "Lol",
         "No, the \"democracy\" part happens in the *actual election*, not party primaries.\n\nThere are flaws with the US form of \"democracy\", but what you're pointing out ain't one of them - every electoral system has some kind of similar provision. Hell, in many democracies, you vote for a party instead of the candidate.",
         "The US is a Constitutional Republic which is a representative democracy.  That's why Delegates vote for the nominee and then citizens vote for whomever they want.",
         "Never has been. Welcome to America.",
         "I didn't say anything was \"stolen.\" I was speaking purely about the \"democracy.\" I thought that was clear.\n\nHere are three things you are completely wrong about...\n\n1) My account is over 15 years old, so not a bot.\n\n2) I'm voting straight Democratic Ticket this year, and I think any rational sane person would do the same. So, not a Russian shill, MAGA moron.\n\n3) If we were a true Democracy, then Bernie Sanders would have been president instead of Trump, and we'd all be better off for it.",
         "You know, I'm speaking only of the primaries, where there is no \"vice\" that you speak of. Also, candidates pick their running mates, they aren't voted for, as you stated.\n\nIf Biden stepped down from the presidency, you'd be correct, but he didn't. He stepped down from the race for president, which is different.",
         "Strange, because you come up with a lot of straight MAGA talking points, but okay. You do you.",
         "People didn't vote for Bernie Sanders",
         "Can you cite some kind of law or regulation that makes this 'different'?",
         "I can be critical, and supportive. I know it's rare these days, but it is possible. Again, didn't mean to stir up all the shit. I would love the US to be more of a Democracy than it is and has been."
      ]
   },
   "1gjxrh5": {
      "title": "Safety first!",
      "text": "",
      "comments": [
         "![gif](giphy|H47XFX8I6mdstTlGHY|downsized)",
         "* who even Epstein said was a terrible person."
      ]
   },
   "1gjczjy": {
      "title": "The Star of Idiocracy and the woman trying to prevent it from coming true.",
      "text": "",
      "comments": [
         "Hope Upgrayed(d) don’t find out. (Oh shit!)",
         "For fuck's sake, in Idiocracy the President trusted the smartest person in the world and sought advice from him. People WANTED to be better. We're heading for the exact opposite if Kamala loses tomorrow.",
         "![gif](giphy|l0MYzQjWpYAFAe2u4|downsized)",
         "President in idiocracy actually wanted what was best for his people and took scientific suggestions to improve things seriously when presented by the smartest man in the world\n\nWe could be in for some trouble but we’d be lucky to have leadership like president Camacho",
         "I sometimes think about how Joe was just speaking coherently and Justin Long as the doctor would be like \"you speak like a F**, that's r********\". Those lines do feel a little too real of who the Trump supporting comedians. Those who try to cross the boundaries with their slurs just to shock and have no real creativity.",
         "Won't it be wonderful having another president that we are HAPPY to see on television?",
         "It's too late, bra.\n\nEveryone is wearing Crocs already....",
         "MAGA keeps saying that she doesn't make sense while clapping for Trump's ramblings.  Idiocracy is already here.",
         "I would vote for Dwayne Elizondo Mountain Dew Camacho!",
         "They're both trying to prevent it from coming true. Don't underestimate the power of comedy. Its ability to shine a light on society's ills should not be understated. The jesters have been pointing out the flaws of the wealthy since time immemorial.",
         "tehy look like sisters :D Like not exactly but if they played sisters on tv, you'd say \"they cast two people who really look like sisters\", ykno? Also their chemistry was like they knew each other since birth and this was another goofy prank they were pulling on the grownups (we're the grownups, the viewers, they're the type of sisters who become 14 years old again (giggly, hungry, r&b stars) when they are together).\n\nI lost it when Maya said \"palmala\", that was a moment of pure wholesome comedy",
         "Hey, don't besmirch the government in Idiocracy by comparing it to a potential Trump administration. President Dwayne Elizondo Mountain Dew Herbert Camacho is a genius and a saint next to Dirty Donnie.",
         "God I hate this analogy.  Everyone acts like that movie is coming true tomorrow.  No it’s not get off the doom scrolling.  Harris 2024!",
         "they really do need to make an Idiocracy 2",
         "O MFing Gee, I forgot about her in that future documentary!",
         "Interviewer: Kamala, what do you plan on eating during election day?\n\nKamala: I don't know ... fruit n' shit.",
         "From coming true AGAIN and permanently.",
         "![gif](giphy|26uf5afBhUKyjvZPW|downsized)",
         "UPGRADE GONNA FIND ME!!!",
         "![gif](giphy|3y1tSvdjkHoX8aMRdQ|downsized)",
         "She wasn’t the star at the time.",
         "Two beautiful women",
         "We're already in it. Aint no stopping it now. Lets go to starbucks.",
         "Maya Rudolph was in Idiocracy too.",
         "I think they were Co-Stars",
         "With two D's...\n\nFor a double dose of pimpin'.\n\nEdit: thanks Otto!!",
         "There are 20,000 people named Upgrayedd.",
         "Trump wishes he was a smart and thoughtful as President Dwayne Elizondo Mountain Dew Camacho!",
         "In Idiocracy the President trusted the smartest man in the world... after society had done the exact opposite for FIVE HUNDRED YEARS.",
         "The president also tried to have him killed.",
         "I feel like idiocracy isn't comparable by this point. \"Idiot\" is a word for reckless and impulsive stupidity. I think we should instead be saying SOULLESS; calculated malice, sociopathic HATE.\n\nSay what you will about \"Electrolytes\" or \"Ow! My Balls!\" at least they didn't bring back the gas chambers.",
         "No he didn't. He wanted a problem to go away. Once whatshisname couldn't fix it, he sent him to be executed.",
         "I always thought Idiocracy was a conservative view of the future where they have universal healthcare, guaranteed base line income, and people of color in the White House.",
         "At the end, but I'm sure it was the opposite on the path there.",
         "The only criticism of Idiocracy is the eugenic notion dumb people breed dumb kids and smart people breed smart kids.",
         "You mean like RFK Jr? /s",
         "I thought his head would be bigger.",
         "We’re in the prelude to idiocracy. We’ll find our real life President Kumacho and Not Sure in the coming years to dig us out of the Prime saturated rubble.",
         "![gif](giphy|88QIhIqNPxpcaEIses)",
         "Most presidents rely on experts over their own knowledge of a subject when they feel they don’t have the background in it. \n\nProblem comes from the lobbyists money getting in the way of those experts.  \n\nMuch like the movie showed with the whole electrolytes part.",
         "Yes, Trump is the worst version of Idiocracy.\n\nLike one of those shitty Legacy Sequels,",
         "The price of french fries and burrito coverings is too high.",
         "Trumpers say the Kamala is the one speaking in word salad, but it's only because they have an average reading level of a fourth grader.",
         "I think about this all the time. Biden occasionally stumbles on words and isn’t terribly charismatic, but he’s coherent and acts in a way that shows he’s trying to actually improve people’s lives.\n\nComparing their transcripts side by side couldn’t make this any clearer. We’re already well into Idiocracy, just hopefully not past that point where we can’t self-recover.",
         "I just can't take another day of Cheeto Benito. \n\nHowever even if he loses he will fight until the day she is inaugurated and he's probably going to keep holding rally's until he is dead or in prison.",
         "The real trick is who she picks for her cabinet.    And how many dems are in the house.\n\nThere are serious problems, and we need serious people and not place Holders.",
         "I have never worn Crocs but I have bought them as presents for others that do.",
         "I knew it was over when I got chipotle yesterday and two workers behind the counter were wearing crocs. They didn’t even have 4 wheel drive on. SMH",
         "He was better than Trump but he still sentenced Joe to death by monster dildo truck when the plants didn't grow fast enough...",
         "Ok A STAR",
         "Help me out here.. I don't get the joke...",
         "![gif](giphy|88QIhIqNPxpcaEIses)",
         "lol Ds",
         "WE wish he was, Trump's perfectly happy with who he is. Unfortunately.",
         "Although, a skit where Terry Crews doing a cameo as President Camacho while Maya as Kamala would be kind of meta. I'm here for it",
         "I wish Fox would let Terry Crews campaign as President Camacho",
         "Head to the Starbucks, or Fuddruckers. Have a pint and wait for this to all blow over.",
         "I'm not so sure there... It's not really possible to judge what society did for five hundred years... bottom line is all generations were dumber than their predicesors for five hundred years. Based on the narrative of the movie, I would not say it's unreasonable to say it's very possible Kumacho, was one of the smartest people born after 2450.\n\nThe point is that as dumb as everyone was... they did not seem to have the same form of anti-intellectualism you'd normally see in modern society, they seemed to in most cases actually promote the best and smartest in their society. Only notable exception being mocking Joes speach patterns, which was more likely racism/homophobia rather than intellectualism, as it's simply talking in a way they don't understand. I'd imagine that as the equivelant of today people would certainly mock someone speaking in old english.",
         "He sent him to be executed because the solution didn’t automatically work (and also created an another problem in the meanwhile). Once they were shown that his solution was working, he pardons him and the main character goes on to become president.",
         "He literally had to pay at the end of his dr appt and that’s how they found out he was unscannable.",
         "Religious uneducated people having too many kids leading to the collapse of society is \"pro conservative?\" \n\nI take it you didn't pay much attention to it when watching.",
         "Are you sure you’ve seen the movie at all?",
         "Honestly it does make uncomfortable when people are like “idiocracy is a documentary!!!” because the movie basically starts with a long scene saying “the wrong people are breeding too much and it’s the cause of society’s problems” \n\n😬 there’s a word for that sort of belief",
         "> always thought Idiocracy was a conservative view of the future\n\n[Well, that one scene with Camacho reflects that.](https://imgur.com/a/gHVR58W)\n\n(not to mention all the republican gunladen christmas cards)",
         "It also is based on eugenics.",
         "There is no suggestion that dumb people breed dumb people due to genetics. Nothing about genes in the movie at all. The implication is that everyone is dumb due to the lack of nurture (being raised by dumb people).\n\n  \nAlmost all of the dumbness is socially created- making fun of the well spoken main character, letting  advertisements create public policy- none of that is Eugenics. I keep hearing this argument and it's ridiculous.",
         "I'm specifically criticizing Trump and the right, who openly reject science and expertise as \"elitism\" and instead pander and demagogue their way through their political lives",
         "absolutely a real-life, current-day problem.",
         "And because they assume a Black woman couldn't possibly be intelligent.\n\nEDIT: Fixed spelling mistake because unlike Kamala, I am not all that intelligent.",
         "They say that to muddy the waters on what that really means and why it's concerning Trump does it.",
         "Aye. its been so wonderful having Biden. he is amazingly competent even if the media hates him. It'll be great having him pass the baton to Kamala",
         "im not worried about who she picks - im worried that she will be allowed to pick. If republikkkans take the senate, zero confirmations.",
         "As a practical joke, right?\n\n\nRight...?",
         "Yup, still much better than Trump.",
         "Its because it actually doesn't work as a joke. Presumably Kamala in Idiocracy is supposed to be some kind of dig at her, but given the context, its just a non-sequitur.",
         "It's because it's not a joke.",
         "I know, that’s okay.",
         "I have no idea why this phrase is not routinely in the top movie comments of all time list.",
         "Doh!",
         "> Trump’s perfectly happy with who he is. \n\nExistential nightmare fuel.\n\nImagine showing up to work behaving like Trump but you can’t tell anything’s off even when people point it out to you.",
         "The problem with all these so-called \"strong men\" is they have incredibly weak egos and can't handle the possibility of anybody else being smarter than them, and only want to put others down and get praise for their supposed genius.\n\nHitler was the exact same way:\n\n>His government was constantly in chaos, with officials having no idea what he wanted them to do, and nobody was entirely clear who was actually in charge of what. He procrastinated wildly when asked to make difficult decisions, and would often end up relying on gut feeling, leaving even close allies in the dark about his plans. His \"unreliability had those who worked with him pulling out their hair,\" as his confidant Ernst Hanfstaengl later wrote in his memoir Zwischen Weißem und Braunem Haus. This meant that rather than carrying out the duties of state, they spent most of their time in-fighting and back-stabbing each other in an attempt to either win his approval or avoid his attention altogether, depending on what mood he was in that day.\n\n>There's a bit of an argument among historians about whether this was a deliberate ploy on Hitler's part to get his own way, or whether he was just really, really bad at being in charge of stuff. Dietrich himself came down on the side of it being a cunning tactic to sow division and chaos—and it's undeniable that he was very effective at that. But when you look at Hitler's personal habits, it's hard to shake the feeling that it was just a natural result of putting a workshy narcissist in charge of a country.\n\n>Hitler was incredibly lazy. According to his aide Fritz Wiedemann, even when he was in Berlin he wouldn't get out of bed until after 11 a.m., and wouldn't do much before lunch other than read what the newspapers had to say about him, the press cuttings being dutifully delivered to him by Dietrich.\n\n>He was obsessed with the media and celebrity, and often seems to have viewed himself through that lens. He once described himself as \"the greatest actor in Europe,\" and wrote to a friend, \"I believe my life is the greatest novel in world history.\" In many of his personal habits he came across as strange or even childish—he would have regular naps during the day, he would bite his fingernails at the dinner table, and he had a remarkably sweet tooth that led him to eat \"prodigious amounts of cake\" and \"put so many lumps of sugar in his cup that there was hardly any room for the tea.\"\n\n>**He was deeply insecure about his own lack of knowledge, preferring to either ignore information that contradicted his preconceptions, or to lash out at the expertise of others. He hated being laughed at, but enjoyed it when other people were the butt of the joke (he would perform mocking impressions of people he disliked). But he also craved the approval of those he disdained, and his mood would quickly improve if a newspaper wrote something complimentary about him**.\n\n>Little of this was especially secret or unknown at the time. It's why so many people failed to take Hitler seriously until it was too late, dismissing him as merely a \"half-mad rascal\" or a \"man with a beery vocal organ.\" In a sense, they weren't wrong. In another, much more important sense, they were as wrong as it's possible to get.\n\n>Hitler's personal failings didn't stop him having an uncanny instinct for political rhetoric that would gain mass appeal, and it turns out you don't actually need to have a particularly competent or functional government to do terrible things.",
         "I know there was a PSA that Terry Crews did as President Camacho to promote men to get their colon checked.\n\nHe was 100% committed to do it for the people.\n\n\nhttps://www.youtube.com/watch?v=-4cULh029ic",
         "I’m here for anything involving Terry Crews",
         "Disney owns it now... We have to get permission from Mickey!",
         "Is that included with the full body latte or is the blow extra?",
         "So he got what he wanted and then cancelled the execution. That's not him being such an amazing guy.\n\nBut yeah Trump's worse.",
         "It's mostly Ayn Rand conservatives shitting on MAGA conservatives by blaming intellectual elitist liberals for not having babies. We are a sentient species that doesn't pass on souly biological information to survive, we use words and concepts far more than we use dna to ensure our survival.",
         "They literally can't comprehend that she can be both black and Asian",
         "It's important to remember that since day one there has been an entire right wing news bubble where people were fed only doom and gloom and they genuinely believe that things have never been worse in America.   \n\nSo he gets no credit from many if not most people for the amazing job he's done. \n\nThat said I think it's clear he should not have been running for reelection as it's clear time has caught up with him. \n\nIf Trump wins, Biden not stepping down in time for primaries will be, I think, thought of as a main reason why when history looks back on this time. \n\nIf Harris wins, his stepping down might well be seen as saving democracy.",
         "Well, if the design is that easy to disrupt, then its a bad design and its time for a new one.",
         "No they LOVE them. They were special Disney Crocs too.",
         "The right sucks at comedy.",
         "Be the change you want to see in the world",
         "This whole movie is the most quotable for me. My favorite movie",
         "lol its monday morning",
         "Maybe that's the play. Since Narcissistic Deranged Asshole is the new character archetype we prefer in this country, we should all go clear the grocery stores of Depends, return to our workplaces and offices, and literally poop our pants while we stroll around drawing on random shit with Sharpies and telling our managers and coworkers:  \n\n*Sorry that task isn't done yet, but I have the greatest concept of a plan for how I will finish it, and you know - when it's done it's going to be the biggest, most beautiful task completion - I could come back and show you papers, papers you can wouldn't believe...tell you what, I'm going to go listen to Joe Rogan for an indefinite period of time - so please just stick around and I'll be there before you know it, and it's just gonna be, you're gonna love the way it's done, and payroll is gonna pay for it.*  \n\nThen, just wobble out the door miming jerking off two girthy schlongs and go golfing. Never clock out. ;)",
         "The kingmaker!",
         "First one's free.",
         "tell me you dont know what your talking about without saying so",
         "Oh, well, since they were obviously little children, that’s different",
         "My future husband introduced me to this movie on our first date 15 years ago. It's still my favorite movie.",
         "How long is the wait? I can wait real good.",
         "Obviously everyone on the social media echo chambers know exactly what they’re talking about. /s",
         "23."
      ]
   },
   "1gjtnuf": {
      "title": "Finally something we can agree on.",
      "text": "",
      "comments": [
         "Don you think he looks tired.",
         "Let's send him to Club Fed to unwind.",
         "She wore his tired ass out",
         "![gif](giphy|l41YadVwKBthQpMSk)",
         "[deleted]",
         "He's exhausting! Vote for Kamala .",
         "Came here to see or post this reference. Well done",
         "I didn't mention it's fake because it's so ruddy obviously fake and all the more so when posted in r/PoliticalHumor :)"
      ]
   },
   "1gk4oe6": {
      "title": "If she committed any ONE of the literally hundreds of crimes he did…she would already be in prison.  (Note: it is a SECRET ballot for a reason; you can vote for whomever the fu*k you want to!)",
      "text": "",
      "comments": []
   },
   "1gjstii": {
      "title": "😐",
      "text": "",
      "comments": [
         "This... is unfortunately my mother. I love her with my whole heart, but the woman has been brainwashed by the MAGA movement. ):",
         "This sums up the intelligence, or lack thereof of American Republican men, who wonder why supporting a convicted rapist, serial sexual assaulter, convicted felon, man who bragged about walking into underage girl's dressing rooms, serial adulterer, who bragged about grabbing female genitals might make women afraid of them? How did American men become this clueless and stupid?",
         "either they don't want to listen, or they will listen but believe it's a lie, or be like \"whatever, still voting for my lord god trump!\"",
         "This is the reality of fragile American men who continue to cling to the idea their race makes them superior because they have never achieved anything personally to make them feel any other level of confidence.",
         "Maybe these people feel left behind with nowhere to turn.  They can't support another elite that did nothing for them.  So they have only one option.",
         "Sounds familiar. She gets angry whenever I have a counterargument when she comes at me with whatever latest thing Fox told her to be freaked out about; apparently I’m not supposed to offer opinions of my own with corroborating evidence, I’m just supposed to validate her existing views.",
         "Propaganda is one hell of a drug ",
         "\"Trump is a selfish narcissist who only seek to better himself and by doing so I think he's a good candidate for the country.\" 🤮",
         "Yep, same. When I give her a counterargument and cite a reliable source, it's fake news. I just try to avoid politics with her. She's 66 now, and I don't want to spend my time fighting and being angry with her. We live 1000 miles apart, so I only see her a couple times a year."
      ]
   },
   "1gk4vwr": {
      "title": "Venn diagram for determining traitors",
      "text": "",
      "comments": []
   },
   "1gk65fk": {
      "title": "The only choice",
      "text": "",
      "comments": [
         "I mean the latter is totally fine, *with consent*",
         "That is a …large number of fingers and cat legs, there. Oh AI. Who knew limbs and digits would be so hard."
      ]
   },
   "1gjw6y5": {
      "title": "Trumps former cabinet members showing support!",
      "text": "",
      "comments": [
         "The only former cabinet member who supports Trump also actively ran against him in the primary and said horrible things about his intelligence and ability to lead \n\nWhat a timeline this is",
         "Imagine being such a bad boss that out of the 40+ people you worked with that not a single one wants to work with you again.",
         "Nikki has zero self respect. Zero spine.",
         "Didn't Nikki Haley, Nikki Haley, Nikki Haley, do the January 6th? (If you get this joke you're probably too into politics and you need help, like me)",
         "**Nimrata Randhawa**, Who changed her name, religion and everything to appear white is a professional grifter. Grifters going to grift",
         "17/18 trying to salvage what little shred of decency is left for the historical record, 1/18 has no problem yeeting their dignity for a 1% change Orange Julius Caesar might give her another do-nothing political appointment.",
         "And the lone supporter is the one that Trump calls \"birdbrain.\" I'll buy that.",
         "Nikki Hailey is a fascist simp",
         "It’s chilling how if he gets his way, \n\nhe’d try to take them out, in any way he can \n\n(if he’s ever able to go **Full PutKimXi**)",
         "So Nikki Haley and Andrew Jackson?",
         "What Haley did was for political reasons.  She is as devoid of character, honor, and integrity as trump.  I hope we never hear her name again, same as trump.  South Carolina has produced some of the most spineless leaders of any state.  (I'm thinking of Leslie graham of course)",
         "Nimrata: still a bimbo.",
         "They got their money and ran.",
         "She also just said yesterday that he’s the “better choice” 🤦🏻‍♂️",
         "Nikki Haley begs to differ…",
         "And some people don’t see this as a huge red flag.",
         "To be fair she did run against him in the primaries. I know a number of \"Haley\" Republicans that fully acknowledge Trump as a liar, an incompetent, an embarrassment, etc. But they just can't vote for a democrat.\n\nOr, it might be that she's jealous of Kamala.",
         "Guarantee she was told if she supports him in this final run, it will be her turn in 2028. ",
         "She's got some, but she's a party over country gal",
         "Tbf, Nikki is her middle name and is an Indian name. She didn’t change her name. She likely went with the one she already has that wouldn’t immediately flag her as non-White, as it would have helped her find success in White-dominated spaces as she was coming up. I honestly don’t begrudge her for that. I’m not Indian, but I have an ethnic first name and a White-sounding middle name. Using my middle name has helped me when it comes to job hunting. Plenty of other non-White people have had similar experiences.\n\nThat said, I’m still stand firmly in the fuck Nikki Haley camp.",
         "Does she, I'm not sure if anyone checked if she'd work in his administration again ",
         "Even Haley's support is begrudging",
         "There's a saying that \"Indians are the biggest enemies of Indians\". Any person of Indian origin with a iota of self respect would not support Trump (21% is voting Trump according to polls). It is a known fact that Trump will try to revoke H1B visa, or even try to stop issuing entirely. This is the visa through which Indians \"legally\" go to the US for work.",
         "I wonder who would have told her? She was not invited to campaign with or for him, despite her expressing availability. She just looks foolish and desperate now. She should have stuck to her guns and thrown in with Liz Cheney. We'll see who made the better bet here pretty soon."
      ]
   },
   "1gk71q6": {
      "title": "And there it is",
      "text": "",
      "comments": [
         "Hey orange grandpa. Don't fear the reaper",
         "Trump's deranged enough for us all anyway."
      ]
   },
   "1gjlzm1": {
      "title": "You can do it America ",
      "text": "",
      "comments": [
         "They’ll never go away like the KKK or Nazis. \n\nShit. I said the same thing three times. I’m sorry yall.",
         "Excuse me but I ordered the LARGE evil space-worm",
         "Geez, America, c'mon, pinch it off already!",
         "https://i.redd.it/hjqle2svmxyd1.gif",
         "You can just say Republican. It’s almost 2025, there’s no such thing as a non-MAGA Republican anymore. \n\nDon’t let the GOP distance themselves from the treason they absolutely enabled, supported, and attempted to normalize. The GOP after Trump is going to be far worse.",
         "It would be pretty messy, but think how nice things would be after the clean-up.",
         "Accurate",
         "![gif](giphy|3oKHWikxKFJhjArSXm)",
         "We love you America!! But I do have a thing at 6 (I’m voting at 0600)",
         "Some of us are really really trying.",
         "![gif](giphy|3oKHWikxKFJhjArSXm|downsized)\n\nTo Harris and Waltz",
         "In this metaphor Rick would be a progressive populist, a party we don’t have. Jerry would be the democrats. Republicans would really be more like the garbage goober, considering how many of them have degrees from the Ivy League but eat up the garbage that is trumpism",
         "Lol hard to put my ittsie bitsy finger on the nuance.",
         "\"When did this shit become the default?!\"",
         "[removed]",
         "We can get rid of Trump by voting (hopefully). MAGA will be harder to kick.",
         "While our version of nationalism is pretty obnoxious, this shit is happening all over the world. Brexit was the first time I realized we humans were in for a wild ride for a few years (or decades). And that was when Trump was first campaigning.\n\nSo don't act like Europe or Asia are immune to this. America's MAGA is loud and obnoxious but this is a human problem, not only an American one.",
         "Europe and Asia might want to look sadder given the last few years over there",
         "Please, please, please.\n\nUsually we joke about it. Now it is for real. How hard can it be to just have someone sane ?",
         "idk i just watched a video about what the chinese think of the U.S elections and alot of them said they support Trump. Asians always support whites man its crazy",
         "Oh believe me, it’s the other party the rest of the icks at 😂",
         "I dunno. When I'm bored on the beach, I sometimes like to differentiate between grains of sand based on size.",
         "The gop needs their votes. Otherwise conservatives would be irrelevant and US citizens would have affordable healthcare and education",
         "I think you just summoned Alabama Beetlejuice",
         "My Israeli friend told me that you can kill an idea, and used nazis as an example.    Sigh.",
         "It’s not like the KKK or Nazis. It is just under a different name.",
         "It's just like Beetlejuice , expect a visit soon ",
         "Yup dems are wild",
         "https://preview.redd.it/n2t836lrmxyd1.jpeg?width=1280&format=pjpg&auto=webp&s=ca5d9c64f617b1d6ee534c7e73b7c0f14d457f43",
         "sorry, the best we can do us a used elon musk",
         "Are you suggesting one of the candidates is a loaf of shit?",
         "![gif](giphy|KGY78vaNYCha5zL1yK)",
         "What's Trumpism?",
         "Hello! Thanks for your comment. Unfortunately it has been removed because you don't meet our karma threshold.\n\n You are not being removed for political orientation.  If we were, why the fuck would we tell you your comment was being removed instead of just shadow removing it?  We never have, and never will, remove things down politicial or ideological lines. Unless your ideology is nihilism, then fuck you. \n \n Let me be clear: The reason that this rule exists is to avoid unscrupulous internet denizens from trying to sell dong pills to our users.  /r/PoliticalHumor mods reserve the RIGHT to hoard all of the dong pills to ourselves, and we refuse to share them with the community.  If you want Serbo-Slokovian dong pills mailed directly to your door, become a moderator. If we shared the dong pills with the greater community, everyone would have massive dongs, and like Syndrome warned us about decades ago: \"if everyone has massive dongs, nobody does.\"\"\n \n If you wish to rectify your low karma issue, go and make things up in /r/AskReddit like everyone else does. \n\n Thanks for understanding! Have a nice day and be well. <3\n \n You can check your karma breakdown on this page:\n \n http://old.reddit.com/user/me/overview\n \n (Keep in mind that sometimes just post karma or comment karma being negative will result in this message)\n \n ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
         "I don't know if you're joking, but I do this too.\n\nEven to the naked eye the sheer variety of some sand is astonishing. I love being at the beach - every place on earth has this feature, which somehow at the beach is just that much more accessible, where everything you look at has the capacity for amazement and wonder. \n\nYou can go from paying attention to the action of waves breaking against the rocks and how that must have formed that large scoop out of the cliff over tens or hundreds of thousands of years, and thinking about all the places the water has been before it was in this bay, and then zoom right in and look at the way moisture runs out of a handful of wet sand, and then zoom in even further and look at how individual grains of sand seem to defy gravity by gripping to the side of your finger, and then just focus on a single grain of sand and imagine what sea shell or crushed rock it started out life as. \n\nI love organising grains of sand. It is, quite legitimately, a more humanizing and useful experience than almost anything else a person can do.\n\nCertainly it's a better activity than worrying about the outcome of geopolitics I can't affect.",
         "Like BMI?",
         "And you know Conservatives hate affordable healthcare and education ",
         "Sounds like your friend just Prestiged his level of brainwashing to 3-Star Platinum.",
         "Second time someone made this joke.\n\n![gif](giphy|1QhmDy91F9veMRLpvK)",
         "You are so strong and brave.\n\n![gif](giphy|JvEMPOQubkyQx9YLQ5|downsized)",
         "A purulent zit or the wet scab covering up a festering wound.",
         "Garbage",
         "A cult",
         "But the worst part was it came from a Black guy.\n\nThere's a reason the ACA polls 30 points ahead of \"Obamacare\" for Republicans...",
         "Sorry I didn't check the entire thread before making a post. Some of us have lives ",
         "It's wild how much I hate this actor",
         "What? You have no actual answer? Ik it's ok.",
         "And yet you seem to have the free time to get defensive about.",
         "It is three comments above yours. You can’t be that busy. You are coming to the top comment to try and grab some coat tails after all.",
         "Aww how cute. She fucking hates you too.",
         "You hate a brown woman?! I’m shocked!",
         "Your question took no effort so I leave you with a no effort response. \n\nGarbage in garbage out"
      ]
   },
   "1gjbxul": {
      "title": "Suddenly it's a free and fair election ",
      "text": "",
      "comments": [
         "Actually, they won’t. \n\nHe bitched about voter fraud during the 2016 election his whole time in office.",
         "He claimed he would have won the popular vote in 2016 if it wasn’t for fraud.",
         "https://preview.redd.it/k6dbizj7kvyd1.jpeg?width=640&format=pjpg&auto=webp&s=d992387cfbfcb8d78f9d9923ed235f8550b2579b",
         "No he will still claim there was cheating against him unless he gets 100% of the vote with 100% voter turnout.",
         "So true. And in Pennsylvania trump is actually already suing for election fraud. And election day has not happened yet.",
         "He's the one trying to rig and steal the election\n\nMake it make sense",
         "To clarify: yes he will still whine about shit because he's a whiny little bitch.",
         "Nope, he's a sore winner, too. The moment he took office on January 20, 2017 he was whining about his inauguration crowd sizes and ordered Sean Spicer to lie about it as his first presser for the new administration. That set the dumbass tone from there. \n\nHe'll cry no matter what happens, because he's a punk ass rich kid who was never told no his entire life, so he honestly believes all the world is his.",
         "It's like how last time all the republican politicians were screaming about voter fraud because Trump lost and yet they had no problem with the votes cast in their favour that got them elected, even though they're the same ballots.",
         "**LOL** yeah yeah, sure sure...tell that to the *electors* who will be *certifying* our votes.",
         "Worth pointing out that the odds of a winner being declared tomorrow are pretty low.",
         "Trump claimed that 75% of the country is his base and repeatedly claimed he would win California except for cheating. Obviously that’s all nonsense, but he has also promised to throw election officials, political operatives, lawyers, donors, and voters in prison if he thinks they cheated. He will still say it was fraudulent because he didn’t get ridiculous results like Putin and other dictators claim, and use it as an excuse to directly attack democracy under the guise of saving it.",
         "Wasn’t one Trump term enough? Be better!",
         "Don't fear. If Trump wins I'll shout cheating from every rooftop",
         "More importantly, they've been driving the \"cheating\" issue for years because they cheat themselves and our claims will not be taken seriously.",
         "Republicans treat elections within America like America treats elections outside America. If the 'right' party wins. It was a free and fair election. If the 'wrong' party wins, it was rigged.",
         "No, they'll be making fun of Kamala for losing election rigged in her favor",
         "No, they’ll say that despite the corruption, they won.",
         "Only if he wins both the popular votes and the electoral college vote. He'd probably still lie if it wasn't the highest turnout ever.",
         "If he wins it will be a 2016 repeat of him winning the electoral college but losing the popular vote but you won’t hear a word about how fucked the electoral college system really is",
         "Let’s not find out. Let em bitch!",
         "No, he'll say he won by a landslide. He can lose the popular vote by 8-10 million and win the electoral college. But then he'll say the vote was rigged, he actually won the popular vote too etc etc.",
         "If trump wins, will the democrats accept it? Will they claim any of these things? Serious question, will they transfer power to someone they believe is a facist that is going to end democracy?",
         "They won't disappear, the Republicans will still use that lie as an excuse to actually rig the 2026, 2028 and all other future elections.  Every accusation is a confession, notice that any actual voter fraud that is discovered (the very very very few cases of actual voter fraud) are all Republicans.",
         "What ever happened to hunter Biden laptop? Weren’t there like a dozen congressional investigations?",
         "This would be the least of our problems …",
         "No, he’ll use voter fraud as a reason to “clamp down” on voting so he can have a majority in congress and so that his next in line wins for sure in 2028",
         "Yeah, Republicans are liars.",
         "Probably true.  Let's not find out.  VOTE VOTE VOTE",
         "He's always said that it's rigged if he doesn't win.",
         "He's going to lose the popular vote, he'll just complain about that, and say that he would have won that if California wasn't rigged, or some other nonsense.",
         "We are literally seeing a grown toddler who didn’t get their candy/toy so they’ll throw the biggest tantrum possible and hope that it forces the parents (American voting population) to give them the item to shut them up.\n\nNa. You’ll see a real resolution to this issue",
         "Actually, it's near impossible to determine a clear winner by the end of election day. \n\nTrump will claim victory anyway, because he's an idiot. He will demand they stop the counting. He will claim there is widespread fraud and provide no proof. He will whip his supporters into a frenzy and point them at his enemies. He will do anything in his power to avoid going to prison.",
         "I think they'll brag that they won *in spite* of all the vOtEr FrAuD!",
         "Yeah… but he won’t win.",
         "“No, all of those things did happen, it’s just that this time we prayed hard enough and the Jesus magic was enough to cancel out the fraud and make Trump win.”/s",
         "After winning the 2016 Electoral Vote, Trump lied about voter fraud and created the [Presidential Advisory Commission on Election Integrity](https://en.m.wikipedia.org/wiki/Presidential_Advisory_Commission_on_Election_Integrity) headed by Pence and several Republicans. \n\n\nThe commission, unsurprisingly, found no evidence of voter fraud. President Trump then ordered all the data destroyed.",
         "Even if he wins, he will claim his victory was actually much bigger than it seems. He will say how the left tried to rig the election but still failed to rig it enough to outnumber his supporters.",
         "No. He will complain that he really won by a much wider margin, and that his win was really the most ____ in history and he’s the best boy ever and his daddy loved him.",
         "Fucking vote. Don't wait until tomorrow. Vote today",
         "No, he'll bitch about the states he lost and if he losses the popular ballot, he'll bitch about for the next four years. He'll try to get Congress to remove the two term limit saying he wasn't declared a complete winner so that means he'll need to run again.",
         "Not true. He claimed voter fraud when he “won” in 2016. He was immediately called out for his lies, but never held accountable by Republican politicians or, more importantly, republican voters. And now look where we are- a whole campaign that’s built upon a foundation of lies, delusion, and the complacency and stupidity of republican voters",
         "AND the LAST ONE EVER  thank you  heRR adolph tRUMP  mein fuRhuR!!!  SEIG HEIL\n\n![gif](giphy|xTiN0CNHgoRf1Ha7CM|downsized)",
         "Nope. He will claim that the Dems threw every trick in the book at him but he still won, and bigly.  And his minions will say that it was divine intervention that helped him overcome the satanic Dems. To admit that it was a fair election would be to admit that he was lying the whole time.",
         "we won't know results until thursday or friday. plenty of time for the chuds to do some crazy shit.",
         "I guess we'll never know because WE AIN'T GOING BACK!!!!",
         "If Trump wins the DNC should immediately launch all the court cases and call Trump in as a witness.",
         "No, they wouldn't. He would claim the evil American scum enemy from within cheated biggly, and he really had the biggest landslide victory in the history of the universe, then he would attempt to begin the purge before he'd even been sworn in.",
         "When Trump Loses, if it's a landslide, Speaker Mike Johnson will 100% **Pull a Pence** and throw Trump under the bus. He does all that two-faced talk to stay clear of the controversy til 11:59 when he will totally pull a Pence and fcuk Trump.",
         "Not worth it.  I'd rather listen to Trump complain about a rigged election all day long from inside a cell.",
         "He will just say that he didn't win by enough.",
         "No it won't. Dude will claim he won Illinois and California in a landslide too",
         "Hasn't he already said that it's rigged only if he loses? In the previous election cycle?",
         "Well, he’ll complain that his landslide was stolen by the cheating Democrats.",
         "Totally agree, it's just like Russian interference, Democrats suddenly stopped complaining about it after Biden won.",
         "If Trump wins, that will be the least of our fucking concerns.",
         "It will not disapper propably, only the side who claim it, is going to change.",
         "… and any irregularities will be the Dems trying to steal it. ",
         "Harris will be making the claims then   And she has always said there is no fraud.  So it’s really no different either way.",
         "Free and fair under Biden and Kamala, what bullshit",
         "I think I've repressed all memories from 2016-2020.",
         "100% this.  Whatever happens he isn't winning the popular vote.  That will sting his precious narcissistic toddler ego and must be because of fraud.  Any state he loses that he has won previously or even fails to win by as bigger margin will be because of fraud.  Every time fraud is discovered and is due to a republican it will be excused and minimised because it us a drop in the ocean compared with evil democrat fraud. \n\n\nAnyone who thinks that accusation is going anywhere hasn't being paying attention!\n\n\nEdit: or possibly as OP says, has blotted some of the deluge of crap from their mind to make room for the more recent crap!",
         "Correct. Win, lose or draw expect 🍊to wail like a stuck pig.",
         "Because it’s not about a specific election.\n\nIt’s a long-term goal of convincing a decent portion of the American people that elections themselves can no longer be trusted, so there’s justification to reform them^1 or temporarily^2 stop having them until the problems can be resolved.^3\n\n^1 That is, to guarantee a permanent Republican super-majority \n\n^2 That is, permanently \n\n^3 That is, never.",
         "It’s cuz he lost the popular vote and cheated, so obviously someone else cheated more.",
         "\"I would have won California if it weren't for all the illegal voters!\" - Trump.",
         "He was setting up the next one",
         "That’s right. He will say there was massive cheating either way, and if he can cheat himself and pull out a win, he will say they won by such a landslide that despite all the voter fraud, he had so much support that he won against all odds",
         "Yep. He swore up and down that his numbers were much higher than that and they were being repressed.",
         "You're right. We can't give them the credit for being against election fraud. They're against elections. They're against democracy. They want their fascist dictatorship, forever.",
         "They’ll say Trump actually won in a landslide and all the cheating offset that into a close win",
         "He even bitched about the states he actually won because he didn't win them by a large enough margin.",
         "Right after his election he appointed a commission to investigate voter fraud during his election in 2016.  They quietly disbanded 6 months and millions of dollars later when they could find nothing,  again.",
         "Well he wants elections like Putin’s, where the winner gets 95% of the vote.  Anything less is unfair to him, because he’s such a great guy and had such a hard life.",
         "Yeah he’ll complain he “actually won by more”",
         "Not only that, he will use false claims to imprison opponents.",
         "Yup. The fraud will have been to make it seem like he only won by a little, when he won by A LOT.",
         " This, he has NEVER refrained from saying his opposition cheat and lie to win OR LOSE. He MUST paint his opposition is morally and ethically corrupt ALWAYS to maintain his supporters' loyalty.",
         "Because he didn’t win the popular vote",
         "Yep.  Because he lost the popular vote.",
         "Yup and that's when he won. He's a poor loser & a poor winner.  Even if he wins he feels as if he didn't win by the biggest numbers ever recorded it doesn't count. I don't understand how his supporters think this thin skinned man is some macho hero",
         "He won't stop until he wins 90+ percent of the popular vote like in some countries in Europe or Asia.",
         "People were caught. They're all republican trump voters.",
         "Ah yes, the \"dear leader\" voting block. We all need to have a 3ft x 3ft picture of Trump on our living room walls, have you hung yours up yet?",
         "Preemptively loading the excuse cannon.",
         "it's called projection",
         "He literally had musk buying votes and nobody cares. I would give someon 1 buck to vote for camala and all of america would immideatly know my name lol",
         "Not letting Trump steal and rig the election *is* election interference.\n\nDemocrats always cheat and interfere by getting more votes.",
         "How dare you point out the blatant hypocrisy of the Republican party!",
         "It was one term too many.",
         "I didn't see America claiming the UK's elections for the last 14 years were rigged. It's more like if the brutal dictator \"wins\" with 90% of the vote despite the people saying \"hey I didn't vote for this asshole,\" then it was rigged. except for Republicans it's rigged if the brutal dictator (i.e. their guy) loses.",
         "No, many of the Republicans I've known have been bitching about this for the last 20 years that I've known them because this isn't about fraud, it's a dogwhistle about taking voting rights away from every group that has gained them in the last 100 years or so.\n\nTrump is just blowing that whistle at 120 decibels.",
         "Democrats believe in free and fair elections, the integrity of the process, and the peaceful transition of power. So yes, we won't like it (clearly) but we would accept it.\n\nOnly one side is attacking the integrity of our elections.",
         "so has half the electorate, apparently",
         "Let me remind you.  We ended with the tear gassing of peaceful protestors so he could get a photo op with a bible in front of a church.\n\nThat's where he's going to start.",
         "Unless it's 100% Trump he won't admit it's fair. \n\nAnd that should bother everyone.",
         "and spent years and millions to not be able to find any.",
         "They want it, but they (being Trump supporters) won’t want to live through it. \n\nAll those rubes are gonna find out how disposable they are after their vote has been clinched and there is no longer a need to vote in a future election.",
         "Very true, but still worth mentioning that these incidents were still exceedingly rare and did not result in enough fraudulent votes to remotely impact any election. Voter fraud of any flavor is exceptionally rare.",
         "Their projection is always an admission",
         "I'd have to turn it so it was facing the wall when I eat.",
         "The excuse cannon is **always** loaded.",
         "Handing out water to people waiting in line to vote could land you in jail because it could be influencing voter decisions, but Musk can flagrantly offer million dollar cash prizes without consequence. It's bullshit.",
         "Why would you think America wouldn't want the Tories in power in the U.K.?    \nThe American 'health' industry, which basically owns both major parties, has made great inroads into destroying the NHS, thanks largely to Tory policies.",
         "Why would you give power to a facsist? They must not actually be a facsist who is a threat to democracy then, that makes no sense",
         "Yeah, MAGA people talk about things being great, experiencing no problems, illegal immigration was stopped, everyone was the most free they’d ever been, and the economy was great.\n\nClearly they don’t remember much of anything.",
         "An upside down bible, no less. It's all coming back to me now.",
         "Don't forget snatching peaceful protesters off the sidewalk and stuffing them into unmarked vans to be detained at black sites.",
         "I will never forgive the DNC for ceding that shit to the right. Trump acted like a tyrant, and all people talk about with the George Floyd protests is \"rioting\" when the cops were calling protests riots for \"violent graffiti\" as an excuse to brutalize them.",
         "Dictatorships create enemies to blame all their problems on.  The runes will hate who they're told to hate.",
         "These events influence other people to do it.",
         "True.",
         "Don't want to ruin the rugs by puking upon sight of his bleached butthole eyes",
         "But now he cocked, loaded and now is getting ready to shoot it.",
         "well they didn't bitch about labour winning this election either, did they?",
         "Because it's a democracy. That is what we do. If the people elect a fascist, then there are other means of removing him from power. \n\nWe do not compromise a peaceful transition of power, unlike the Jan 6 terrorists.",
         "That’s the effect of him doing one horrible thing after another — you can’t remember more than a fraction. Can you even remember all the horrible things he said this week? The msm barely bothers to report them.",
         "He knows they don't actually read their Bibles, and he certainly doesn't.",
         "Preach!",
         "You’re presupposing that they aren’t just rounded up alongside the liberals and other undesirable groups for whatever cannon fodder Trump needs to do.",
         "They rarely criticise nations who don't have the balls to criticise them.",
         "https://x.com/larrydjonesjr/status/1853609325761273976?s=46&t=7KMlZzWYYAy1OLLQy1w9-Q\n\nCurious of your thought here. So would you say this isn’t what you’re describing?",
         "How is it going to be a democracy if they allow a facist to subvert democracy? There isn’t a democracy anymore?",
         "okay you're gonna have to spell out for me exactly what you're getting at, because you said america calls any election where the \"wrong\" party wins rigged, i pointed out that they haven't said that about elections in actual democracies regardless of which party wins, and now you're saying that's because the UK doesn't have the balls to criticize the US? criticize the US for what? and which elections are you referring to that americans only call rigged because \"the wrong party won\"? russia? venezuela? hungary? can you name a country NOT run by a dictator that the US has criticized for having rigged elections?",
         "He is trying to erode the pillars of our democracy one by one, yes. It is our job as voters to vote those assholes out. If we don't, it doesn't mean America is suddenly not a democracy, it's not that black and white.\n\nIs it less of a democracy? Yes. Are all of our democratic institutions still in place? Also yes. We're not suddenly in 1939 Germany.",
         "I am again saying, I understand and agree with you, but you're telling me if the voters vote for hitler adjacent, then its 1939 germany and the democrats are going to allow it?",
         "I never said anything about him being Hitler adjacent, in fact I don't like that comparison at all. And if the American people elect him, we're not suddenly 1939 Germany lol. \n\nIs our country dramatically worse off? Yes. But we're not suddenly in a dictatorship, we still have a system of checks and balances (as flawed as they are). American democracy will survive this asshole.",
         "So trump isnt a facsist then and him winning won't hurt our democracy?",
         "Dude you're speaking in absolutes and it exhausting. The world doesn't work that way. Have a good day."
      ]
   },
   "1gjr19z": {
      "title": "Meet the Republicans who are keeping their votes for Kamala Harris a secret ",
      "text": "",
      "comments": [
         "Nor should your husbands, fathers, grandfathers, brothers or sons. Lets fix this!",
         "I can’t imagine having to wear all that crap while secretly voting for Harris. I could not.",
         "Oh sweety....they absolutely ARE that stupid.",
         "Republican women are completely subservient. They don’t have the wherewithal to act against exactly what their husbands tell them to do.",
         "I rather suspect that there are more voters who say they will vote Harris even though they will check Trump's box in the voting booth. Trump voters are much more likely to be socially ostracized than the other way around. Go to a MAGA demo as a Democrat and then go to a Democrat demo as a MAGA.",
         "If seltzers data is believable, and a trend not an only Iowa thing, older women are pissed that women's rights have gone backwards and many are dragging their husbands with them.\n\n\nThe hippies of the 60's are still mad about Roe being overturned.",
         "I mean, it’s literally illegal to wear political apparel in voting locations in most states.",
         "I wouldn’t wear that period"
      ]
   },
   "1gjrt4r": {
      "title": "The picture they should use",
      "text": "",
      "comments": [
         "They should.  Truth in advertising.  They always use this photoshopped photo from a decade ago though.",
         "https://preview.redd.it/b8xg4kquj0zd1.png?width=1198&format=png&auto=webp&s=1b1b1793a53c47eff227012b61827989d3c8497a"
      ]
   },
   "1gjeims": {
      "title": "Why?",
      "text": "",
      "comments": [
         "I wonder if when they look back at this time in history if they are going to refer to it as “Americas Orange Period”",
         "well the coronavirus didn't finish us so he has to use more direct methods.",
         "Great, now I have to rematch Duck Soup",
         "Margaret Dumont could deliver any line with a straight face.",
         "sent by Putin",
         "YES!!!",
         "Its been months since i've seen this repost!",
         "Apparently so!!",
         "absolute pestilence.",
         "The Stupidening",
         "Watched it for the n-th time last night, it was the first time my kids saw it.  They had no idea what they were watching, other than I was quoting it all evening.\n\nThe nightgown mirror scene is absolutely one of the best cinematic moments ever.\n\nPeanuuuuuts.... to you."
      ]
   },
   "1gk5t35": {
      "title": "VOTE",
      "text": "",
      "comments": []
   },
   "1gjmqhm": {
      "title": "Trump's Garbage truck door dilemma: three tries, one handle, zero dignity",
      "text": "",
      "comments": [
         "Before people start saying it's fake or ai, here is the source: https://www.youtube.com/shorts/h_2Qju85B00",
         "That orange vest isn't for his safety.  It's to show he's a danger and a menace to anyone within site of him.",
         "I've seen people mention that dementia affects your depth perception. I'm no expert, but the evidence is stacking up. He's clearly got something going on.",
         "Folks, I'd be careful ripping on him... you don't know how hard it is to walk with a girdle, diaper and high heels on while trying not to smear his makeup...",
         "I initially didn’t notice that he was missing the handle. I thought he struggled with pulling the door, as though it was jammed. Somehow this is way worse. It’s like he’s drunk, but he’s probably just old. I hear he refuses to wear his glasses in public.",
         "And they said Biden was too old…",
         "Vascular dementia. It took my mom. Can't wait for it to take him.",
         "No depth perception... Where's that damn handle?",
         "Waiting for the garbage truck chauffeur",
         "You shoulda heard him trying to justify it at his rally, hilarious",
         "Dementia-1\n\n\n\nDiaperDon-0",
         "Old fart...defeated by door.",
         "Is he drunk?",
         "Ketamine is a powerful drug.",
         "Dementia Donald!",
         "That dilemma is far from the least dignified act of his conduct.",
         "It occurs to me that this piece of shit has opened very few doors for himself in his life.  I mean that both figuratively and literally.",
         "When I am leaving the bar trying to get into the Uber.",
         "It's less that he missed it and more that he almost somehow fell the fuck over in the process.",
         "The door is already open….he doesn’t even have to grab the handle and actually unlatch the mechanism.",
         "Noticed there was no toilet paper on his shoe though",
         "he looked like a toddler wanting his sippy cup with the way he wiffed that handle.",
         "The 1st guy who posted it with 7 moscow mules reference was spot on!",
         "Now I know another reason why he may like teleprompters besides the very real possibility of being illiterate:  He needs glasses, and refuses to wear them because they'll block the orange skin.",
         "Bone Spurs strikes again.",
         "The lord works in mysterious ways.  If this guy wins I predict we will spend four years making jokes about him falling down and shitting himself.",
         "Me trying to open the fridge on Saturday nights tho",
         " how many times in his life do you think he's opened his own car door?",
         "Same energy as the dude tumbling down the stairs of a trailer.",
         "He is dying",
         "https://preview.redd.it/bh0yo384oyyd1.jpeg?width=720&format=pjpg&auto=webp&s=f5a312dba2cd9999257238772b81294998e6d656",
         "Having seen Alzheimer’s/dementia and all of its stages. Instability and altered motor skills are a couple of many symptoms. He’s unfit for office with or without dementia.",
         "If that was a pussy he’d a had it on the first try!",
         "Trump recently got upset that 60 Minutes edited their Harris interview  But when I looked this clip up the other day I came across a version on FQX. Of course they just edited the best part out.\n\n\nWhere if Biden had done anything similar they'd have been running just this part on a loop on every show, and even different show segments.",
         "That’s not fair. When did this lump of shit have dignity?",
         "I can’t make fun of this, I did the same shit this morning. Missed the handle twice.",
         "I never realized he missed the handle...  I thought it was harder to open than he expected.  This is so much funnier.\n\nI like Presidents who can open car doors.\n\n![gif](giphy|feO9ESQit0QM0|downsized)",
         "Surprised he knew to pull and not push.",
         "I've never seen it this close up, I thought he was struggling not that he totally missed the door.",
         "“Is it dishonesty, or dementia?”",
         "You cropped out his actual stumble. This video is pointless. In the original video, you can see him falter in his feet.",
         "He's senile, admit it.",
         "When his legs crossed I thought for sure he was going down",
         "They're tippin' the room on em!",
         "Guy doesn’t know what real work is.  Spoiled little bully",
         "A vote for trump is a vote for jd vance, at this point.",
         "Those door handles can be tricky in high heels.",
         "I have never walked into an Uber that drunk.",
         "Hyperextends left knee gotta hurt",
         "Weird guy",
         "Any other 78 year old, they would take away his driver's license and put him in a home.\n\nI cannot fathom how anyone with an IQ over 40 wants to give this doddering, senile old fuck the keys to the country.",
         "What? Open a door? He has people for that",
         "MAGA, this is your guy?",
         "For a guy who doesn’t drink…",
         "Trump has a new dance move, the DJT shuffle\n.",
         "All he needs is to hop in the back and he will be right at home. Fucking trashy ass human being.",
         "Grandpa's been drinking before work again.",
         "Notice that they didn't let him drive it.",
         "If he wins the election that's elder abuse.\n\nPutting him up on stage is already elder abuse.",
         "he tired, he is nlftearth",
         "Should've put him in the back where he belongs. Sure there is room thee for the rest of the GOP trash as well.",
         "No one thinks it’s fake, it’s hilarious.",
         "Oh, I know it's not fake. Those door handles are tricky. I would miss when I was suffering from mild hypothermia",
         "He was just preoccupied with his thoughts at the time…You know he wasn’t looking forward to actually getting into that truck. We probably couldn’t see him muttering to himself as he was walking towards the door handle.",
         "Right? Imagine the poor bastard who had to be in that cab with him. The stank must have been unimaginably heinous.",
         "Nature has a way of putting bright colors on poisonous things",
         "Yeah, like brightly coloured poisonous animals/insects warn the others, \" back off, I'm dangerous!\"",
         "Maybe his hands are getting smaller.",
         "Clearly not a series of mini strokes. ",
         "He does look drunk.\n\nEver see notes he sometimes brought to podium?  Very large block letters heavy bold,  written with wide tip markers.",
         "Collin Jost on SNL said \"He looks as drunk as I'm going to be Tuesday night.\"",
         "He (probably) won't go to prison but everyone will watch his very public and very total mental collapse in real time as his faculties continue to decline, he can no longer hide his incontinence and the only thing going into or coming out of his mouth is boiled cabbage. ",
         "Unless we are deemed the enemy within.",
         "This one?  https://www.youtube.com/shorts/h_2Qju85B00",
         "Fkn hilarious.  Hahaha.",
         "I wonder what his excuse is?",
         "Miss touching the door at all? He didn't fail to articulate the handle; he failed completely at judging where the handle and the door were.",
         "Tracks, can’t chew gum and think at the same time.",
         "Hazard pay doesn’t cover that kind of hazard.",
         "In Trump's case, it's for anyone without a sense of smell, as that would typically keep anyone with a modicum of intelligence well back.",
         "I thought that was due to his poor eyesight and his unwillingness to wear glasses in public. Dude is old. It’s  basically like the standard font size old folks use on their phones for texting.",
         "The way his fat, tiny fingers wiggle trying to catch the door before he almost falls over is amazing.  It’s like even his brain thinks his fingers should be longer and he should have made that first catch.",
         "Cognitive decline or a fuckton of ketamine",
         "Yes, thank you for explaining what we watched",
         "It’s OK, he won’t pay anyway.",
         "He was not steady on his feet.  I've said before,  looked like he was on a pitching boat with big wind and waves.  He had no balance.   He was very close to falling down.",
         "If god existed, Trump would have face-planted right there.",
         "Cognitive decline AND a fuckton of ketamine\n\n(Fixed it)",
         "Captain obvious strikes again!"
      ]
   },
   "1gk4222": {
      "title": "It's already started in fact...",
      "text": "",
      "comments": [
         "Trump’s going to claim fraud even if he wins. He’ll claim everyone voted for him, but the evil democrats flipped all of his votes.",
         "It's pretty easy to predict something when it's already been happening for at least a decade.",
         "Trump is already doing it in PA",
         "Stollen*",
         "And Georgia..."
      ]
   },
   "1gjyzd7": {
      "title": "Texas abandon him like he abandoned his decency and you. ",
      "text": "",
      "comments": [
         "And the guy who said my dad was part of the group that killed JFK. It's ok because he is on the theocracy team.",
         "He can't go to Mexico now, sad to say. Not a good look for him with them having a female president these days.",
         "love this!",
         "I did my part!",
         "He had decency?",
         "https://preview.redd.it/8i8mgksgx2zd1.jpeg?width=1200&format=pjpg&auto=webp&s=f89fc9092c1ea21a70b80e51f2ce61f6ee319dde"
      ]
   },
   "1gk0vy5": {
      "title": "Fuck Trump (in a bad way)",
      "text": "",
      "comments": [
         "Facts",
         "Yeah no shit"
      ]
   },
   "1gjmu9v": {
      "title": "Well said.",
      "text": "",
      "comments": [
         "The more I learn about polling methodology, the more convinced I am that they are meaningless. It's literally just people guessing based on available data. Which isn't terrible, but in close elections is meaningless.",
         "We'll know the outcome on January 7th. Expect every moment until then to be nonstop legal battles to overturn the election, a 50' tsunami of bullshit from conservative media and the constant threat of more violent insurrections. ",
         "\"Quick Batman, down the Bat Poll!\"\n\n*Slap! Slap!*\n\n\"I meant Bat Rod\"",
         "winning isnt enough, trump\ncant lose by 1% he needs to be demolished so hard that he and his rhetoric will be seen as unelectable for future elections, otherwise we have trump 2.0 in the next election",
         "Big problems with polling bias as well. Pollsters purposely throwing out whole demographics if it doesn’t help sensationalize the lie that the race was gonna be a close nail biter. Also boomers are disproportionately polled because they are the only group of people who still have landlines.",
         "I don't know if I'd say that. I don't think polling data is useful in the way that pollsters want you to believe it is. However, constantly reporting how close the race is is likely to motivate otherwise complacent voters.",
         "I do have a conspiracy theory that they're keeping the polls as close as possible for ratings and when they're wrong they'll just claim \"margin of error\" as a defense.",
         "Considering all the sane-washing that has been done, I can see this being very possible. Still, don't read to much info polls, and just vote!",
         "On one hand, wrecking your credibility long term sounds like a stupid idea. On the other, it has kept people coming back every day to check the latest polls. Kinda like how the history channel and discovery switched to shoveling garbage to us because it's more profitable than trying to educate us."
      ]
   },
   "1gjstbe": {
      "title": "If you were duped by Elon Musk’s $1M registration lottery that he now admits was rigged, here’s a suggestion of how to show him how you feel",
      "text": "",
      "comments": [
         "Can you imagine voting for the side that literally treated you like suckers the week before the election 😂",
         "Class action lawsuit.",
         "Sounds like a class action lawsuit waiting to happen...",
         "Now President Biden, can you cut the government contracts that support Space X and hurt him where it hurts--his money?   Plus revoke the EV tax credit.  Let's take this billioniare down.   NASA can wait."
      ]
   },
   "1gjf672": {
      "title": "Trump's story isn't getting any better.",
      "text": "",
      "comments": [
         "Wait did he really tweet that corndog thing? I thought it was fake",
         "Trump: \"what, doesn't everyone deep throat a corndog from time to time in front of thousands of people when vying for the top job in the land?\"",
         "Guys, chill. This is the family values party. They're not blowing mics and humping couches. There has to be perfectly normal explanations for these things! If only they could think of any...",
         "https://preview.redd.it/46u08c4u8wyd1.png?width=170&format=png&auto=webp&s=90cec6c29586c2383609de326884e5ae3c03bfd7",
         "Ask Melania what a fake blow job looks like, she should be able to tell him how to perform something while your mind is somewhere else...\n\nIf he can find her that is.",
         "Now imagine if ANY democrat EVER did that. Doesn't even have to be Harris as a woman, but literally ANY democrat. The entire internet would burn down about how democrats are unstable....",
         "Wait, i... there's no way that was an actual tweet by a former president speaking on giving a microphone a blowjob... \n\nSigns of the times, signs of the times.",
         "TIL: the Donald hawk tuah’s a corn dog before eating it\n\n![gif](giphy|83QtfwKWdmSEo)",
         "\" You guys don't think I'll drop an N-bomb to change the subject. I'll do it, I will \"",
         "This could be a believable excuse, if you happen to be blind.",
         "Can we get the man a corn dog already, so he can demonstrate how a corn dog is eaten?",
         "You know how many foods are shaped like dicks? The best kinds!",
         "Small hands make the corn dog look bigger in the photos. Just sayin",
         "You know how many foods are shaped like dicks? The BEST kinds",
         "So why is he talking about corn dogs if this is true? Does this have anything to do with why we should vote for him. Is he hungry? Or is he practicing for jail?",
         "At this point, I’m too afraid to ask, tbh",
         "\"Corn dog\" is Putin's love handle.",
         "That corndog was attached to putin’s  balls",
         "Trump eats corn the long way",
         "Showing off his expert negotiation skills. \n\nCup, stroke, suck.",
         "Are we surprised? Dude a spicy ny liberal that loves show tunes. Proof is in the puddin,no?",
         "Was he even talking about corndogs? Make it make sense!",
         "Extra mustard",
         "Wait, so he did really clarify that?",
         "JD: Why are there corn dog crumbs on the couch?",
         "I mean I like corn dogs too, but as a friend.",
         "Trump, \"Mmm, Arnold Palmer.\"",
         "That’s how you eat a corn dog, Donald?",
         "And if it were Any Other Candidate they’d be dropped like the flaming heap of 💩from the party ticket.",
         "“Corndog” is his safe word.",
         "If he actually said this corn dog thing I haven't seen it yet.   \n(Not that I'm saying the guy doesn't deserve ridicule.)",
         "Trump: There was no ~~lube~~ ketchup so I had to ~~lube~~ ~~full throat it~~ swallow it whole.",
         "Dick Suck Don like, \"What, you guys don't open throat and try to sliiiide the corn dog in? You guys are biting and chewing??\"",
         "Come on guys, don’t act like you know of a better way to eat a corn dog than that. The guy is a stable genius, /s",
         "Isn't giving a corn dog fellatio pretty gay too?",
         "He was just having a mental slip, remembering his private visit with Putin.",
         "I always stroke my corndog before repeatedly deepthroating it, making sure that my teeth avoid contact\n\n\n\nI wouldn't want to bite it accidentally",
         "Well, his “his eating a corndog” sure looks a hell of a lot like giving a blowjob.",
         "So weird.",
         "Corndog is the CIA's codename for Putin's penis.",
         "You should see what he does with a corn cob.",
         "It was fake, it's embarrassing that people are running with clear misinformation when the dude says crazy shit every day. \n\nFocus on the real, no need to bring ourselves down to their level of disinformation.",
         "Im fairly certain it was fake",
         "This is a radical left deep fake. They put a hologram of him up at the rally. What you’re seeing and hearing isn’t what you’re seeing and hearing !!!",
         "And stroke it.",
         "![gif](giphy|relnvfSEa2Qa125uPA)",
         "https://preview.redd.it/bqfbpg74gwyd1.png?width=1482&format=pjpg&auto=webp&s=f8900bd878f7b96d6929b42bf686a9ac24d30919",
         "He doesn't eat a corn dog to enjoy its taste, but to savor its shape.",
         "Prison practice.",
         "I haven't seen it anywhere in the mainstream media.  What he did was so reprehensible it should be out there everywhere.  That low class, crude, immoral POS is not representative of America and needs to be in prison.  ASAP.  VOTE 🔵.",
         "I think the greater signs of the times are that people are so lazy they can't take five seconds to check his socials and confirm before they spread bullshit. \n\nThere is just so much garbage out here and people don't want to decipher what is real and fake",
         "He doesn't eat a corn dog to enjoy its taste but to enjoy its shape.",
         "So he is just going with giving a mic a blowjob?",
         "It is hard to separate satire from reality. I googled it myself to see if it was true and determined it wasn't. But I had to, and that's the point. \n\nDo you think it's satire that Trump said Herschel Walker should be in charge of missile defense?",
         "That's the problem. It's not clear misinformation anymore *because* of the crazy shit he says every day",
         "I think it's less, \"running with clear misinformation\" & more, \"I honestly can't tell what's satire & what the lunatic actually said\".",
         "Why are you against corndog oral sex?",
         "To be fair, they've jumped the shark so many times that ot's honestly hard to tell which tweets are real and which are not. And I'm not about to download his shitty nazy social media app to verify.",
         "Rotflmao",
         "multiple times.. what, does he pet his food before swallowing it whole like a snake?",
         "because he is that bad so often there is no longer any reason to doubt it, no matter HOW insane.",
         "He eats mars bars upside down to emulate the veins.",
         "Yeah I guess so, which is even more crazy than this corndog joke so I don't even know why we're talking about the corn dog outside of funny lol. \n\nHe hasn't really mentioned this incident in today's rally, he has two more though so I'm curious if it'll come up and he makes an even bigger fool of himself",
         "Hey look, what has he talked about recently at a rally? Arnold Palmer's big dick.\n\nNow he's miming blowing a phallic object.\n\nHe's clearly imagining that he's giving Arnold Palmer a hole in one.",
         "I don't disagree, however I think we could do better to not add to the chaos by creating fake posts.",
         "Yeah but there would usually be an in-between step in \"not knowing what is real\" and \"posting joke that is not real\" \n\nLike what happened to verifying information before we post stuff?",
         "You don't gotta download the app, you can see his posts without creating an account or downloading the app.",
         "Dude he literally tells his base not to believe their lying eyes. Maybe not directly in those words but he buries it in his insane weave",
         "I have had a good laugh about the corn dog joke, and I am sure he will continue to get more unhinged the closer we get to the election. So more weird shit to come.",
         "What happened is trump flooded the zone with shit to the point that fact checking every single thing is practically impossible & usually a waste of time.\n\nI get where you're coming from, but I don't think the left accidentally using misinformation is all that bad when the right willfully engages in & creates their own misinformation on the daily.\n\nI know you're not trying to \"both sides\" this & I'm not even accusing you of doing so. I'm just saying that it's the R-Cons that created this atmosphere. Somebody falling for a bit of misinformation that could've easily been true isn't really all that bad, especially since it has now been corrected.",
         "I want Trump to define the radical-left.  I feel so embarrassed to be an American these days.",
         "Don't quote me on this, but I'm fairly certain he has used those exact words. I could be wrong bc all this B's is starting to blend together, but it seems like I've heard him say that.\n\nAfter, \"I alone can fix it\" &, \"I'm the chosen one\"... I have no doubt he would say that.",
         "But it would be easy to check these big viral posts immediately before posting or upvoting right? \n\nI don't think that the Republicans misinformation campaign is even close to this, they are undoubtedly the largest enemy of free information and are completely malicious with their campaigns. I just think we could do a bit better before we post things is all. In the grand scheme of things, this is all very tiny.",
         "We are the laughing stock of the world and that’s saying something because if you’ve ever watched parliament in session, That used to be the world’s clown show."
      ]
   },
   "1gjy1r9": {
      "title": "Elon's lawyer be like:",
      "text": "",
      "comments": []
   },
   "1gjeiu9": {
      "title": "A reminder...",
      "text": "",
      "comments": [
         "When did he change the color of his tie or is this a trick question like the color of the dress?",
         "He gassed the nuns that work there so he could take a photo in front of their church.\n\nDude should have been done at that point.",
         "I think he might’ve been afraid at the red tie might be one too many insults, in addition to holding up a book he’s never read and holds in complete contempt. I doubt if he believes in a god,. But it always pays to be careful.",
         "With a bad spray tan",
         "Didn't expect it to be so dumb",
         "He'll do anything for a laugh ...  oh wait, he's serious ?",
         "It came in with Sarah Palin. it's been working towards its perfect form with trump.",
         "It's difficult to find humor, as there is so much truth here.",
         "when fascism comes to america it'll be hugging a flag and holding that bible upside down. bc you know, fuckin fascists are dumb as hell...",
         "Holding a Bible with the lyrics to “God Bless the USA” printed inside.",
         "Holding it upside down at that. And when asked if it was his bible he replied \"its a bible\""
      ]
   },
   "1gjthzi": {
      "title": "😆",
      "text": "",
      "comments": [
         "https://preview.redd.it/ywljqzqf8zyd1.jpeg?width=266&format=pjpg&auto=webp&s=f5a416ff6f3bd62f94008f2186f47bde274123b7",
         "Ms. Ogyny",
         "Karen Trump",
         "Ha ha ha ha",
         "I need you to find me 4-5 million votes.",
         "She looks so much like her mother.",
         "Cue George Santos because she is taking her spotlight. \"Catfight\" imminent.",
         "Mimi?",
         "I’ve always been so confused by the hairstyling of that photo…like Gretchen Weiner’s hair, but instead of being full of secrets, it was just full of evil."
      ]
   },
   "1gk6587": {
      "title": "Every time I voted",
      "text": "",
      "comments": []
   }
}