{
   "1gkyljd": {
      "title": "R/pics removed my President Donald Trump picture",
      "text": "r/pics removed this picture but kept my Kamala Harris picture lol. ",
      "comments": [
         "Wow rude, how dare they remove a picture of the 47th President of the United States",
         "I got banned too. I posted \"You now have a newly Elected President and not an appointed one.\" And I got banned. Proof that Liberals only spread lies, and cancel truth.",
         "I got banned from them yesterday",
         "Yeah that's not cool. It's a picture. It quality.",
         "Of course they did!  Today is going to glorious!",
         "The people who weren't democratically appointed to their positions, positions that are abused to silence free speech, scream how the people they silence are threats to democracy.\n\nIt's going to be a good four years.",
         "I wish I could block r/pics from showing up on my feed,  It should be called \"r/pics for Liberals'.",
         "You can expect more of that all around Reddit as they are very very upset. It’s so funny how underhanded they are while claiming to be the honest ones.",
         "Trump trump trump trump!",
         "That’s what fascists and those who don’t believe in freedom of speech like to do.",
         "Reddit is VERY different this morning... lmao",
         "This is my surprised face 😐",
         "“The Party of acceptance and tolerance”..,,  lol",
         "Of course.",
         "R/pics is a cesspool",
         "I just got banned from there for literally commenting, lol.",
         "Their bans are vindications. They lost BIGLY, the plurality of Americans voted “no” to their delusions",
         "They banned me for posting elsewhere.  Screw those guys.",
         "Banned me.",
         "Cause Reddit is a cesspool of Dems .",
         "Banned from there the moment I posted there lol",
         "Of course they did, it’s runs by crazy leftists.",
         "What a great picture!",
         "I've been banned from numerous subs.",
         "Did you not expect them to LOL\nThey’re injecting copium directly into the vein.",
         "They’re really butthurt today by everybody over there dunking on them",
         "that is a nice picture! was it taken recently?",
         "Now post a picture of Kamala looking like a loser.",
         "They are hard core commies over there. And more are lurking behind similar innocuous and innocent sounding channels.",
         "Of course they did",
         "Yeah r/pics is full of crazy TDS over there, I actually muted their channel on my feed it got so bad.",
         "That place is too left for Marx.",
         "Reddit has become a leftist Cesspool it seems, Even non-political pages! Anything conservative in nature will get your post removed, banned or get violent and threatening Direct messages!",
         "I was testing R/pics on the pictures as they are so far woke left over there its funny. \n\nI should feel bad but i don't really but i've been using / abusing their illness by posting stuff that feeds their sickness just to get upvotes lol.",
         "I got a ban for 3 days last week cause I spoke about the \"religion of ✌️\" M-North slavery in Africa. \n\nOnly noted an article about the (M) (M-north) did last Christmas. And three day came through",
         "Sign of a true patriot",
         "Like wise, but i've been naughty and using / abusing their far woke left sickness / illness ideology to farm upvotes lol",
         "Epstein Epstein Epstein",
         "I had noticed. My Kamala Harris picture was left up but had 0 upvotes. My Trump picture got to 32 then ban lol",
         "I could get used to seeing equal parts democratic and equal parts conservative posts. It is like X but with Reddit’s interface.",
         "I’m surprised they didn’t permaban your whole account. They over react a lot over there",
         "I'm willing to forgo all my karma to post on those subs and be downvoted. Or worse... banned! GASP!",
         "Not true but whatever u say brother",
         "I purposely try to get banned from any left sub. Surprised I still have an account.",
         "Based. \n\nI FAFO that some of those leftist mods have waaay too much power"
      ]
   },
   "1gksgsk": {
      "title": "Trump wins!",
      "text": "",
      "comments": [
         "It’s a great time to be on Reddit. Haha!",
         "He has lead all swing states for hours",
         "R/Texas is locked down",
         "Congrats.\n\nProud to be an American (as a legal immigrant from Eastern Europe)",
         "All praise to God! Our country is not lost!!",
         "Why do I keep seeing posts that he's won but can't find that on Google anywhere. Has he actually won? 🤞🤞🤞",
         "🇺🇸🇺🇸💕",
         "I honestly didn’t think they would allow it. I thought they would cheat like they did last time. Too big to fail!",
         "I’m supposed to be at work in 3 hours but I don’t care. I want to see this through. I’m extremely hopeful.",
         "To big to rig!!",
         "Cnn still hasnt declared him a winner..hahahaha",
         "Only Fox has called it this far.",
         "Thank god. Just listening to that moron HeelsUp would have been hell for 4 years",
         "Ben was gloating so hard over this news last night on the DW's coverage. So hilarious!",
         "Anyone check r/politics, r/pics, or r/[insert state] lately?",
         "Just passed so manny posts about liberals crying. Good time to be on Reddit.",
         "[removed]",
         "Let the entertainment begin!!!!!",
         "It sure is.  And a great time to see all the tears flowing.  Americans spoke.",
         "Finally, after all the left propaganda out here on Reddit before the election.",
         "How the redditors on r/Texas feel when the state that votes red every year votes red:",
         "Congratulations to you. Glad to have you and your family as Americans.",
         "We are proud to have you!",
         "It's just been delayed by 2 years lol",
         "Same… I think Google is trying hard not to concede harder than Kamala lol",
         "CNN and The New York Times were really dragging their feet and didn't want to give Trump Alaska, Wisconsin, Nevada, Arizona, and Michigan.",
         "There is the ever so slightest chance he hasn’t won",
         "What cheating happened? There’s little evidence of rigging last time and him winning this time is also evidence of no rigging taking place",
         "Shut up. There was no evidence of large-scale vote tampering last election and certainly not on a scale to flip the election the other way. Trump lost 2020 fair and square. And he won today fair and square.",
         "I feel that, like how can I sleep at this time!?!",
         "The New York Times was dragging their feet on it, too.",
         "Fox called it a little early, but they based it on the fact that more than 90% of the votes had been reported, and there was no way for Kamala to take the lead in Wisconsin or Pennsylvania",
         "I mean, they probably been crying for the past 2 hours, just like Kamala's whole election party.",
         "It is odd seeing so many threads with so much activity in it, but zero up votes.",
         "America the Beautiful",
         "If they are Cowboys fans they’re used to disappointment.",
         "That's what I told my son. I think Google is messing with us lol.",
         "Sorry for your loss",
         "Shh. The thick-skinned, Trump worshippers can't handle the thought of people not liking their daddy. They tend to get emotionally unstable when you point out his endless list of flaws.",
         "No vote tampering. But tell me the media didn’t sway hard left in their coverage (or lack of coverage). It’s pretty well confirmed and I’m hoping a lot of people lose their credentials and security clearing this week. Drain the swamp.",
         "Whatever you have to tell yourself. Your leftist masters appreciate your blind support",
         "I don't know about the extent of vote tampering but there were things going on behind the scenes. Time labeled it the shadow campaign. \n\nhttps://time.com/5936036/secret-2020-election-campaign/",
         "It is!!!!  And Land of the Free...",
         "The media has a first ammendment right to say whatever they want. Even if it's conplete lies, so long as it doesn't cross into slander."
      ]
   },
   "1gl23dd": {
      "title": "Harris having to certify her own election loss is pure chef's kiss.",
      "text": "",
      "comments": [
         "Trust me I was scared that California would ruin the election",
         "Is there a reason NV, AZ, MI and AK are taking so long to finalise? I’m starting to get suspicious",
         "Will she be unburdened by what's about to be?",
         "it's hilarious to me that she's waiting until 6 pm est to make the speech. even Hillary called in the middle of the night to congratulate him. I wonder if she called him.",
         "I love this stuff - looking at it on a county-by-county level and comparing results to last year.  When I saw her tanking early in Florida by big numbers and Dade county turning 18 points vs. the last election, and even Palm Beach co. was a near draw vs. a big loss last time, I knew she would be in trouble nationally.  Even in the blue states, she didn't do well - I think Illinois was a 17-point Biden win in 2020 vs. 8 or 9 this time, and NJ went from a 16 point win to 4 or 5.  And don't even mention the BS Des Moines Register poll vs. his 13 point actual win in Iowa, LOL.\n\nThe biggest problem for democrats is that, aside from people being tired of the identity politics, poor immigration controls and enabling of criminality, she just wasn't a likeable or good candidate.",
         "Men are tired of the bullshit and our women are tired of it too.",
         "Kamala has to certify that she is a LOSER! That’s so appropriate!",
         "I really feel bad for whichever intern that has to explain this to her. You know they are getting the slipper.",
         "Shout out to my Latino brothers and sisters in the State of Texas!  MVPs of the 2024 election in my opinion... Texas would legit suck without you guys..it really would.",
         "I finally like Reddit again .. hearing these assholes talk about their life is over as they know it is so freakin satisfying after this election cycle.. they were the most toxic little weirdos ever",
         "Popular Vote Baby! I was fairly sure we would win electorally but stomping her out with the PV is cathartic.",
         "270towin:\n\nLast Updated: Nov 6, 2024 at 11:37 AM\n58% est. reporting\n\nKamala Harris 5,606,703\t57.3%\n\nDonald J. Trump 3,918,222\t40.1%\n\n\nHow is it possible that only 58% has reported!?",
         "same! and that she would get PA.",
         "With PA being called he's already over 270. He wins even if her loses mi az and nv.",
         "Yrs, this is where the boxes of unopened ballots are suddenly found usually comes in.....and why some counties consistently take so long to count their votes is always suspicious to me.  Either willful or just unintentional incompetence.",
         "As of 9 am this morning she hadn't",
         "Oh I know. What I mean is, and granted I understand this sounds paranoid, I’m suspicious biased actors may be trying to mess with votes while everyone is not worried cause he won to make it look like those states were closer than they actually were. Or to make them blue",
         ":/ and that’s exactly what worries me",
         "It's a legit fear.  But the rnc under Lara Trump is on the ball with the election security. Very surprised by how good she's doing.",
         "It's almost as it the Trump family is invested in the Republican party and the \"grifters\" the never trumpets and Ds keep calling them. \n\nBtw, if you're here and you voted for Harris, you're not a conservative."
      ]
   },
   "1gkzvuo": {
      "title": "Once Trump is back in office and the economy is moving in the right direction, the Republicans need to consider 2028",
      "text": "The momentum built during this election was incredible. People don’t like the direction the country was going, and they showed it by giving the Republicans the presidency, the senate, and likely the house too. Plus, there’s a good chance Thomas and/or Alito retire soon and give Trump another two SCOTUS picks (for a total of 5 Justices appointed by Trump).\n\nBut the Republicans need to not get complacent. Trump isn’t going to be the nominee in 2028. Whoever the Republican nominee is, they need to keep that same energy that Trump demonstrated in this election.\n\nWe haven’t had a Republican take office after a different Republican president since George H.W. Bush won the 1988 election after Reagan. We can’t let them do what they did these last four years again. We can’t let them undo all of the good things Trump is very likely to accomplish between now and January 2029. \n\nI really hope Trump gets us back on track after these disastrous last four years. I just don’t want to watch it all get undone again four years from now. ",
      "comments": [
         "JD",
         "JD tulsi and DeSantis all would have my vote as of now",
         "JD would lock it up for another 8 years if trump can put the brakes on and fix all this mess.",
         "IMO, they should put forth a woman who appeals to the same voters so that hopefully the first female president is one of us and it's easier to shut down the other side's talking points. By their own logic, if they oppose her in any way then they are misogynistic.",
         "DeSantis or JD.",
         "JD and Tulsi could be nice! But for now, we’ve got the man for the job! 🥳",
         "They have so many great options, but I would like JD, Desantis, tulsi. It’s really tough for me to pick one of the three. JD is probably the pragmatic political choice though. Assuming trump does well. If not, they’ll need a candidate that can distance themselves from him, and that would probably be Desantis.",
         "Tulsi perhaps? Is she ready?",
         "Not today. Today is for enjoying the fruits of our labors.",
         "I like JD and Tulsi.  About time we get some young, smart, articulate energy back into this, who can handle the media and leftist operatives well.  As a 60 year old dem turned independent who voted for Trump in this and the last election, really pleased with the results and the increased level of diversity within the republican camp, which belies the dem nonsense belief, which assumed that everyone would be aligned with their garbage identity and victim-based politics forever.  I absolutely hate what that party has become.",
         "It needs to be JD or DeSantis.",
         "They need to already be considering 2028. If we keep control of the house we need to fortify elections with mandatory voter id, the mass deportation of illegals needs to happen, and republicans need to get more involved at the grass roots level.",
         "Man. Take a day off and bask in the November sun. We’ll get to work soon. Nah. I like your hustle.",
         "DeSantis has my vote already. Get that man in the fucking white house!",
         "Hmm ... Trump reminds me of Hitler",
         "Agreed. JD is clearly the right choice. He can go into the hornets nest and leave without a single sting.",
         "No Vivek for anyone?\n\nNot pushing for him, just wondering everyone’s thoughts.",
         "Actually my thoughts as well. Tulsi would be a great candidate regardless of gender; which is the type of candidate you’d want for a first woman.",
         "Maybe. She needs a little time to grow. But I can see JD/Tulsi or vice versa someday.",
         "then you obviously don't know history",
         "and you remind me of a cry baby.\n\nnow stfu and get lost",
         "Vivek as as the VP.",
         "I'd vote for Vivek, but I think he might be a bit too philosophical for the average voter. He can speak as well as Obama but he really likes talking about abstract concepts, he's like the JP of politics.",
         "I really like JD but I prefer Vivek to be honest.\n\nI followed his campaign a bit and I found him to be very convincing.",
         "There will be a Stalingrad within 4 years, I stopped reading about the 3rd reich already, doing china now",
         "im literally clutching my pearls while typing this",
         "you are delusional. . . absolutely nothing of what you said makes any sense, you've created a boogy man in your head, he's already been president and nothing bad happened. in fact u could afford groceries and a house while he was president. \n\nEnjoy another 4 years of peace and prosperity, you don't deserve it"
      ]
   },
   "1gks0wo": {
      "title": "“Texas Will Flip Blue”",
      "text": "Glorious Photo 🇺🇸",
      "comments": [
         "r/texas on full lockdown right now\n\nIm not surprised they banned people who uploaded republican voter resources",
         "Ironically the (D)elusional loser in the Senate race was Colin Allred.\n\nAll red..!!  Lol",
         "Proud Texas voter!! My husband and I sent our absentee ballots 2 weeks ago from South Korea.  Keep Texas Red!",
         "Aged like milk",
         "Don’t Mess with Texas",
         "California and New York are closer to flipping than Texas",
         "On many subs you cannot type the word trump but you can type Kamala.\n\nThey’re melting down. And I’m bathing in the tears.",
         "These fools really thought because they were the loudest that they were the majority.",
         "Hell yeah Fort Worth. From Purple to Red this go round!",
         "You should be embarrassed to be a democrat. I think they owe you an apology for running a terrible candidate.",
         "Taking snaps right now for the records",
         "I voted in Austin - seems more purple to me there",
         "Im on long island new york. I expect (or hope) busses of ICE agents just walk town to town deporting all the illegals up here. My hour ride home has become 3 with more virginia and delaware and mississippi plates than the states themselves have!!! Forget the countless accidents everyday.",
         "The mark my words sub has been HILARIOUS",
         "I got banned from r/Texas they be reeeaally silent rn hahaha",
         "That’s what r/Texas r/Louisiana r/Mississippi r/Florida all said!! Meltdown incoming",
         "Nonsense",
         "Maybe in a twilight zone episode",
         "Reddit is delusional",
         "Lol",
         "Hahahahahahahahahahaha!",
         "It sure did... And the loons will ruin the trend that the Dems have been advertising by turning on the Latinos for the crime of voting red",
         "I'm loving it.",
         "Yeah. I just tried to reply to a thread someone started 1w hours ago and realized I couldn't because the thread was locked.\n\nThen I went down the list and every single one of them are locked.\n\nI think that is rather telling about how the other side is going to deal with their new reality.",
         "Jeez that sub is out of control.",
         "Love to see it. By far one of the most sensitive group of ban-happy over anything that doesn’t toe the line of the radical left agenda mods on the site. \n\nTo borrow one of their phrases, “ I hope they’re having the day they deserve.”",
         "Yup",
         "Good Job!!",
         "Waiting for the comedy acts of weeks worth of worthy Trump Deraingment Syndrome clips!!!",
         "Best part about the meltdown posts is you can ban all the bots.🤖 They make it so obvious. Surprised Reddit doesn’t recognize them.",
         "Like a bunch of cry babies that can't handle when they don't get their way.\n\nI almost dread the next four years due to how obnoxious they'll be. Almost...",
         "Like a bunch of cry babies that can't handle when they don't get their way.\n\nI almost dread the next four years due to how obnoxious they'll be. Almost...lol"
      ]
   },
   "1gkshv0": {
      "title": "Whoopsie Daisy ",
      "text": "Oopsie doopsie ",
      "comments": [
         "Her irrelevance from this day forward pleases me.",
         "To be unburdened by what has been",
         "Hope we never have to see this lady ever again. She can go back to being an alcoholic",
         "The look of falling from coconut tree.",
         "Awfully quiet on reddit this a.m.",
         "She was a terrible candidate and the media did everything they could to make her look viable.  She was so bad at answering questions, she only fooled the people suffering from TDS.",
         "I want to see how this smug individual handles the blowback now",
         "She’s such a knucklehead",
         "Love it!!",
         "Ugly.",
         "FKH",
         "I LOVE IT!!!",
         "“Hahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahshah.” -KDawg",
         "Deeply.",
         "That book tour going to be lit",
         "“We didn’t want to lose, but we did lose. And in losing we realized that losing is when you lose. But losing does not mean you lost, it just means that you realize what losing is.”",
         "After she certifies the election lol",
         "They’re coping as hard as they can.",
         "They’re so salty it’s hilarious"
      ]
   },
   "1gl1898": {
      "title": "Guess who’s back. ",
      "text": "",
      "comments": [
         "I FUCKING LOVE IT!!!!",
         "Back again!",
         "BOOM!"
      ]
   },
   "1gkwwjo": {
      "title": "Gotta love Reddit…the Presidential winner isn’t even a trending story",
      "text": "",
      "comments": [
         "You now have a newly Elected President and not an appointed one.",
         "\"AP calls election for Trump\" is literally the first headline!",
         "It's literally the first one, you show that yourself",
         "Reddit is full of lefty trash.",
         "really I see ALL OVER the page"
      ]
   },
   "1gkwbnd": {
      "title": "This is what Brett said",
      "text": "",
      "comments": [
         "This is the way."
      ]
   },
   "1gl26cw": {
      "title": "Oh-oh someone is mad",
      "text": "",
      "comments": [
         "TDS...find a cure",
         "Some people are a little slow",
         "This is one of many reasons why my mind blanks out Wikipedia donation request banners.\nI'd respect the TDS sufferer more if their edits were particularly witty or clever though, I can always use some more comedy in my life.",
         "The cure is JD Vance, and it will be available to you beginning in 2028."
      ]
   },
   "1gl0c0x": {
      "title": "It's so insane to me that these women only care about the ability to freely without consequence murder their unborn baby when considering policy.",
      "text": "",
      "comments": [
         "Pro abortion initiatives won in four states, and barely did not pass in FL (57% yes, 60% needed to win). Only SD defeated an initiative by a majority. Sad & evil\\*. \n\n  \n\\* Evil here being defined as the intentional and willful inflicting of pain & death onto others for your own gain & pleasure.",
         "Yep. Says a lot about the people who believe this is an important issue. It might also be a reason why they lost."
      ]
   },
   "1gktx4q": {
      "title": "People talking about Trump being a threat to democracy",
      "text": "There’s a bunch of people who are saying Trump is a threat to democracy. Ironically though, yes there were a lot of voters who thought someone was a threat to democracy but overwhelmingly those people voted for Trump, because they actually thought Harris was a threat to democracy not Trump. Idk how there was so many people who voted for Harris. I will say though that I won’t be able to rest easy until every vote is counted.",
      "comments": [
         "The Democrats using Stalinist tactics for the last 8 and half years to eliminate a political opponent are the true threat to Democracy and our Republic.",
         "Weaponizing the DOJ against a political opponent, weaponizing the FBI against parents at school board meetings, disenfranchising 14 million voters who voted for one candidate and then replacing the guy they voted for with a candidate they wanted is the real threat to democracy. They literally ignored the votes of their own people. That is the textbook definition of anti democratic.",
         "They meant to say threat to their bureaucracy",
         "People who think this also think having a Commander in Chief with dementia is somehow NOT a threat to national security.",
         "Not to mention an attempted assassination",
         "If anyone actually believed that the whole country wouldn’t have elected him",
         "Vast majority saw through the state propaganda put out by the MSM.",
         "Says the party that completely circumvented the electoral process. Whatever!! We are back baby!!",
         "They overplayed.  When the middle can’t overlook the lawfare and media manipulation of reality anymore, then the doubling down on the hate rhetoric and fear mongering starts to backfire.",
         "This time they won’t be able to sabotage his presidency with Russian collusion investigations",
         "In a fair election, sure. But they cheat. A lot. And that's how we got Biden."
      ]
   },
   "1gkjep4": {
      "title": "Trump!!",
      "text": "",
      "comments": [
         "It’s fucked up it’s even this close lol. 47 percent of Americans are that stupid??",
         "I don't believe that chart at all. I bet less than 30% really think Kamala is better for the economy. I bet the methodology on that poll never gets published.",
         "Yeah it being this close is fucking scary. \n\nAlso that bottom ribbon showing 43% say finances are worse today vs 56% saying they’re the same or better is not good for Trump, and I’m waiting it as someone who wants him to win. Looks like that’s just for MI though.",
         "It’s an NBC poll so doubtful it’s accurate.",
         "Gullibility would seem to be at a record high…",
         "Yea they are",
         "To vote for her, yes they’re are, still 🤦‍♀️",
         "Atleast a majority have common sense",
         "30% are, yes. The rest are just that checked out/ undiscerning."
      ]
   },
   "1gl3ke0": {
      "title": "Woman Cries Over Trump’s Victory, Claiming There’s No Hope for Her Body’s Future",
      "text": "",
      "comments": []
   },
   "1gl24cg": {
      "title": "The Jesus Movement in the 1960s converted a lot of hippies. Trump is securing the modern New Age/Rogan vote. Here's why that's important to conservative dominance going forward.",
      "text": "",
      "comments": [
         "Here are some famous and *influential* conservatives aligned to this movement. Some are still new age and others are converting to Christianity.\n\n1. Joe Rogan\n2. Jordan Peterson\n3. JP Sears\n4. Brandon Russell\n5. Aubrey Marcus\n6. After Skool",
         "Cool"
      ]
   },
   "1gkyc0w": {
      "title": "Look what I found",
      "text": "",
      "comments": []
   },
   "1gl16fc": {
      "title": "Discussion; REALISTICALLY, do you think Kamala Harris will be selected for democratic nominee for next election?",
      "text": "How compelling is she as a candidate for the average democrat voter vs her expected/potential competition?\n",
      "comments": [
         "No. She wasn’t even selected for this one lol. She took control after a back door coup.",
         "When challenged, I think she’ll cry racism and misogyny at first, and say she wears the mantle and the nomination should be hers. \n\nBut she’ll be drowned out by any candidate who can speak without a script and handle a presser.",
         "She'll have to win a primary this time, so no.",
         "She’s going to be getting the Biden treatment very quickly. She’ll be shunted off to the side and blamed for Trump’s re-election. (Not wrongly. She was an abysmal candidate).",
         "Hell no. They’ve run the three worst presidential candidates in history.",
         "No. In fact if they had a primary this election she would not have been picked. She is grossly unpopular.",
         "Not a chance.",
         "Any reason this is getting downvoted lol?\nI obviously don’t want her to even run. \n\nI’m asking for others’ opinions, as I am only aware of my own perspective.",
         "Nope",
         "HA!!! nah.",
         "Possibly, because she and people like her won’t learn from their mistakes.",
         "She will be one of the pack and will drop before her first primary.",
         "I don’t think the dems wanted her anyway. It was a last minute switcharoo forced on them. She would fail and has failed a primary within the party. \n\nI’d love to see it though. She was a train wreck.",
         "She will be an outcast in the Demoncratic party.  She was a terrible candidate and failed her mission, they are not ones to forgive and forget.",
         "No way !",
         "No, the first primary she ran it she did terrible. Joe had to pick her up from nothingness and make her VP as he can say he has a black woman as VP. Only reason she even got that close to the presidency is because they forced Joe Biden out and forced her in.",
         "There's literally 0% chance this happens.  They won't even let her run in the primary; at best she'll do a short stint as a MSNBC contributor but no one likes her so that'll last 2-weeks.",
         "Not if they have any interest in winning.",
         "She was a last minute choice forced by the DNC wanting to keep the 100 million $+ they got under the Biden campaign that could only be used by the same campaign. So absolutely no chance of her being the nominee next time.",
         "I doubt she’d survive a primary. We’ll have a better idea of who by the midterms.",
         "No.",
         "I think any job in public service is probably over for her at this point. She was just a tool used by the DNC.  Sadly, that is just the game in D.C.",
         "Hell no.",
         "Gavin Newsom is feeling pretty good right now.",
         "Not a chance. Not only that but I don’t think we’ll be seeing much of her anymore. Her career is going to fade off quickly now",
         "I hope so.",
         "I just worry that democrats will feel like they were close this time and people are already familiar with her.",
         "I think you hit that pretty spot on. \nI don’t want to see her run in the next race.",
         "Brigaders. They hate that our guy won. They hate he won the popular vote. They hate Rs have control of the senate and more governorships. They just hate.",
         "Yeah, everyone knows what racist, dementia ridden Joe was attempting there lol. \nThe worst part about these recent democratic candidates is that they are complete chameleons. \nThey take on different acts for certain groups and it’s really frustrating to see because they often get the votes of people I’m certain they don’t actually care about.",
         "Ya and Dems stayed home and didn’t vote for her. She’s done politically unless she runs for senate.",
         "But she wasn’t close at all. The margins for her were terrible compared to 2020",
         "They were so far off they lost the popular vote for the first time in twenty years to someone they called a Nazi.  Her career is done once they realize they can't blame the electoral college and begin blaming her instead.",
         "I do. Another free win.",
         "Oh it’s eating them up for sure 😂😂😂",
         "“Feel like” they were close\nThey were ahead in many polls\nBut we did indeed win by a mile."
      ]
   },
   "1gkebyp": {
      "title": "I plan to call the race in a few minutes.",
      "text": "",
      "comments": [
         "Most accurate map we have at this point in the vote count!",
         "Is the yellow piss?",
         "The Sasquatch vote in the Pacific Northwest is severely under-represented.",
         "More accurate than CNN, MSNBC, and Fox.",
         "Libertarians are showing up more than I would have expected.",
         "This may be the best election map I've seen ever.",
         "Nailed it, bro.",
         "Well, you’re clearly not calling it for Kamala because you *used* the crayons instead of eating them.",
         "Without piss, blood, and finely-ground lawn signs we’d all be in the dark.",
         "JEB!",
         "Truth!"
      ]
   },
   "1gkq5l5": {
      "title": "“We Believe In All That” — the poetry of Kamala Harris",
      "text": "Some quotes to inspire us all",
      "comments": [
         "Pathetic.  Just like Kamala!"
      ]
   },
   "1gk9jde": {
      "title": "Trump closed the gap in Guam and Republicans may flip the legislature",
      "text": "",
      "comments": [
         "Oh wow! “I hope the island flipping does not drown the residents!!!” Hank Johnson \n\n/s",
         "**Context**\n\nWhile Harris will win Guam's straw poll, Trump appears to have closed the gap by ten points compared to the last election. There's also indication that republicans will either almost or will flip the Guam legislature. This may be a harbringer for results to come.\n\nOr polls are still shit.",
         "High energy Jeb never gets old.",
         "Hafa Adai!",
         "Who has ever actually been polled? Anyone know how they work. I can’t find a single person that has been polled In regards to the election",
         "I polled your mom last night.  Ask her.",
         "I don’t know. I’ve been a registered voter for 23+ years and I have never been polled. \n\nHere’s the kicker, polls are not as scientific as presented. They send out a certain number of surveys to a certain area. So if the demographic is all one political leaning (i e. a liberal/conservative city) then of course it’s not going to be surprising the surveys will come back mainstream for that area. \n\nOne other subjective issue is the fact that polls affect polls. In other words if a poll says XYZ is popular, but just those surveyed had that opinion, then it’s a false equivalence. Polls have and will most likely be just a sociological construct of its own making. And that is why  political scientists don’t really consider just polls but mix them in with other more concrete evidence. \n\nIt’s a mess. And it’s a political tool and that’s it. It’s waving a flag of whatever the political agenda is for a specific purpose. It’s not informative, it’s disruptive. We need them but we shouldn’t lean into them.",
         "How was it? Helpful? Fun? Educational? Or just raw goodness?",
         "Ouch. That’s cold blooded. Very original though.",
         "Low hanging fruit.",
         "Yummy."
      ]
   },
   "1gkm118": {
      "title": "This is the Official DailyWire Election Link",
      "text": "",
      "comments": [
         "Fantastic content, I’ve been watching for 3 hours now"
      ]
   },
   "1gju17q": {
      "title": "I had comments deleted, being called a bigot, even the ones I know didn't believe me. But I was right ",
      "text": "",
      "comments": [
         "Everybody just stood around and let this dude beat on women. The left was full blown protecting him. Micropenis recognizes micropenis I suppose.",
         "Enough time has passed that no one cares anymore, particularly the ones that scolded you for being right. It's kind of the playbook, as the same thing happened with COVID.",
         "I remember reading leftist say she was born a woman and tried to make people feel bad for her. Turns out she was a man all along and they just lied like they usually do.",
         "Hahaha the ole micropenis. I’d probably want to beat women up too if my dick was described as an enlarged clit 😂😂",
         "I  read that this morning so others did as well! Good job.",
         "Because truth, actual truth is inconvenient at best and unnecessary at worst.",
         "I mean I would be mad if I had a micropenis but I wouldn’t beat women",
         "She is a woman",
         "that's how everything in society is. it literally makes me sick.",
         "So will the medal 🏅 and title be taken away from him.",
         "Honestly bro. I can’t imagine that life but women deserve respect and love 🫡",
         "XY chromosomes does not constitute a woman.",
         "Whatever the voices tell you my dude.",
         "No HE'S not",
         "Did you read the article?",
         "But what is a woman?",
         "r/hownottogiveafuck",
         "What?",
         "[removed]"
      ]
   },
   "1gjxi1y": {
      "title": "Kamala's hats selling like hotcakes???",
      "text": "In New York, you see Trump/MAGA hats go for $18< minimum. I guess Kamala is doing \"sOoOoO gOoD\", that they gotta sell her caps for 2bucks each.... isn't that how supply and demand works???",
      "comments": [
         "I have never seen a Kh hat.  I just began to see a couple of signs recently.  Maybe 20 : 1 in favor of trump tho.  I'm in Ga.",
         "Still overpriced.",
         "The subsidies too lol",
         "Just because people aren’t buying random nick nacks from 3rd party vendors doesn’t mean their candidate isn’t doing well. It’s honestly kinda cringe seeing people with a politician’s name all over them/their house",
         "*sigh*\n\nTrump supporters tend to be much more enthusiastic to the point of purchasing any and all merchandise that sports his name. \n\nJust because other politicians aren't pimping their name doesn't mean they don't have support."
      ]
   },
   "1gj64bf": {
      "title": "Meme I Made ",
      "text": "",
      "comments": [
         "Shouldn't it be screaming in a baby's face?",
         "Very unrealistic. Where is the blue hair?",
         "Sad but true. Gonna have to win by a big margin to overcome the fuqqery that is gonna happen tomorrow.",
         "They had to look like that to vote too",
         "Imagine them being known as the delusional TDS generation 🤔"
      ]
   },
   "1gj1ppp": {
      "title": "Ok, last one.",
      "text": "",
      "comments": []
   },
   "1givkl4": {
      "title": "No one on that list will ever have their name released.",
      "text": "",
      "comments": []
   },
   "1giq5d9": {
      "title": "Election Coverage ",
      "text": "Does any one know if you need a subscription to watch their election coverage?\n\nThanks,",
      "comments": [
         "I'm quite sure it'll be on YouTube for free, all of their post election coverage was free on YT as well.",
         "Don't forget Rumble.  No need to give views and subs to YouTube.",
         "Sweet! Was it live on youtube? I always listen to the post analysis on Spotify. I want to find live coverage on Tuesday as I don’t have cable or anything",
         "You’re not “giving them to YouTube” you’re giving them to the channel you are watching on YouTube. ",
         "I'm fully planning on watching it on YouTube live. I'll be shocked if it isn't.",
         "Anything right leaning has been demonetized by now.  It all goes to Google.",
         "That’s definitely not true. "
      ]
   },
   "1giftzj": {
      "title": "What even is reality anymore?!",
      "text": "Dear God I wish I had a time machine. I would go to 2 days after the election and be like: oh you think this is nuts. Have I got a story for you.",
      "comments": [
         "Trump needs to save squirrels 🐿️",
         "The 2020 election*",
         "We have a yard squirrel named Larry, seeing this I want to bring him in an fully adopt him 🥺"
      ]
   },
   "1ghz3g9": {
      "title": "No lie is detected",
      "text": "",
      "comments": [
         "Poor Squirrel killed for being a star.",
         "#justiceforpeanut",
         "Normally, I would’ve ignored this story while sympathizing with the owner, but the fact that violent felons are actively ignored by police in the sanctuary cities is what gets to me.",
         "When you lack skills, you have to select the tasks you are successful at.   Fight crime?  Too hard.  Bully children?  Doing that their whole life...",
         "Nuts Out 🫡🥜",
         "Can I get context please?",
         "He was killed for being a Republican!",
         "SAY IT’S NAME",
         "No. NY State government kidnapped and killed someone's pet squirrel. Be angry. But in all seriousness there isn't much more to it than that.",
         "https://www.usatoday.com/story/news/nation/2024/11/01/peanut-the-squirrel-euthanized/75992420007/"
      ]
   },
   "1ghyjj2": {
      "title": "How The Kamala Camp Is Reportedly Manipulating The Internet To Fake Support And Spread Lies",
      "text": "“On Reddit, Harris staffers allegedly direct volunteers to post specific content to specific threads, and up-vote or down-vote certain posts – effectively spamming threads and seemingly breaking platform rules. The apparent goal is to make Harris appear more popular than she is, and promote content that helps Harris, even if it’s not true. For example, staffers have allegedly directed the boosting of Project 2025 content, which they tie to former President Donald Trump, even though Trump is not connected to the plan.”\n\nI, for one, am shocked!",
      "comments": [
         "Not surprising in the slightest. Reddit is a leftist cesspool.",
         "Yep. Even the “posts you may be interested in” are all posts about Trump being bad or harris being the messiah, even in completely unrelated subreddits - different cities, sports, travel, etc. I block every one of them and they keep showing more. \n\nThey’re fighting hard to make it seem like there are people who actually support her.",
         "You can see it everywhere. Especially red state subs where someone “votes dem” for the first time ever like it’s their first CrossFit workout and it’s appropriately upvoted by a fake brigade new accounts and some of the softest “me too” comments",
         "I remembered when people used to post on r/pics things like \"Trump acting creepy\" BUT WHEN I posted pics of BIDEN being creepy they deleted it because \"is political\"",
         "Yep, everyday I see these insane Left wing posts with huge upvotes.  They are speaking in an echo chamber though, so hopefully it’s a waste of their efforts.",
         "Propaganda machine is real there's a lot of money involved.",
         "I see daily ads ok tv from Kamala's campaign talking about project 2025 bullshit, despite it being outright lies. Arrested for birth control, ivf banned, national abortion ban, etc. All of it is utter bullshit. That is in top of the \"Hello fellow Republicans,\" ads that show various people claiming to have voted Trump in the past 2 elections but won't in the next, each one playing the same \"rich as hell\" sound bite. Its so ridiculously obvious they are actors since the script is damn near identical regardless of who the \"Republican\" is.",
         "I posted on something where they were blaming Republicans for all voter fraud, when I countered I was told I need a source, when I supplied a source they didn't like i was told I was going to be banned for posting false information. When I asked why they didn't need a source, I was told it was hyperbole. Morons run those subreddits.",
         "[r/AdviceAnimals/](https://www.reddit.com/r/AdviceAnimals/) <-- the whole sub is turned into a democrat pro meme generator. Its dystopian.",
         "This was obvious (not that she was behind it, but that something was fishy on this platform) immediately after the failed Biden debate. TDS propaganda started popping up in weird places like food and other completely non-political subs",
         "They're just trying to make it believable that she could actually win. So if they cheat, they'd point to how \"popular\" she is in the internet and media. Of course, the few sheep that actually support her would believe the lies  like they've always have.",
         "I am not shocked by anything the Democrats do or say. They will literally do anything to win an election, including lying and cheating.",
         "Reddit is ruined and I’m not sure why I even open it anymore. This is the only good sub.",
         "Uhhhh check out Reddit.",
         "This seems like a pretty common political tactic in the modern age. Are there any campaigns in the last 15 years that don't have a social media team that do exactly this?",
         "And every benign subreddit. Like r/pics ....totally inundated with lefty garbage posts. It has to be curated or bot content.",
         "When there is a pro Trump post or questioning the status quo - it is sent to internal messaging and then swarmed with downvotes.",
         "The cesse`est of pools",
         "It’s funny because Kamala is literally the least exciting or inspiring person. She’s just an empty vessel that the machine got behind.",
         "The amount of \"I've always voted republican... until today!\" Posts are funny",
         "Maybe normal people don't support Donald Trumps constant vomit of lies. Like how he just said he never tried to repeal affordable Care AKA Obamacare when he literally tried to do it his entire presidency, but don't worry he's got a concept of health care. It's taken him 9 years to get to a \"concept\" of replacing the affordable Care act. Hope none of you guys are on Medicare etc",
         "I totally agree. Thank you for the post!",
         "This and r/criticaldrinker are it",
         "This is different. Reddit is a broken system. The subreddit enlist Super Left moderators that ban anyone with an opposing post. \n\nThis is not just enlisting people to post the opposite.",
         "That one is one of the worst.",
         "A lot are paid actors and there's a lot of blind followers in there, that's where you get all that. So yeah there is some of the people. I don't agree with any political party at this moment. They're all in a big club and we're not in it. Just wish people would see that.",
         "Explain this to me, because what you're saying is not what is reported in the article. What specific subreddit enlists Super Left moderators that ban anyone with an opposing post? \n\nWhat exactly does it mean to 'enlist' them? \n\nWhy do the existing moderators need to \"enlist Super Left moderators\" for their subs to ban people? Can't they already do that themselves if they wanted to?\n\nHere is what the article claims: \"On Reddit, Harris staffers allegedly direct volunteers to post specific content to specific threads, and up-vote or down-vote certain posts – effectively spamming threads and seemingly breaking platform rules. The apparent goal is to make Harris appear more popular than she is, and promote content that helps Harris, even if it’s not true. For example, staffers have allegedly directed the boosting of Project 2025 content, which they tie to former President Donald Trump, even though Trump is not connected to the plan.\""
      ]
   },
   "1gi8irs": {
      "title": "Does Matt Walsh know about the movie Tusk?",
      "text": "",
      "comments": [
         "Im asking this because I know he wrote the book Johnny the walrus and I would love to see him have to review this movie on the show.",
         "Probably not but he absolutely should"
      ]
   },
   "1ghgmk9": {
      "title": "Hey, fellas! Hey!",
      "text": "",
      "comments": []
   },
   "1gh4e8h": {
      "title": "Chicago Police announces hate crime, terror charges against gunman accused of shooting Orthodox Jew",
      "text": "",
      "comments": []
   },
   "1gh2gct": {
      "title": "Has anyone watched the documentary “Am I ra*ist?” from the DailyWire+?",
      "text": "What is everyones thoughts on the docum\nentary from the DailyWire+ Am I ra*ist?? \nInterested in hearing everyones thoughts and opinions!!\n",
      "comments": [
         "Saw it in theaters, was refreshing to hear so many ppl laughing lol",
         "I watched it last night with my boy. There are some really funny scenes. Matt exposes leftist DEI activists for the grifting devisive idiots they are.",
         "Saw it in the theatres. Excellent documentary.",
         "I loved the movie and he made excellent points about how far too far überwoke has become. I kinda wish he hadn’t been such a jerk because this could have otherwise been a great recommendation for friends, colleagues and others at my church who really need a wake up call. Unfortunately I can only recommend to those who already know. Ya know?",
         "It's a really funny yet uncomfortable movie. It shows how outside of reality people are, and how many hoops people will jump through to stay in that \"safe space\"",
         "I watched in theatre. It was good for what it showed, I didn't think it was amazing. I've known these people hate America and white people for years, so no revelations. Glad it was made so people still asleep can wake up.",
         "Not yet.",
         "Took my mom to see it in the theater. We had a blast and we were happy to see a nice variety of people in attendance.",
         "Yes it was good.  Not great.  But “great” is a tall order for a mockumentary",
         "I’m itching to watch it! It looks so good! Hope X lets it be seen for free again like they did “What is a woman?” DailyWire needs to get into video games too.",
         "I watched it earlier this week.\n\nI didn’t find it nearly as funny as “What is a Woman?”",
         "My dad and I plan to watch it once he's back from vacation.",
         "Not yet, I’m waiting until my three day weekend coming up to do a free trial and watch it + some other stuff to see if upgrading is worth it (I’m sure it is I’m just poor and saving for like 3 different big things right now and this is unfortunately the lowest priority for me currently)",
         "It looks so fucking great I can’t wait to watch it",
         "Yep! It was pretty funny, though not as substantive as \"What Is A Woman\". I think Matt let some bits last too long that took me out of the moment a few times, although bumbling oaf humor just isn't for me so maybe that's my fault.",
         "Are we censoring \"racist\" now? Even though it's in the name of the movie?\n\nIf we are, can we pick a less important letter than the one that makes the word look like \"rapist\" instead lmao",
         "What's under the asterisk? Is it a 'P'? I hope not! Not you, Matt Walsh! Nnnooo!!!",
         "Loved it. I liked it better than, \"what is a woman?\" bc it was just a straight up comedy. The workshop scene was hilarious and probably my fave part. That or the robin interview.",
         "I'll see it one day. Eventually...",
         "I usually don’t like Matt’s content. This was good but I feel there was too much of him in it.",
         "Right? Some of the people there were even younger than me, and I'm 30 years old! It was heartening, to say the least.",
         "yess!!",
         "Fully agree. What Is a woman had a bit of this to real you in early on, but then really jumped into the deep water on how much damage it's doing.\n\nI kept waiting for that transition but it never really got deeper than \"LOOK HOW LIBERAL THE CHERRY PICKED MOST LIBERAL PEOPLE WE FILMED ARE\"\n\nthere were no deeper revealing statistics/2nd layer harm/messages, was entirely a gotcha. But i loved that lady giving $32 reparations 🤣🤣🤣🤣",
         "Oh, I didnt even know it was in theaters?! I saw that it was on the DailyWire but you need a subscription. interesting. but yes, its about time people wake up! I feel the media has always been trying to turn us against eachother!",
         "I wonder if there is anywhere we can watch it without getting a subscription to the dailywire+?",
         "I didnt see a downvote on my end. Did you accidentally press it? lol",
         "I want to watch that one even more I think lol",
         "Other than this and what is a woman, anythinh else I should be checking out?",
         "i want to watch that one! is it on dailywire+ too??",
         "I'm 36 and was one of the older people there. It was awesome.",
         "Just got a 1 month membership to watch these.  Saw what is a woman last night.  The first 25 min or so was…meh.  I only needed about 5 min of it.  When he started getting into the damage it’s doing and when Miriam Grossman got into the history of it, that’s when the film took off in a good direction.  Just traveling around annoying people is fun for YouTube but getting to that substance is what documentaries are for.  It is hard to balance the two; I just wish it didn’t take so long to get to that substance.  I’m hoping “am I racist” is better.",
         "I have the subscription,  I just didn't watch it yet.\nAnd why on earth was I downvoted !?",
         "No.\nI suspect some Kamalabots are downvoting me now automatically.",
         "Worth the watch. I loved it",
         "Mr. Birchum looks funny as hell if you like adult animated comedies, and Run Hide Fight looks like a good drama! I also just love Michael Knowles, so I’d definitely binge some of his show on there.",
         "Its not unfortunately. If you thought first 25mins was rough, get ready for 75mins here",
         "it doesnt show a downvote for you on my end!",
         "Now I am +1.\nMaybe it was a mistake \nMaybe someone upvoted me.\nMaybe someone is messing with me."
      ]
   },
   "1ggonr5": {
      "title": "Trump sues CBS News for $10 billion alleging 'deceptive doctoring' of Harris' '60 Minutes' interview ",
      "text": "",
      "comments": [
         "Good. At this point, all the legacy media outlets run a single identical story 24/7 — \"toe the party line, or else.\"",
         "Good! I hope he wins!",
         "He is ridiculous! Chances of this going anywhere are 0 to None. They won't countersue as even if they do win he'll never pay or be in a grave before it finishes appeals.",
         "You guys remember that Fox News/ Dominion defamation lawsuit? I’ll be flabbergasted if theres not at least a 787 million settlement here. Im from Michigan, even our liberal Secretary of State is acknowledging the problems their shit machines are having in early voting. If defamation was the claim for Fox, this CBS lawsuit should be fraud.",
         "Doesn’t necessarily matter for him, It brings more attention to what happened."
      ]
   },
   "1gg0mnq": {
      "title": "It's a dirty job, but someone's got to do it",
      "text": "",
      "comments": [
         "Mike Rowe, Donald Trump is coming for your job!!",
         "Hauling off all the subreddits I’ve muted due to politics.",
         "What an absolute mad lad",
         "Fucking epic 🇺🇸",
         "Im actually a garbage man and it is oddly satisfying to see Trump in a trash truck. Its a thankless job where everyone needs you but treats you like dirt.",
         "I was waiting for it. Garbage people (even properly gendered) here to take out the trash!",
         "Time to take the trash out of the white house",
         "Woof",
         "Mike Rowe for Secretary of Transportation",
         "I wait until I’ve been banned from commenting then I mute them.  I find it more satisfying",
         "Everything they do only makes him more powerful"
      ]
   },
   "1gg0s7t": {
      "title": "The vast majority of reddit despise us it seems.",
      "text": "",
      "comments": [
         "One side unironically calls half the country *literal trash*. The other side makes silly jokes and rides around in a literal garbage truck.\n\nIt really speaks volumes. Deplorables: Part II",
         "Fuck em.  Have you read the articles on the reddit astroturfing?  If not read them and you’ll know why.",
         "I don't care I love Chick fil A",
         "Ah, yes. Because going out of your way to Other your political rivals and dehumanize people is the moral and good thing to do.\n\nBut of course lol",
         "The Bible is the icing on the cake…\n\nThe left isn’t even trying to hide its bigotry at this point.",
         "Why do they have such disdain for Christians, yet are terrified to speak out against other religions? Is there a label we can come up with for the Christian faith being persecuted out of sheer hate/intolerance? The left absolutely **hate** being labeled something negative. It's their kryptonite 😂\n\n6 more days...",
         "Let the cultists boo us. We've seen what makes them cheer. If they're unhappy, things are moving in the right direction.",
         "man what did chick fillet do?",
         "The vast majority of Reddit is full of bottom feeders",
         "They despise the idea of us.\n\nIt’s part of the media “othering” anyone who doesn’t agree with them.",
         "mostly bots",
         "There is a paid VERY VOCAL minority who do. They will dry up in November after the paychecks stop rolling in.",
         "I DON'T have a Confederate battle flag heart tattoo, but I DO like Chick-Fil-A...guess that's their problem, not mine.",
         "Bahhhaaha. Reddit is 90% liberal leftist.",
         "That means we are doing something right.",
         "Just a bunch of basement dwellers who scream, bitch, piss and moan online to complain about everything else for their shitty life decisions.\n\n\nI wouldn't look too much into it.",
         "And Chick-Fil-A? Damn if you can’t eat a sandwich from there your priorities are all fucked up.",
         "These look oddly similar to those kamala in an eagles jersey adds that were put up in Philly, before the eagles had that ripped down.",
         "Only 40.3k upvotes wouldn't even be half of the nation's voter pool",
         "Chick Fill A is great bro!",
         "It’s funny, I’ve seen a lot more left wing crap pushed into my feed here lately too. Couple that with this nonsense and it becomes just tiring at times.",
         "Reddit is a left-wing cesspool",
         "That's fine; the feeling goes both ways.",
         "How dare I like chic fil a or have a Bible?",
         "Reddit is a freakish amount of bots. I wouldn't sweat it.",
         "For sure. Full of basement dwelling “victims”.",
         "NYC FOR TRUMP!",
         "I wonder how many liberals stroked out during the Trump MSG rally? It must have been a beautiful thing to behold.",
         "Bots and bootlickers without an original thought, oh no……",
         "It’s ok to be hated/disliked by those possessed by ideology",
         "Never thanked god faster than thanking him for being vegetarian.🙏🤍",
         "This is from years ago\n[Keep NYC trash free](https://www.snopes.com/fact-check/nyc-sanitation-posters/)",
         "May we all SeekTheLordsFaceForANewHeart",
         "There’s no new information here.",
         "The \"Be Kind\" people are incredibly vicious and hateful, right?",
         "Yeah I usually just call them stupid but now we're trash, garbage, Evil, racist, all kinds of ists and we want to take everyone's Rights away. What's bad it's not just the propagandists saying that but normal people. It's because they're dumb",
         "To forgive and love your enemies is the hardest thing to do, which is one of the core teachings of Jesus Christ.",
         "And chik fil a does really well in NYC so this is doubly funny.",
         "“The tolerant left”",
         "They don't have to.  They've \"captured all the flags\" so to speak: gov't, academia, media, \"science\", corporations.",
         "They'd never do that with the **Qur'an**. They'd rather go after the peaceful religion that doesn't behead people.",
         "Alright Rick. I'm with you.",
         "It was started by a company with strong Christian morals hence why they’re closed on Sundays.",
         "Donate to religious corporations that are against LGBT",
         "I was wondering about that.",
         "Keep telling yourself that",
         "Ah I didn’t know I thought it was recent thanks",
         "They only mean their team. Which is why the teachings of christ are so profound in that they pierce human nature.",
         "Deus Vult! /s",
         "The tolerant left is the most intolerant people I’ve ever encountered. And I’ve been to Sharia Law Caliphates",
         "Not any more.  New leadership, made a big deal months back about donating to LBG stuff.",
         "Keep telling yourself you're the good guys.",
         "When I see the \"Be Kind\" signs, I always say in an undertone, \"... or else.\"",
         "SELAH",
         "Same",
         "That's very unfortunate",
         "the bots found me…",
         "😂"
      ]
   },
   "1gg4gwg": {
      "title": "Harris Campaign Caught Manipulating X To Censor Criticism",
      "text": "",
      "comments": [
         "The Harris campaign is very active on Reddit.",
         "Won’t matter. Most of us are numb to the media now.",
         "I don’t even comment on Reddit anymore. \n\nEveryone is a liberal pussy who can’t handle the truth.",
         "I am on the discord server and can view the chat, if anyone wants to verify anything (like if you want to know whether you were targeted).",
         "And water is wet.",
         "Maybe that’s why my account was permanently suspended last night. I can’t even deactivate my account",
         "X, like other media, is still managed by Commies. Musk might boast about free speech but his employees at X monitoring posts are third rate, notorious censors of free speech. Musk’s all the claims are false. For example, my account under old Twitter which was banned for life was not revived in spite of appeals. Likewise, my new X account has been banned forever for the post” dead communist is a good communist” saying that it promotes violence!. X and Musk both are frauds misleading people",
         "Oh shit yeah….\n\nBetween bots and the paid psychos…. They are everywhere.",
         "Yes they are.  And really disgusting as well.",
         "Waaaaaa, I can't promote violence on a platform that I says I can't promote violenceon their platform. \n\nGet outta her ya ya fucking dolt.",
         "I mean they have a point with the communist thing…",
         "There is still a TOS, if you don't want catch a ban read it and don't break the companies rules or word what you are trying to get across a little smarter.",
         "“There’s still a TOS” how’s it feel being the dude from Chappells show that fucks with his pajama pants still on?"
      ]
   },
   "1gfwoxh": {
      "title": "Non-Citizen From China Charged After Casting Ballot In Michigan. His Vote Will Still Count.",
      "text": "",
      "comments": [
         "So, what would have happened if he hadn't called to ask for his ballot back?",
         "If only there were some....thing that people could have prevented this from happening. Some sort of paper or something, a card if you will, that the people working the polls could check.  Something to identify the voter as a citizen or not a citizen. I'm sure there's got to be something out there that can be used for this....",
         "And when will this student be on the first thing smoking BACK to where he may vote for the CCP?",
         "Ancient Chinese proverb:\nIt’s easier to cheat and ask forgiveness than get ID and ask permission… idk… I tried.",
         "Because of the anonymous nature of voting, it's pretty impossible to undo his vote. Otherwise they could track your vote back to you.",
         "The fix is in.",
         "Nope, and his vote will still count.  Also, the sky is blue.",
         "Fascist… /s",
         "Sounds like this fella from Germany a few years back"
      ]
   },
   "1gflxxu": {
      "title": "Swiped this somewhere. ",
      "text": "",
      "comments": [
         "From the same people calling Trump voters “weird”.",
         "😂😂😂 resorting to witchcraft is a new low for the DP.",
         "Lightning bolt! Lightning bolt!",
         "Keep praying!",
         "He has plot armor",
         "Pepe protection",
         "Lmao. I’m sure this isn’t real, but it’s still funny to read. Reminds me of that south park episode.",
         "Witches are a special unhinged. About 20 years ago, they were about \"love and light.\" But then they decided they didn't like that spiritual principle that they should be punished for curses and abandoned the belief of something called the three fold rule (basically karma).\n\nThat's right: they basically rewrote their religion because they didn't want to face consequences for immoral actions.\n\nAll the love and light witches basically gave up witchcraft and became new thought (which is a Christian heresy, but still aligned with Christianity rather than occultism). Interesting that they became more Christian, not less.",
         "This is even more ridiculous when you realize it came from a “Christian” “news agency.”",
         "Yes!",
         "I feel like this sub is literally the only place I can get away from the crazy.",
         "Amen",
         "Not sure it’s new for them.",
         "My first time hearing about it but you’re probably right",
         "They actually have a “spell” that was written by some dude back in 2016 during that election. I think it’s called the Blue Wave spell or something like that. If you want a laugh, go look it up. It’s literally the dumbest stuff I’ve ever heard."
      ]
   },
   "1gfdaov": {
      "title": "Facts",
      "text": "",
      "comments": [
         "You can tell Reddit is a left leaning app for sure",
         "I watched my dad explain heels up Harris to my mother awkwardly.",
         "It's insanity out here. The trump derangement syndrome is in full effect. The symptoms are at an all time high, people are losing their minds.",
         "This is the same redditer that calls Republicans weird",
         "True , I've been banned from a few groups for saying  her only  job history is 🍆🫨 history.",
         "I don’t care what they look like; I’d actually prefer not to see them",
         "DNC poll watcher. I bet \"she\" is totally honest",
         "Put that under a spoiler next time please and thank you.",
         "That guy needs Jesus ☹️",
         "I think I defeated... **that**... in an early Final Fantasy installment.",
         "True",
         "Spot on.",
         "No facial hair?",
         "Jesus is that photoshop??? Tell me that’s photoshop. For the love of god there’s no one this screwed in the brain is there??????",
         "Kamala should slow down on the genocide if she wants to be president.  Also, body autonomy for all, no more mandatory experimental \"vaccines\" .",
         "Halloween costumes are scary this year....oh that's their everyday look. Bless...it's heart.",
         "Probably the CEO",
         "Oh seen this thing on tik tok. It belongs in an institution.",
         "So that's the freak that dinged me last week?",
         "Lol check out /rant.    https://www.independentsentinel.com/complete-fraud-harris-set-up-phony-reddit-posts-to-look-popular/",
         "I just got banned from r/politicalhumor when I poked fun at the left.   I guess the subreddit should be r/nopoliticalhumor.",
         "The next Secretary of Transportation....  or any other dept.  DEI baby!   Got Kamala the VP nod.",
         "I mean…prove the meme wrong",
         "This is why mail in voting is so important.",
         "HHAHHAHAHAHAHAHAHHA",
         "#BigFacts",
         "Why would Daily Wire delete posts that were critical of Harris?",
         "I love Hogatha! She cracks me up always listen to her channel and hope she starts streaming on Rumble in the future.",
         "Hilarious!  I disagree with Harris on basically everything but I’m afraid for Ukraine.   I wish he would pledge to not turn his back to them.  Just months ago he said he would help them but on a loan in which they would pay us back.",
         "What’s frustrating too is it’s hard to tell how many reddit accounts are bots or people karma farming.",
         "Look up the federalist article from I think yesterday. They have giant groups of ppl solely to flood reddit with shit-on-trump posts/comments",
         "Understatement of the century. Reddit is a leftist cesspool of pedophiles and perverts.",
         "Sure is. They nuts",
         "Whats that?",
         "...and a lot of cosmetic surgery.",
         "Yup, FFV, in the Great Sea Trench.\n\nI can't post images, but maybe a link will work?\n\nhttps://finalfantasy.fandom.com/wiki/Unknown_(Final_Fantasy_V)?file=Unknown_2_from_FFV_SNES_sprite.png",
         "They’s heart",
         "It’s referring to the libtard subreddits.",
         "we gave them so much money already. what else can we do?",
         "Part of a running joke (that might be true) that Kamala always progresses through her career by sleeping with the right people.",
         "I’m concerned about the support with intel and weapons that requires U.S. military assistance.",
         "Might be true? There's no doubt. From Montel to Willie Brown she's been a social climber her whole life. Never earned any job she's ever had.",
         "It’s not a running joke.  Willie Brown insisted on showing up to parties with a lady on each arm.",
         "Best Blowjob in the beltway",
         "I was trying to avoid saying it outright, but yeah.  There’s literally no other way she could’ve gotten this far otherwise"
      ]
   },
   "1gftmet": {
      "title": "Recorded in a construction zone? 🤣",
      "text": "Anybody else have a hard time following the episode today with the random background sound and voices? It kind of felt like it was distracting Matt as well, but I kept cracking up whenever I heard the random \"Ha!\" Comments 😂",
      "comments": []
   },
   "1gfie7z": {
      "title": "Can’t believe Am I Racist is real? ",
      "text": "Finally got round to watching Am I racist. I can’t believe that some of the people in it are real. The dinner table scene is shocking. Another big takeaway is the amount of money to be made: create more problems, create more money!",
      "comments": [
         "It's surreal. I follow the news and see glimpses but when you see the sheer nonsense from the Marxists it's mind-boggling.",
         "I haven't seen it except for in clips... But yeah, I can't believe these people are real either.  The amount of enabling and rewarding we've done in our society should be lessons to learn from for the future. It created monsters.",
         "This is the result of living completely within a bubble.",
         "Can I rent this I would like to support it",
         "It’s extremely disturbing but happy the movie got made and exposes these grifters for what they are but would like to see republicans take on academia in the future. Can’t let academia get taken over by leftists.",
         "It’s scary. Hoping it’s only a minority of people",
         "Subscribe to Daily Wire and support all the wonderful things they do!!!! It’s worth it."
      ]
   },
   "1gf23ob": {
      "title": "Truth bomb",
      "text": "",
      "comments": [
         "True for both sides.",
         "It’s the policies, not the politician.",
         "I am tired of being in a society that requires famous people to have impeccable personal lives. I don’t care what an actor personal beliefs are or if he’s cheated on his wife. In fact I’d rather not know so I can enjoy their craft in peace. I’d also prefer for them to stop broadcasting their opinions as if we should take them into account. The exception being for criminal/ extremely immoral activity.\n\nSame for politicians. Over the years I’ve come to have the impression that Trump really is not a bad person in real life. I think he seems savvy and funny. But you know what, I don’t really care. What matters is I believe he is sincere in trying to make the country better, and I mostly agree with most of his policies.",
         "That’s a bingo. Regardless of which party you support.",
         "I agree but strippers need love too people. Relationships do form and they do get married and have families sometimes",
         "You cannot compare politicians to strippers, one is okay and the other is gross",
         "Yeah I’ve never seen a cult of personality behind a US politician than how some people view Trump. He’s better than Kamala, but some people seem to think that he’s an actual God.",
         "Trusting in the sincerity of a politician is a fool’s errand. At best you look at their track record and decide if their policies and results align with your desired outcomes.\n\nIf you put your faith in a person you will be let down 100% of the time eventually.",
         "Ya and as a Christian I cringe so bad every time I see stuff like that. On the other hand, liberals aren’t truly religious (IMO) but view Kamala, Obama, Hillary as their saviors. So lame and ridiculous on both sides.",
         "You’re willfully misunderstanding what I said, as you came over to correct me only to make the same point I did",
         "Not really. I was commenting on your last sentence where you state “I believe he is sincere etc etc”. I just have no idea what is going on in any politician’s head so I’ve just given up on trying to evaluate their sincerity.\n\nI’m really not looking to disagree with you, that statement just stuck out to me.",
         "Oh ok sorry about that.\n\nI meant in contrast with Kamala, for example. Maybe I’m wrong about Trump and he’s trying to undermine the country, but so far, I believe him, which is why I support him. His track record also supports that, which as you pointed out, it’s what actually matters. In contrast, I don’t believe in almost anything that comes out of Harris’ mouth."
      ]
   },
   "1gexugp": {
      "title": "We need a 2024 sequel ",
      "text": "",
      "comments": [
         "Make insane asylums great again",
         "This depresses me as much as it amuses me.....",
         "Whatever happened to this person? Did they recover?",
         "I'd pay good money to see this again...right or wrong you have to admire someone who has found their calling at such a young age...",
         "This is EXACTLY who, and WHAT I’m standing AGAINST!! Trump 2024!!! End this woke madness NOW and let’s bring back common sense.",
         "She looks like Bill Gates",
         "One of the most punchable looking faces I’ve ever seen",
         "That’s one of those white dudes for Harris",
         "It would be epic to see if she’d be up for a remake!",
         "Cool out for a week and you'll have plenty to choose from.",
         "🤣🤣🤣",
         "This would make a hilarious Halloween costume…\n\n“Who are you supposed to be?”\n\n*Falls to knees*\n\n“NOOOOOOOOOOO!!!!”",
         "Looks for the extended version of this clip.  Pricless!",
         "LOL...what an attention whore that dude was/is",
         "Ironically, this zer has become this comical abomination because they/them were never told \"No\"",
         "I'm 'bout lose my mind... up in here... up in here....",
         "Patton oswalt really was upset that day.",
         "Can we please have a group of 30-50 people dress up like this and scream together at the Harris announcement gathering...",
         "Need to put a \"Where are they now?\" segment for this.",
         "Sweet, found my new ringtone.",
         "Then her portfolio gained 20%",
         "Liberal just hate freedom, and peace. Honestly prison is the best place for them",
         "I wonder if this lady has to just avoid the internet because I see her in memes, all... the... time....  She thought she was being so passionate and provocative and she ends up a constant punchline.  I still laugh when I see it because it was just a weird campus style performance of \"stupid\".   Hey, let's all scream at the sky at the injustice of our candidate losing this election.\n\nIt's this sort of performative angst that they do for each other, the currency of which is essentially worthless in real life.",
         "Someone needs to go to grippy socks jail.",
         "May favorite part of this clip is (sadly) almost never included.   Just before her scream, she surreptitiously checks to make sure the camera is on and ready to capture her big 'look at me' moment.  It just makes it that much more pathetic knowing that she WANTED that on film.",
         "It is coming. \nOnly question is will it be Joe or Kamala.",
         "This just brings me so much joy.",
         "I can't wait for the sequel when Trump wins!",
         "Emily gets canceled 😤",
         "It was the best moment of the 2016 election meltdown",
         "What is she whaling about? It doesn’t look like she would have to worry about any reproductive rights issues.",
         "🤣😂",
         "I can't fucking wait..",
         "My bath is ready for the liberal tears. Gonna be a nice, soothing bath.",
         "r/houstonwade    Get ready for round 2 ☺️",
         "If Trump wins again the lamentations will dwarf what happened in 2016.",
         "HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA",
         "Can't wait",
         "Maybe with less screaming.",
         "Make them possible again.",
         "Make Asylums Insane Again!!",
         "Reagan was the one that knee capped them and opened the door for news stations to take clear political sides. Both things trump has taken hard stances against… yet Reagan is a deity to many of those who claim to love trump.",
         "This motivates me to vote",
         "They they/them'd themselves too close to the sun.",
         "They are still screaming to this day. I’m sure if you look in the mirror and say ‘safe place’ three times they will show up",
         "I'm sure he joined a gym, got shredded, and became a J6er. Or he just doubled down on his TDS",
         "Still living in their parent's basement and bitter.",
         "Or Patton Oswalt",
         "She? Bigot\n\nThey/them is a beautiful and brave folx",
         "I thought it was a woman",
         "https://youtu.be/wDYNVH0U3cs?si=k3Fy_nTFxyrB7vfM",
         "Is a woman",
         "Real",
         "This can not be completely true. Ben just brought up that WaPo first endorsed Jimmy Carter in 1976 for instance.\n\nInterested if you have a source on this.\n\nEven if true, there are a ton of reasons to still like reagan, same as Trump with his weaknesses.",
         "Their bumping fuzzies with some furries",
         "I thought it was a chick",
         "I can see that.",
         "It’s all the genders. It’s the everything bagel of genders.",
         "LOL this is how I imagine most people on Reddit look and act like",
         "I saw a different clip of her (they?) where (whatever) looks to make sure the camera is filming before screaming.   Tells you everything you need to know about these phonies.",
         "Woops...could have fooled me.",
         "[mental institution thing](https://en.m.wikipedia.org/wiki/Mental_Health_Systems_Act_of_1980)\n\n[Fake News getting made](https://scholar.google.com/scholar?q=reagan+fairness+in+media+repeal&hl=en&as_sdt=0&as_vis=1&oi=scholart#d=gs_qabs&t=1730294924081&u=%23p%3DGWH0YhSYf6EJ)\n\nYes and no to still having reasons to like both. The things I like about trump are things I’ve liked about other people. I very much like tulsi for example.",
         "How dare both of you assume! it's a zer...",
         "It’s never hot women who are “born in the wrong body”",
         "I'm not sure the first is related to your statement but interesting non the less. I personally agree with the sentiment that the federal government does not have a responsibility to weigh in and control everything and that local communities and states should decide how to deal with such matter. The problems of mental health go far beyond repealing federal spending on it so don't want to go down that rabbit hole.\n\nFor your second point on the repeal of the fairness doctrine, I also personally take the side that in the balance of FCC vs first admendment, I go first admendment. The issues aren't that news corporations are biased, it's that they act like they are balanced. My issue with the FCC regulating it is if they are biased...which they would be by the measure of all government agencies having bias, they would not impose the rules of the fairness doctrine equally. \n\nThanks for specifying what you mean though, these are all interesting topics to discuss.",
         "😂😂😂"
      ]
   },
   "1gfax7o": {
      "title": "The difference when asked about if they are friends with someone who is voting for the opposite candidate is stunning in askaliberal and askaconservative ",
      "text": "",
      "comments": [
         "While there are still some moderate Democrats, most of the left now consists of people that went wandering in the desert, searching for something new to pour their sense of belief into. Unfortunately for the rest of us, they decided to collectively put their faith into a mirage.",
         "This went about like I thought it would.  They're generally not very pleasant people. Granted they've been deceived to an unbelievable degree. But still... You have to be somewhat a willing participant to believe the things they believe.",
         "Not surprising to me at all. I have friends who are liberals. One of them constantly makes little snide political comments but then gets upset if I do it back at him.\n\nLike I’ll say “did you hear that comment Kamala made? Oof that was a tough interview she had on 60 Minutes, huh?”\n\nAnd suddenly he’s all “come on I’ve told you I don’t want to talk about politics.”\n\nHe absolutely does want to talk about politics because he doesn’t it with other people. Just not me because he knows I’ll disagree with him.",
         "I wonder what people would say about trump if he was anointed the republican primary",
         "RFK Jr and Trump respect each other’s view points and decided to work together on the things they agree on. Same with Trump and Tulsi Gabbard. Can you just imagine what we could achieve if that was the goal in D.C. and our extremely well paid leaders could do that instead of spending all of their time on the politics of fear and division so they can keep getting elected and pad their pockets? Even “good old Bernie” who rips on the wealthy and has spent a lifetime as a mayor, congressman, and then Senator has a net worth around 3 million and owns three homes. Way past due for term limits and ending the “perks for life” plan. The Nevada legislature is just the right amount of government. $150.71 per day for 120 days every two years and term limits. They are forced to deal with what is actually important as there is time pressure, there is not as much corruption and outside interests pouring money into it as it is not a position their candidates seek to become eternally wealthy (not saying there’s no corruption, it’s the American Way in politics), and when they limit out, they’re forced to return to being a citizen like the founders intended. The State Capitol (Carson City) is pretty much a dump and most people don’t realize it’s the Capitol as so little political fat cat money is being thrown around there.",
         "Trump sat down with Rogan and had a three hour conversation. Apparently he has asked Kamala to do the same. As hard as it will be to listen to for me, on the outside chance she is willing to do so, I’ll listen. From everything I know about her beliefs and platforms, seriously doubt I’d consider voting for her but truth is, I really have no idea what she truly stands for. I want to know who our aspiring presidents are as a person and their belief system whether I agree or not.",
         "\"He stole the primary\""
      ]
   },
   "1gf0yob": {
      "title": "Ice cream so good",
      "text": "",
      "comments": [
         "I love ice cream and the Clintons >!I am not suicidal!<. >!Epstein didn’t kill himself!<. >!They want you to eat bugs and live in a high density concrete box in urban neighborhoods!<. >!They’re pricing you out of single family homes cause they don’t want people to raise normal families!<. >!They want public school propaganda to indoctrinate your kids!<. My favorite flavor is Rainbow flavor during Pride months.",
         "Saw this in another thread..   \n\nWait until you see how many companies Blackrock owns controlling majority of and Blackrock also owns the buildings those companies work in.   Now you know why the big push for Return to Office started.  The controlling shareholder is forcing companies to put their employees 'back' in the buildings they also own.",
         "Well that was depressing",
         "Not sure whether I should be laughing or crying at this video....",
         "That was the last time we saw her alive?",
         "Hang on, trying to figure out how to invest in Black Rock.",
         "Black rock, state street, and vanguard own almost everything. And also own pieces of each over.",
         "Aren’t blackrock/vanguard mutual funds? ",
         "Juicy",
         "Love this! It’s so anti establishment!",
         "She’s great, love the opening",
         "I creamed so good",
         "This is cringe, and this is so overly dramatic.\n\nWhat she says is true though.",
         "Learning about these things is a bit of a grieving process, but depression means you’re past the denial stage and you’re on the path to acceptance (after some more cycling between anger, bargaining, and depression) and soon you’ll actually being able to do something about it.",
         "BLK on NYSE",
         "How is it overly dramatic? It's a comedic way said by a pretty girl to keep the knuckle draggers looking to express something more people need to know.",
         "Elaborate",
         "Thanks. Massive profits here I come!",
         "I was halfway joking, since we are in an age of much pain and revelation, but my experience learning hard truths is that because it does involve betrayal and loss, there is a bit of a [grieving cycle](https://thewrightinitiative.com/800/600/http/i.pinimg.com/474x/be/7d/eb/be7deb82293d8596ca3ed20a6b7292c1.jpg) to it all. \n\nNot trying to give too much credit to therapist hucksters, but eventually, with enough exposure and learning, this stuff won’t even phase ya.\n\nEdit: if you wanted elaboration on how you can actually do something about it, I say community. You can’t save the world, but you can make a tiny corner of it pretty sweet. \n\nThe news just tries to soak up your time and energy on things you can’t even do anything about - so I say put that time and energy into your community and water it and watch it grow."
      ]
   },
   "1geuobh": {
      "title": "The Harris Campaign Manipulates Reddit To Control The Platform",
      "text": "",
      "comments": [
         "Reddit is a liberal hell hole.  Filled with mentally ill 20 something year olds who think they are smart and witty, but are just boot lickers and followers.",
         "Fraud campaign for a fraud candidate with fraudulent beliefs.",
         "lol pretty sure Reddit already reports to the DNC.",
         "No no, it's just pure coincidence a non political sub like r/pics just happens to be nothing but anti Trump propaganda.",
         "There’s a pile of DNC shadow subs on Reddit.\nIt’s fairly obvious.",
         "Kind of given up on Reddit. The censorship is another level!",
         "I am relatively new to Reddit and am absolutely convinced this is true.  The one dimensional approach everyone has on this platform is staggering.",
         "Reddit is so left the NPR sub has people saying they(NPR) are supporting Trump. NPR is a left leaning news outlet and anyone with a brain hears that fact everyday. It is wild to me that Reddit is so restricting unless it is what they want to see. Example: I saw multiple posts of people posting voting pics showing Harris as selected candidate. If you posted I voted and show T’s name, you would probably get perm. ban from reddit.",
         "I saw the blatant lull in political vomit before the Kamala coups. It was all silent, and then when she became the official candidate, the engine was sent pumping full steam ahead and it’s been non-stop propaganda and chaos ever since.",
         "Reddit has been coopted by a cesspool of degenerate no brains, communists, Chinese and Russian bots. Hit the popular on reddit and you can view the bubbles of hypocrisy and ignorance.",
         "From the article. \n\n\"These claims have often been dismissed, citing that Democrat voters are already more likely to be on the internet compared to their not-as-tech-savvy Republican counterparts. This would suggest that the constant flood of left-leaning content on websites such as Reddit was merely a reflection of the userbase.\"\n\nI dont think it has anything to do with dems being more tech savvy. It is because less dems/leftists have jobs or children that take up their time.",
         "My hometown sub is full of libs and they just upvote each other and live in their bubble. No other opinions allowed. All cops are murderers. Just funny how they can’t even form an opinion without media or politician telling them.",
         "Part of the problem of why it is so lopsided is that many of us are not allowed to have a discussion on any level that doesn’t embrace the left completely.",
         "The major subreddits have effectively been an arm of DNC/Act Blue since Trump’s first term. Reddit looks the other way because they sympathize with them ideologically.",
         "R/louisiana and r/neworleans are all filled with liberal propaganda. Say anything remotely close to disagreeing with them and you’re downvoted or banned. It’s nuts.",
         "Seeing it  all converge here on Reddit I am reminded why I was a Democrat.  Right now, it more like three dogs in a trench coat calling itself the Democratic party.  Reddit is where this evil calls home.",
         "They’re just finding this out lol",
         "They will downvote you to hell",
         "What is so fundamentally flawed with their policy positions that this manipulation is necessary?\n\n\nOh, I guess I answered my own question.",
         "I knew it. Spread this article like wildfire!",
         "It’s day and night between Reddit and X",
         "No Sh....",
         "Bots, bots everywhere.",
         "Reddit is a liberal hive mind cesspool.",
         "There are a ton of accounts posting up leftist propaganda that have a low karma and they were all set up between February 10-18 this year. I have blocked around 30 in the last week. I noticed the more leftist accounts I block, the nicer reddit gets.",
         "It's just the Matrix, Matrixing.",
         "😐\n\nThis is my surprised face.",
         "I got banded from 2 subs in one day for stating facts about Trump and Vance.",
         "Full of sheep who have been indoctrinated at university. Worthless degrees and zero education.",
         "Reddit is a hell scape of liberal horseshit but it's still better than Facebook",
         "The run Hillary 2.0 even naming her VP pick Tim and are surprised she’s not doing too good?",
         "And foreign actors.",
         "[removed]",
         "The entire faculty of Reddit (young to old, sales/advertising to IT) is entirely democrat. They’re hell bent on regurgitating leftist rhetoric and suppressing all non-conforming ideas.",
         "Further left.",
         "I remembered that 3-2 months ago people posted pics of \"Trump being creepy\" but when I posted pics of Joe Biden being Creepy, they deleted it because \"they don't accept political pics\"",
         ">nothing but anti Trump propaganda.\n\nThat's a lie\n\nHalf the time it's pro Harris propaganda",
         "Christ! I clicked on it just to see, and literally every post is either bashing Trump or shilling for Kamala. Every. Single. One.",
         "r/Seattle",
         "What's funny is when you see 2 or more people start out circle jerking each other because they agree on everything but then it turns into an argument of semantics or someone misspelled a word.",
         "Yep, mine too. The funny thing is that most of NYS votes red until you get to the inner cities. Yet all I see is Syracuse university students circle jerking on the Syracuse sub. I’ve posted a differing opinion and get downvoted into oblivion. I laugh because I simply don’t care anymore about downvotes.",
         "It's every single state subreddit. I mute them all and just hang out in the few right wing subreddits available.",
         "r/Seattle too",
         "And purple.",
         "... face tattoo of \"TheRealDonaldTrump\"",
         "Furer left",
         "Sounds about right. Pearl clutching is an art to these people.",
         "I sometimes post a pix of a ballot indicating Trump. The results are hilarious.",
         "That happened to quite a few of my comments. I don’t waste my time and effort reading and commenting on their cr.p anymore.",
         "Lol you had me going for a minute.",
         "That's pretty much any sub for any city on Reddit though.",
         "I have to mute them because it’s being shoved down my throat. It’s annoying and there’s definitely an agenda going on in Reddit world…a liberal agenda."
      ]
   }
}