{
   "1glmpsr": {
      "title": "Hope you all enjoy your cup of favourite beverage today.",
      "text": "Still can't post on \"pics\" lol and also not happy diarywire removed my Trump picture yesterday but i guess thats because i was referring to \"pics\" (not typing fully name to avoid link) in title but you all know who they are. Most probably broke a rule doing that 🙄. ",
      "comments": [
         "I’m taking a nice warm Liberal tears bath right now! So calming and relaxing it’s like a giant weight of ism’s just got taken off my shoulders.",
         "I'm enjoying that every day.",
         "The tears of the liberals are so delicious.",
         "Something about 4 years of peace and prosperity makes these stupid liberals so angry",
         "They are salty.  Very salty right now.  So much salt.",
         "This is not the way"
      ]
   },
   "1glb1ip": {
      "title": "Let's not forget about this legend.",
      "text": "Rush Limbaugh helped make Tuesday night happen as much as anybody. The EIB network crawled so that the daily wire, Prager U, the blaze and many others could run today. He created a new industry, conservative commentary. \n\nFor decades he deconstructed the hypocrisy and duplicity of the political left and the corporate media with simple facts and logic, encouraging millions to critically assess what they hear in the news. \n\nHe was also one of the earliest and biggest fans of Trump. Day after day he made his case to the American people why Trump, despite being untested in the political realm, was the best candidate. \n\nWe don't know how much of the black vote that Trump got was because of Rush Limbaugh. Near the end of his career in particular began reaching out to the African-American community. He went on The breakfast club with charlamagne the god and made his case directly to the African American community that the Democrats were simply using them as pawns and not really interested in helping them.\n\nRush was unstoppable. Through his entire career the left tried to silence him with all methods honorable and underhanded, but his audience just grew and grew right up to the end. He was a raging Bull that didn't stop until a force of nature that modern medicine still can't defeat took him down. So he gets the hero salute. He would have been thrilled to see this day. \n\nThis weekend during your reveries pour one out for Rush.",
      "comments": [
         "God took his talent back.  Kudos to you Rush.",
         "He's smiling right now.",
         "He'd love this",
         "12-3 has never been the same",
         "At 12:00 noon on Nov. 6 2020, when the Rush Limbaugh show came on, the first three words he said: “ Keep the faith.”\n\nWe did.",
         "Trump should name a navy ship after Rush. \nThe \"USS El Rushbo\"",
         "The guy that spoke to the rest us, RIP.",
         "💙💙💙",
         "He would be pleased at the results of this election.",
         "The legend is buried in STL-MO. Amazing man!",
         "I said looking up with a smile, well Rush, Trump is back in charge !",
         "I’ve been thinking of him all week! God Bless Rush! So missed 💕🇺🇸",
         "What is the medal he's wearing?",
         "I think it’s safe to confirm on everything he spoke about   RUSH    WAS     RIGHT",
         "O7",
         "his \"nicotine stained fingers\" became nicotine stained lungs",
         "Congratulations to Rush on his three years of sobriety.",
         "he's not smiling. he's dead. duh",
         "I didn't realize he was that close to where I live. I could actually go visit his grave.",
         "Presidential medal of freedom. Awarded by Trump at the 2019 State of the Union address if I recall correctly.",
         "Are you envious? You should celebrate his sobriety by having one for him.",
         "Oh you."
      ]
   },
   "1glo45r": {
      "title": "Remember the 5th of Nov (pls remove if this violates rule 4)",
      "text": "",
      "comments": [
         "Lmao, love it",
         "Great clip.",
         "LOL"
      ]
   },
   "1gl23dd": {
      "title": "Harris having to certify her own election loss is pure chef's kiss.",
      "text": "",
      "comments": [
         "Trust me I was scared that California would ruin the election",
         "I finally like Reddit again .. hearing these assholes talk about their life is over as they know it is so freakin satisfying after this election cycle.. they were the most toxic little weirdos ever",
         "Will she be unburdened by what's about to be?",
         "Shout out to my Latino brothers and sisters in the State of Texas!  MVPs of the 2024 election in my opinion... Texas would legit suck without you guys..it really would.",
         "it's hilarious to me that she's waiting until 6 pm est to make the speech. even Hillary called in the middle of the night to congratulate him. I wonder if she called him.",
         "Kamala has to certify that she is a LOSER! That’s so appropriate!",
         "Is there a reason NV, AZ, MI and AK are taking so long to finalise? I’m starting to get suspicious",
         "Men are tired of the bullshit and our women are tired of it too.",
         "I love this stuff - looking at it on a county-by-county level and comparing results to last year.  When I saw her tanking early in Florida by big numbers and Dade county turning 18 points vs. the last election, and even Palm Beach co. was a near draw vs. a big loss last time, I knew she would be in trouble nationally.  Even in the blue states, she didn't do well - I think Illinois was a 17-point Biden win in 2020 vs. 8 or 9 this time, and NJ went from a 16 point win to 4 or 5.  And don't even mention the BS Des Moines Register poll vs. his 13 point actual win in Iowa, LOL.\n\nThe biggest problem for democrats is that, aside from people being tired of the identity politics, poor immigration controls and enabling of criminality, she just wasn't a likeable or good candidate.",
         "How did you get such a grainy picture of the map though?",
         "And losing Pennsylvania cause she wouldn't pick the jew.  At least she got the always blue minessota, barely lol",
         "Oh yeah, I'll be watching that day.",
         "Re downloaded Reddit and I’m banned on every page here but daily wife. The salt mine is real lmfao",
         "When they kept saying, \"We won't go back!\" Did they mean they won't go back to great policies?",
         "I really feel bad for whichever intern that has to explain this to her. You know they are getting the slipper.",
         "I had a dream where this became true and it was so beautiful. Then I woke up and it was true. How magnificent. How telling in this dream, that the dems would get their justice. So when Jesus came to me over and over in this dream, it was so pure and thick. He came to me so many times in one dream. I’m just so happy to have him in me",
         "2016:  A New Hope \n2020:  The Empire Strikes Back \n2024:  Return of The Jedi",
         "This is a shitty pic",
         "And as she sits there during the certification, she can ponder the significance of the passage of time",
         "Yes, it was very nice to listen to a person of character humbly accept the democratic process. Last person who lost surely didnt. A very pleasant chef's kiss indeed.",
         "Yes! That’s awesome!",
         "Lmao",
         "After 2020 the VP certification of the election is purely ceremonial.",
         "Kamala lost sooooo bad, FEMA sent her a check for $750",
         "In 4 years when the economy is faulty again, they cut from the social safety nets, and dollar general is called 20 dollar general, just think of today. A lot of everyday, working class people are going to suffer because of the decisions that are about to come. :-(",
         "The wild part is that Trump still won 40% of California.",
         "There are counties in California that support Trump. Thank God for at least a little balance and common sense.",
         "Popular Vote Baby! I was fairly sure we would win electorally but stomping her out with the PV is cathartic.",
         "270towin:\n\nLast Updated: Nov 6, 2024 at 11:37 AM\n58% est. reporting\n\nKamala Harris 5,606,703\t57.3%\n\nDonald J. Trump 3,918,222\t40.1%\n\n\nHow is it possible that only 58% has reported!?",
         "California will always go blue. And it doesn't matter if they are 100% Democrat with all 40 or whatever million people, it's still only worth 54 electoral votes.",
         "same! and that she would get PA.",
         "We can only hope that the woke movement ends here",
         "I know we all feel unburdened by what has been now.",
         "Dayum",
         "I keep seeing variations of this quote.  Where did it come from?",
         "Most of the border counties flipped/remained red.",
         "As of 9 am this morning she hadn't",
         "With PA being called he's already over 270. He wins even if her loses mi az and nv.",
         "Yrs, this is where the boxes of unopened ballots are suddenly found usually comes in.....and why some counties consistently take so long to count their votes is always suspicious to me.  Either willful or just unintentional incompetence.",
         "Most women aren't.  Most women voted for the hoe and before that Joe.",
         "You have to use a media image to post in this sub. I just dragged and dropped  the first election map on Google images lol.",
         "for real. \n\nMusk should buy reddit and Wikipedia",
         "Lol",
         "By area, most of California is red",
         "It makes me happy that we can’t even have pieces saying that we need to abolish the “outdated” electoral college",
         "Everyone went to fucking bed cause apparently Californians work like the fucking French, aka NOT AT ALL",
         "If Trump has a strong successful administration, he should set Vance up for an easy win in 2028 and hopefully 2032. And hopefully this causes the Democrats to reset and pull away from the far left insanity. NOBODY WANTS IT! They were bullied by a fringe loud sect into thinking its what most people want.\n\nUnfortunately since there were still blue state strongholds, with CA being unwilling to let go of Pelosi or Schiff, the chance for the bullshit to stick around does remain.",
         "We are all “Unburdened by what will\nnever be”",
         "From Kamallama herself.",
         "She won’t. Her, her cabinet and the MSM smeared his name for almost a decade. If I was Trump and she did call I wouldn’t even pickup the phone. Let dead dogs die already",
         "Oh I know. What I mean is, and granted I understand this sounds paranoid, I’m suspicious biased actors may be trying to mess with votes while everyone is not worried cause he won to make it look like those states were closer than they actually were. Or to make them blue",
         ":/ and that’s exactly what worries me",
         "So true.",
         "Don't tell him where the quote came from. Now that you told him he is burdened, no he is ununburdened by what has been",
         "It's a legit fear.  But the rnc under Lara Trump is on the ball with the election security. Very surprised by how good she's doing.",
         "she conceded so it's done :)",
         "It's almost as it the Trump family is invested in the Republican party and the \"grifters\" the never trumpets and Ds keep calling them. \n\nBtw, if you're here and you voted for Harris, you're not a conservative."
      ]
   },
   "1glcer3": {
      "title": "What is a woman?",
      "text": "Suddenly the left knows what a woman is.",
      "comments": [
         "It’s ridiculous that it has been turned into a women’s rights issue. Its sad that even in defeat the democrats are continuing to spread division and hate rhetoric.\n\nTrump isnt and has never came for womens rights its sad that the narrative has been allowed to go this far.\n\nIt has and always will be a state issue and Trump stays out of it, Kamala becoming president would not have changed the Roe v Wade decision or give Women’s any more rights then they don’t already have.\n\nThe way Liberals are acting youd think Trump is trying to enslave women like they have just been banished to the kitchen, got their voting rights stripped and forced into slavery. The dramatics are ridiculous and show just how delusional the base got from the dangerous fear mongering left.\n\nBeing convinced to vote for an incompetent president like Kamala over a fake narrative is everything that is wrong with the left.",
         "Take it from Kamala herself, a lot of kids nowadays are stupid.",
         "People don’t like the word hysterical for various reasons but this is fucking HYSTERICAL",
         "Not wanting men competing in women’s sports somehow isn’t considered women’s rights.",
         "Total asshat",
         "I don’t know. I’m not a biologist",
         "She’s proving Trumps point, Democrats love the declare war.",
         "Only when it's convenient",
         "Where can we ship these celebrities off to?",
         "They think Trump is gonna turn America into Gilead or some shit.",
         "Damn the man isn't even in office yet and suddenly women exist again?  Hasn't even been sworn back in and already doing the Lord's work.",
         "That's what we need, more brain-dead celebrities giving their two cents 🤡",
         "This is not a role model for my daughter.",
         "Women who fixate on abortions need to reevaluate themselves and their own personal choices instead of blaming the president.",
         "If you registered by voice that you would leave the country if Trump won, is there a go fund me where we can contribute to plane tickets?",
         "Hopefully she will be unburdened by what has been.",
         "Yawn.",
         "Never heard of her/it whatever that's supposed to be.",
         "Taking all the wrong takeaways as usual.",
         "Satanic entity.",
         "What is a woman?",
         "Phish did birds of a feather better",
         "She's got a pair of big juicy tits and that's about it",
         "Wait… didn’t women show up in support of Trump during this election?\n\nWho is she talking to?",
         "Ha 👍🏾",
         "It’s the same mindlessness that says he is antisemitic, while his grandchildren are Jewish. His son in law is Jewish and his daughter converted to Judaism. \n\n*These idiots want to say Trump hates women, Jews, blue collar workers, Christians and is the worst.*\n\nI keep encouraging them. I remind them that the GOP appreciates their help in Trump winning the most important election in our lifetime and to keep up their tactics so the GOP can keep winning.",
         "From today until next election season there is just nothing the left has to say that’s going to carry any value for me, frankly. As a moderate I just can’t respect the Democrat party after the last five years of total chaos and borderline tyranny. \n\nThe Democrat party needs to change, fast. This level of disdain from even their own voter base isn’t sustainable.",
         "Victim mindset…",
         "I thought they were all leaving? 🤷‍♂️",
         "You mean it's not a guy? 😆"
      ]
   },
   "1glhf8j": {
      "title": "Call down, at this point this is just Karma Farming and Venting",
      "text": "",
      "comments": [
         "Plot twist, about 13 million were fake mail in ballots that were injected during the 2020 election. They couldn't pull off the rig without a pandemic covering for them...",
         "Comments disabled on OP.\nGeez, wonder why...",
         "That sub has been so good since the election",
         "The party of joy",
         "Ah yes, more comments from the party of tolerance.",
         "Who wants to tell him?",
         "LMAO \"EvErThInG SiNcE 2016 WaSn'T EnOuGh FoR YoU\" You mean peace and prosperity? ? No new wars? being able to afford a house, car and groceries? \n\nLiberals are unhinged maniacs. they need to leave this country they don't deserve to be here",
         "Look, those 20 million were mail in ballots, they were from low effort voters. You know the guys who can't be bothered to drive to a polling station, don't know there is an election, those who can't even breath. \n\nSo yes, 20 million didn't show up as they never show up if they can help it."
      ]
   },
   "1gl3ke0": {
      "title": "Woman Cries Over Trump’s Victory, Claiming There’s No Hope for Her Body’s Future",
      "text": "",
      "comments": [
         "No hope for her body’s future!? What reality do these people live in? Seriously",
         "She's too brainwashed to realize that abortion is regulated at the state level now and not the federal level.",
         "hey, now show some compassion. most of These women just wanna be raw dogged without consequences.",
         "This guy gets it",
         "These democrats are so delusional, to much MSM, to realize this is a state issue not a federal matter. These are the people who actually thought Texas would go blue and believe headlines. The democratic elite love these morons.",
         "Mmmmm The sweet taste of insane liberal tears",
         "Sounds like a personal problem",
         "What gets me is he cannot change the Supreme Court ruling. Now your states laws are up to your governor. That is why local and state elections are honestly more important than the presidential. Trump wants to keep it at the state level which is should be. Reside in a state that aligns with your values and beliefs and they’ll be a lot happier.",
         "Be responsible or keep your legs crossed until you're ready to have children. Never even crosses the minds of the irresponsible.",
         "Imagine pointing a camera at yourself and thinking this garbage is ok. lol.",
         "After Roe v Wade was overturned, Abortions went UP!\n\n[Over One Million US Abortions in 2023](https://www.npr.org/sections/health-shots/2024/03/19/1238293143/abortion-data-how-many-us-2023)\n\n[Abortion Statistics and Reasons Given](https://www.pcuc.org/resources/statistics-on-abortion/)\n\n[STATES ABORTION REPORTING ](https://www.guttmacher.org/state-policy/explore/abortion-reporting-requirements)\n\nReasons given for abortions:\n\n<0.5%\tVictim of rape\n\n3%\tFetal health problems\n\n4%\tPhysical health problems\n\n4%\tWould interfere with education or career\n\n7%\tNot mature enough to raise a child\n\n8%\tDon’t want to be a single mother\n\n19%\tDone having children\n\n23%\tCan’t afford a baby\n\n25%\tNot ready for a child\n\n6%\tOther",
         "It’s so sad what they’re doing to the mental health of young people. Why am I surprised",
         "Amen brother",
         "seriously! you said it right. “imagined threat” that people are out to control their bodies! its all in their head and its looney toon!! they are soo nutty, i cant even deal with them and they dont listen when you explain they are wrong lol 😆",
         "Legacy media is DONE",
         "I think they actually WANT to be gaslit by the media and Democrats. The WANT someone to hate.",
         "Are you serious!? She might have to use....ugh.... birth control or a condom now! The absolute horror!",
         "Some women think they are forced to live in the states they do. They have a breakdown and freak out when they can literally just.. drive away.",
         "the accuracy! 🤣",
         "And Lewis black and Bill Clinton say that they’re the man for the job!"
      ]
   },
   "1gl8972": {
      "title": "Leftist Tears tumbler",
      "text": "I want to buy one of these for my husband for Christmas but I can’t find it on their website. Is it just out of stock or is this something that you can’t buy without a membership?",
      "comments": [
         "Apparently I'm a fascist racist Nazi Hispanic according to these people.",
         "The tumbler comes with a paid membership to daily wire",
         "It looks like right now you have to buy it as a candle and then can get the lid separately for once handle is used through. I wonder why they don’t currently have them in stock outside of the candles. They may have sold out. https://store.dailywire.com/products/leftist-tears-tumbler-candle",
         "This is not the way.",
         "I don’t know the answer, but thanks for sharing this idea cuz I think it’d make a great Christmas present for my husband too!",
         "My cup doth overflow",
         "It’s just filled with soy and arrogant hate",
         "I just signed up yesterday, but I don't see how to get the cup. Do they just automatically send it to you?"
      ]
   },
   "1gkzvuo": {
      "title": "Once Trump is back in office and the economy is moving in the right direction, the Republicans need to consider 2028",
      "text": "The momentum built during this election was incredible. People don’t like the direction the country was going, and they showed it by giving the Republicans the presidency, the senate, and likely the house too. Plus, there’s a good chance Thomas and/or Alito retire soon and give Trump another two SCOTUS picks (for a total of 5 Justices appointed by Trump).\n\nBut the Republicans need to not get complacent. Trump isn’t going to be the nominee in 2028. Whoever the Republican nominee is, they need to keep that same energy that Trump demonstrated in this election.\n\nWe haven’t had a Republican take office after a different Republican president since George H.W. Bush won the 1988 election after Reagan. We can’t let them do what they did these last four years again. We can’t let them undo all of the good things Trump is very likely to accomplish between now and January 2029. \n\nI really hope Trump gets us back on track after these disastrous last four years. I just don’t want to watch it all get undone again four years from now. ",
      "comments": [
         "JD",
         "JD tulsi and DeSantis all would have my vote as of now",
         "JD would lock it up for another 8 years if trump can put the brakes on and fix all this mess.",
         "JD and Tulsi could be nice! But for now, we’ve got the man for the job! 🥳",
         "Not today. Today is for enjoying the fruits of our labors.",
         "DeSantis or JD.",
         "Man. Take a day off and bask in the November sun. We’ll get to work soon. Nah. I like your hustle.",
         "IMO, they should put forth a woman who appeals to the same voters so that hopefully the first female president is one of us and it's easier to shut down the other side's talking points. By their own logic, if they oppose her in any way then they are misogynistic.",
         "They have so many great options, but I would like JD, Desantis, tulsi. It’s really tough for me to pick one of the three. JD is probably the pragmatic political choice though. Assuming trump does well. If not, they’ll need a candidate that can distance themselves from him, and that would probably be Desantis.\n\nI’d also like rfk, but he’s not really a republican and I’m not sure about all his policies.",
         "I like JD and Tulsi.  About time we get some young, smart, articulate energy back into this, who can handle the media and leftist operatives well.  As a 60 year old dem turned independent who voted for Trump in this and the last election, really pleased with the results and the increased level of diversity within the republican camp, which belies the dem nonsense belief, which assumed that everyone would be aligned with their garbage identity and victim-based politics forever.  I absolutely hate what that party has become.",
         "Tulsi perhaps? Is she ready?",
         "They need to already be considering 2028. If we keep control of the house we need to fortify elections with mandatory voter id, the mass deportation of illegals needs to happen, and republicans need to get more involved at the grass roots level.",
         "JD, Vivek, Tulsi. Lot of good candidates for the Rs",
         "Either JD, Tulsi or Vivek would be my choice.",
         "I maybe in the minority but I'd love to see Tulsi Gabbard get some consideration.",
         "Vance+Gabbard 2028",
         "It needs to be JD or DeSantis.",
         "Vivek Ramaswamy 2028!",
         "JD/Tulsi",
         "JD/Tulsi",
         "It’ll probably be Vance, but DeSantis deserves another look. You can’t deny what he’s done in Florida. Imagine if he was able it do that on a national level.",
         "DeSantis has my vote already. Get that man in the fucking white house!",
         "VV 28",
         "JD. nobody runs thing better than a Marine.",
         "Well, the first thing they need to do is prepare for the return of presidential candidate  Kamala Harris's second run for office. 😂",
         "Man I'm drowning with all the liberal tears right now T\\_T",
         "Any combination of JD, DeSantis, or Tulsi",
         "Trump junior",
         "Vivek is still the guy we should be looking forward with. He is the only guy I’ve ever seen in an interview to respond to a question he was illinformed with to state “I’m sorry I’m not as informed as I’d like to be on that subject to have an opinion. If you give me a week I will research the topic and I can get back to you”",
         "Vance / Gabbard",
         "Hold your horses there, Pete ... we JUST finished this election, can we have a freaking break before thinking about next election!?",
         "I'd say Tulsi. Demos are screaming for a woman so it only makes sense.",
         "vance 2028 💯💯",
         "I'm happy he won, and I know we need to have that lined up for 2028, but I think that's not the alligator closest to the boat. I'm very fearful of what sort of roadblocks will be in his way. \n\nAll is lost if we aren't able to make good on our promises. And members of the establishment are going to try everything in their power to ensure it takes 4x longer if not impossibly long for Trump to effect positive change.\n\nI think Trump is well positioned to tackle all that, but I'm worried because I know some dirty tricks are about to come out of left field.",
         "Bobby Kennedy will probly run as a republican - Vance will probly run against him in the primaries. 🍿",
         "Looking at all these Kamala loving dipshits cry is the best feeling",
         "JD/ DeS for sure",
         "Not Donald or JD please.",
         "Hmm ... Trump reminds me of Hitler",
         "Agreed. JD is clearly the right choice. He can go into the hornets nest and leave without a single sting.",
         "Vance/DeSantis",
         "No Vivek for anyone?\n\nNot pushing for him, just wondering everyone’s thoughts.",
         "I'd already forgot how terrible the DeSantis Campaign was.",
         "Actually my thoughts as well. Tulsi would be a great candidate regardless of gender; which is the type of candidate you’d want for a first woman.",
         "Maybe. She needs a little time to grow. But I can see JD/Tulsi or vice versa someday.",
         "then you obviously don't know history",
         "and you remind me of a cry baby.\n\nnow stfu and get lost",
         "Hmm... You remind me of a turd that won't flush.",
         "Vivek as as the VP.",
         "I'd vote for Vivek, but I think he might be a bit too philosophical for the average voter. He can speak as well as Obama but he really likes talking about abstract concepts, he's like the JP of politics.",
         "I’d vote for Vivek, but would also be happy with him as a Senator. Good with VP too.",
         "I really like JD but I prefer Vivek to be honest.\n\nI followed his campaign a bit and I found him to be very convincing.",
         "There will be a Stalingrad within 4 years, I stopped reading about the 3rd reich already, doing china now",
         "This is the way",
         "100%",
         "im literally clutching my pearls while typing this",
         "you are delusional. . . absolutely nothing of what you said makes any sense, you've created a boogy man in your head, he's already been president and nothing bad happened. in fact u could afford groceries and a house while he was president. \n\nEnjoy another 4 years of peace and prosperity, you don't deserve it",
         "LOL get a clue. The Democrats are the ones who have been using Stalinist tactics for the last 9 years to try and get rid of a political opponent."
      ]
   },
   "1gl1898": {
      "title": "Guess who’s back. ",
      "text": "",
      "comments": [
         "This is even better when you remeber that eminem endorsed kamala",
         "Libs are in full meltdown mode. I'm guessing there's going to be a huge increase in admissions to mental health facilities.",
         "I FUCKING LOVE IT!!!!",
         "Back again!",
         "BOOM!",
         "Can we get Ben in here?? He does have a budding rap career 😂",
         "Reddit is melting down something awful.  Which is so weird to me since that woman \"Kamala\" only got what, 4% of the democrat vote in the original primaries?  Biden was chosen, not her.  No one chose her, ever.  So the meltdown is SO STRANGE.",
         "THE DONALD!!!",
         "Lol I love the video where he’s simulating giving head. So funny"
      ]
   },
   "1gl26cw": {
      "title": "Oh-oh someone is mad",
      "text": "",
      "comments": [
         "This is one of many reasons why my mind blanks out Wikipedia donation request banners.\nI'd respect the TDS sufferer more if their edits were particularly witty or clever though, I can always use some more comedy in my life.",
         "TDS...find a cure",
         "Someone should change Kamala’s to “future McDonald’s Employee of the Week.”",
         "Some people are a little slow",
         "Wikipedia is a joke and anyone who uses it as a source should not be reasoned with",
         "At risk of being downvoted... guys if you have problems with things on wikipedia you should make an account and change those things. I read on there once that the Brooks Brothers Riot decided the 2000 election, that was wrong so I provided my reasoning for why that was wrong in the discussion page and changed it. Just follow the rules. They may be biased but it's not nearly as bad as reddit.",
         "Defamation suit, anyone?",
         "The meltdown of these mentally ill liberals is hilarious",
         "Unlike under the Harris/Biden regime…this won’t be forced down by the FBI",
         "Where is this at on wiki? I went to Trump's page and it's not there",
         "Hahahaha",
         "When does everyone expect their black Hugo Boss suit and jackboots to be in?",
         "surprised they didn’t draw devil horns on him yet",
         "Yes Dems, please to continue to act like insufferable cunts and lie about everything.  I'm sure it will eventually work.",
         "I like how they keep misunderstanding how Nazism worked. Keep spreading the ignorance I guess. Wiki is cementing itself as a great source for information again too.",
         "Seriously, I used to throw them a few bucks here and there after I graduated college, since they helped me get through college so much, but not anymore. \n\nI know they can be edited by anyone, and I don’t hold them responsible for the edits, but it’s the blatant misinformation they’ll keep on their site for so long because one left leaning “expert” is the one monitoring the page.",
         "The co-founder of Wikipedia Larry Sanger has been vocal against its left wing bias.",
         "The cure is JD Vance, and it will be available to you beginning in 2028.",
         "“The woman that fell of a coconut tree”",
         "“Disgraced Alleged Former Fry Cook,” known for general incompetency and rampant sexual misconduct in the workplace",
         "They don't want her. Never did.",
         "Agreed, but it can be a good source for sources, lol I often go it and scroll to the bottom to get the actual sources 😂",
         "https://en.m.wikipedia.org/w/index.php?title=President-elect_of_the_United_States&oldid=1255745582",
         "https://en.wikipedia.org/wiki/President-elect_of_the_United_States\n\nNot there. Either has been corrected, or a photoshopped mirror link.",
         "Vance 2028!!!!",
         "Nah, TDS is going to cling on through 2032 easy",
         "Maybe Canada would take her.",
         "Damn that's salty, they edited it back quickly lol.",
         "Do they prefer word salads on their menu?"
      ]
   },
   "1gksgsk": {
      "title": "Trump wins!",
      "text": "",
      "comments": [
         "It’s a great time to be on Reddit. Haha!",
         "He has lead all swing states for hours",
         "R/Texas is locked down",
         "Congrats.\n\nProud to be an American (as a legal immigrant from Eastern Europe)",
         "All praise to God! Our country is not lost!!",
         "Why do I keep seeing posts that he's won but can't find that on Google anywhere. Has he actually won? 🤞🤞🤞",
         "🇺🇸🇺🇸💕",
         "I honestly didn’t think they would allow it. I thought they would cheat like they did last time. Too big to fail!",
         "To big to rig!!",
         "I’m supposed to be at work in 3 hours but I don’t care. I want to see this through. I’m extremely hopeful.",
         "Cnn still hasnt declared him a winner..hahahaha",
         "Only Fox has called it this far.",
         "Thank god. Just listening to that moron HeelsUp would have been hell for 4 years",
         "My leftist tears mug is overflowing",
         "Ben was gloating so hard over this news last night on the DW's coverage. So hilarious!",
         "Anyone check r/politics, r/pics, or r/[insert state] lately?",
         "Just passed so manny posts about liberals crying. Good time to be on Reddit.",
         "[removed]",
         "Let the entertainment begin!!!!!",
         "It sure is.  And a great time to see all the tears flowing.  Americans spoke.",
         "Finally, after all the left propaganda out here on Reddit before the election.",
         "How the redditors on r/Texas feel when the state that votes red every year votes red:",
         "Congratulations to you. Glad to have you and your family as Americans.",
         "We are proud to have you!",
         "It's just been delayed by 2 years lol",
         "Same… I think Google is trying hard not to concede harder than Kamala lol",
         "CNN and The New York Times were really dragging their feet and didn't want to give Trump Alaska, Wisconsin, Nevada, Arizona, and Michigan.",
         "Fox News had called Pennsylvania for Trump, and so did Decision Desk HQ around 1 am. This eventually led to DDHQ calling the election in Trumps favor. AP wouldn’t call the race until around 5 am.",
         "Now you learned about corporations being in politics pockets. What your comment states is proof internet interference isn't freedom. If a search Corp can't be neutral than it shouldn't be allowed. Fuck Google.",
         "There is the ever so slightest chance he hasn’t won",
         "What cheating happened? There’s little evidence of rigging last time and him winning this time is also evidence of no rigging taking place",
         "Shut up. There was no evidence of large-scale vote tampering last election and certainly not on a scale to flip the election the other way. Trump lost 2020 fair and square. And he won today fair and square.",
         "I feel that, like how can I sleep at this time!?!",
         "The New York Times was dragging their feet on it, too.",
         "Fox called it a little early, but they based it on the fact that more than 90% of the votes had been reported, and there was no way for Kamala to take the lead in Wisconsin or Pennsylvania",
         "I mean, they probably been crying for the past 2 hours, just like Kamala's whole election party.",
         "It is odd seeing so many threads with so much activity in it, but zero up votes.",
         "America the Beautiful",
         "If they are Cowboys fans they’re used to disappointment.",
         "That's what I told my son. I think Google is messing with us lol.",
         "I gave up around 4ish my time when he was at 267. I couldn't stay awake anymore, lol. Good ol Google wouldn't update for anything. So I came here to get the info. Can't rely on anyone else.",
         "Absolutely.  I've seen FB posts being removed today as well.",
         "Sorry for your loss",
         "Shh. The thick-skinned, Trump worshippers can't handle the thought of people not liking their daddy. They tend to get emotionally unstable when you point out his endless list of flaws.",
         "No vote tampering. But tell me the media didn’t sway hard left in their coverage (or lack of coverage). It’s pretty well confirmed and I’m hoping a lot of people lose their credentials and security clearing this week. Drain the swamp.",
         "Whatever you have to tell yourself. Your leftist masters appreciate your blind support",
         "I don't know about the extent of vote tampering but there were things going on behind the scenes. Time labeled it the shadow campaign. \n\nhttps://time.com/5936036/secret-2020-election-campaign/",
         "It is!!!!  And Land of the Free...",
         "I suspect they're 49ers fans.",
         "The media has a first ammendment right to say whatever they want. Even if it's conplete lies, so long as it doesn't cross into slander."
      ]
   },
   "1gl44bf": {
      "title": "How I like my coffee",
      "text": "",
      "comments": [
         "I'm fucking suing the daily wire.  I woke up to my house flooded. I can't even reach the tumbler without nearly drowning. This was NOT listed on the warning label. I'd vote 0 stars if I could 😤",
         "I need this",
         "I starting cackling when I saw this lmfao was not expecting that in my feed",
         "It’s gonna be overflowing today!",
         "I will be taking mine to work with me until I'm forced to stop.\n\nWe are now the majority 🦅🦅🦅🦅",
         "😅",
         "The sell them on the Daily Wire website. I don’t know if they still do it, but a paid membership used to come with it"
      ]
   },
   "1gl6f3n": {
      "title": "DOJ Getting Rid Of Jack Smith Before Trump Takes Office, Dropping Federal Cases",
      "text": "",
      "comments": [
         "Since Trump isn’t president yet (re-president?) this is more proof it was all B.S.",
         "More of this to come. When the puppets don’t get the job done, the puppeteers move on to something else",
         "Say it ain’t so",
         "Yes. It was what is called lawfare.",
         "Yes.",
         "The Spanish inquisition guy was a hellva puppet character, though. Chills!"
      ]
   },
   "1gks0wo": {
      "title": "“Texas Will Flip Blue”",
      "text": "Glorious Photo 🇺🇸",
      "comments": [
         "r/texas on full lockdown right now\n\nIm not surprised they banned people who uploaded republican voter resources",
         "Proud Texas voter!! My husband and I sent our absentee ballots 2 weeks ago from South Korea.  Keep Texas Red!",
         "Ironically the (D)elusional loser in the Senate race was Colin Allred.\n\nAll red..!!  Lol",
         "Don’t Mess with Texas",
         "Aged like milk",
         "California and New York are closer to flipping than Texas",
         "On many subs you cannot type the word trump but you can type Kamala.\n\nThey’re melting down. And I’m bathing in the tears.",
         "These fools really thought because they were the loudest that they were the majority.",
         "Hell yeah Fort Worth. From Purple to Red this go round!",
         "I voted in Austin - seems more purple to me there",
         "Taking snaps right now for the records",
         "Im on long island new york. I expect (or hope) busses of ICE agents just walk town to town deporting all the illegals up here. My hour ride home has become 3 with more virginia and delaware and mississippi plates than the states themselves have!!! Forget the countless accidents everyday.",
         "You should be embarrassed to be a democrat. I think they owe you an apology for running a terrible candidate.",
         "The mark my words sub has been HILARIOUS",
         "I got banned from r/Texas they be reeeaally silent rn hahaha",
         "That’s what r/Texas r/Louisiana r/Mississippi r/Florida all said!! Meltdown incoming",
         "Reddit is delusional",
         "Nonsense",
         "Maybe in a twilight zone episode",
         "It sure did... And the loons will ruin the trend that the Dems have been advertising by turning on the Latinos for the crime of voting red",
         "Lol",
         "Hahahahahahahahahahaha!",
         "I thank God Ted Cruz won! Even though I live in Richmond I donated to his campaign.",
         "This is in r/Texas. [https://www.reddit.com/r/texas/comments/1gl8kp3/its\\_the\\_dawn\\_of\\_a\\_new\\_day\\_again/](https://www.reddit.com/r/texas/comments/1gl8kp3/its_the_dawn_of_a_new_day_again/)\n\nHow long until it's deleted?\n\n(It's a drawing of a bright, happy sun, with the President's smiling face on it.)",
         "Item 7642 of their bullshit propaganda",
         "LOL, WRONG!",
         "I'm loving it.",
         "Yeah. I just tried to reply to a thread someone started 1w hours ago and realized I couldn't because the thread was locked.\n\nThen I went down the list and every single one of them are locked.\n\nI think that is rather telling about how the other side is going to deal with their new reality.",
         "Jeez that sub is out of control.",
         "Love to see it. By far one of the most sensitive group of ban-happy over anything that doesn’t toe the line of the radical left agenda mods on the site. \n\nTo borrow one of their phrases, “ I hope they’re having the day they deserve.”",
         "Not only did they ban me but they instantly muted before I could even say anything at all!",
         "Good Job!!",
         "Yup",
         "Waiting for the comedy acts of weeks worth of worthy Trump Deraingment Syndrome clips!!!",
         "Best part about the meltdown posts is you can ban all the bots.🤖 They make it so obvious. Surprised Reddit doesn’t recognize them.",
         "Like a bunch of cry babies that can't handle when they don't get their way.\n\nI almost dread the next four years due to how obnoxious they'll be. Almost...",
         "Like a bunch of cry babies that can't handle when they don't get their way.\n\nI almost dread the next four years due to how obnoxious they'll be. Almost...lol",
         "Them and pic. Hell The thing that got me banned from pics also got me a warning from reddit.",
         "Years. It’s going to be years."
      ]
   },
   "1glf39o": {
      "title": "President Jo Biden",
      "text": "Haha",
      "comments": [
         "AI Biden probably would have done better.",
         "Joe gets to retire proud now that’s for sure",
         "I mean most AI versions of Biden are actually pretty funny to watch and that goes for most of the AI presidents videos"
      ]
   },
   "1gl7rrh": {
      "title": "Where are you getting your chalice of cope filled?",
      "text": "It's early christmas for conservatives, so tell me what's the best subreddits to drink from the chalice of cope, the tumbler of tears, the mug of misery?!\n\nI must say that the r/the_everything_bubble is juicy right now. Fucking golden\n\nBask in the ignorance of the brainwashed, my friends. It's a great day, and things are going to get better 🤜🤛\n\n",
      "comments": [
         "r/punk\nr/badfacebookmemes\nr/teachers\nr/pics\n\n🤌",
         "How do they keep saying democracy has ended? Is it only democracy when the people they want to win are victorious?\n\nAlso, since the candidate that was forced upon them without a primary election didn't win, NOW  democracy has ended? \n\nAm I missing something?",
         "The difficulty I have is we know Reddit is infested with bots and paid operatives. How many of these freak out posts are real and how many are fake?",
         "That pic is of the inside of Zaps head",
         "Oh my god I found a really good one. r/witchesvspatriarchy",
         "\"No Signal\" sums it up nicely.",
         "Those are golden. Lord have mercy",
         "Oh god I didn't think about r/punk. That's gonna be good.",
         "Ugh, thanks for reminding me that aweful sub around my career.",
         "No you're not missing anything, just the media is brainwashing people that don't pay close attention to politics. The media can survive without good ratings because they are funded by billion dollar corporations running ads and giving donations. As to why, that, I don't know. But most people just hear what their friends say and they just read a headline and that's all they need to dehumanize us. It's sad",
         "Democracy is when democrats get 💯 what they want. If they get 99.99% it’s fascism.",
         "You're witnessing their narrative collapsing in upon itself. Even a leftist brain has a limit to the amount of cognitive dissonance it can contain.",
         "I don’t understand the head shaving? Is it supposed to hurt MAGA somehow? All it does is prove their mental illness"
      ]
   },
   "1gkshv0": {
      "title": "Whoopsie Daisy ",
      "text": "Oopsie doopsie ",
      "comments": [
         "Her irrelevance from this day forward pleases me.",
         "To be unburdened by what has been",
         "Hope we never have to see this lady ever again. She can go back to being an alcoholic",
         "She was a terrible candidate and the media did everything they could to make her look viable.  She was so bad at answering questions, she only fooled the people suffering from TDS.",
         "The look of falling from coconut tree.",
         "Awfully quiet on reddit this a.m.",
         "She’s such a knucklehead",
         "I want to see how this smug individual handles the blowback now",
         "Love it!!",
         "Ugly.",
         "“Hahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahshah.” -KDawg",
         "FKH",
         "I LOVE IT!!!",
         "Oops and I farted. 🤭",
         "I'm so happy that we are finally unburdened from this dumbass!",
         "She looks like she's either trying to hold in a laugh or trying to hold in vomit. I can't decide which.",
         "Deeply.",
         "That book tour going to be lit",
         "“We didn’t want to lose, but we did lose. And in losing we realized that losing is when you lose. But losing does not mean you lost, it just means that you realize what losing is.”",
         "After she certifies the election lol",
         "They’re coping as hard as they can.",
         "That sounds about right after wasting over a billion dollars.",
         "They’re so salty it’s hilarious",
         "This comment is awesome!!!",
         "I've been. Banned",
         "How so? I see your message",
         "Not this sub. But they are trying. Had a mysterious harassment report. I asked what was the reason and got no answer to why.",
         "Oh. Ya. I get the suicide help line outreach thing all the time. First few times I went back and reviewed what I wrote that maybe I said something dumb or something that could be misinterpreted. Nope. Just them reacting in the most vile way possible per usual. I got banned from so many political subs due to auto bot accounts flagging me over paragraphs like this. And good luck disputing it. For them to be all about democracy they sure do hate it when it’s directed at them."
      ]
   },
   "1gl0c0x": {
      "title": "It's so insane to me that these women only care about the ability to freely without consequence murder their unborn baby when considering policy.",
      "text": "",
      "comments": [
         "Pro abortion initiatives won in four states, and barely did not pass in FL (57% yes, 60% needed to win). Only SD defeated an initiative by a majority. Sad & evil\\*. \n\n  \n\\* Evil here being defined as the intentional and willful inflicting of pain & death onto others for your own gain & pleasure.",
         "Yep. Says a lot about the people who believe this is an important issue. It might also be a reason why they lost.",
         "Get your tubes tied, get an implant, get on the pill, don’t have unprotected sex, make intelligent decisions with your partner. Don’t kill your children"
      ]
   },
   "1gkwbnd": {
      "title": "This is what Brett said",
      "text": "",
      "comments": [
         "This is the way."
      ]
   },
   "1gl16fc": {
      "title": "Discussion; REALISTICALLY, do you think Kamala Harris will be selected for democratic nominee for next election?",
      "text": "How compelling is she as a candidate for the average democrat voter vs her expected/potential competition?\n",
      "comments": [
         "No. She wasn’t even selected for this one lol. She took control after a back door coup.",
         "When challenged, I think she’ll cry racism and misogyny at first, and say she wears the mantle and the nomination should be hers. \n\nBut she’ll be drowned out by any candidate who can speak without a script and handle a presser.",
         "She'll have to win a primary this time, so no.",
         "She’s going to be getting the Biden treatment very quickly. She’ll be shunted off to the side and blamed for Trump’s re-election. (Not wrongly. She was an abysmal candidate).",
         "Hell no. They’ve run the three worst presidential candidates in history.",
         "No, the first primary she ran it she did terrible. Joe had to pick her up from nothingness and make her VP as he can say he has a black woman as VP. Only reason she even got that close to the presidency is because they forced Joe Biden out and forced her in.",
         "There's literally 0% chance this happens.  They won't even let her run in the primary; at best she'll do a short stint as a MSNBC contributor but no one likes her so that'll last 2-weeks.",
         "No. In fact if they had a primary this election she would not have been picked. She is grossly unpopular.",
         "Any reason this is getting downvoted lol?\nI obviously don’t want her to even run. \n\nI’m asking for others’ opinions, as I am only aware of my own perspective.",
         "Not a chance.",
         "Nope",
         "Possibly, because she and people like her won’t learn from their mistakes.",
         "I doubt she’d survive a primary. We’ll have a better idea of who by the midterms.",
         "Hell no. Gavin Newsome vs Ron Desantis. Do your remind me in 4 years thing because I’ll be right",
         "She will be one of the pack and will drop before her first primary.",
         "I don’t think the dems wanted her anyway. It was a last minute switcharoo forced on them. She would fail and has failed a primary within the party. \n\nI’d love to see it though. She was a train wreck.",
         "Not a chance. Not only that but I don’t think we’ll be seeing much of her anymore. Her career is going to fade off quickly now",
         "She will be an outcast in the Demoncratic party.  She was a terrible candidate and failed her mission, they are not ones to forgive and forget.",
         "No way !",
         "Not if they have any interest in winning.",
         "She was a last minute choice forced by the DNC wanting to keep the 100 million $+ they got under the Biden campaign that could only be used by the same campaign. So absolutely no chance of her being the nominee next time.",
         "No.",
         "I think any job in public service is probably over for her at this point. She was just a tool used by the DNC.  Sadly, that is just the game in D.C.",
         "Hell no.",
         "No. Her political career on the federal level is done. She may go back to California and run for governor, but even then I don’t think so. Usually you don’t go downwards in politics.",
         "No fucking way.  Not even close.",
         "I hope so.",
         "No she’s done. This is one of their worst results in a long time.",
         "No. She was a horrible option this time around. She’s inauthentic, cowardly, weak, and radical as hell. There’s a reason she dropped out of the 2020 race as early as she did. The only reason she was selected was so they could get access to the Biden/Harris war chest. They thought they could run her on vibes for 100 days and it fell apart.",
         "Not a chance.",
         "HA!!! nah.",
         "Hell no! I hope she is, it would be an easy win if it’s her versus Vance, but the Dems will run a real primary and if Kamala enters she will get very low votes and be out of it quickly.",
         "Not ever",
         "They’d probably try with Bilary again before her. (Autocorrect did that for Hillary, is that a /r/dailywire feature?)",
         "Absolutely not. I think the dnc has learned that promoting a candidate based solely off of sex/gender isn't going to win them any elections. Hell, even the corpse of Joe Biden garnered more support than Kamala or Hillary.",
         "Who?",
         "Gavin Newsom is feeling pretty good right now.",
         "No",
         "No, her White House politician days are over!",
         "Zero chance.  She has her chance and lost spectacularly.  Her campaign was terrible - it had more money than God, and still lost across the board.  Thought it may take them a year to see this.  They are most likely going to clean house.  If they’re smart - in 2028, they will have a Bill Clinton type candidate",
         "Didn't she lose because she was a horrible candidate? She ran a horrible campaign, and she's a person whomis as fake as ahe is dumb, and too many voters just cannot stand anything about her.\n\n\nI think left/right politics played second fiddle to her losing because she's an unlikeable dolt.",
         "She will fade into oblivion.",
         "Gosh no. If anything, she proved she was not a good leader.",
         "Hopefully,  but I don't think the Democrats are that stupid",
         "I've already heard people talking up whitmer for 28.... On one hand it would be nice to get her out of Michigan, on the other hand, she would be president........",
         "I think her and her campaign team will be quietly forced out. Joe Biden was a better candidate and even suffering from dementia, he was a better candidate. Joe could’ve stepped down much sooner and that would’ve helped the Democrats, but I believe they were all in on covering for him until that debate. I don’t think there was any pressure for him to step down until that moment. Even so, designating a replacement without going through the Democratic process was a huge mistake. We will all hear stories today about how 5 million more Americans than voted for Kamala are racist or misogynist but that really had nothing whatsoever to do with the election. It’s about a lucid policy that Americans can understand.\n\nI am an independent and probably lane libertarian if anything. The question I ask myself every four years is am I better off or worse off than I was four years ago. A lot of people decided worse off.",
         "No. She has too much baggage in this election and there's no way for her to get rid of that baggage. She didn't plan long-term.",
         "You can’t be serious, right? She was literally the least qualified and able to be the leader of the free world. Don’t you think the democrats know this? They are evil, not stupid.",
         "Beyoncé",
         "Incidentally, \"back door coup\" was Willy Brown's favorite sex position.",
         "I just worry that democrats will feel like they were close this time and people are already familiar with her.",
         "I think you hit that pretty spot on. \nI don’t want to see her run in the next race.",
         "They need to break away from the extreme progressive left and realign to a more moderate stance to have a shot",
         "Yeah, everyone knows what racist, dementia ridden Joe was attempting there lol. \nThe worst part about these recent democratic candidates is that they are complete chameleons. \nThey take on different acts for certain groups and it’s really frustrating to see because they often get the votes of people I’m certain they don’t actually care about.",
         "Brigaders. They hate that our guy won. They hate he won the popular vote. They hate Rs have control of the senate and more governorships. They just hate.",
         "She lost her first one. She’s terrible and now the country knows how fake she is.",
         "RemindMe! 4 Years “was he right?”",
         "U don’t think Vance could make it on the ballot?",
         "I doubt they learned their lesson lol\nBut you may be right about Kamala not winning or running for primaries.",
         "Headline from San Francisco Chronicle: With Donald Trump as president, Gavin Newsom poised to become ‘leader of the resistance’",
         "Ya and Dems stayed home and didn’t vote for her. She’s done politically unless she runs for senate.",
         "They were so far off they lost the popular vote for the first time in twenty years to someone they called a Nazi.  Her career is done once they realize they can't blame the electoral college and begin blaming her instead.",
         "I hope they run her again so they get stomped again\n\nShe is completely incompetent",
         "But she wasn’t close at all. The margins for her were terrible compared to 2020",
         "Worry? We should be so lucky that they be dumb enough try again with her.",
         "Dems eat their own! Look at Hillary they blame her for Kamala. Joe is too stupid to take the Blame. Kamala and the Party knew it was over before the first votes were counted because the exit polls showed she failed. Nobody holding a title in the party was even at Howard but college students and blind sheep. The campaign staff was in Wilmington watching on TV. Kamala is DEI! DEI has failed!",
         "I do. Another free win.",
         "Oh it’s eating them up for sure 😂😂😂",
         "Good point, we'll see how he does as VP. Ron has a great established record right now which is why DW pulled for him so hard initially. Plus we all heard Ron's handling of covid, I don't really know what Vance has done.",
         "[deleted]",
         "Even then, she's not going to get anywhere if the Dems are sane",
         "“Feel like” they were close\nThey were ahead in many polls\nBut we did indeed win by a mile.",
         "I don’t know much about Vance yet but he has had some whit in the debates and I admire it lol\n\nI do like Desantis too.",
         "They’re not lol.",
         "Yep I didn't watch the VP debates or Rogan, definitely gonna go back and watch his Rogan ep now. Sounds like either would be a good choice to follow in 2028",
         "I had some hope for them to become sane. Time will tell. Maybe the media will stop pumping them full of inane fallacies this time.",
         "I watched MSNBC today to see what they were saying. Watched a couple shows between meetings. They’re not sane. They’re blaming everyone other than Kamala. Basically, it’s dumb Americans who aren’t college educated who screwed everyone. They still don’t get it."
      ]
   },
   "1gktx4q": {
      "title": "People talking about Trump being a threat to democracy",
      "text": "There’s a bunch of people who are saying Trump is a threat to democracy. Ironically though, yes there were a lot of voters who thought someone was a threat to democracy but overwhelmingly those people voted for Trump, because they actually thought Harris was a threat to democracy not Trump. Idk how there was so many people who voted for Harris. I will say though that I won’t be able to rest easy until every vote is counted.",
      "comments": [
         "The Democrats using Stalinist tactics for the last 8 and half years to eliminate a political opponent are the true threat to Democracy and our Republic.",
         "Weaponizing the DOJ against a political opponent, weaponizing the FBI against parents at school board meetings, disenfranchising 14 million voters who voted for one candidate and then replacing the guy they voted for with a candidate they wanted is the real threat to democracy. They literally ignored the votes of their own people. That is the textbook definition of anti democratic.",
         "They meant to say threat to their bureaucracy",
         "People who think this also think having a Commander in Chief with dementia is somehow NOT a threat to national security.",
         "Not to mention an attempted assassination",
         "If anyone actually believed that the whole country wouldn’t have elected him",
         "Vast majority saw through the state propaganda put out by the MSM.",
         "Says the party that completely circumvented the electoral process. Whatever!! We are back baby!!",
         "I see all kinds of panic on Reddit today. People saying they need to get hysterectomy operations or have their tubes tied or stockpile birth control because mean ole Trump is gonna force them to be baby factories. People saying he’s gonna raid every dem voters home. Man. The media and dem propaganda machine has these people terrified!  How do we fight such reckless fear and hatred?",
         "Didn’t you know it’s only democracy when you vote for my “candidate”. Otherwise if you vote for the candidate you want it’s fascism, Duh /s f it’s not painfully obvious.",
         "The threat has been temporarily eliminated.  But don’t think for a minute that the satanist liberal democrats will sit idly by without taking actions to further destroy American democracy.  It’s just a matter of time.  The enemy within.",
         "They overplayed.  When the middle can’t overlook the lawfare and media manipulation of reality anymore, then the doubling down on the hate rhetoric and fear mongering starts to backfire.",
         "This time they won’t be able to sabotage his presidency with Russian collusion investigations",
         "⬆️⬆️⬆️😂😂😂",
         "You saw that AI video too?",
         "In a fair election, sure. But they cheat. A lot. And that's how we got Biden."
      ]
   },
   "1glatwy": {
      "title": "Does anyone know why Jeremy Boreing wears a literal key around his neck? Has he ever said anything about it?",
      "text": "",
      "comments": [
         "He's talked about it a few times I think on backstage. I think it was something at one of his first gigs or something like that. I remember I wasn't overcome by hearing the story, but I was like \"oh okay.\"",
         "If I recall correctly it's a key to a theater in Texas.",
         "Is it a reference to the production company \"Bentkey\".  \n\nhttps://get.bentkey.com/",
         "Was curious of the same thing myself",
         "It’s think it’s actually the inverse, the company name is a reference to the key.",
         "The key predates Bentkey",
         "he spoke about it in the interview (it was more of a chat TBH) with Ben about it. It is a reference to his early days when in the film industry"
      ]
   },
   "1gkyc0w": {
      "title": "Look what I found",
      "text": "",
      "comments": []
   },
   "1gl24cg": {
      "title": "The Jesus Movement in the 1960s converted a lot of hippies. Trump is securing the modern New Age/Rogan vote. Here's why that's important to conservative dominance going forward.",
      "text": "",
      "comments": [
         "Here are some famous and *influential* conservatives aligned to this movement. Some are still new age and others are converting to Christianity.\n\n1. Joe Rogan\n2. Jordan Peterson\n3. JP Sears\n4. Brandon Russell\n5. Aubrey Marcus\n6. After Skool",
         "Cool"
      ]
   },
   "1gkjep4": {
      "title": "Trump!!",
      "text": "",
      "comments": [
         "It’s fucked up it’s even this close lol. 47 percent of Americans are that stupid??",
         "I don't believe that chart at all. I bet less than 30% really think Kamala is better for the economy. I bet the methodology on that poll never gets published.",
         "Yeah it being this close is fucking scary. \n\nAlso that bottom ribbon showing 43% say finances are worse today vs 56% saying they’re the same or better is not good for Trump, and I’m waiting it as someone who wants him to win. Looks like that’s just for MI though.",
         "It’s an NBC poll so doubtful it’s accurate.",
         "Gullibility would seem to be at a record high…",
         "Yea they are",
         "To vote for her, yes they’re are, still 🤦‍♀️",
         "Atleast a majority have common sense",
         "30% are, yes. The rest are just that checked out/ undiscerning."
      ]
   },
   "1glo5do": {
      "title": "Oh no….",
      "text": "",
      "comments": [
         "What is that from? I'm guessing he was told to go f*#k himself. That's the kind of funny, yet dorky thing he would say as a response. I like the guy a lit, but let's be real, he's a dork, lol.",
         "It’s from a discord server, I was caught so off guard 😭"
      ]
   },
   "1gkebyp": {
      "title": "I plan to call the race in a few minutes.",
      "text": "",
      "comments": [
         "Most accurate map we have at this point in the vote count!",
         "Is the yellow piss?",
         "The Sasquatch vote in the Pacific Northwest is severely under-represented.",
         "More accurate than CNN, MSNBC, and Fox.",
         "Libertarians are showing up more than I would have expected.",
         "This may be the best election map I've seen ever.",
         "Nailed it, bro.",
         "Well, you’re clearly not calling it for Kamala because you *used* the crayons instead of eating them.",
         "Without piss, blood, and finely-ground lawn signs we’d all be in the dark.",
         "JEB!",
         "Truth!"
      ]
   },
   "1gkq5l5": {
      "title": "“We Believe In All That” — the poetry of Kamala Harris",
      "text": "Some quotes to inspire us all",
      "comments": [
         "Pathetic.  Just like Kamala!"
      ]
   },
   "1gk9jde": {
      "title": "Trump closed the gap in Guam and Republicans may flip the legislature",
      "text": "",
      "comments": [
         "Oh wow! “I hope the island flipping does not drown the residents!!!” Hank Johnson \n\n/s",
         "**Context**\n\nWhile Harris will win Guam's straw poll, Trump appears to have closed the gap by ten points compared to the last election. There's also indication that republicans will either almost or will flip the Guam legislature. This may be a harbringer for results to come.\n\nOr polls are still shit.",
         "High energy Jeb never gets old.",
         "Hafa Adai!",
         "Who has ever actually been polled? Anyone know how they work. I can’t find a single person that has been polled In regards to the election",
         "I polled your mom last night.  Ask her.",
         "I don’t know. I’ve been a registered voter for 23+ years and I have never been polled. \n\nHere’s the kicker, polls are not as scientific as presented. They send out a certain number of surveys to a certain area. So if the demographic is all one political leaning (i e. a liberal/conservative city) then of course it’s not going to be surprising the surveys will come back mainstream for that area. \n\nOne other subjective issue is the fact that polls affect polls. In other words if a poll says XYZ is popular, but just those surveyed had that opinion, then it’s a false equivalence. Polls have and will most likely be just a sociological construct of its own making. And that is why  political scientists don’t really consider just polls but mix them in with other more concrete evidence. \n\nIt’s a mess. And it’s a political tool and that’s it. It’s waving a flag of whatever the political agenda is for a specific purpose. It’s not informative, it’s disruptive. We need them but we shouldn’t lean into them.",
         "How was it? Helpful? Fun? Educational? Or just raw goodness?",
         "Ouch. That’s cold blooded. Very original though.",
         "Low hanging fruit.",
         "Yummy."
      ]
   },
   "1gkm118": {
      "title": "This is the Official DailyWire Election Link",
      "text": "",
      "comments": [
         "Fantastic content, I’ve been watching for 3 hours now"
      ]
   },
   "1gju17q": {
      "title": "I had comments deleted, being called a bigot, even the ones I know didn't believe me. But I was right ",
      "text": "",
      "comments": [
         "Everybody just stood around and let this dude beat on women. The left was full blown protecting him. Micropenis recognizes micropenis I suppose.",
         "Enough time has passed that no one cares anymore, particularly the ones that scolded you for being right. It's kind of the playbook, as the same thing happened with COVID.",
         "I remember reading leftist say she was born a woman and tried to make people feel bad for her. Turns out she was a man all along and they just lied like they usually do.",
         "Hahaha the ole micropenis. I’d probably want to beat women up too if my dick was described as an enlarged clit 😂😂",
         "I  read that this morning so others did as well! Good job.",
         "Because truth, actual truth is inconvenient at best and unnecessary at worst.",
         "I mean I would be mad if I had a micropenis but I wouldn’t beat women",
         "She is a woman",
         "that's how everything in society is. it literally makes me sick.",
         "So will the medal 🏅 and title be taken away from him.",
         "Honestly bro. I can’t imagine that life but women deserve respect and love 🫡",
         "XY chromosomes does not constitute a woman.",
         "Whatever the voices tell you my dude.",
         "No HE'S not",
         "Did you read the article?",
         "But what is a woman?",
         "r/hownottogiveafuck",
         "What?",
         "[removed]"
      ]
   },
   "1gjxi1y": {
      "title": "Kamala's hats selling like hotcakes???",
      "text": "In New York, you see Trump/MAGA hats go for $18< minimum. I guess Kamala is doing \"sOoOoO gOoD\", that they gotta sell her caps for 2bucks each.... isn't that how supply and demand works???",
      "comments": [
         "I have never seen a Kh hat.  I just began to see a couple of signs recently.  Maybe 20 : 1 in favor of trump tho.  I'm in Ga.",
         "Still overpriced.",
         "The subsidies too lol",
         "Just because people aren’t buying random nick nacks from 3rd party vendors doesn’t mean their candidate isn’t doing well. It’s honestly kinda cringe seeing people with a politician’s name all over them/their house",
         "*sigh*\n\nTrump supporters tend to be much more enthusiastic to the point of purchasing any and all merchandise that sports his name. \n\nJust because other politicians aren't pimping their name doesn't mean they don't have support."
      ]
   },
   "1gj64bf": {
      "title": "Meme I Made ",
      "text": "",
      "comments": [
         "Shouldn't it be screaming in a baby's face?",
         "Very unrealistic. Where is the blue hair?",
         "Sad but true. Gonna have to win by a big margin to overcome the fuqqery that is gonna happen tomorrow.",
         "They had to look like that to vote too",
         "Imagine them being known as the delusional TDS generation 🤔"
      ]
   },
   "1gj1ppp": {
      "title": "Ok, last one.",
      "text": "",
      "comments": []
   },
   "1givkl4": {
      "title": "No one on that list will ever have their name released.",
      "text": "",
      "comments": []
   },
   "1giq5d9": {
      "title": "Election Coverage ",
      "text": "Does any one know if you need a subscription to watch their election coverage?\n\nThanks,",
      "comments": [
         "I'm quite sure it'll be on YouTube for free, all of their post election coverage was free on YT as well.",
         "Don't forget Rumble.  No need to give views and subs to YouTube.",
         "Sweet! Was it live on youtube? I always listen to the post analysis on Spotify. I want to find live coverage on Tuesday as I don’t have cable or anything",
         "You’re not “giving them to YouTube” you’re giving them to the channel you are watching on YouTube. ",
         "I'm fully planning on watching it on YouTube live. I'll be shocked if it isn't.",
         "Anything right leaning has been demonetized by now.  It all goes to Google.",
         "That’s definitely not true. "
      ]
   },
   "1giftzj": {
      "title": "What even is reality anymore?!",
      "text": "Dear God I wish I had a time machine. I would go to 2 days after the election and be like: oh you think this is nuts. Have I got a story for you.",
      "comments": [
         "Trump needs to save squirrels 🐿️",
         "The 2020 election*",
         "We have a yard squirrel named Larry, seeing this I want to bring him in an fully adopt him 🥺"
      ]
   },
   "1ghz3g9": {
      "title": "No lie is detected",
      "text": "",
      "comments": [
         "Poor Squirrel killed for being a star.",
         "#justiceforpeanut",
         "Normally, I would’ve ignored this story while sympathizing with the owner, but the fact that violent felons are actively ignored by police in the sanctuary cities is what gets to me.",
         "When you lack skills, you have to select the tasks you are successful at.   Fight crime?  Too hard.  Bully children?  Doing that their whole life...",
         "Nuts Out 🫡🥜",
         "Can I get context please?",
         "He was killed for being a Republican!",
         "SAY IT’S NAME",
         "No. NY State government kidnapped and killed someone's pet squirrel. Be angry. But in all seriousness there isn't much more to it than that.",
         "https://www.usatoday.com/story/news/nation/2024/11/01/peanut-the-squirrel-euthanized/75992420007/"
      ]
   },
   "1ghyjj2": {
      "title": "How The Kamala Camp Is Reportedly Manipulating The Internet To Fake Support And Spread Lies",
      "text": "“On Reddit, Harris staffers allegedly direct volunteers to post specific content to specific threads, and up-vote or down-vote certain posts – effectively spamming threads and seemingly breaking platform rules. The apparent goal is to make Harris appear more popular than she is, and promote content that helps Harris, even if it’s not true. For example, staffers have allegedly directed the boosting of Project 2025 content, which they tie to former President Donald Trump, even though Trump is not connected to the plan.”\n\nI, for one, am shocked!",
      "comments": [
         "Not surprising in the slightest. Reddit is a leftist cesspool.",
         "Yep. Even the “posts you may be interested in” are all posts about Trump being bad or harris being the messiah, even in completely unrelated subreddits - different cities, sports, travel, etc. I block every one of them and they keep showing more. \n\nThey’re fighting hard to make it seem like there are people who actually support her.",
         "You can see it everywhere. Especially red state subs where someone “votes dem” for the first time ever like it’s their first CrossFit workout and it’s appropriately upvoted by a fake brigade new accounts and some of the softest “me too” comments",
         "I remembered when people used to post on r/pics things like \"Trump acting creepy\" BUT WHEN I posted pics of BIDEN being creepy they deleted it because \"is political\"",
         "Yep, everyday I see these insane Left wing posts with huge upvotes.  They are speaking in an echo chamber though, so hopefully it’s a waste of their efforts.",
         "Propaganda machine is real there's a lot of money involved.",
         "I see daily ads ok tv from Kamala's campaign talking about project 2025 bullshit, despite it being outright lies. Arrested for birth control, ivf banned, national abortion ban, etc. All of it is utter bullshit. That is in top of the \"Hello fellow Republicans,\" ads that show various people claiming to have voted Trump in the past 2 elections but won't in the next, each one playing the same \"rich as hell\" sound bite. Its so ridiculously obvious they are actors since the script is damn near identical regardless of who the \"Republican\" is.",
         "I posted on something where they were blaming Republicans for all voter fraud, when I countered I was told I need a source, when I supplied a source they didn't like i was told I was going to be banned for posting false information. When I asked why they didn't need a source, I was told it was hyperbole. Morons run those subreddits.",
         "[r/AdviceAnimals/](https://www.reddit.com/r/AdviceAnimals/) <-- the whole sub is turned into a democrat pro meme generator. Its dystopian.",
         "This was obvious (not that she was behind it, but that something was fishy on this platform) immediately after the failed Biden debate. TDS propaganda started popping up in weird places like food and other completely non-political subs",
         "They're just trying to make it believable that she could actually win. So if they cheat, they'd point to how \"popular\" she is in the internet and media. Of course, the few sheep that actually support her would believe the lies  like they've always have.",
         "I am not shocked by anything the Democrats do or say. They will literally do anything to win an election, including lying and cheating.",
         "Reddit is ruined and I’m not sure why I even open it anymore. This is the only good sub.",
         "Uhhhh check out Reddit.",
         "This seems like a pretty common political tactic in the modern age. Are there any campaigns in the last 15 years that don't have a social media team that do exactly this?",
         "And every benign subreddit. Like r/pics ....totally inundated with lefty garbage posts. It has to be curated or bot content.",
         "When there is a pro Trump post or questioning the status quo - it is sent to internal messaging and then swarmed with downvotes.",
         "The cesse`est of pools",
         "It’s funny because Kamala is literally the least exciting or inspiring person. She’s just an empty vessel that the machine got behind.",
         "The amount of \"I've always voted republican... until today!\" Posts are funny",
         "Maybe normal people don't support Donald Trumps constant vomit of lies. Like how he just said he never tried to repeal affordable Care AKA Obamacare when he literally tried to do it his entire presidency, but don't worry he's got a concept of health care. It's taken him 9 years to get to a \"concept\" of replacing the affordable Care act. Hope none of you guys are on Medicare etc",
         "I totally agree. Thank you for the post!",
         "This and r/criticaldrinker are it",
         "This is different. Reddit is a broken system. The subreddit enlist Super Left moderators that ban anyone with an opposing post. \n\nThis is not just enlisting people to post the opposite.",
         "That one is one of the worst.",
         "A lot are paid actors and there's a lot of blind followers in there, that's where you get all that. So yeah there is some of the people. I don't agree with any political party at this moment. They're all in a big club and we're not in it. Just wish people would see that.",
         "Explain this to me, because what you're saying is not what is reported in the article. What specific subreddit enlists Super Left moderators that ban anyone with an opposing post? \n\nWhat exactly does it mean to 'enlist' them? \n\nWhy do the existing moderators need to \"enlist Super Left moderators\" for their subs to ban people? Can't they already do that themselves if they wanted to?\n\nHere is what the article claims: \"On Reddit, Harris staffers allegedly direct volunteers to post specific content to specific threads, and up-vote or down-vote certain posts – effectively spamming threads and seemingly breaking platform rules. The apparent goal is to make Harris appear more popular than she is, and promote content that helps Harris, even if it’s not true. For example, staffers have allegedly directed the boosting of Project 2025 content, which they tie to former President Donald Trump, even though Trump is not connected to the plan.\""
      ]
   },
   "1gi8irs": {
      "title": "Does Matt Walsh know about the movie Tusk?",
      "text": "",
      "comments": [
         "Im asking this because I know he wrote the book Johnny the walrus and I would love to see him have to review this movie on the show.",
         "Probably not but he absolutely should"
      ]
   },
   "1ghgmk9": {
      "title": "Hey, fellas! Hey!",
      "text": "",
      "comments": []
   },
   "1gh4e8h": {
      "title": "Chicago Police announces hate crime, terror charges against gunman accused of shooting Orthodox Jew",
      "text": "",
      "comments": []
   },
   "1gh2gct": {
      "title": "Has anyone watched the documentary “Am I ra*ist?” from the DailyWire+?",
      "text": "What is everyones thoughts on the docum\nentary from the DailyWire+ Am I ra*ist?? \nInterested in hearing everyones thoughts and opinions!!\n",
      "comments": [
         "Saw it in theaters, was refreshing to hear so many ppl laughing lol",
         "I watched it last night with my boy. There are some really funny scenes. Matt exposes leftist DEI activists for the grifting devisive idiots they are.",
         "Saw it in the theatres. Excellent documentary.",
         "I loved the movie and he made excellent points about how far too far überwoke has become. I kinda wish he hadn’t been such a jerk because this could have otherwise been a great recommendation for friends, colleagues and others at my church who really need a wake up call. Unfortunately I can only recommend to those who already know. Ya know?",
         "It's a really funny yet uncomfortable movie. It shows how outside of reality people are, and how many hoops people will jump through to stay in that \"safe space\"",
         "I watched in theatre. It was good for what it showed, I didn't think it was amazing. I've known these people hate America and white people for years, so no revelations. Glad it was made so people still asleep can wake up.",
         "Not yet.",
         "Took my mom to see it in the theater. We had a blast and we were happy to see a nice variety of people in attendance.",
         "Yes it was good.  Not great.  But “great” is a tall order for a mockumentary",
         "I’m itching to watch it! It looks so good! Hope X lets it be seen for free again like they did “What is a woman?” DailyWire needs to get into video games too.",
         "I watched it earlier this week.\n\nI didn’t find it nearly as funny as “What is a Woman?”",
         "My dad and I plan to watch it once he's back from vacation.",
         "Not yet, I’m waiting until my three day weekend coming up to do a free trial and watch it + some other stuff to see if upgrading is worth it (I’m sure it is I’m just poor and saving for like 3 different big things right now and this is unfortunately the lowest priority for me currently)",
         "It looks so fucking great I can’t wait to watch it",
         "Yep! It was pretty funny, though not as substantive as \"What Is A Woman\". I think Matt let some bits last too long that took me out of the moment a few times, although bumbling oaf humor just isn't for me so maybe that's my fault.",
         "Are we censoring \"racist\" now? Even though it's in the name of the movie?\n\nIf we are, can we pick a less important letter than the one that makes the word look like \"rapist\" instead lmao",
         "What's under the asterisk? Is it a 'P'? I hope not! Not you, Matt Walsh! Nnnooo!!!",
         "Loved it. I liked it better than, \"what is a woman?\" bc it was just a straight up comedy. The workshop scene was hilarious and probably my fave part. That or the robin interview.",
         "I'll see it one day. Eventually...",
         "I usually don’t like Matt’s content. This was good but I feel there was too much of him in it.",
         "Right? Some of the people there were even younger than me, and I'm 30 years old! It was heartening, to say the least.",
         "yess!!",
         "Fully agree. What Is a woman had a bit of this to real you in early on, but then really jumped into the deep water on how much damage it's doing.\n\nI kept waiting for that transition but it never really got deeper than \"LOOK HOW LIBERAL THE CHERRY PICKED MOST LIBERAL PEOPLE WE FILMED ARE\"\n\nthere were no deeper revealing statistics/2nd layer harm/messages, was entirely a gotcha. But i loved that lady giving $32 reparations 🤣🤣🤣🤣",
         "Oh, I didnt even know it was in theaters?! I saw that it was on the DailyWire but you need a subscription. interesting. but yes, its about time people wake up! I feel the media has always been trying to turn us against eachother!",
         "I wonder if there is anywhere we can watch it without getting a subscription to the dailywire+?",
         "I didnt see a downvote on my end. Did you accidentally press it? lol",
         "I want to watch that one even more I think lol",
         "Other than this and what is a woman, anythinh else I should be checking out?",
         "i want to watch that one! is it on dailywire+ too??",
         "I'm 36 and was one of the older people there. It was awesome.",
         "Just got a 1 month membership to watch these.  Saw what is a woman last night.  The first 25 min or so was…meh.  I only needed about 5 min of it.  When he started getting into the damage it’s doing and when Miriam Grossman got into the history of it, that’s when the film took off in a good direction.  Just traveling around annoying people is fun for YouTube but getting to that substance is what documentaries are for.  It is hard to balance the two; I just wish it didn’t take so long to get to that substance.  I’m hoping “am I racist” is better.",
         "I have the subscription,  I just didn't watch it yet.\nAnd why on earth was I downvoted !?",
         "No.\nI suspect some Kamalabots are downvoting me now automatically.",
         "Worth the watch. I loved it",
         "Mr. Birchum looks funny as hell if you like adult animated comedies, and Run Hide Fight looks like a good drama! I also just love Michael Knowles, so I’d definitely binge some of his show on there.",
         "Its not unfortunately. If you thought first 25mins was rough, get ready for 75mins here",
         "it doesnt show a downvote for you on my end!",
         "Now I am +1.\nMaybe it was a mistake \nMaybe someone upvoted me.\nMaybe someone is messing with me."
      ]
   },
   "1ggonr5": {
      "title": "Trump sues CBS News for $10 billion alleging 'deceptive doctoring' of Harris' '60 Minutes' interview ",
      "text": "",
      "comments": [
         "Good. At this point, all the legacy media outlets run a single identical story 24/7 — \"toe the party line, or else.\"",
         "Good! I hope he wins!",
         "He is ridiculous! Chances of this going anywhere are 0 to None. They won't countersue as even if they do win he'll never pay or be in a grave before it finishes appeals.",
         "You guys remember that Fox News/ Dominion defamation lawsuit? I’ll be flabbergasted if theres not at least a 787 million settlement here. Im from Michigan, even our liberal Secretary of State is acknowledging the problems their shit machines are having in early voting. If defamation was the claim for Fox, this CBS lawsuit should be fraud.",
         "Doesn’t necessarily matter for him, It brings more attention to what happened."
      ]
   },
   "1gg0mnq": {
      "title": "It's a dirty job, but someone's got to do it",
      "text": "",
      "comments": [
         "Mike Rowe, Donald Trump is coming for your job!!",
         "Hauling off all the subreddits I’ve muted due to politics.",
         "What an absolute mad lad",
         "Fucking epic 🇺🇸",
         "Im actually a garbage man and it is oddly satisfying to see Trump in a trash truck. Its a thankless job where everyone needs you but treats you like dirt.",
         "I was waiting for it. Garbage people (even properly gendered) here to take out the trash!",
         "Time to take the trash out of the white house",
         "Woof",
         "Mike Rowe for Secretary of Transportation",
         "I wait until I’ve been banned from commenting then I mute them.  I find it more satisfying",
         "Everything they do only makes him more powerful"
      ]
   },
   "1gg0s7t": {
      "title": "The vast majority of reddit despise us it seems.",
      "text": "",
      "comments": [
         "One side unironically calls half the country *literal trash*. The other side makes silly jokes and rides around in a literal garbage truck.\n\nIt really speaks volumes. Deplorables: Part II",
         "Fuck em.  Have you read the articles on the reddit astroturfing?  If not read them and you’ll know why.",
         "I don't care I love Chick fil A",
         "Ah, yes. Because going out of your way to Other your political rivals and dehumanize people is the moral and good thing to do.\n\nBut of course lol",
         "The Bible is the icing on the cake…\n\nThe left isn’t even trying to hide its bigotry at this point.",
         "Why do they have such disdain for Christians, yet are terrified to speak out against other religions? Is there a label we can come up with for the Christian faith being persecuted out of sheer hate/intolerance? The left absolutely **hate** being labeled something negative. It's their kryptonite 😂\n\n6 more days...",
         "Let the cultists boo us. We've seen what makes them cheer. If they're unhappy, things are moving in the right direction.",
         "man what did chick fillet do?",
         "The vast majority of Reddit is full of bottom feeders",
         "They despise the idea of us.\n\nIt’s part of the media “othering” anyone who doesn’t agree with them.",
         "mostly bots",
         "There is a paid VERY VOCAL minority who do. They will dry up in November after the paychecks stop rolling in.",
         "I DON'T have a Confederate battle flag heart tattoo, but I DO like Chick-Fil-A...guess that's their problem, not mine.",
         "Bahhhaaha. Reddit is 90% liberal leftist.",
         "That means we are doing something right.",
         "Just a bunch of basement dwellers who scream, bitch, piss and moan online to complain about everything else for their shitty life decisions.\n\n\nI wouldn't look too much into it.",
         "And Chick-Fil-A? Damn if you can’t eat a sandwich from there your priorities are all fucked up.",
         "These look oddly similar to those kamala in an eagles jersey adds that were put up in Philly, before the eagles had that ripped down.",
         "Only 40.3k upvotes wouldn't even be half of the nation's voter pool",
         "Chick Fill A is great bro!",
         "It’s funny, I’ve seen a lot more left wing crap pushed into my feed here lately too. Couple that with this nonsense and it becomes just tiring at times.",
         "Reddit is a left-wing cesspool",
         "That's fine; the feeling goes both ways.",
         "How dare I like chic fil a or have a Bible?",
         "Reddit is a freakish amount of bots. I wouldn't sweat it.",
         "For sure. Full of basement dwelling “victims”.",
         "NYC FOR TRUMP!",
         "I wonder how many liberals stroked out during the Trump MSG rally? It must have been a beautiful thing to behold.",
         "Bots and bootlickers without an original thought, oh no……",
         "It’s ok to be hated/disliked by those possessed by ideology",
         "Never thanked god faster than thanking him for being vegetarian.🙏🤍",
         "This is from years ago\n[Keep NYC trash free](https://www.snopes.com/fact-check/nyc-sanitation-posters/)",
         "May we all SeekTheLordsFaceForANewHeart",
         "There’s no new information here.",
         "The \"Be Kind\" people are incredibly vicious and hateful, right?",
         "Yeah I usually just call them stupid but now we're trash, garbage, Evil, racist, all kinds of ists and we want to take everyone's Rights away. What's bad it's not just the propagandists saying that but normal people. It's because they're dumb",
         "To forgive and love your enemies is the hardest thing to do, which is one of the core teachings of Jesus Christ.",
         "And chik fil a does really well in NYC so this is doubly funny.",
         "“The tolerant left”",
         "They don't have to.  They've \"captured all the flags\" so to speak: gov't, academia, media, \"science\", corporations.",
         "They'd never do that with the **Qur'an**. They'd rather go after the peaceful religion that doesn't behead people.",
         "Alright Rick. I'm with you.",
         "It was started by a company with strong Christian morals hence why they’re closed on Sundays.",
         "Donate to religious corporations that are against LGBT",
         "I was wondering about that.",
         "Keep telling yourself that",
         "Ah I didn’t know I thought it was recent thanks",
         "They only mean their team. Which is why the teachings of christ are so profound in that they pierce human nature.",
         "Deus Vult! /s",
         "The tolerant left is the most intolerant people I’ve ever encountered. And I’ve been to Sharia Law Caliphates",
         "Not any more.  New leadership, made a big deal months back about donating to LBG stuff.",
         "Keep telling yourself you're the good guys.",
         "When I see the \"Be Kind\" signs, I always say in an undertone, \"... or else.\"",
         "SELAH",
         "Same",
         "That's very unfortunate",
         "the bots found me…",
         "😂"
      ]
   },
   "1gg4gwg": {
      "title": "Harris Campaign Caught Manipulating X To Censor Criticism",
      "text": "",
      "comments": [
         "The Harris campaign is very active on Reddit.",
         "Won’t matter. Most of us are numb to the media now.",
         "I don’t even comment on Reddit anymore. \n\nEveryone is a liberal pussy who can’t handle the truth.",
         "I am on the discord server and can view the chat, if anyone wants to verify anything (like if you want to know whether you were targeted).",
         "And water is wet.",
         "Maybe that’s why my account was permanently suspended last night. I can’t even deactivate my account",
         "X, like other media, is still managed by Commies. Musk might boast about free speech but his employees at X monitoring posts are third rate, notorious censors of free speech. Musk’s all the claims are false. For example, my account under old Twitter which was banned for life was not revived in spite of appeals. Likewise, my new X account has been banned forever for the post” dead communist is a good communist” saying that it promotes violence!. X and Musk both are frauds misleading people",
         "Oh shit yeah….\n\nBetween bots and the paid psychos…. They are everywhere.",
         "Yes they are.  And really disgusting as well.",
         "Waaaaaa, I can't promote violence on a platform that I says I can't promote violenceon their platform. \n\nGet outta her ya ya fucking dolt.",
         "I mean they have a point with the communist thing…",
         "There is still a TOS, if you don't want catch a ban read it and don't break the companies rules or word what you are trying to get across a little smarter.",
         "“There’s still a TOS” how’s it feel being the dude from Chappells show that fucks with his pajama pants still on?"
      ]
   }
}