{
   "1gkebyp": {
      "title": "I plan to call the race in a few minutes.",
      "text": "",
      "comments": [
         "Most accurate map we have at this point in the vote count!",
         "Is the yellow piss?",
         "The Sasquatch vote in the Pacific Northwest is severely under-represented.",
         "More accurate than CNN, MSNBC, and Fox.",
         "Libertarians are showing up more than I would have expected.",
         "This may be the best election map I've seen ever.",
         "Nailed it, bro.",
         "LOL",
         "Without piss, blood, and finely-ground lawn signs we’d all be in the dark.",
         "JEB!"
      ]
   },
   "1gk9jde": {
      "title": "Trump closed the gap in Guam and Republicans may flip the legislature",
      "text": "",
      "comments": [
         "Oh wow! “I hope the island flipping does not drown the residents!!!” Hank Johnson \n\n/s",
         "**Context**\n\nWhile Harris will win Guam's straw poll, Trump appears to have closed the gap by ten points compared to the last election. There's also indication that republicans will either almost or will flip the Guam legislature. This may be a harbringer for results to come.\n\nOr polls are still shit.",
         "Hafa Adai!",
         "High energy Jeb never gets old.",
         "Who has ever actually been polled? Anyone know how they work. I can’t find a single person that has been polled In regards to the election",
         "I polled your mom last night.  Ask her.",
         "Ouch. That’s cold blooded. Very original though.",
         "How was it? Helpful? Fun? Educational? Or just raw goodness?",
         "Low hanging fruit.",
         "Yummy."
      ]
   },
   "1gju17q": {
      "title": "I had comments deleted, being called a bigot, even the ones I know didn't believe me. But I was right ",
      "text": "",
      "comments": [
         "Everybody just stood around and let this dude beat on women. The left was full blown protecting him. Micropenis recognizes micropenis I suppose.",
         "Enough time has passed that no one cares anymore, particularly the ones that scolded you for being right. It's kind of the playbook, as the same thing happened with COVID.",
         "I remember reading leftist say she was born a woman and tried to make people feel bad for her. Turns out she was a man all along and they just lied like they usually do.",
         "Hahaha the ole micropenis. I’d probably want to beat women up too if my dick was described as an enlarged clit 😂😂",
         "I  read that this morning so others did as well! Good job.",
         "Because truth, actual truth is inconvenient at best and unnecessary at worst.",
         "I mean I would be mad if I had a micropenis but I wouldn’t beat women",
         "She is a woman",
         "that's how everything in society is. it literally makes me sick.",
         "So will the medal 🏅 and title be taken away from him.",
         "XY chromosomes does not constitute a woman.",
         "Whatever the voices tell you my dude.",
         "No HE'S not",
         "Did you read the article?",
         "But what is a woman?",
         "r/hownottogiveafuck",
         "What?",
         "[removed]"
      ]
   },
   "1gjxi1y": {
      "title": "Kamala's hats selling like hotcakes???",
      "text": "In New York, you see Trump/MAGA hats go for $18< minimum. I guess Kamala is doing \"sOoOoO gOoD\", that they gotta sell her caps for 2bucks each.... isn't that how supply and demand works???",
      "comments": [
         "I have never seen a Kh hat.  I just began to see a couple of signs recently.  Mayne 20 : 1 in favor of trump tho.  I'm in Ga.",
         "Still overpriced.",
         "The subsidies too lol",
         "*sigh*\n\nTrump supporters tend to be much more enthusiastic to the point of purchasing any and all merchandise that sports his name. \n\nJust because other politicians aren't pimping their name doesn't mean they don't have support.",
         "Just because people aren’t buying random nick nacks from 3rd party vendors doesn’t mean their candidate isn’t doing well. It’s honestly kinda cringe seeing people with a politician’s name all over them/their house"
      ]
   },
   "1gj64bf": {
      "title": "Meme I Made ",
      "text": "",
      "comments": [
         "Shouldn't it be screaming in a baby's face?",
         "Very unrealistic. Where is the blue hair?",
         "Sad but true. Gonna have to win by a big margin to overcome the fuqqery that is gonna happen tomorrow."
      ]
   },
   "1gj1ppp": {
      "title": "Ok, last one.",
      "text": "",
      "comments": []
   },
   "1givkl4": {
      "title": "No one on that list will ever have their name released.",
      "text": "",
      "comments": []
   },
   "1giq5d9": {
      "title": "Election Coverage ",
      "text": "Does any one know if you need a subscription to watch their election coverage?\n\nThanks,",
      "comments": [
         "I'm quite sure it'll be on YouTube for free, all of their post election coverage was free on YT as well.",
         "Don't forget Rumble.  No need to give views and subs to YouTube.",
         "Sweet! Was it live on youtube? I always listen to the post analysis on Spotify. I want to find live coverage on Tuesday as I don’t have cable or anything",
         "You’re not “giving them to YouTube” you’re giving them to the channel you are watching on YouTube. ",
         "I'm fully planning on watching it on YouTube live. I'll be shocked if it isn't.",
         "Anything right leaning has been demonetized by now.  It all goes to Google.",
         "That’s definitely not true. "
      ]
   },
   "1giftzj": {
      "title": "What even is reality anymore?!",
      "text": "Dear God I wish I had a time machine. I would go to 2 days after the election and be like: oh you think this is nuts. Have I got a story for you.",
      "comments": [
         "Trump needs to save squirrels 🐿️",
         "The 2020 election*",
         "We have a yard squirrel named Larry, seeing this I want to bring him in an fully adopt him 🥺"
      ]
   },
   "1ghz3g9": {
      "title": "No lie is detected",
      "text": "",
      "comments": [
         "Poor Squirrel killed for being a star.",
         "#justiceforpeanut",
         "Normally, I would’ve ignored this story while sympathizing with the owner, but the fact that violent felons are actively ignored by police in the sanctuary cities is what gets to me.",
         "When you lack skills, you have to select the tasks you are successful at.   Fight crime?  Too hard.  Bully children?  Doing that their whole life...",
         "Nuts Out 🫡🥜",
         "Can I get context please?",
         "He was killed for being a Republican!",
         "SAY IT’S NAME",
         "No. NY State government kidnapped and killed someone's pet squirrel. Be angry. But in all seriousness there isn't much more to it than that.",
         "https://www.usatoday.com/story/news/nation/2024/11/01/peanut-the-squirrel-euthanized/75992420007/"
      ]
   },
   "1ghyjj2": {
      "title": "How The Kamala Camp Is Reportedly Manipulating The Internet To Fake Support And Spread Lies",
      "text": "“On Reddit, Harris staffers allegedly direct volunteers to post specific content to specific threads, and up-vote or down-vote certain posts – effectively spamming threads and seemingly breaking platform rules. The apparent goal is to make Harris appear more popular than she is, and promote content that helps Harris, even if it’s not true. For example, staffers have allegedly directed the boosting of Project 2025 content, which they tie to former President Donald Trump, even though Trump is not connected to the plan.”\n\nI, for one, am shocked!",
      "comments": [
         "Not surprising in the slightest. Reddit is a leftist cesspool.",
         "Yep. Even the “posts you may be interested in” are all posts about Trump being bad or harris being the messiah, even in completely unrelated subreddits - different cities, sports, travel, etc. I block every one of them and they keep showing more. \n\nThey’re fighting hard to make it seem like there are people who actually support her.",
         "You can see it everywhere. Especially red state subs where someone “votes dem” for the first time ever like it’s their first CrossFit workout and it’s appropriately upvoted by a fake brigade new accounts and some of the softest “me too” comments",
         "I remembered when people used to post on r/pics things like \"Trump acting creepy\" BUT WHEN I posted pics of BIDEN being creepy they deleted it because \"is political\"",
         "Yep, everyday I see these insane Left wing posts with huge upvotes.  They are speaking in an echo chamber though, so hopefully it’s a waste of their efforts.",
         "Propaganda machine is real there's a lot of money involved.",
         "I see daily ads ok tv from Kamala's campaign talking about project 2025 bullshit, despite it being outright lies. Arrested for birth control, ivf banned, national abortion ban, etc. All of it is utter bullshit. That is in top of the \"Hello fellow Republicans,\" ads that show various people claiming to have voted Trump in the past 2 elections but won't in the next, each one playing the same \"rich as hell\" sound bite. Its so ridiculously obvious they are actors since the script is damn near identical regardless of who the \"Republican\" is.",
         "I posted on something where they were blaming Republicans for all voter fraud, when I countered I was told I need a source, when I supplied a source they didn't like i was told I was going to be banned for posting false information. When I asked why they didn't need a source, I was told it was hyperbole. Morons run those subreddits.",
         "[r/AdviceAnimals/](https://www.reddit.com/r/AdviceAnimals/) <-- the whole sub is turned into a democrat pro meme generator. Its dystopian.",
         "This was obvious (not that she was behind it, but that something was fishy on this platform) immediately after the failed Biden debate. TDS propaganda started popping up in weird places like food and other completely non-political subs",
         "They're just trying to make it believable that she could actually win. So if they cheat, they'd point to how \"popular\" she is in the internet and media. Of course, the few sheep that actually support her would believe the lies  like they've always have.",
         "I am not shocked by anything the Democrats do or say. They will literally do anything to win an election, including lying and cheating.",
         "Reddit is ruined and I’m not sure why I even open it anymore. This is the only good sub.",
         "Uhhhh check out Reddit.",
         "This seems like a pretty common political tactic in the modern age. Are there any campaigns in the last 15 years that don't have a social media team that do exactly this?",
         "And every benign subreddit. Like r/pics ....totally inundated with lefty garbage posts. It has to be curated or bot content.",
         "When there is a pro Trump post or questioning the status quo - it is sent to internal messaging and then swarmed with downvotes.",
         "The cesse`est of pools",
         "It’s funny because Kamala is literally the least exciting or inspiring person. She’s just an empty vessel that the machine got behind.",
         "The amount of \"I've always voted republican... until today!\" Posts are funny",
         "Maybe normal people don't support Donald Trumps constant vomit of lies. Like how he just said he never tried to repeal affordable Care AKA Obamacare when he literally tried to do it his entire presidency, but don't worry he's got a concept of health care. It's taken him 9 years to get to a \"concept\" of replacing the affordable Care act. Hope none of you guys are on Medicare etc",
         "I totally agree. Thank you for the post!",
         "This and r/criticaldrinker are it",
         "This is different. Reddit is a broken system. The subreddit enlist Super Left moderators that ban anyone with an opposing post. \n\nThis is not just enlisting people to post the opposite.",
         "That one is one of the worst.",
         "A lot are paid actors and there's a lot of blind followers in there, that's where you get all that. So yeah there is some of the people. I don't agree with any political party at this moment. They're all in a big club and we're not in it. Just wish people would see that.",
         "Explain this to me, because what you're saying is not what is reported in the article. What specific subreddit enlists Super Left moderators that ban anyone with an opposing post? \n\nWhat exactly does it mean to 'enlist' them? \n\nWhy do the existing moderators need to \"enlist Super Left moderators\" for their subs to ban people? Can't they already do that themselves if they wanted to?\n\nHere is what the article claims: \"On Reddit, Harris staffers allegedly direct volunteers to post specific content to specific threads, and up-vote or down-vote certain posts – effectively spamming threads and seemingly breaking platform rules. The apparent goal is to make Harris appear more popular than she is, and promote content that helps Harris, even if it’s not true. For example, staffers have allegedly directed the boosting of Project 2025 content, which they tie to former President Donald Trump, even though Trump is not connected to the plan.\""
      ]
   },
   "1gi8irs": {
      "title": "Does Matt Walsh know about the movie Tusk?",
      "text": "",
      "comments": [
         "Im asking this because I know he wrote the book Johnny the walrus and I would love to see him have to review this movie on the show.",
         "Probably not but he absolutely should"
      ]
   },
   "1ghgmk9": {
      "title": "Hey, fellas! Hey!",
      "text": "",
      "comments": []
   },
   "1gh4e8h": {
      "title": "Chicago Police announces hate crime, terror charges against gunman accused of shooting Orthodox Jew",
      "text": "",
      "comments": []
   },
   "1gh2gct": {
      "title": "Has anyone watched the documentary “Am I ra*ist?” from the DailyWire+?",
      "text": "What is everyones thoughts on the docum\nentary from the DailyWire+ Am I ra*ist?? \nInterested in hearing everyones thoughts and opinions!!\n",
      "comments": [
         "Saw it in theaters, was refreshing to hear so many ppl laughing lol",
         "I watched it last night with my boy. There are some really funny scenes. Matt exposes leftist DEI activists for the grifting devisive idiots they are.",
         "Saw it in the theatres. Excellent documentary.",
         "It's a really funny yet uncomfortable movie. It shows how outside of reality people are, and how many hoops people will jump through to stay in that \"safe space\"",
         "I loved the movie and he made excellent points about how far too far überwoke has become. I kinda wish he hadn’t been such a jerk because this could have otherwise been a great recommendation for friends, colleagues and others at my church who really need a wake up call. Unfortunately I can only recommend to those who already know. Ya know?",
         "I watched in theatre. It was good for what it showed, I didn't think it was amazing. I've known these people hate America and white people for years, so no revelations. Glad it was made so people still asleep can wake up.",
         "Not yet.",
         "Took my mom to see it in the theater. We had a blast and we were happy to see a nice variety of people in attendance.",
         "Yes it was good.  Not great.  But “great” is a tall order for a mockumentary",
         "I’m itching to watch it! It looks so good! Hope X lets it be seen for free again like they did “What is a woman?” DailyWire needs to get into video games too.",
         "I watched it earlier this week.\n\nI didn’t find it nearly as funny as “What is a Woman?”",
         "My dad and I plan to watch it once he's back from vacation.",
         "Not yet, I’m waiting until my three day weekend coming up to do a free trial and watch it + some other stuff to see if upgrading is worth it (I’m sure it is I’m just poor and saving for like 3 different big things right now and this is unfortunately the lowest priority for me currently)",
         "It looks so fucking great I can’t wait to watch it",
         "Yep! It was pretty funny, though not as substantive as \"What Is A Woman\". I think Matt let some bits last too long that took me out of the moment a few times, although bumbling oaf humor just isn't for me so maybe that's my fault.",
         "Are we censoring \"racist\" now? Even though it's in the name of the movie?\n\nIf we are, can we pick a less important letter than the one that makes the word look like \"rapist\" instead lmao",
         "What's under the asterisk? Is it a 'P'? I hope not! Not you, Matt Walsh! Nnnooo!!!",
         "Loved it. I liked it better than, \"what is a woman?\" bc it was just a straight up comedy. The workshop scene was hilarious and probably my fave part. That or the robin interview.",
         "I'll see it one day. Eventually...",
         "I usually don’t like Matt’s content. This was good but I feel there was too much of him in it.",
         "Right? Some of the people there were even younger than me, and I'm 30 years old! It was heartening, to say the least.",
         "yess!!",
         "Fully agree. What Is a woman had a bit of this to real you in early on, but then really jumped into the deep water on how much damage it's doing.\n\nI kept waiting for that transition but it never really got deeper than \"LOOK HOW LIBERAL THE CHERRY PICKED MOST LIBERAL PEOPLE WE FILMED ARE\"\n\nthere were no deeper revealing statistics/2nd layer harm/messages, was entirely a gotcha. But i loved that lady giving $32 reparations 🤣🤣🤣🤣",
         "Oh, I didnt even know it was in theaters?! I saw that it was on the DailyWire but you need a subscription. interesting. but yes, its about time people wake up! I feel the media has always been trying to turn us against eachother!",
         "I wonder if there is anywhere we can watch it without getting a subscription to the dailywire+?",
         "I didnt see a downvote on my end. Did you accidentally press it? lol",
         "I want to watch that one even more I think lol",
         "Other than this and what is a woman, anythinh else I should be checking out?",
         "i want to watch that one! is it on dailywire+ too??",
         "I'm 36 and was one of the older people there. It was awesome.",
         "Just got a 1 month membership to watch these.  Saw what is a woman last night.  The first 25 min or so was…meh.  I only needed about 5 min of it.  When he started getting into the damage it’s doing and when Miriam Grossman got into the history of it, that’s when the film took off in a good direction.  Just traveling around annoying people is fun for YouTube but getting to that substance is what documentaries are for.  It is hard to balance the two; I just wish it didn’t take so long to get to that substance.  I’m hoping “am I racist” is better.",
         "I have the subscription,  I just didn't watch it yet.\nAnd why on earth was I downvoted !?",
         "No.\nI suspect some Kamalabots are downvoting me now automatically.",
         "Worth the watch. I loved it",
         "Mr. Birchum looks funny as hell if you like adult animated comedies, and Run Hide Fight looks like a good drama! I also just love Michael Knowles, so I’d definitely binge some of his show on there.",
         "Its not unfortunately. If you thought first 25mins was rough, get ready for 75mins here",
         "it doesnt show a downvote for you on my end!",
         "Now I am +1.\nMaybe it was a mistake \nMaybe someone upvoted me.\nMaybe someone is messing with me."
      ]
   },
   "1ggonr5": {
      "title": "Trump sues CBS News for $10 billion alleging 'deceptive doctoring' of Harris' '60 Minutes' interview ",
      "text": "",
      "comments": [
         "Good. At this point, all the legacy media outlets run a single identical story 24/7 — \"toe the party line, or else.\"",
         "Good! I hope he wins!",
         "He is ridiculous! Chances of this going anywhere are 0 to None. They won't countersue as even if they do win he'll never pay or be in a grave before it finishes appeals.",
         "You guys remember that Fox News/ Dominion defamation lawsuit? I’ll be flabbergasted if theres not at least a 787 million settlement here. Im from Michigan, even our liberal Secretary of State is acknowledging the problems their shit machines are having in early voting. If defamation was the claim for Fox, this CBS lawsuit should be fraud.",
         "Doesn’t necessarily matter for him, It brings more attention to what happened."
      ]
   },
   "1gg0mnq": {
      "title": "It's a dirty job, but someone's got to do it",
      "text": "",
      "comments": [
         "Mike Rowe, Donald Trump is coming for your job!!",
         "Hauling off all the subreddits I’ve muted due to politics.",
         "What an absolute mad lad",
         "Fucking epic 🇺🇸",
         "Im actually a garbage man and it is oddly satisfying to see Trump in a trash truck. Its a thankless job where everyone needs you but treats you like dirt.",
         "I was waiting for it. Garbage people (even properly gendered) here to take out the trash!",
         "Time to take the trash out of the white house",
         "Woof",
         "Mike Rowe for Secretary of Transportation",
         "I wait until I’ve been banned from commenting then I mute them.  I find it more satisfying",
         "Everything they do only makes him more powerful"
      ]
   },
   "1gg0s7t": {
      "title": "The vast majority of reddit despise us it seems.",
      "text": "",
      "comments": [
         "One side unironically calls half the country *literal trash*. The other side makes silly jokes and rides around in a literal garbage truck.\n\nIt really speaks volumes. Deplorables: Part II",
         "Fuck em.  Have you read the articles on the reddit astroturfing?  If not read them and you’ll know why.",
         "I don't care I love Chick fil A",
         "Ah, yes. Because going out of your way to Other your political rivals and dehumanize people is the moral and good thing to do.\n\nBut of course lol",
         "The Bible is the icing on the cake…\n\nThe left isn’t even trying to hide its bigotry at this point.",
         "Why do they have such disdain for Christians, yet are terrified to speak out against other religions? Is there a label we can come up with for the Christian faith being persecuted out of sheer hate/intolerance? The left absolutely **hate** being labeled something negative. It's their kryptonite 😂\n\n6 more days...",
         "Let the cultists boo us. We've seen what makes them cheer. If they're unhappy, things are moving in the right direction.",
         "man what did chick fillet do?",
         "The vast majority of Reddit is full of bottom feeders",
         "They despise the idea of us.\n\nIt’s part of the media “othering” anyone who doesn’t agree with them.",
         "mostly bots",
         "There is a paid VERY VOCAL minority who do. They will dry up in November after the paychecks stop rolling in.",
         "I DON'T have a Confederate battle flag heart tattoo, but I DO like Chick-Fil-A...guess that's their problem, not mine.",
         "Bahhhaaha. Reddit is 90% liberal leftist.",
         "That means we are doing something right.",
         "Just a bunch of basement dwellers who scream, bitch, piss and moan online to complain about everything else for their shitty life decisions.\n\n\nI wouldn't look too much into it.",
         "And Chick-Fil-A? Damn if you can’t eat a sandwich from there your priorities are all fucked up.",
         "These look oddly similar to those kamala in an eagles jersey adds that were put up in Philly, before the eagles had that ripped down.",
         "Only 40.3k upvotes wouldn't even be half of the nation's voter pool",
         "Chick Fill A is great bro!",
         "It’s funny, I’ve seen a lot more left wing crap pushed into my feed here lately too. Couple that with this nonsense and it becomes just tiring at times.",
         "Reddit is a left-wing cesspool",
         "That's fine; the feeling goes both ways.",
         "How dare I like chic fil a or have a Bible?",
         "Reddit is a freakish amount of bots. I wouldn't sweat it.",
         "For sure. Full of basement dwelling “victims”.",
         "NYC FOR TRUMP!",
         "I wonder how many liberals stroked out during the Trump MSG rally? It must have been a beautiful thing to behold.",
         "Bots and bootlickers without an original thought, oh no……",
         "It’s ok to be hated/disliked by those possessed by ideology",
         "Never thanked god faster than thanking him for being vegetarian.🙏🤍",
         "This is from years ago\n[Keep NYC trash free](https://www.snopes.com/fact-check/nyc-sanitation-posters/)",
         "May we all SeekTheLordsFaceForANewHeart",
         "There’s no new information here.",
         "The \"Be Kind\" people are incredibly vicious and hateful, right?",
         "Yeah I usually just call them stupid but now we're trash, garbage, Evil, racist, all kinds of ists and we want to take everyone's Rights away. What's bad it's not just the propagandists saying that but normal people. It's because they're dumb",
         "To forgive and love your enemies is the hardest thing to do, which is one of the core teachings of Jesus Christ.",
         "And chik fil a does really well in NYC so this is doubly funny.",
         "“The tolerant left”",
         "They don't have to.  They've \"captured all the flags\" so to speak: gov't, academia, media, \"science\", corporations.",
         "They'd never do that with the **Qur'an**. They'd rather go after the peaceful religion that doesn't behead people.",
         "Alright Rick. I'm with you.",
         "It was started by a company with strong Christian morals hence why they’re closed on Sundays.",
         "Donate to religious corporations that are against LGBT",
         "I was wondering about that.",
         "Keep telling yourself that",
         "Ah I didn’t know I thought it was recent thanks",
         "They only mean their team. Which is why the teachings of christ are so profound in that they pierce human nature.",
         "Deus Vult! /s",
         "The tolerant left is the most intolerant people I’ve ever encountered. And I’ve been to Sharia Law Caliphates",
         "Not any more.  New leadership, made a big deal months back about donating to LBG stuff.",
         "Keep telling yourself you're the good guys.",
         "When I see the \"Be Kind\" signs, I always say in an undertone, \"... or else.\"",
         "SELAH",
         "Same",
         "That's very unfortunate",
         "the bots found me…",
         "😂"
      ]
   },
   "1gg4gwg": {
      "title": "Harris Campaign Caught Manipulating X To Censor Criticism",
      "text": "",
      "comments": [
         "The Harris campaign is very active on Reddit.",
         "Won’t matter. Most of us are numb to the media now.",
         "I don’t even comment on Reddit anymore. \n\nEveryone is a liberal pussy who can’t handle the truth.",
         "I am on the discord server and can view the chat, if anyone wants to verify anything (like if you want to know whether you were targeted).",
         "And water is wet.",
         "Maybe that’s why my account was permanently suspended last night. I can’t even deactivate my account",
         "X, like other media, is still managed by Commies. Musk might boast about free speech but his employees at X monitoring posts are third rate, notorious censors of free speech. Musk’s all the claims are false. For example, my account under old Twitter which was banned for life was not revived in spite of appeals. Likewise, my new X account has been banned forever for the post” dead communist is a good communist” saying that it promotes violence!. X and Musk both are frauds misleading people",
         "Oh shit yeah….\n\nBetween bots and the paid psychos…. They are everywhere.",
         "Yes they are.  And really disgusting as well.",
         "Waaaaaa, I can't promote violence on a platform that I says I can't promote violenceon their platform. \n\nGet outta her ya ya fucking dolt.",
         "I mean they have a point with the communist thing…",
         "There is still a TOS, if you don't want catch a ban read it and don't break the companies rules or word what you are trying to get across a little smarter.",
         "“There’s still a TOS” how’s it feel being the dude from Chappells show that fucks with his pajama pants still on?"
      ]
   },
   "1gfwoxh": {
      "title": "Non-Citizen From China Charged After Casting Ballot In Michigan. His Vote Will Still Count.",
      "text": "",
      "comments": [
         "So, what would have happened if he hadn't called to ask for his ballot back?",
         "If only there were some....thing that people could have prevented this from happening. Some sort of paper or something, a card if you will, that the people working the polls could check.  Something to identify the voter as a citizen or not a citizen. I'm sure there's got to be something out there that can be used for this....",
         "And when will this student be on the first thing smoking BACK to where he may vote for the CCP?",
         "Ancient Chinese proverb:\nIt’s easier to cheat and ask forgiveness than get ID and ask permission… idk… I tried.",
         "Because of the anonymous nature of voting, it's pretty impossible to undo his vote. Otherwise they could track your vote back to you.",
         "The fix is in.",
         "Nope, and his vote will still count.  Also, the sky is blue.",
         "Fascist… /s",
         "Sounds like this fella from Germany a few years back"
      ]
   },
   "1gflxxu": {
      "title": "Swiped this somewhere. ",
      "text": "",
      "comments": [
         "From the same people calling Trump voters “weird”.",
         "😂😂😂 resorting to witchcraft is a new low for the DP.",
         "Lightning bolt! Lightning bolt!",
         "Keep praying!",
         "He has plot armor",
         "Pepe protection",
         "Lmao. I’m sure this isn’t real, but it’s still funny to read. Reminds me of that south park episode.",
         "Witches are a special unhinged. About 20 years ago, they were about \"love and light.\" But then they decided they didn't like that spiritual principle that they should be punished for curses and abandoned the belief of something called the three fold rule (basically karma).\n\nThat's right: they basically rewrote their religion because they didn't want to face consequences for immoral actions.\n\nAll the love and light witches basically gave up witchcraft and became new thought (which is a Christian heresy, but still aligned with Christianity rather than occultism). Interesting that they became more Christian, not less.",
         "This is even more ridiculous when you realize it came from a “Christian” “news agency.”",
         "Yes!",
         "I feel like this sub is literally the only place I can get away from the crazy.",
         "Amen",
         "Not sure it’s new for them.",
         "My first time hearing about it but you’re probably right",
         "They actually have a “spell” that was written by some dude back in 2016 during that election. I think it’s called the Blue Wave spell or something like that. If you want a laugh, go look it up. It’s literally the dumbest stuff I’ve ever heard."
      ]
   },
   "1gfdaov": {
      "title": "Facts",
      "text": "",
      "comments": [
         "You can tell Reddit is a left leaning app for sure",
         "I watched my dad explain heels up Harris to my mother awkwardly.",
         "It's insanity out here. The trump derangement syndrome is in full effect. The symptoms are at an all time high, people are losing their minds.",
         "This is the same redditer that calls Republicans weird",
         "True , I've been banned from a few groups for saying  her only  job history is 🍆🫨 history.",
         "I don’t care what they look like; I’d actually prefer not to see them",
         "DNC poll watcher. I bet \"she\" is totally honest",
         "Put that under a spoiler next time please and thank you.",
         "That guy needs Jesus ☹️",
         "I think I defeated... **that**... in an early Final Fantasy installment.",
         "True",
         "Spot on.",
         "No facial hair?",
         "Jesus is that photoshop??? Tell me that’s photoshop. For the love of god there’s no one this screwed in the brain is there??????",
         "Kamala should slow down on the genocide if she wants to be president.  Also, body autonomy for all, no more mandatory experimental \"vaccines\" .",
         "Halloween costumes are scary this year....oh that's their everyday look. Bless...it's heart.",
         "Probably the CEO",
         "Oh seen this thing on tik tok. It belongs in an institution.",
         "So that's the freak that dinged me last week?",
         "Lol check out /rant.    https://www.independentsentinel.com/complete-fraud-harris-set-up-phony-reddit-posts-to-look-popular/",
         "I just got banned from r/politicalhumor when I poked fun at the left.   I guess the subreddit should be r/nopoliticalhumor.",
         "The next Secretary of Transportation....  or any other dept.  DEI baby!   Got Kamala the VP nod.",
         "I mean…prove the meme wrong",
         "This is why mail in voting is so important.",
         "HHAHHAHAHAHAHAHAHHA",
         "#BigFacts",
         "Why would Daily Wire delete posts that were critical of Harris?",
         "I love Hogatha! She cracks me up always listen to her channel and hope she starts streaming on Rumble in the future.",
         "Hilarious!  I disagree with Harris on basically everything but I’m afraid for Ukraine.   I wish he would pledge to not turn his back to them.  Just months ago he said he would help them but on a loan in which they would pay us back.",
         "What’s frustrating too is it’s hard to tell how many reddit accounts are bots or people karma farming.",
         "Look up the federalist article from I think yesterday. They have giant groups of ppl solely to flood reddit with shit-on-trump posts/comments",
         "Understatement of the century. Reddit is a leftist cesspool of pedophiles and perverts.",
         "Sure is. They nuts",
         "Whats that?",
         "...and a lot of cosmetic surgery.",
         "Yup, FFV, in the Great Sea Trench.\n\nI can't post images, but maybe a link will work?\n\nhttps://finalfantasy.fandom.com/wiki/Unknown_(Final_Fantasy_V)?file=Unknown_2_from_FFV_SNES_sprite.png",
         "They’s heart",
         "It’s referring to the libtard subreddits.",
         "we gave them so much money already. what else can we do?",
         "Part of a running joke (that might be true) that Kamala always progresses through her career by sleeping with the right people.",
         "I’m concerned about the support with intel and weapons that requires U.S. military assistance.",
         "Might be true? There's no doubt. From Montel to Willie Brown she's been a social climber her whole life. Never earned any job she's ever had.",
         "It’s not a running joke.  Willie Brown insisted on showing up to parties with a lady on each arm.",
         "Best Blowjob in the beltway",
         "I was trying to avoid saying it outright, but yeah.  There’s literally no other way she could’ve gotten this far otherwise"
      ]
   },
   "1gftmet": {
      "title": "Recorded in a construction zone? 🤣",
      "text": "Anybody else have a hard time following the episode today with the random background sound and voices? It kind of felt like it was distracting Matt as well, but I kept cracking up whenever I heard the random \"Ha!\" Comments 😂",
      "comments": []
   },
   "1gfie7z": {
      "title": "Can’t believe Am I Racist is real? ",
      "text": "Finally got round to watching Am I racist. I can’t believe that some of the people in it are real. The dinner table scene is shocking. Another big takeaway is the amount of money to be made: create more problems, create more money!",
      "comments": [
         "It's surreal. I follow the news and see glimpses but when you see the sheer nonsense from the Marxists it's mind-boggling.",
         "I haven't seen it except for in clips... But yeah, I can't believe these people are real either.  The amount of enabling and rewarding we've done in our society should be lessons to learn from for the future. It created monsters.",
         "This is the result of living completely within a bubble.",
         "Can I rent this I would like to support it",
         "It’s extremely disturbing but happy the movie got made and exposes these grifters for what they are but would like to see republicans take on academia in the future. Can’t let academia get taken over by leftists.",
         "It’s scary. Hoping it’s only a minority of people",
         "Subscribe to Daily Wire and support all the wonderful things they do!!!! It’s worth it."
      ]
   },
   "1gf23ob": {
      "title": "Truth bomb",
      "text": "",
      "comments": [
         "True for both sides.",
         "It’s the policies, not the politician.",
         "I am tired of being in a society that requires famous people to have impeccable personal lives. I don’t care what an actor personal beliefs are or if he’s cheated on his wife. In fact I’d rather not know so I can enjoy their craft in peace. I’d also prefer for them to stop broadcasting their opinions as if we should take them into account. The exception being for criminal/ extremely immoral activity.\n\nSame for politicians. Over the years I’ve come to have the impression that Trump really is not a bad person in real life. I think he seems savvy and funny. But you know what, I don’t really care. What matters is I believe he is sincere in trying to make the country better, and I mostly agree with most of his policies.",
         "That’s a bingo. Regardless of which party you support.",
         "I agree but strippers need love too people. Relationships do form and they do get married and have families sometimes",
         "You cannot compare politicians to strippers, one is okay and the other is gross",
         "Yeah I’ve never seen a cult of personality behind a US politician than how some people view Trump. He’s better than Kamala, but some people seem to think that he’s an actual God.",
         "Trusting in the sincerity of a politician is a fool’s errand. At best you look at their track record and decide if their policies and results align with your desired outcomes.\n\nIf you put your faith in a person you will be let down 100% of the time eventually.",
         "Ya and as a Christian I cringe so bad every time I see stuff like that. On the other hand, liberals aren’t truly religious (IMO) but view Kamala, Obama, Hillary as their saviors. So lame and ridiculous on both sides.",
         "You’re willfully misunderstanding what I said, as you came over to correct me only to make the same point I did",
         "Not really. I was commenting on your last sentence where you state “I believe he is sincere etc etc”. I just have no idea what is going on in any politician’s head so I’ve just given up on trying to evaluate their sincerity.\n\nI’m really not looking to disagree with you, that statement just stuck out to me.",
         "Oh ok sorry about that.\n\nI meant in contrast with Kamala, for example. Maybe I’m wrong about Trump and he’s trying to undermine the country, but so far, I believe him, which is why I support him. His track record also supports that, which as you pointed out, it’s what actually matters. In contrast, I don’t believe in almost anything that comes out of Harris’ mouth."
      ]
   },
   "1gexugp": {
      "title": "We need a 2024 sequel ",
      "text": "",
      "comments": [
         "Make insane asylums great again",
         "This depresses me as much as it amuses me.....",
         "Whatever happened to this person? Did they recover?",
         "I'd pay good money to see this again...right or wrong you have to admire someone who has found their calling at such a young age...",
         "This is EXACTLY who, and WHAT I’m standing AGAINST!! Trump 2024!!! End this woke madness NOW and let’s bring back common sense.",
         "She looks like Bill Gates",
         "One of the most punchable looking faces I’ve ever seen",
         "That’s one of those white dudes for Harris",
         "It would be epic to see if she’d be up for a remake!",
         "Cool out for a week and you'll have plenty to choose from.",
         "🤣🤣🤣",
         "This would make a hilarious Halloween costume…\n\n“Who are you supposed to be?”\n\n*Falls to knees*\n\n“NOOOOOOOOOOO!!!!”",
         "Looks for the extended version of this clip.  Pricless!",
         "LOL...what an attention whore that dude was/is",
         "Ironically, this zer has become this comical abomination because they/them were never told \"No\"",
         "I'm 'bout lose my mind... up in here... up in here....",
         "Patton oswalt really was upset that day.",
         "Can we please have a group of 30-50 people dress up like this and scream together at the Harris announcement gathering...",
         "Need to put a \"Where are they now?\" segment for this.",
         "Sweet, found my new ringtone.",
         "Then her portfolio gained 20%",
         "Liberal just hate freedom, and peace. Honestly prison is the best place for them",
         "I wonder if this lady has to just avoid the internet because I see her in memes, all... the... time....  She thought she was being so passionate and provocative and she ends up a constant punchline.  I still laugh when I see it because it was just a weird campus style performance of \"stupid\".   Hey, let's all scream at the sky at the injustice of our candidate losing this election.\n\nIt's this sort of performative angst that they do for each other, the currency of which is essentially worthless in real life.",
         "Someone needs to go to grippy socks jail.",
         "May favorite part of this clip is (sadly) almost never included.   Just before her scream, she surreptitiously checks to make sure the camera is on and ready to capture her big 'look at me' moment.  It just makes it that much more pathetic knowing that she WANTED that on film.",
         "It is coming. \nOnly question is will it be Joe or Kamala.",
         "This just brings me so much joy.",
         "I can't wait for the sequel when Trump wins!",
         "Emily gets canceled 😤",
         "It was the best moment of the 2016 election meltdown",
         "What is she whaling about? It doesn’t look like she would have to worry about any reproductive rights issues.",
         "🤣😂",
         "I can't fucking wait..",
         "My bath is ready for the liberal tears. Gonna be a nice, soothing bath.",
         "r/houstonwade    Get ready for round 2 ☺️",
         "If Trump wins again the lamentations will dwarf what happened in 2016.",
         "HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA",
         "Can't wait",
         "Maybe with less screaming.",
         "Make them possible again.",
         "Make Asylums Insane Again!!",
         "Reagan was the one that knee capped them and opened the door for news stations to take clear political sides. Both things trump has taken hard stances against… yet Reagan is a deity to many of those who claim to love trump.",
         "This motivates me to vote",
         "They they/them'd themselves too close to the sun.",
         "They are still screaming to this day. I’m sure if you look in the mirror and say ‘safe place’ three times they will show up",
         "I'm sure he joined a gym, got shredded, and became a J6er. Or he just doubled down on his TDS",
         "Still living in their parent's basement and bitter.",
         "Or Patton Oswalt",
         "She? Bigot\n\nThey/them is a beautiful and brave folx",
         "I thought it was a woman",
         "https://youtu.be/wDYNVH0U3cs?si=k3Fy_nTFxyrB7vfM",
         "Is a woman",
         "Real",
         "This can not be completely true. Ben just brought up that WaPo first endorsed Jimmy Carter in 1976 for instance.\n\nInterested if you have a source on this.\n\nEven if true, there are a ton of reasons to still like reagan, same as Trump with his weaknesses.",
         "Their bumping fuzzies with some furries",
         "I thought it was a chick",
         "I can see that.",
         "It’s all the genders. It’s the everything bagel of genders.",
         "LOL this is how I imagine most people on Reddit look and act like",
         "I saw a different clip of her (they?) where (whatever) looks to make sure the camera is filming before screaming.   Tells you everything you need to know about these phonies.",
         "Woops...could have fooled me.",
         "[mental institution thing](https://en.m.wikipedia.org/wiki/Mental_Health_Systems_Act_of_1980)\n\n[Fake News getting made](https://scholar.google.com/scholar?q=reagan+fairness+in+media+repeal&hl=en&as_sdt=0&as_vis=1&oi=scholart#d=gs_qabs&t=1730294924081&u=%23p%3DGWH0YhSYf6EJ)\n\nYes and no to still having reasons to like both. The things I like about trump are things I’ve liked about other people. I very much like tulsi for example.",
         "How dare both of you assume! it's a zer...",
         "It’s never hot women who are “born in the wrong body”",
         "I'm not sure the first is related to your statement but interesting non the less. I personally agree with the sentiment that the federal government does not have a responsibility to weigh in and control everything and that local communities and states should decide how to deal with such matter. The problems of mental health go far beyond repealing federal spending on it so don't want to go down that rabbit hole.\n\nFor your second point on the repeal of the fairness doctrine, I also personally take the side that in the balance of FCC vs first admendment, I go first admendment. The issues aren't that news corporations are biased, it's that they act like they are balanced. My issue with the FCC regulating it is if they are biased...which they would be by the measure of all government agencies having bias, they would not impose the rules of the fairness doctrine equally. \n\nThanks for specifying what you mean though, these are all interesting topics to discuss.",
         "😂😂😂"
      ]
   },
   "1gfax7o": {
      "title": "The difference when asked about if they are friends with someone who is voting for the opposite candidate is stunning in askaliberal and askaconservative ",
      "text": "",
      "comments": [
         "While there are still some moderate Democrats, most of the left now consists of people that went wandering in the desert, searching for something new to pour their sense of belief into. Unfortunately for the rest of us, they decided to collectively put their faith into a mirage.",
         "This went about like I thought it would.  They're generally not very pleasant people. Granted they've been deceived to an unbelievable degree. But still... You have to be somewhat a willing participant to believe the things they believe.",
         "Not surprising to me at all. I have friends who are liberals. One of them constantly makes little snide political comments but then gets upset if I do it back at him.\n\nLike I’ll say “did you hear that comment Kamala made? Oof that was a tough interview she had on 60 Minutes, huh?”\n\nAnd suddenly he’s all “come on I’ve told you I don’t want to talk about politics.”\n\nHe absolutely does want to talk about politics because he doesn’t it with other people. Just not me because he knows I’ll disagree with him.",
         "I wonder what people would say about trump if he was anointed the republican primary",
         "RFK Jr and Trump respect each other’s view points and decided to work together on the things they agree on. Same with Trump and Tulsi Gabbard. Can you just imagine what we could achieve if that was the goal in D.C. and our extremely well paid leaders could do that instead of spending all of their time on the politics of fear and division so they can keep getting elected and pad their pockets? Even “good old Bernie” who rips on the wealthy and has spent a lifetime as a mayor, congressman, and then Senator has a net worth around 3 million and owns three homes. Way past due for term limits and ending the “perks for life” plan. The Nevada legislature is just the right amount of government. $150.71 per day for 120 days every two years and term limits. They are forced to deal with what is actually important as there is time pressure, there is not as much corruption and outside interests pouring money into it as it is not a position their candidates seek to become eternally wealthy (not saying there’s no corruption, it’s the American Way in politics), and when they limit out, they’re forced to return to being a citizen like the founders intended. The State Capitol (Carson City) is pretty much a dump and most people don’t realize it’s the Capitol as so little political fat cat money is being thrown around there.",
         "Trump sat down with Rogan and had a three hour conversation. Apparently he has asked Kamala to do the same. As hard as it will be to listen to for me, on the outside chance she is willing to do so, I’ll listen. From everything I know about her beliefs and platforms, seriously doubt I’d consider voting for her but truth is, I really have no idea what she truly stands for. I want to know who our aspiring presidents are as a person and their belief system whether I agree or not.",
         "\"He stole the primary\""
      ]
   },
   "1gf0yob": {
      "title": "Ice cream so good",
      "text": "",
      "comments": [
         "I love ice cream and the Clintons >!I am not suicidal!<. >!Epstein didn’t kill himself!<. >!They want you to eat bugs and live in a high density concrete box in urban neighborhoods!<. >!They’re pricing you out of single family homes cause they don’t want people to raise normal families!<. >!They want public school propaganda to indoctrinate your kids!<. My favorite flavor is Rainbow flavor during Pride months.",
         "Saw this in another thread..   \n\nWait until you see how many companies Blackrock owns controlling majority of and Blackrock also owns the buildings those companies work in.   Now you know why the big push for Return to Office started.  The controlling shareholder is forcing companies to put their employees 'back' in the buildings they also own.",
         "Well that was depressing",
         "Not sure whether I should be laughing or crying at this video....",
         "That was the last time we saw her alive?",
         "Hang on, trying to figure out how to invest in Black Rock.",
         "Black rock, state street, and vanguard own almost everything. And also own pieces of each over.",
         "Aren’t blackrock/vanguard mutual funds? ",
         "Juicy",
         "Love this! It’s so anti establishment!",
         "She’s great, love the opening",
         "I creamed so good",
         "This is cringe, and this is so overly dramatic.\n\nWhat she says is true though.",
         "Learning about these things is a bit of a grieving process, but depression means you’re past the denial stage and you’re on the path to acceptance (after some more cycling between anger, bargaining, and depression) and soon you’ll actually being able to do something about it.",
         "BLK on NYSE",
         "How is it overly dramatic? It's a comedic way said by a pretty girl to keep the knuckle draggers looking to express something more people need to know.",
         "Elaborate",
         "Thanks. Massive profits here I come!",
         "I was halfway joking, since we are in an age of much pain and revelation, but my experience learning hard truths is that because it does involve betrayal and loss, there is a bit of a [grieving cycle](https://thewrightinitiative.com/800/600/http/i.pinimg.com/474x/be/7d/eb/be7deb82293d8596ca3ed20a6b7292c1.jpg) to it all. \n\nNot trying to give too much credit to therapist hucksters, but eventually, with enough exposure and learning, this stuff won’t even phase ya.\n\nEdit: if you wanted elaboration on how you can actually do something about it, I say community. You can’t save the world, but you can make a tiny corner of it pretty sweet. \n\nThe news just tries to soak up your time and energy on things you can’t even do anything about - so I say put that time and energy into your community and water it and watch it grow."
      ]
   },
   "1geuobh": {
      "title": "The Harris Campaign Manipulates Reddit To Control The Platform",
      "text": "",
      "comments": [
         "Reddit is a liberal hell hole.  Filled with mentally ill 20 something year olds who think they are smart and witty, but are just boot lickers and followers.",
         "Fraud campaign for a fraud candidate with fraudulent beliefs.",
         "lol pretty sure Reddit already reports to the DNC.",
         "No no, it's just pure coincidence a non political sub like r/pics just happens to be nothing but anti Trump propaganda.",
         "There’s a pile of DNC shadow subs on Reddit.\nIt’s fairly obvious.",
         "Kind of given up on Reddit. The censorship is another level!",
         "I am relatively new to Reddit and am absolutely convinced this is true.  The one dimensional approach everyone has on this platform is staggering.",
         "Reddit is so left the NPR sub has people saying they(NPR) are supporting Trump. NPR is a left leaning news outlet and anyone with a brain hears that fact everyday. It is wild to me that Reddit is so restricting unless it is what they want to see. Example: I saw multiple posts of people posting voting pics showing Harris as selected candidate. If you posted I voted and show T’s name, you would probably get perm. ban from reddit.",
         "I saw the blatant lull in political vomit before the Kamala coups. It was all silent, and then when she became the official candidate, the engine was sent pumping full steam ahead and it’s been non-stop propaganda and chaos ever since.",
         "Reddit has been coopted by a cesspool of degenerate no brains, communists, Chinese and Russian bots. Hit the popular on reddit and you can view the bubbles of hypocrisy and ignorance.",
         "From the article. \n\n\"These claims have often been dismissed, citing that Democrat voters are already more likely to be on the internet compared to their not-as-tech-savvy Republican counterparts. This would suggest that the constant flood of left-leaning content on websites such as Reddit was merely a reflection of the userbase.\"\n\nI dont think it has anything to do with dems being more tech savvy. It is because less dems/leftists have jobs or children that take up their time.",
         "My hometown sub is full of libs and they just upvote each other and live in their bubble. No other opinions allowed. All cops are murderers. Just funny how they can’t even form an opinion without media or politician telling them.",
         "Part of the problem of why it is so lopsided is that many of us are not allowed to have a discussion on any level that doesn’t embrace the left completely.",
         "The major subreddits have effectively been an arm of DNC/Act Blue since Trump’s first term. Reddit looks the other way because they sympathize with them ideologically.",
         "R/louisiana and r/neworleans are all filled with liberal propaganda. Say anything remotely close to disagreeing with them and you’re downvoted or banned. It’s nuts.",
         "Seeing it  all converge here on Reddit I am reminded why I was a Democrat.  Right now, it more like three dogs in a trench coat calling itself the Democratic party.  Reddit is where this evil calls home.",
         "They’re just finding this out lol",
         "They will downvote you to hell",
         "What is so fundamentally flawed with their policy positions that this manipulation is necessary?\n\n\nOh, I guess I answered my own question.",
         "I knew it. Spread this article like wildfire!",
         "It’s day and night between Reddit and X",
         "No Sh....",
         "Bots, bots everywhere.",
         "Reddit is a liberal hive mind cesspool.",
         "There are a ton of accounts posting up leftist propaganda that have a low karma and they were all set up between February 10-18 this year. I have blocked around 30 in the last week. I noticed the more leftist accounts I block, the nicer reddit gets.",
         "It's just the Matrix, Matrixing.",
         "😐\n\nThis is my surprised face.",
         "I got banded from 2 subs in one day for stating facts about Trump and Vance.",
         "Full of sheep who have been indoctrinated at university. Worthless degrees and zero education.",
         "Reddit is a hell scape of liberal horseshit but it's still better than Facebook",
         "The run Hillary 2.0 even naming her VP pick Tim and are surprised she’s not doing too good?",
         "And foreign actors.",
         "Basement dwellers with blue hair, sometimes green.",
         "The entire faculty of Reddit (young to old, sales/advertising to IT) is entirely democrat. They’re hell bent on regurgitating leftist rhetoric and suppressing all non-conforming ideas.",
         "Further left.",
         "I remembered that 3-2 months ago people posted pics of \"Trump being creepy\" but when I posted pics of Joe Biden being Creepy, they deleted it because \"they don't accept political pics\"",
         ">nothing but anti Trump propaganda.\n\nThat's a lie\n\nHalf the time it's pro Harris propaganda",
         "Christ! I clicked on it just to see, and literally every post is either bashing Trump or shilling for Kamala. Every. Single. One.",
         "r/Seattle",
         "What's funny is when you see 2 or more people start out circle jerking each other because they agree on everything but then it turns into an argument of semantics or someone misspelled a word.",
         "Yep, mine too. The funny thing is that most of NYS votes red until you get to the inner cities. Yet all I see is Syracuse university students circle jerking on the Syracuse sub. I’ve posted a differing opinion and get downvoted into oblivion. I laugh because I simply don’t care anymore about downvotes.",
         "It's every single state subreddit. I mute them all and just hang out in the few right wing subreddits available.",
         "r/Seattle too",
         "And purple.",
         "... face tattoo of \"TheRealDonaldTrump\"",
         "Furer left",
         "Sounds about right. Pearl clutching is an art to these people.",
         "I sometimes post a pix of a ballot indicating Trump. The results are hilarious.",
         "That happened to quite a few of my comments. I don’t waste my time and effort reading and commenting on their cr.p anymore.",
         "Lol you had me going for a minute.",
         "That's pretty much any sub for any city on Reddit though.",
         "I have to mute them because it’s being shoved down my throat. It’s annoying and there’s definitely an agenda going on in Reddit world…a liberal agenda."
      ]
   },
   "1gexue7": {
      "title": "I like the direct one ",
      "text": "",
      "comments": [
         "Love how Harris looks like she is just so pleased she got the words out.",
         "I could give a shit less about the final people we somehow chose. This is what also shows how rigged this world is. But it’s funny at the same time. The media will bash the one that doesn’t fit their narrative.\nObviously you shouldn’t pick the one they love but at the same time… we’re left with two bad choices as usual. Your vote probably doesn’t count. And if it does… you don’t get the person we really need to run a country.",
         "i see you're at the denial phase. once you go through acceptance and depression, at which point you'll feel enabled and encouraged to act, you'll remember back and think you should've voted and that the country is now fucked and you were a part of the issue because you were too emotionally unequipped.",
         "I see your point…. It would make more sense if the elite weren’t in charge of how the world operates. \nThey have everyone played. They have everyone against each other. That’s what they really want. I have close family and friends that hate each other for their political views.. thats exactly what they want. Easier to brainwash a population than to convince them they’ve been brainwashed. \nThis “two party system” isn’t really two party.\nThey’re the same.",
         "You're telling me you're boiling this whole situation down to, \"they're just trying to make us hate each other\"?\n\nOne side wants abortion, the other side thinks it's murder. One side thinks it's okay for minors to permanently alter themselves through artificial hormones and surgical mutilation, one side thinks children should be protected and allowed to make those decisions when they become adults. One side thinks it's good to censor people in the guise of \"hate speech\", while the other side fight wars and sacrifice themselves so that even the people who hate them can talk all the shit they want, cause that's true freedom of speech.\n\nI really think you're taking the stick-your-head-in-the-sand strategy / if-i-can't-see-them-they-can't-see-me approach to this. You gotta WAKE UP.\n\nEdit: make your decision, vote. it's still not too late. i'm not telling you who to decide for, but your \"elites run this world\" motto isn't helping anything, especially considering you're probably not 100% sure on that, as much as you'd like that to be true so you don't have to take any responsibility."
      ]
   },
   "1geeo9q": {
      "title": "Trump to the save the universe ",
      "text": "",
      "comments": [
         "Kamala is sooooooooo stupid!  Best quote ever!",
         "She’s seen some shit. 😳",
         "Seeing how the democrats want to mimic what China was during during the Covid lockdowns, I can see why she is upset, having a family who came from that mess.\nFor those unaware, the government was welding entrances to large multifamily dwelling properties. Quite literally locking them inside. Also many people are unaware how the government was violating the Chinese peoples human rights. A man was seeing screaming \"Why can't we go buy what we need! We have no food! No toiletries!\" This election is important, but the distraction has always been meant to take your eyes off of God.\n\nJesus Christ loved you, John 3:16-18, Romans 10:9-10. \nOnly Jesus Christ can save you!",
         "Dang, woman. Don't hold back like that. Tell us what you really think.",
         "Holy cow am I glad she's on our side. Can you imagine seeing a billion of her, come sailing over the horizon on a Chinese troop-carrier?",
         "I love this. So raw and brutal honest with the broken English talk.",
         "This is exactly what my Guatemalen grandmother would say, except with broken English in Spanish accent. 😂\nAhhh this is great",
         "Based on",
         "Well look who’s getting deported.",
         "The fact that people are so easily distracted from the CCP collusion (may not be the right word) and the atrocities that happened there to their own people, the Uyghurs, the Turks, Kazakhs, Nepali etc... for a country (USA) full of loud virtue signalers... they don't take any action against their politicians who knowingly don't do anything about these problems... there was a video that never made it to mainstream media about an apartment complex in Urumqi where the CCP locked the tenants inside a building, there was a fire and the CCP didn't let anyone out and didn't allow the firefighters in... people were jumping off the building to escape burning alive... and this party gets upset with the wrong pronouns or hyperfixate with their Trump derangement syndrome. \n\nUgh, rant over."
      ]
   },
   "1ge9duk": {
      "title": "I’m cool, I voted for Donald",
      "text": "Vote for Donald",
      "comments": [
         "Very cool...proud of you!",
         "This was my first vote for a president",
         "I'm sorry you didn't get the Werewolf one. The kid designed \"I Voted\" stickers are the best things coming out of Michigan this election cycle.",
         "Third time voting for the Don, feels real good.",
         "Same. This time it feels vital.",
         "I spent about 15 seconds at the sticker table before getting the fuck outta there lmao"
      ]
   },
   "1gef2mf": {
      "title": "The hypocrisy ",
      "text": "",
      "comments": [
         "Holy shit was that Frederick Douglass?",
         "Love her! She’s a fresh voice pushing back against these establishment narratives being shoved down everyone’s throat without being alienating or extreme. She needs to be promoted more for those who’ve gone down the rabbit hole of msnbc.",
         "Jesus George Lopez looks like shit. That being said, George Lopez is of Mexican descent and  his career has centered around the mexican experience. Tony calling an entire nation a \"pile of trash\" has a little more offensiveness built into it. Now granted Tony is a roast comic so him shit talking people is his brand.. I'll bring in now that PR is a beautiful and culturally rich nation completely controlled by America. Given no representation in government and they can't even vote for president unless they are a resident of the mainland. So it's not really a good look to call an oppressed people \"trash\".",
         "hes mexican…",
         "It's more chill when a black person uses the N word- Think about it",
         "He looks like Charles Manson"
      ]
   },
   "1ge34je": {
      "title": "“AM I RACIST” is out today! are you watching?",
      "text": "",
      "comments": [
         "Already did in theaters. Pretty great",
         "Where can I watch it",
         "I'm trying, but Daily Wire wouldn't let me. I paid for the Insider membership, was billed instantly, but the film is still unavailable. No matter how many times I log in and out it says I have to upgrade the account, even though it states in account details that I'm on Insider monthly membership. Tried other browsers, same issue. Tried the app, it keeps crashing. Submitted support request, no reply yet. I am pretty annoyed and not sure what I can do next.\n\nAnyone had similar issues?",
         "Just watched it yesterday.",
         "Really enjoyed it. Eye opener. Could not believe some of these people are real",
         "I do hope they drop a DVD. I don’t ever see myself getting Daily Wire +. But I’d love to show this movie to people. I saw a lot of elderly patrons at the theaters and I bet they’d buy a DVD.",
         "Is it on Amazon? Y’all throw away so much money from those of us who’d buy it but don’t want a political subscription.",
         "It’s on Daily Wire + now if you have a subscription",
         "It’s available for me",
         "I'm having the exact same issue. I just paid for a monthly membership and I can't use it to watch. What gives?",
         "I've watched like three times",
         "The subscription for the whole month is 15 bucks. Its for all shows and movies... \n\nAnd afaik a single movie ticket is usually around that price",
         "You get the sub watch the content then cancel, how hard is that,  you can see the what is a woman and am I racist for $15 bucks…there is no cheaper legal way to get such a good value.  Dont consider it a subscription consider it a purchase..",
         "I don’t 😢 I’ll have to wait.",
         "Okay, I tried on the mobile app and it was fine. Also tried it on a different laptop with a different google account and it was fine as well. I think the dailywire system remembered my google account being associated with the free membership in the past? Idk. I’d say try starting a different google account and log in from that",
         "Not the point. There are tons of us who refuse to do that. I want less subscriptions not more and I don’t want to rent it I want to own it. \n\nI have zero desire to go to a loud, gross theater with busted speakers and inflated prices. Especially with a movie like this where attending makes you a target for wackadoos.\n\nI  not alone. There are millions like me. They are leaving money on the table.",
         "If I don’t get to keep it after, it isn’t a purchase.",
         "You can get a. Membership and see it for $14.99 today….",
         "Then sail the high seas man, idk what to tell, you, you cant have it both ways",
         "Amazon… one of the places this movie would NEVER be allowed on?",
         "Fuck.. yeah I meant to say rental.  I stand behind what I said earlier substituting that but it’s still a value……..",
         "You can, they just have to stop holding their content hostage to force folks to their platform. Im not going to steal content. That’s illegal. If I wanted to live a life of crime, I’d be a Democrat.",
         "I own conservative documentaries purchased on Amazon Prime Video. They aren’t as likely to provide it for free but they didn’t make it this big by boycotting instead of selling. Bezos would sell his grandma for the right price.",
         "Yeah I get that. But it makes it harder to de-program my family on the fence when I say the only way you can watch it is this super conservative platform. I am a moderate. I have a lot of rational moderates in my bubble that have about had it with the left and I’d love to watch this and the woman one with them because DEI and the never ending list of genders has been a head scratcher.",
         "I mean i get what youre saying but at the end of the day its their ip, they can \"hold it hostage\" however they want. And i dont know if they have much of a choice, im sure not alot of companies would be interested in mass producing CDs for this movie because of its nature. \n\nAlso the motto is \"if buying isnt owning, pirating isnt stealing\". You font have to be a rep or dem to have the right to own the stuff you buy. I am subscribed because i want to support them, but for example i dont feel bad about sailing disney movies since many of those are also subscription only.",
         "Which ones are those?",
         "Dinesh D’Souza (sp?) made a few good ones.",
         "Oh yes he has made great ones. But even he has a couple that Amazon just flat out said no to. Both of Matt Walsh’s movies fit that same category.",
         "I fail to believe they’ll sell me Hillary’s America but not Am I Racist. I’d need to see that in black and white from Amazon or Daily Wire.",
         "So if they’d let almost all of Dinesh’s movies on Amazon. Why isn’t his election fraud documentary on there? If they’d let almost just let it all on there?"
      ]
   },
   "1gdudgh": {
      "title": "If you even had a single shred of faith left in the mainstream media… ",
      "text": "",
      "comments": [
         "You may think you hate the media enough, but you don’t.",
         "Hey, you know what event was hosted at Madison Square Garden in 1976, 1980, and 1992? The Democratic National Convention.",
         "MSNBC is made up of nothing more than deranged lying lunatics.",
         "When you have the facts, you pound the facts. When you don't, you pound the table.",
         "Hitler drank water too!!!",
         "When you have nothing else….",
         "Who’s he talking about whose clothes got torn from his body?",
         "And people STILL believe the media isn't part of the democrat/left agenda. 🙄",
         "You know they are getting desperate when Hitler references start coming out.",
         "I got permanently banned from /worldnews for just mentioning I was watching it.  So tired of these looney toons.",
         "Desperate and demented.  They are clutching for anything.  Anything at all.  Feels like the teleprompter broke.  Wake up and Smile 😂 \n\nhttps://youtu.be/Nc0FeUMQIA4",
         "SIMPLE AS: turf war. In their mind, NYC is theirs and no Republican should ever even think about setting foot on their turf. But when we did with this rally, you know they’re scared because of their decision to lead with the “Nazi” route as opposed to the “waste of time” route. If the Left was at all confident in this election, they’d scoff at Trump wasting his time and resources by going to MSG and not focusing his time in the swing states. Instead, when they can only attach the Nazi label to this, you can be certain they believe he’s not only going to win those swing states, but could threaten to have a stronger showing in places they see as sacrosanct, like NYC.",
         "The actual amazing part is that the Left WANT to believe it and are willingly gaslit",
         "I've been voting libertarian since 2008, but like someone in one of those subs said, I'm just about ready to vote for Trump out of pure spite for the way the DNC and MSM treat him.",
         "Didn’t FDR hold a rally there also. Wasn’t he a Democrat. Asking for a friend.",
         "I'm just waiting for someone to comment trying to defend this garbage.",
         "They're getting so desperate it's actually hilarious lol",
         "Our media is disgusting. Jake Tapper should be ashamed of his Vance interview too.",
         "Theyre only discrediting themselves at this point",
         "Did they break their arm because of how far they reached?",
         "I believe MSG was built in the 60’s after the old Penn Station was demolished.",
         "Nazi means you’re  cool now",
         "Funny thing is thats not the original location of MSG where you had the progress...I mean nazi rally [https://www.msg.com/madison-square-garden/history](https://www.msg.com/madison-square-garden/history)",
         "Yeah I logged into work today and I saw this article on the garbage MSN homepage: \n\nhttps://www.thedailybeast.com/donald-trumps-racist-nyc-rally-was-vile-it-was-also-political-suicide/\n\nThey make me sick.",
         "I turned it all off.  I'll resub on November 5th so I can stream the live broadcasts from my favorite subs and also watch it live on these platforms, then turn it all off again.\n\nNo need to spend the next five years watching them throw so much hate on the president it may get him hurt, again.\n\nLast thing I want to hear is Jamie Raskin saying 'High crimes and misdemeanors' over and over for the next four years ..  MSNBC played that on loop like it was a world war.",
         "Trump is the literal opposite of Hitler 🤣 \n\nI mean, honestly, you couldn't have a better example of polar opposites.",
         "Doesn't even surprise me anymore, I don't expect anything meaningful from them",
         "Media is losing more and more ratings. More and more numbers gone. Good riddance.",
         "OHHH so bc his rallies are so much bigger than Kamala's, he's a nazi",
         "\"BREAKING: Trump pooped today just 90 years after Hitler did the very same day\"\n\nHow are we the cult",
         "The current MSG was built in 1968.",
         "I’m convinced that the guy who writes headlines for MSNBC is the same person who writes Babylon Bee headlines",
         "Amen!",
         "No I do they already said weeks before he did the event that he was Hitler for doing the rally at Madison square garden I completely expected this I will be honest though I did not expect them to be so openly psychotic",
         "And those were 37, 41, and 53 years after the pro-Nazi rally. 😱 These numbers are less than the number 85!!",
         "Lmao YES",
         "Wait until you see what CBS reported tonight",
         "Hitler also breathed air! \n\nWait, if I too breath air, does that mean I am like...🤔",
         "Hitler also breathed air!\n\nWait a second, if I too also breath air, does that mean I am like...🤔",
         "Lol that’s what I want to know!",
         "It's a hiel mary attempt to win the game.",
         "Do it.",
         "Shame? Never heard of it.",
         "1968. The last one, the one with the Hitler rally, was MSG number 3.",
         "For those that don’t know history the Democrats have always been the party of *racism.* \n\nThe American Civil War was the Democrats wanting to keep slaves. They lost to the first Republican President Abraham Lincoln. \n\nJim Crow laws were passed in response to losing the Civil War. \n\nThe Ku Klux Klan was started by Democrats after losing the Civil War. \n\nThe Indian Removal Act was made law by Democratic President Andrew Jackson’s\n\nHitler has such a great philosophy of *race* and eugenics that Margaret Sanger studied and brought it to America. She was the founder of Planned Parenthood. https://www.usatoday.com/story/opinion/2020/07/23/racism-eugenics-margaret-sanger-deserves-no-honors-column/5480192002/\n\nDuring Obama’s presidency anyone who criticized was called *racist.* We were not allowed to disagree on policy, without being labeled racist. \n\nWhen Joe Biden filled a vacant spot of the Supreme Court his first requirement above all others was race. \n\nThere are dozens of quotes of Joe Biden displaying his open racism. \n\nUnderstand that Democrats are the party of racism and always have been.",
         "Which was?",
         "I don't watch cable or network news, but I'm sure I'll read about it eventually. These people have completely lost their minds.",
         "It also helps that the LP candidate this election is an authoritarian chode. But even if I vote for Orange Man, I'm not coming back to the GOP long-term.",
         "What a great breakdown. Historical and recent. Wish I could give it more up votes.",
         "💯",
         "Just posted it to this sub",
         "That’s ok, I won’t hold it against you. I’m libertarian minded as well. 🤗",
         "I'd possibly vote for Vivek in the future."
      ]
   },
   "1gf6tpn": {
      "title": "Caption This",
      "text": "",
      "comments": [
         "“I groom my cats with my tongue and use their litter box instead of a toilet, AMA”",
         "F@ck her too",
         "I have to vote because my aborted children can’t.",
         "I just moved from California. Boulder is so lovely.",
         "One won’t get you the other; I mean, he’s not gonna fuck you just for your vote",
         "The desperate plea of a woman named Trump.",
         "So ugly",
         "White dudes for Harris.",
         "“I voted to protect my abortion rights”",
         "“I voted in the last democratic election the country I clearly hate will ever have if my candidate wins!”",
         "TDS patient needs a new phone...",
         "White trash…",
         "That one Aunt at Thanksgiving.",
         "You savage! I like you.",
         "Underrated comment",
         "Yeah, cause she's really gonna need to worry about that 🙄",
         "Haha you got the joke!"
      ]
   },
   "1gduqaw": {
      "title": "Courtesy of the DNC. A new low. They are scrambling. This was reported on CBS News by the way. ",
      "text": "",
      "comments": [
         "The current Madison Square Garden was opened in 68. It's not at the same location as the one that the pro nazi group held their rally. You know what was though? Multiple rallies in support of the Jewish people, JFKs birthday party, and a Communist rally. https://en.m.wikipedia.org/wiki/Madison_Square_Garden_(1925)#Other_events\n\nThe current MSG has been the site of 3 Democratic and 1 Republican convention, several Elton John concerts, and a September 11 memorial concert amongst a slew of other shows, rallies, concerts, and events.\n\nWhy does Trump's rally get tied to an event from 85 years ago at a different location?",
         "Why they so mad, bro?",
         "The hysteria has reached a fever pitch.  I'm surprised the brownshirts aren't out rioting yet in my local area, Portland OR.",
         "I'm guessing there is no way they will accept a Trump win.",
         "They are so scared of trump its funny now",
         "Good Lord they're desperate.",
         "Disgusting.",
         "A question I want a serious answer to, with a link to full context: What did Trump say in support of Hitler?",
         "I heard Trump drinks a tall glass of ice cold milk daily.  You know who else was a milk drinker? Jonny Carson. Uh, I mean Adolf Hitler.",
         "This is so fucking nasty I just don’t see how anyone can support this",
         "The Dems are becoming expert Nazi hunters and Hitler spotting experts \nShame the generals aren’t like the German ones or trump (who isn’t elected) would be on the road to world domination invading lots of countries setting up military bases everywhere and starting wars in the Middle East, Europe and agitating the Asian power (China) starting an arms race. Assassinating foreign leaders and terrorists.\nOh wait isnt that what the Dems have already done ?\nMaybe we are seeing a projection of the Dems behaviour on to their political opponents in an attempt to stifle political opposition and put them in jail",
         "Do they have a quote related to that? Or was trump just talking about history again?",
         "It’s comical at this point. If this is the worst they have on him, he doesn’t sound that scary.",
         "Trump does praise Hitler, though.  He’s done it several times over the years.",
         "The dummycrats are so unhinged now that if Trump announced the end of cancer, they'd be upset it would put doctors out of business.",
         "The left’s desperation is at an all time low… and that’s saying something!",
         "Another reason I departed from the left. Idk how many hundreds of times I heard and parroted “he’s a Nazi” before I realized… oh, he actually isn’t, who would’ve thought?",
         "You know why. The whole “Trump is Hitler” schtick is all they’ve got left and they’re gonna milk that cow DRY come hell or high water.",
         "Because the dishonesty never ends.  There are at least a dozen folks,  wearing masks indoors.  Who are reading this right now and will downvote me for calling them out on their non-pragmatic behavior.",
         "The Ds want to scare the undecided into not voting for Trump.",
         "They’re dead afraid of losing power and influence.",
         "Remember that’s the side of the political spectrum who believed that a foreign superpower nation interfered with the results of the 2016 election, they then proceeded to waste millions of dollars and hundreds of man hours in investigations to find nothing. They also believe that questioning the results of the 2020 election makes you a threat to democracy and a sore loser, despite all the suspicious activity surrounding that election.",
         "I mentioned this above as well- I would really like to know what their far fetched root idea is here",
         "Do you have the quote in question?",
         "When you’ve convinced yourself Trump is literally Hitler and we’re on the verge of a Fourth Reich, nothing is off the table. These people will claim to be the party of decency and love yet spew this kind of vile hate.",
         "It was likely some normal Trump Hyperbole taken WAY out of context.",
         "I’ve heard a friend of mine who is unfortunately on the left mention the root of this talk track. I am sure that it is taken out of context like many of the other things the leftists have run with (like the bloodbath comment). \n\nCan anyone add a little more color here on background so I can knock this statement down as I hear it in a more factual and intelligent manner?",
         "I’m honestly kinda surprised they don’t just knock off sleepy Joe and ride the excitement of having the first female president for a bit. I’ve kinda been expecting that for several years now lol",
         "There are still many Democrats who believe Trump did collude with Russia and got away with it. You can find them on Reddit a lot in leftist subs (so like 99% of them).",
         "Same thing happened in Brazil.  Bolsonaro and Lula were top two, Bolsonaro with \\~48.5% and Lula with about \\~44%.  So they had a run off with just those two because winner must have more than half.  Somehow Lula won.  Same playbook everywhere you look.",
         "The alleged quote is “I need the type of generals that Hitler had.” Essentially this is all stemming from an Atlantic article written by Jeffrey Goldberg (this is the same guy that also came up with the “suckers and losers” story, again with unverified sources) where all it says is two people in the White House heard him say it. Of course, these people are “anonymous” and nobody outside of these two sources can verify anything being said. \n\nAgain, it is just some insane story with unverified sources and accusations that the left, as per usual, takes as gospel truth because they hate anyone who disagrees with them.",
         "I don’t. That’s what I’m looking for. The claim is “Trump praised Hitler”. I’m gonna need some evidence — with context. \n\nIf Trump fired off a “Mussolini made the trains run on time” type of quip, that’s not the same as saying Hitler was a good guy with lots of great ideas.",
         "Unironically, just like the National Socialists from the '30s/'40s.",
         "JD Vance called Trump America’s Hitler.  That’s not a democrat.",
         "Would love to watch the original vid, for future arguments",
         "Their argument is that Trump isn't intelligent enough to use hyperbole.",
         "What was the quote again? I’ll look it up",
         "They would have had Harris been more of a compelling candidate. Harris has been so underwhelming as a *person* - let alone a White House contender - her whole damn career they can only ride the “Trump is literally Hitler!” Train until it’s milked dry. Literally anyone else with staying power would have worked",
         "Ok, so. Source: trust me bro.",
         "I mentioned this in another comment but the supposed quote is “I need the type of generals that Hitler had.” It came from a story written by the same guy who came up with the “suckers and losers” line. The story has unverified sources and just states that 2 people “heard him say it”. Great standard of evidence from this titan of journalism /s. \n\nEssentially, as per usual, the left is running with it as ironclad proof that Trump is Hitler. It’s disgusting how they can constantly do this and still get away with it. It’s like clockwork.",
         "There isn’t a video. All that they have is a story from the Atlantic that alleges he said it, and all they say is that 2 people heard him say “I need the kind of generals that Hitler had.” They are just running with this as something that is irrefutably true which is surprising to no one.\n\nSome added context, the guy who wrote the story is Jeffrey Goldberg which is the same guy that wrote the story which broke the debunked “suckers and losers” quote that, like this story, came from unnamed sources that heard him say it.",
         "It was something allegedly to the effect of that if he gets elected you’ll never have to vote again. Like he was going to do away with the way we vote. \n\nTo be clear- I’m sure this is taken highly out of context",
         "So, the very definition of unverifiable hearsay. If Trump was a private citizen, sounds like it would qualify as slander.",
         "lol so its \"hearsay?\" We learned that word from the amber turd trial. \n\nIts just bullshit then",
         "Wait that Jeremy Goldberg clown? The same one that made up the “suckers and losers” hoax?",
         "Oh it was. It was normal Trump hyperbole. It was in the context of how he’s gonna have this country fixed so good you won’t have to worry about voting anymore. He was speaking to an evangelical base that typically shy away from voting while encouraging them to vote just this once",
         "He was speaking to people that normally don't vote, asking them to vote this time as its so important. After he wins, he'll work on correcting the integrity of our elections as right now there's enough stuff to make anyone concerned about that. Then it won't be so important that those usual non-voters vote. They can go back to ignoring it as there won't be anything shady to give any doubt. Right now we need a win too big for them to cheat against.",
         "Not only that, but multiple former White House staff have publicly come out and said that he *did not* ever say that.\n\nSo it comes down to who you believe: former staff who are loyal to Trump or former staff who think Trump’s a nazi. Somebody’s lying.\n\nEither the anti-Trump crowd is lying, presumably to influence the election. Or the pro-Trump crowd is lying to shield him because he actually is a Nazi sympathizer. I’ll let you decide which seems more likely. \n\nBut the other issue is the people making the claim, the former staff who hate Trump, have no evidence besides “I heard him say it!” and expect the other side to provide proof he never said it. Which is, of course, completely insane. The burden of proof is very much on the “Trump is a Nazi” side of the argument.",
         "Yep. They really have got nothing. \n\nAlso, I can almost guarantee you that this was released last week knowing that Trump would be having his rally at MSG where they could try to make a stronger link to the other stupidity they are running with about the Nazi rally at MSG. The timing is more than questionable when they have been trying to make this connection for a while and the same week Trump is set to have a rally there is the same week that this article drops.",
         "Yeah same guy. The pattern is the same as well. The story is all just “these people who we can’t name said that Trump said X”.",
         "That makes so much more sense.",
         "Oh shit thank you for putting that connection together. You’re right. Timing is way too convenient"
      ]
   },
   "1gddveb": {
      "title": "Fight Back",
      "text": "I’m just about finished with Reddit.\n\nEcho chambers, downvoting for downvote sake, post prevention, bans for no reason, bans for conflicting views, mods deleting my posts for no valid reason, liberal circle jerks… it’s an extremely toxic environment and I can’t take it anymore.\n\nI’m rendering my Reddit account essentially banned from everything and useless to my life in every way, but this has a bright side to it.\n\nNow that I don’t care about my karma, when people hate on Trump or Republicans I’ll leave a comment instead of scrolling. When a democrat crybaby has a meltdown over how they can’t stand Trump, I call them what they are… etc.\n\nI’m actually quite excited, I must say.\n\nI tried to post about this in s/Trump but even they won’t let me post there for some reason :) I hate Reddit.\n\nGo ahead and remove this one too.\n\nVote for Trump.",
      "comments": [
         "Reddit can be very toxic, that's true.  And a lot of people on reddit are just miserable, hateful, negative people who are contrarian for the sake of being combative and adversarial, and that misery loves company.  But, there are some cool forums on the platform, however, and there are people with similar outlooks in life or at least a lot with real respect for diversity of opinion, and who can exchange conflicting opinions respectfully.\n\nRegarding anti-Trumpism:  The hate and hysteria around \"Trumpism\" has taken on a life greater than the man himself.  Most people who say they hate him can't rationally, coherently and logically even present an argument as to why they hate the man as much as they do, without regurgitating a tirade of debunked memes and falsehoods (like the project 2025 nonsense).\n\nIt's ironic for people who like to think they're smarter than everyone else, they certainly seem to demand allegiance to groupthink and hive mind, which to me is the opposite of how a really intelligent, insightful individual behaves.  I am a democrat turned independent who was sick and tired of leftist operatives telling me what to think and how to think in line with their agenda items, and the blatant steering by our national media of a lazy population who tend to believe whatever they're fed and then say they're \"informed\".  Good on you for holding your ground.",
         "I got banned from walkaway for saying something like, “[this piece of human garbage in X post] is going to clog the woodchipper.” Lefties say exponentially more vile shit about us on their subs, but walkway needs to be extra vigilant because Reddit is looking for every single tiny reason to shut conservative subs down. \n\n“Go make [your] own Reddit.” … sure … look what happened to Parlor",
         "I’m with you. Reddit is working really hard to manipulate the vote right now (at least the bots are). You’ll not that any Pro Kamala or Anti Trump post usually has about the same number of upvotes within minutes of being posted. Almost always 3k something or 6k something. Pretty sure the only reason it varies at all is us normies are sick of it and downvoting to screw with their numbers. Also, the algorithm is putting anti Trump or vote for Kamala posts from swing states (especially Georgia and Pennsylvania) in my feed daily. I have never commented or shown any interest in those states so I’m assuming they are trying to make us feel there is a huge groundswell of support in those States. I can’t believe that those states have nothing they want to discuss other than the election. Don’t know if anybody else is having this problem but it no longer allows me to block the threads I’m not interested in. Ever. Period. Zero. Maybe that will fix itself after the manipulation of the vote is no longer necessary. Only ray of sunshine is the internet has taught me that the harder they push one narrative, the harder they have been receiving pushback. Hoping this is the case here.",
         "Lots of bots to work against.",
         "Hey, downvote this comment. Thanks.",
         "Well if u owned up to ur Reddit name u would grab them and not tuck tail and run. Fuck em and feed em fish heads. Keep fighting the good fight. Don’t let it defeat u. I know Reddit sucks and is a liberal echo chamber in 99% of subs but so what? Imagine that one person you could reach? For that one ur fight to continue bringing patriotism, positivity, and love….its worth it dawg!",
         "There are 5 post as I post this but only OP’s question about where are they is showing. \n\nTrump is going to have a greater 2nd term if he gets congress. (Without Paul Ryan this time)",
         "You should have thousands of upvotes. As a Libertarian, I applaud you being a rational person who can think freely and form your own opinions. We need more people like you on all sides.",
         "Did you read my post?",
         "My bad. I did but I got caught up in ur frustration too much. Keep it up big scrotum! 😂😆 go get em. Tea bag em all"
      ]
   },
   "1gdghyy": {
      "title": "I would say \"Cry about it\", but I guess they already are. The karma farming is wild ",
      "text": "",
      "comments": [
         "The only reasdon he's \"in your faces\" is because the liberal media cannot stop obsessing about him.",
         "If you didn’t think TDS was real before…",
         "Yeah, maybe if Biden had been decent he would have retired to his condo.",
         "The democrats know that they're the ones plaster bad orange man picture on the front page of reddit everyday, don't they? Seems like they're crying about what they're doing which is giving trump the time of day by making everything about him lol those morons",
         "Somebody call a WHAAA-mbulance",
         "I got banned from that Reddit due to saying that there is a difference between legal and illegal immigration.",
         "Californian here, I have had 30 years of this sock puppet they call a candidate.",
         "Rent free.",
         "Noone voted for her to get here. Not 1 person. This is an installation of a political officer. Not a president, she won't make 1 decision. She is owned property",
         "Had they not cheated to get him out in '20 he'd be leaving instead of returning to the White House. Now they'll have 12 years of him. Hopefully they'll have 8 years of Vance after that.",
         "How many were probably hooked on the Apprentice?",
         "Wild to see people are actually this brainwashed",
         "Deranged",
         "Seriously. Hillary and CNN don’t get enough credit for his first win.",
         "100%. If the news gave him zero air time, he wouldn't even have made it to a primary or meet the conditions for debates.  The free press coverage is worth so much I'm surprised the fed hasn't tried to tax it.",
         "[removed]",
         "And enjoy your whaaaburger and cries! The party of joy lmfao!"
      ]
   },
   "1gd0rzg": {
      "title": "Imagine 4 years of this woman ",
      "text": "",
      "comments": [
         "I can't take 4 minutes of this incompetent twat",
         "lol this is pretty good",
         "I don't want to hear the constant accent change and the joker's laugh",
         "Perfect cut.",
         "I’m already muting commercials",
         "I can’t stand her either but leave that beloved man out of this.",
         "Yeah let's elect a drunk incompetent puppet who cheated on her husband to get to the top.",
         "Please no",
         "Please no",
         "I feel his pain every time she speaks and laughs.",
         "She being the word \"vapid\" to mind.",
         "This shit is hilarious 🤣😂😂",
         "That would be the best part of 4 years of her and her coterie.",
         "What is the video of Keanu from?",
         "You could play it with a video of either candidate and I'd be cringing though. I feel sorry for Americans having to choose between Kamala and Trump. It's like saying do you want to eat shit or a bag of broken glass. While one may be an obviously better option, neither are appetising.",
         "Honestly, I would take 4 years of her over 4 years of Clinton",
         "Me neither. Hopefully we'll be rid of her soon."
      ]
   },
   "1gcx6p3": {
      "title": "Amala said what should be said ",
      "text": "",
      "comments": [
         "Everything is a right wing conspiracy to the Democrats. Until it isn't.",
         "Humility - not, but humiliation - oh yes... 😒",
         "Who is this girl?  She's on point.",
         "What’s funny is that when the party began shopping for a replacement candidate, the president got wind of it, announced his withdrawal and then quickly endorsed the worst possible candidate, he was pissed off and took revenge.  Party leadership got screwed.  And here we are.",
         "This post about facts will not break 1000 upvotes, but it got mine in. Reddit truly has become an echo chamber.",
         "Stand Strong...",
         "She work for Daily Wire+ now?",
         "SeekYHWHsFaceForANewHearT",
         "Amala Ekpunobi",
         "My most \"based\" post has 699 up votes https://www.reddit.com/r/dailywire/s/8GOPvKMX4u",
         "She is on PragerU",
         "701 now"
      ]
   },
   "1gcblij": {
      "title": "Joe Rogan Experience #2219 - Donald Trump",
      "text": "",
      "comments": [
         "I actually like it tbh",
         "Trump getting really excited about concrete and then having to restrain himself was very endearing to me.",
         "So he’s clear and articulates himself while actually answering questions? Whoa… 🤯",
         "Joe just gave me a new word to use for people who only get their news from mainstream media. A “low information person”, aka a “LIP”. Uncle Bill is a nice guy but he’s a LIP.",
         "I’ll get the popcorn",
         "Ear is out of sight I see",
         "Favorite point discussed?",
         "Trump has to be on the spectrum. Like the way he geeks out and goes on about certain things makes him super endearing.",
         "Its actually a stolen line. Rush limbaugh used to say this all the time.",
         "coldminnesotanights. Stop trying to make LIP happen It’s not going to happen.",
         "Joe asks about the ear, he shows him and Joe comments about the scar, they talk about it for a minute.\n\nWatch the video before you comment your ignorance.",
         "What’s your point, that he didn’t nearly get assassinated, or that the two attempts were fake? \n\nBecause there’s a dead husband and father if you need any additional proof.",
         "You understand the difference between pictures and videos right? They look at it.",
         "Ditching income tax was cool, nuclear is cool, Trump talking about how off shore wind is bad for whales is gonna make some heads explode.",
         "I liked when he was talking about the Lincoln bedroom.  You really get insight into the person Trump is.  It’s not about the power that drives him.  He loves America.  He loves the history of America.  He geeks out on the details of that history.  He wants to have a hand in guiding America to greatness, not just for himself, but for the sake of America.",
         "Just the overall atmosphere.",
         "Shut up you Boomer LIP",
         "The people who orchestrated it have no problem with collateral damage",
         "The cost of offshore wind is over 3X the cost of onshore wind. That alone should shut it down.",
         "The thought of these incredible complex animals being absolutely tortured by sound they can’t escape makes me wanna cry",
         "they out here lippin’",
         "Boomer? Replace your name with Gretchen and LIP with Fetch",
         "Sometimes people say something so stupid, it’s more a cry for help. I hope you have a social interaction today, friend. \nThe world isn’t as bad as you think it is. Go make a connection today, go for a hike, try something knew,",
         "Democrats?",
         "Leave the basement, friend.",
         "It’s called rage bait, looking to get you riled up",
         "No"
      ]
   },
   "1gc8od2": {
      "title": "Who will replace Brett Cooper when she has to reduce her hours because of a baby?",
      "text": "",
      "comments": [
         "**Context**\n\n* Brett Cooper is out today for some mysterious reason and her producer Reagan guest hosted\n* Reagan actually did an *amazing* job and fit the whole brand of the show\n\nIt seems to have been implied by Brett's hints over the last year that she wants to have kids and homestead. I can't imagine she would do full-time hours as she does now unless she moves the whole show to her home like Allie Stuckey I think does.\n\nI've thought before that DailyWire might want to acquire Pop Culture Crisis for their brand, but Reagan proved the future of The Comments Section even if it's hosted by multiple people or replaces Brett Cooper entirely.",
         "I wanna see theo von just cause",
         "[deleted]",
         "Ben Shapiro. no one would notice",
         "She got married recently and talks about having a baby *a lot*. She's trying to get pregnant or is planning to soon.",
         "I need them to switch shows on April 1st and introduce themselves as the other person. The real challenge will be pacing. Obviously the editor will have to speed up Brett by 2 and slow down Ben by 0.5.",
         "Shapiro wearing a wig.",
         "[deleted]",
         "Talking about wanting to have a baby is airing out bedroom wishes?"
      ]
   },
   "1gcaxpw": {
      "title": "That last sentence makes me laugh.",
      "text": "",
      "comments": []
   },
   "1gbc3ng": {
      "title": "Just another day that end with a Y",
      "text": "",
      "comments": [
         "👆",
         "These people need to learn what fascism actually means.",
         "Well, that would actually involve a mirror and that often is difficult for some folks."
      ]
   },
   "1gbheco": {
      "title": "How much do you think they paid Ben Shapiro to go on this?",
      "text": "I feel like they have to pay money to get a speaker like Ben Shapiro. What like 50k? ",
      "comments": [
         "I watched one clip of a women with a beard talk for 4 minutes like an insane person spouting utter garbage and never letting him reply only to get up and walk away.  I don't have the patience to sit through 24 more of these crazies.",
         "The she/male weirdo at 35 minutes is the greatest example of the archetype of a useful idiot for the Marxists I have ever seen, or could imagine.  What society has done to this \"human\" is remarkable and terrifying at the same time.  This abomination will blame capitalism and the patriarchy for his/her lifetime of failure.  When, in fact, it is a horrible attitude and horrible outlook that brings-on his/her ruin.  Amazing though.",
         "I believe these are the same group that Kirk faced. And it shows how angry the Harris voters really are, full of hatred.",
         "I mean he probly did it for the lulz",
         "He did great. Wayyyy better than Kirk. Both sides as steel manned their positions so well it’s like abortion. It’s either murder or isn’t; so there really isn’t much for both to actually talk about.",
         "some os this people are annoying",
         "Most likely he was paid zero dollars.\n\nThey only pay a travel stipend for people traveling over 150 miles, iirc.  It might be 250, I no longer see an attched pdf on their site with specifics.  It only says they pay a \"limited travel stipend\" now.\n\nBen makes money through his own, and daily wire content.  That show provided hours thereof, which he/they will/have monetized.  \n\nIt would be surprising if Jubilee were willing to pay even his token public speaking fee.",
         "I thought this was pretty good. The trans person really threw the whole thing off, and honestly i now have less care than i originally did for this small group of people who are currently being used as a tool for abortion???? Makes no sense.\n\nThe gentleman who likely thinks they won debating the immigration policy was very rude and talked over Ben constantly. He focused on 1 data point ignoring the glaring data from the prior years. Also the border is not closed!\n\nFinally the guy arguing for Palestine (almost all of the Palestine defenders)…… you don’t know how war works.",
         "I believe the norm is to do things like this for free. You basically get paid in content for your own channels and exposure to new viewer bases.",
         "That “woman” *thinks* she just owned Shapiro when all she did reinforce the bubble around her while alienating anyone with even a slightly open mind willing to listen to an alternate opinion.",
         "Charlie Kirk did this the other day. It was only a matter of time until Ben Shapiro did it. I wouldn’t be surprised if Matt or Micheal pop in for a round themselves before too long.",
         "Not enough!",
         "What ever it was, it's not enough.",
         "$10k?",
         "I watched the whole thing. All she had for him was hate. That’s all.",
         "She looks like a Klingon.",
         "This was harsh. Some deluded people. Some garden variety lefties. Then, some really smart people who really hate Ben. The one guy on the border topic just laid into him personally over and over and kept saying things like \"this is what you guys say.\" Made it personal and lumped Ben, the individual, in with some wet dream hate of all things conservative. It was unsettling to see.  brought so much",
         "Saw that too. The topic was on abortion and the bearded WOMAN just jumped down Ben’s throat spewing trans rhetoric. There was so much hatred in her eyes. Once her time was up she got up put out her hand to let Ben shake it and quickly took it away once Ben put his hand out. She wasn’t there to debate, she was there to try and humiliate him.",
         "These Kamala voters are an Island of Misfit toys doomed for failure at whatever they do and the democrats love it because they will be lifetime leftists.  The cure for being a leftist is success.  Therefore the far left wants their constituents ruined and dependent on government and blaming capitalism, the patriarchy, lack of reparations, really blaming ANYTHING other than their own self destructive actions.  Example,: I would never hire people with face piercings, ear gauges, excessive tattoos, or unprofessional hair.  90% of these losers check this box.  The rest are arrogant overconfident schmucks.  I wont hire those either.",
         "I would honestly say this is the only person that irritated me. For multiple reasons. To start with i don’t believe they were assaulted. Next they changed their gender several times throughout their diatribe. Finally if everything they said was true they represent the smallest of the smallest group of people. Yet they want the whole system turned upside down to meet their needs.",
         "She was a complete nutter",
         "Wait, I thought that was JonTron?",
         "For real soo annoying and she didn’t have any real points besides feelings",
         "Man*",
         "She acted like a woman cosplaying as a bro.",
         "I'm the bearded lady. Who are you, one of the freaks?",
         "U mean man?",
         "I really believe it starts with the poison in the center grocery store aisles, then the pharmacy counter, and ends with the so called health care system.",
         "Some of them are the same people but there are new ones too.",
         "I think he did it to maybe plant some seeds of sanity and wisdom in the viewers. jubilee is usually pretty liberal. But also geared to young people. JMO",
         "For Teh Lulz",
         "This is Ben's \"Would you rather fight 1 horse sized duck, or 100 duck sized horses?\" And he chose the 100 duck sized horses.",
         "Idk, the guy won’t call a beloved family member without throwing an ad read in. You know he got his bag for this",
         "I was floored by that one woman who actually asked why it’s wrong to kill people, in the abortion discussion. So sad.",
         "And they keep bringing back the same ones, so it's almost like a little leftist club.",
         "ben did not get paid for this, but it will make DW $.",
         "I think both ben and Charlie did great.  I can maybe see Michael do it, I don't know about matt.",
         "Key word. “Try”",
         "It's funny because at the beginning of her rambling she claimed Ben talks fast and quickly switches subjects so no one could retire his claims..",
         "And that clip is on all the lefty reddits with captions like “slay!” And “watch Ben Shapiro get owned!” And other crap like that. Throwing a tantrum at a debate is a self own. Saw it happen with the same representative group of people at a panel discussion when I was in college 20 years ago. The conservatives were respectful and intelligent and the leftists were banging the table and yelling and acting like children.",
         "She’s gone to plaid!",
         "All are contributing.  Dont forget the parents who drove them to the grocery store.",
         "He might not convince even one in the circle, but there are thousands who watched.",
         "How bout the lady who equated c sections and love births with abortions because they “ended the pregnancy”",
         "Yeah, Micheal is a more likely candidate for this than Matt, but I’d rather see Matt personally.",
         "Matt would definitely be more entertaining for sure.  I enjoy him most of all the hosts, I love his very direct and dry humor approach."
      ]
   },
   "1ga6h9h": {
      "title": "What are your thoughts on Brett Cooper",
      "text": "So I just wanna know your thoughts on Brett and her videos I have seen a people say that she doesn't believe in what she says and things like that and like she's a propaganda machine for conservatives (I don't have the full scope of what's happening in America since I don't live there i get those from online sources) and I agreed with what she's saying(and dont try to say I don't have my own opinion i had them before I knew daily wire existed) so yea what are you're thoughts",
      "comments": [
         "She played someone's video very similar to this a number of months ago, going through the \"live stream\" setup even though her show is recorded, and things like that.  I think she is as authentic as any 20-something can be when they have millions of people watching them.  A lot of what they do (literally every actor, interviewer, content creator, etc.) is done with \"high quality video\" in mind, so it necessarily has to have some scripting.  At least in terms of loose scripting.  \n\nBut is her show a genuine show with genuine viewpoints from someone who believes what they say?  There's zero reason or evidence to think otherwise.  I think she is very authentic.",
         "Why do we on the right wonder if our people are authentic?  The left doesn't do this. \n\nTaylor Swift by all accounts was right leaning, she flips to left to help her career, and not a single person on the left wonders if she's being authentic. Because they didn't care, because she is carrying their water.\n\nWe need to stop caring!!!  Brett Cooper is young, intelligent, well spoken and attractive. Not to mention female. The right needs more of this!!!  Something like 70% of females her age are Democrat, so we should be supporting the hell out of her, and anyone like her.\n\nStop worrying if people are authentic.  If they aren't it will come out eventually, and we can stop supporting them then.  I'm looking at you Matt Drudge.",
         "I'm a woman in my later forties, and so the stuff she covers--popular culture, social media, etc--doesn't tend to interest me a lot, but I've slowly become more interested in listening to her. Watch her interview with Jordan Peterson--she is actually an extremely accomplished and impressive young woman, and seems to have a very level head on her shoulders. She started college even younger than Ben did, and was emancipated and supporting herself by 15, as an example. I have yet to see her act, so I will reserve my opinion on that. \n\nEvery Daily Wire regular I have ever heard has said that they are allowed to say whatever they want to on their show. Candace obviously turned into the exception, but even then, it wasn't a case of them standing over her shoulder and telling her what to say. She was allowed to say what she wanted to--but when that no longer represented opinions they wanted associated with the Daily Wire, they let her go. Which is all to say that there is no reason to think Brett doesn't have similar freedom to express her genuine opinions. I'm sure she works with her team to choose the videos or stories she wants to respond to, and makes a plan about what to say, but that doesn't make it less genuine.",
         "I haven’t watched her show, but I’m a guy in my late thirties. My wife likes her show.",
         "I think that she's honest and forthright. And she's sweet woman, I was glad to hear that she had found a guy to share her life with.",
         "I like the videos of hers that I watch, but I’m not a regular viewer. I honestly don’t get the argument about being “authentic.“ just because she has an outline for her videos doesn’t make her any more or less authentic than someone who just shoots from the hip. It means she’s more organized. Also, the headphones and microphone thing are not a creation of streamers. That’s what radio hosts have done forever. we just didn’t have video cameras on them doing it until more recent years. All I know is, she’s got those segues into the sponsor ad down.",
         "What a weak attempt to discredit BC. Her videos are interesting, and she is popular because she is great at what she does. I wonder if there would ever be a context where those arguing with her credibility would accept that anybody could express conservative views, ever. I get the impression they dont like that she has influence and may cause other people to share her beliefs, and rather than just argue on the merits, they try to make her out as inauthentic (for having a relatable streaming setup, set?). I have a feeling this video will change exactly 0 minds for those who watch and enjoy her content.",
         "She's too young for me. I'm out of her target demographic.\n\nAs for being \"a propaganda machine\" that sounds like any critique from the other end of the political spectrum. MSNBC is a \"propaganda machine\" from the conservative end of the spectrum. All of Daily Wire is a \"propaganda machine\" from the leftist end.",
         "I like her. She’s authentic, funny, thoughtful. \n\nI don’t watch many of her videos because she focuses on youth culture, which is usually a bunch of stuff I don’t care about because I’m too old (mid 30s). I generally don’t care what celebrities are saying and doing or what’s trending",
         "She’s for the younger crowd and I’m an angry old white guy. So i hope she does well but im clearly here for the angry politics. (I did subscribe to her for the cause)",
         "She was my gateway to the DailyWire and i am near 50. She is great.",
         "I think she would be better losing the comments section aspect of it. Yes, i know it’s the name of the show. But I care about what she thinks not some rando in the comment section.",
         "She's cute and does a good job reaching her generation.\n\n I'll watch a few minutes, long enough to get the gist and then move on.\n\n I hate to admit she talks a bit too fast for me, or maybe it's the cadence.. In either case I can only take a few minutes before I jet out.",
         "I follow her but I kind of prefer Amala Ekpunobi for the young conservative woman perspective. In some sense they are both manufactured in that they have been elevated by rich older conservative men and broadcast from high end studios made to look like some idealized young woman's living space. That said they are both talented, smart, and offer a fresh perspective. Both come from liberal backgrounds but came to see the lunacy of the modern left, I am not cynical enough to believe that that awakening was manufactured for profit,",
         "I like her.  A lot of her commentary I agree with and enjoy. \n\nEvery time I see her though I think she could be Ben Shapiro’s sister. The resemblance is striking.",
         "Would",
         "I love her. She’s entertaining and informative. She comes across as a warm and friendly person, and has pretty eyes, too!",
         "Her show is pretty entertaining for the most part, my only real criticism I might have is that in an older video from 2022, she said my favorite singer (Halsey) looked like a raccoon, but of course that’s hardly anything to get upset about.",
         "I’m 40. It didn’t really catch me, but my 14yo daughter really likes her.",
         "She’s the goat",
         "15 minutes into this guys video and I need a break 😂",
         "Love her. She’s intelligent and beautiful",
         "I like female ben shapiro.  Culture content isn't really my thing, and I look forward to her growing into a political opinionist, but she presents well and is kinda funny.",
         "Despite her “appeal” to my generation, I don’t like her content. It feels like a waste of mental faculties.",
         "I'm still hoping for DW to finish the more authentic modern Snow White movie (with BC).",
         "I dig watching her. She’s entertaining.\n\nI do wonder if she’s related to Ben Shapiro though, the facial resemblance is strong to me.",
         "Never listened to her for more than a few minutes… I’m there for Ben, Matt, Michael and Klavan!",
         "The Left initially posted headlines saying that she mopped the floor with Brett to sway the sheep that didn't actually watch the interview, but then too many people actually watched the interview to see she was a disaster.\n\nThat is the current use of media and social media. Get it in the headline and the weak minded will believe it.",
         "Love her. She’s a great host",
         "I think she’s awesome!",
         "I need a triple speed to listen to this dude. In my opinion he's not really attacking her authenticity. All his arguments apply to any Youtuber or news anchor or any media personality masquerading as a \"normal person.\" His main thesis is that since Brett had a lot of resources behind her, and presents herself as a simple girl, she's not authentic. He spends most of the video attacking her conservative viewpoints.",
         "I want to smash. Other than that, never thought about her.",
         "Brett Cooper is a young lady who's married, now? From face value, her relationship is holding up, which means she's not hoeing around at clubs or seeking open-relationship stuff. This points to her conservative values. And somebody who gets married early likely has conservative values",
         "Hate these type of youtubers, just critiquing random celebrities' life to drawing in clickbait",
         "I don't think about her at all.",
         "Purity tests are so ridiculous.",
         "I agree. This preoccupation with proving objective truth in the age of subjectivism is just tedious and boring. I know bullshit when I smell it.",
         "Look i couldn't agree with you more on that I just wanted to know the public opinion.",
         "The Left WANT to believe what is obviously illogical if they just thought for themselves",
         "She is basically female Ben Shapiro - particularly in looks but surprisingly also in other areas as well",
         "This is why she exists. To interest women. My wife likes watching her videos and asks me political questions now.",
         "Somehow they aren't related",
         "I'm pretty sure she's here for Gen Z, too. They were specifically looking for someone to appeal to young people. I still listen to Ben way more than her, but her videos are typically short and punchy, which makes them very watchable.",
         "Indeed. She's better than Candace Owens in her delivery and lack of cattiness."
      ]
   },
   "1gad095": {
      "title": "This video aged terribly.",
      "text": "https://youtu.be/luIvQjyMsEU?si=SJyd_nOA026zNcCV",
      "comments": [
         "I never imagined people would be so excited for a senile old man to win an election, but Democrats are weird so.",
         "Why are some comments locked but not others for up/down votes? Mods being opinionated?\n\nLock the thread or don’t.",
         "He's not American, let him stay out of our elections.\nThough, on the other hand, Chuck Schumer did give a speech implying that the PM of his country should be ousted.",
         "Like I'm so conflicted, I know for a Fact that Trump/Vance is the right way to go, it's the only way to go, these are good people who Love Ameirca and it's citizens. And I hear People Like Andrew Wilson, Ben Shapiro, and Matt Walsh give Amazing, sound arguments that no one can Refute as to why Trump is good. Especially Andrew Wilson. But when Everyone On social media is 98% Democrat it's Like they constantly Gaslight me into Doubting myself, And it's so hard to Think about sometimes",
         "He lives in America",
         "If it’s hard to think about that means you are thinking hard. But just because a lot of people think something doesn’t mean they are right. You have to think and decide for yourself. But also, it’s usually not a question of Trump being better or worse than Kamala, it’s a question of alignment of values. So Kamala is the right choice for people with some values and the wrong choice for people with other values. For me, Kamala is actively against many of my values, while Trump’s policies are consistent with most of my values.",
         "Just keep thinking for yourself. You can’t talk to people if they don’t want to listen. If they’re gaslighting, it’s probably an indication that they have no good points to make.",
         "“Do not conform to the pattern of this world, but be transformed by the renewing of your mind. Then you will be able to test and approve what God’s will is—his good, pleasing and perfect will.” Romans 12:2",
         "It is not the content that goes into a man that makes a man, but the content that comes out.",
         "No, he lives in the UAE.",
         "Well Kamala has no values 💀💀. She says what she thinks people wanna hear literally depending on the state. Meanwhile Trump is completely transparent and everyone literally knows basically everything about him. And Frankly Basically everything Kamala stands For goes against My Morals (Christian Ethics which is what we all should live by). I guess I'm js whining Everyone doesn't see the truth 🤷"
      ]
   }
}