{
   "1gjipdk": {
      "title": "Michael Moore predicts 'Trump is toast' in 2024",
      "text": "",
      "comments": [
         "I’m not so into Moore’s predictions. He made a wild guess in 2016. He was wrong in 2020. \n\nWe won’t know until after the election.",
         "I am optimistic for now that he is correct. Trump is not even what’s best for billionaires so why would they allow him to be re-elected?",
         "I hope Chump is burnt orange toast. 🙏",
         "He was the first person that I remember accurately predicting a Trump win 8.5 years ago",
         "I feel anxious to say it out loud but I think Trump is going to lose again. And not just on hopium, I really think he’s too old, too uninspiring; There’s an enthusiasm gap that I feel is being really under-reported",
         "Doubt it. Michiganders have made it abundantly clear they’re not voting for Harris. Pennsylvania will likely go for Trump as well. North Carolina is not a real swing state and hasn’t been since Obama won in 2008 (he also won Indiana but Democrats decided to ignore that part apparently). Wisconsin likely to Harris but barely. Arizona and Georgia back to GOP. It’ll be 287-312 electoral votes for Trump. And that sucks but it’s what happens when Democrats go with the worst candidates possible time and time again.",
         "2016 wasn’t  a wild guess.  He based that on his discussions and knowledge of the rust belt and their feelings about the Clintons.  2020 he said he didn’t know how it was going to turn out and he wasn’t going to make a prediction.  He did say not to underestimate Trump’s support in the run up to the election."
      ]
   },
   "1gigwsj": {
      "title": "Will Abortion Rights Decide 2024 Election?",
      "text": "",
      "comments": [
         "For all this talk about the crisis of men and incels and all maybe the answer is really really simple. They are pissing women off.",
         "Yes. Vote and help.",
         "Roe, Roe, Roe the vote!"
      ]
   },
   "1ghpnfx": {
      "title": "A Kind Reminder From Sen. Sanders",
      "text": "",
      "comments": [
         "Please be prepared for this, and pay attention to what's actually happening, not just what's being said.",
         "Related video from Robert Reich: [Beware Trump’s Election Night Trick](https://www.youtube.com/watch?v=5XEQ_7zZ-bw)",
         "Ok, so what can we do about it?"
      ]
   },
   "1gh2ab4": {
      "title": "Americans in Puerto Rico can't vote for US president. Their anger at Trump is shaping the race.",
      "text": "",
      "comments": [
         "It’s time to give statehood to all US territories. This ridiculous colonialism must end.",
         "Americans living in Puerto Rico cannot affect the election, but more Puerto Ricans live in the fifty states. Their anger could be Trump's undoing. \n\nExample: more Puerto Ricans live in Pennsylvania than the margin of victory in the last three presidential elections.",
         "> The comments dominated local news sites late into the night and prompted Jenniffer González, Puerto Rico’s representative in Congress for the pro-statehood New Progressive Party and a Trump supporter, to call them “despicable, misguided and disgusting.”\n\n> “They do not represent the values of the GOP,” she said.\n\nIf things weren't so serious I'd fall over laughing. Who's she trying to kid?",
         "Puerto Rico needs to be a state with 4 senate seats and 6 EC votes to match the states Iowa and Utah with similar population.",
         "> \"The comments dominated local news sites late into the night and prompted Jenniffer González, Puerto Rico’s representative in Congress for the pro-statehood New Progressive Party and a Trump supporter, to call them 'despicable, misguided and disgusting. ... They do not represent the values of the GOP,' she said.\"\n\nOHHHH, YES THEY DO\n\nWhere the hell have YOU been, lady",
         "Puerto Rico should be its own independent country. And the US should pay off all its debts (which are because of US policy towards the island). \n\nAnnexing Puerto Rico as a state is not the progressive position.",
         "I recently saw there’s something like 300,000 Puerto Ricans in Texas alone.",
         "Idk why we can’t just do a referendum on the matter and see what the citizens of these territories actually want to do.\n\nIt’s also strange because the only way a Puerto Rican can vote for the US president is if they move to a US State, whereas if someone born in a US state moves to Puerto Rico they lose their ability to vote.\n\nSo if being born in Puerto Rico doesn’t take away your right to vote if you can move to another state why tf does living there?",
         "Either give statehood to territories, or let them succeed. Keeping them around and not giving them any representation is rather oppressive.",
         "For Puerto Rico, definitely. Not all territories want statehood. American Samoa doesn’t because it would force the end of their system of communal land ownership.",
         "I’m hoping that if Kamala wins, this incident makes statehood for Puerto Rico and D.C. a much higher priority.",
         "FFS, I sure hope they turn out and vote! Ignore all polls. Vote vote vote.",
         "A “New Progressive Party” representative backing Trump? Do words even mean anything anymore?",
         "> Who's she trying to kid?\n\nHerself first",
         "New \"Progressive\" Party lmfao. Yet pro-statehood AND a Trump supporter?",
         "*house seats?",
         "no. there should be a referendum held by puerto rican residents. if they choose to become a US state, then that's what should happen.\n\nthey may be better off without us, but maybe not. let them decide.",
         "They should still be allowed to vote on president regardless of statehood. We let Americans who live abroad vote, yet US citizens who live on American soil can’t, doesn’t make any sense.",
         "And DC, as well. It can vote in the electoral college, but it doesn't have representation within the Senate.",
         "Then give them a vote. In or out. If it's out, then fine. It's their land after all. Let them go.\n\nBut I can think of an instant answer for this. Make the majority of the lands a reservation, modeled on Native American reservations, upon which they can own land by their traditions, and make just the areas owned by non natives outside the reservation. \n\nAlternatively, surely the French came up with a solution, for the other portion of Samoa. Model on that.\n\nAnyhow, since a state has mutual sovereignty, I imagine there is a way to enshrine their customs in state law. I don't think this is an absolute roadblock.",
         "I know this is out of the realm of possibility for the US, but the system should be amended such that they can vote without losing anything else",
         "Should still have the right to vote if laws and policies are in effect there.",
         "Ya that threw me off. I originally read the sentence as being about her and a completely different person.",
         "Yes",
         "Because they'd vote for the \"Demon\"crats. If it was a conservative stronghold it would have ben awarded votes 50 years ago."
      ]
   },
   "1ggh1hg": {
      "title": "Billionaires vs Democracy - The rich are trying to buy elections all over the world and consign democracy to the trash bin of history.",
      "text": "",
      "comments": [
         "I would say they have been quite successful at this. What the DS don't seem capable of grasping is that they are better off when the middle class is better off. They are in essence killing the goose that lays the golden egg.",
         "We need a world-wide cap on wealth.  No more billionaires.",
         ">From Democracy to Oligarchy\n\n>Billionaires are a trump card that can disrupt democracy by exploiting the dreams of some people to acquire enormous wealth, become famous, and break the law with impunity. Once billionaires win, however, they become the law. As in Russia, the oligarchs collaborate with the ruling party to transform politics into patronage and economics into outright theft.\n\n>To do this, they don’t have to break the law: they make the law.\n\n>In the United States, such an oligarchy would look a lot like the state of affairs at the impishly named X. \n\nThe author of this article seems incredibly naive.  This already happened in the US long, long ago.  They already made the law.  It's called Citizens United.  Unlimited money is already being poured into politics.  Democrats aren't losing because they don't have billionaire support.",
         "They are running scared because they see the tide turning against them. Wealth inequality this extreme historically does not last very long in any society.",
         "They would rather have less money and have a bigger gap between us and them \n\nMost Billionaires are mentally unwell. There is never enough to fill the holes in their lives \n\nWe suffer for their psychosis",
         "I picture Smaug and the hoard of gold…"
      ]
   },
   "1gg328q": {
      "title": "How Corporations Use Anti-Immigrant Politics to Divide the Working Class",
      "text": "",
      "comments": []
   },
   "1gfmamd": {
      "title": "A Texas Woman Died After Waiting 40 Hours for Miscarriage Care",
      "text": "",
      "comments": [
         "The Republican plan to protect women seems to be working as designed.  /s",
         "Vote like women's lives depend on it."
      ]
   },
   "1gelsyg": {
      "title": "20k+ attend Michigan Rally",
      "text": "",
      "comments": []
   },
   "1gdskia": {
      "title": "Trump loyalists spew racist, vulgar attacks at Harris and Democrats at New York City rally",
      "text": "",
      "comments": [
         "Color me shocked.",
         "Article Text:\n\nFormer President Donald Trump closed his Madison Square Garden rally on Sunday with an ominous 80-minute speech denouncing his political rivals, assailing immigrants and promising to invoke an 18th century law to pave the way for mass deportations.\n\nBut it was the opening acts of the New York City rally – a hodgepodge of donors, entertainers and MAGA politicians – who unleashed an eleventh-hour campaign furor that prompted angry rebukes from Democrats and some Republicans who worried the vengeful show would hurt their standing with moderate voters.\n\nLocal Trump loyalists, who made up many of the speakers’ list ahead of the former president, took the opportunity to spew familiar grievances at some of Trump’s favorite targets. One failed Republican House candidate labeled Harris “the antichrist.”\n\nHe hardly stood out.\n\nThe rally began with Tony Hinchcliffe, a comedian and podcast host, assailing Puerto Rico – in the city that’s home to the largest Puerto Rican population on the US mainland. About 500,000 Puerto Ricans also live in battleground Pennsylvania, where Harris campaigned on Sunday.\n\n“There’s a lot going on, like, I don’t know if you know this but there’s literally a floating island of garbage in the middle of the ocean right now,” he said. “I think it’s called Puerto Rico.”\n\nThe line was well-received by Trump supporters who filled the historic arena in Midtown Manhattan. Trump has recently taken to calling the US “a garbage can for the world” when he rails against undocumented immigrants.\n\n“These Latinos, they love making babies, too. Just know that they do,” Hinchcliffe continued.\n\nAfter the rally, Trump’s campaign sought to distance itself from Hinchcliffe, who like the other speakers was an invited guest, and his comments about Puerto Rico.\n\n“This joke does not reflect the views of President Trump or the campaign,” Trump campaign spokesperson Danielle Alvarez said in a statement to CNN.\n\nBut Harris’ campaign had already seized on the attacks on Puerto Rico, quickly clipping the video and posting it on social media channels. The vice president on Sunday visited a Puerto Rican restaurant in North Philadelphia, where she discussed her vision for the island along with plans to lower costs and create opportunity in Puerto Rican communities on the mainland.\n\nPuerto Rican superstar Bad Bunny, whose album “Un Verano Sin Ti” was the most-streamed album globally in 2023, posted a video of Harris spelling out her plan for Puerto Rico to his 45 million Instagram followers shortly after Hinchcliffe left the stage.\n\nRepublican Sen. Rick Scott of Florida, whose reelection campaign depends on sizable support from the state’s Puerto Rican community, joined the backlash, writing of the “joke” on X, “It’s not funny and it’s not true. Puerto Ricans are amazing people and amazing Americans!”\n\nHinchcliffe, also on social media, addressed the furor, saying that his critics “have no sense of humor.”\n\n“I love Puerto Rico and vacation there. I made fun of everyone … watch the whole set,” he wrote.\n\nTrump — who was introduced by former first lady Melania Trump in her first speaking role at a rally this cycle — largely stuck to the script in his own remarks, including his now common assertion that his political rivals represent a traitorous “enemy within.”\n\n“We’re running against a massive, crooked, malicious leftist machine that’s running the Democrat party,” the former president said. “They are smart and vicious, they are the enemy within, we must defeat them.”\n\nAnother warm-up act, former Fox News host Tucker Carlson, reprised his old attacks on Harris and the idea, as he described it, of Americans celebrating her possible election.\n\n“It’s gonna be pretty hard to look at (the country after Harris wins) and say, you know what, Kamala Harris, she got 85 million votes because she’s so impressive – as the first Samoan, Malaysian, low IQ former California prosecutor ever to be elected president,” said Carlson, before exclaiming that anyone who is not impressed by Harris will be called a “freak” or a “criminal.”\n\nLater, Republican politician David Rem took the microphone to call Harris “the devil” while waving around a cross.\n\n“She is the antichrist,” Rem wailed, before saying he planned to run for mayor.\n\nAnother speaker, radio host Sid Rosenberg — who once occupied a plum seat beside Don Imus on WFAN, the area’s largest sports station — started off by attacking Clinton, the Democratic nominee from eight years ago.\n\n“She is some sick bastard, that Hillary Clinton, huh?,” he said, channeling Trump’s own past remarks. “What a sick son of a b*tch.”\n\nRosenberg then turned his attention to migrants now living in New York City – and his fury over the local government’s attempts to feed and house them.\n\n“You got homeless and veterans – Americans, Americans – sleeping on their own feces on a bench in Central Park,” Rosenberg said. “But the f**king illegals, they get whatever they want, don’t they?”"
      ]
   },
   "1gchyzx": {
      "title": "No One Needs This Many Guns",
      "text": "",
      "comments": [
         "Agreed. My late father was a gun nut. He owned 37 of them when he died. He smuggled two loaded derringers into the hospital on one of his many trips there in his final days. My mother found them before he shot himself or someone at the hospital. When he died we had three illegal weapons to get rid of, two sawed off shotguns and an AK 47 style rifle that he had converted to an automatic weapon with a kit from a gun show. He didn’t shoot it that much it was just too expensive to go through so many bullets so fast. I shot it once. My father also collected salt and pepper shakers. He had hundreds of them. They were all cheap things he picked up at garage sales and thrift stores. There was some sort of obsessive compulsive thing going on with him.\n\nI think the key to gun control in America is to forget about the guns and make it hard to get bullets. Sure some people will make their own but most won’t. Make the ingredients to make them controlled substances. Make them expensive. It won’t stop every gun death in America but it would go a long way in reducing the number of deaths.",
         "Gun registry now. Gun insurance now. Mandatory gun training now.",
         "as long as there are those who connect their gun possession....with their manhood and inner feelings of self worth...\n\nit will not change.",
         "Let these nuts collect all the guns they want. It's their .only and that means fewer guns on the street.",
         "Chris Rock proposed the idea of Bullet Control a long time ago.\n\n>You don’t need no gun control, you know what you need? We need some bullet control. Men, we need to control the bullets, that’s right. I think all bullets should cost five thousand dollars… five thousand dollars per bullet… You know why? Cause if a bullet cost five thousand dollars there would be no more innocent bystanders.\nYeah! Every time somebody get shot we’d say, ‘Damn, he must have done something ... Shit, he’s got fifty thousand dollars worth of bullets in his ass.’\nAnd people would think before they killed somebody if a bullet cost five thousand dollars. ‘Man I would blow your fucking head off…if I could afford it.’ ‘I’m gonna get me another job, I’m going to start saving some money, and you’re a dead man. You’d better hope I can’t get no bullets on layaway.’\nSo even if you get shot by a stray bullet, you wouldn't have to go to no doctor to get it taken out. Whoever shot you would take their bullet back, like \"I believe you got my property.",
         "The real life hack would be to make a gun that shoots salt and pepper shakers.",
         "Until someone robs them and puts all their guns in the hands of criminals",
         "[deleted]",
         "I read that entire thing in his voice",
         "Exactly!",
         "*Modern problems require modern solutions.*",
         "Most guns used by criminals are produced by big factories and were initially legally purchased",
         "Fair. But a small percentage of Americans own a huge majority of the guns, I don't think that's a bad thing."
      ]
   },
   "1ga8u8y": {
      "title": "These teachers often live in poverty. A pay raise could help — but there’s a cost",
      "text": "",
      "comments": [
         "Investing in teachers is investing in your children",
         "Or we could just fund the program and quit accepting right wing framing on every single issue.\n\n'To raise pay “without further funding,” Holcomb says, “would mean I have to close currently operating classrooms, cutting services to children and reducing staff.”'",
         "Yes, and everyone's! \n\nInvesting in teachers is investing in the future, pure and simple."
      ]
   },
   "1g8lhj0": {
      "title": "Why Catholic bishops are donating less to oppose abortion rights measures this year",
      "text": "",
      "comments": [
         "The cupboards are bare(-ish) what with all the child sexual abuse payouts.  Catholics gonna Catholic.",
         "Because…\n\n> “They're starting to acknowledge that there is a disconnect between what people in the pews believe and what the hierarchy preaches from the pulpit,” Ashley Wilson, spokesperson for the group Catholic for Choice, said of the Catholic bishops."
      ]
   },
   "1g6fyiv": {
      "title": "Ron DeSantis, using the levers of state government, ramps up efforts to defeat Florida abortion-rights ballot measure",
      "text": "",
      "comments": [
         "> Florida Gov. Ron DeSantis and allies in his administration have undertaken a robust effort to build opposition to an amendment on the November ballot that would enshrine abortion rights in the state’s constitution and undo a pinnacle piece of legislation he signed into law.\n\n> In recent weeks, one state agency launched a website attacking the ballot measure, another state agency threatened local television stations that had run an ad supporting it, and an election police unit created by DeSantis started investigating claims of fraud in the signature-gathering process for it months after it was approved for the ballot.\n\n> DeSantis’ critics [argue] that using government resources to wade into a political fight is unethical and illegal."
      ]
   },
   "1g4dqdz": {
      "title": "Jimmy Carter Achieves His Goal, Lives Long Enough to Vote for Kamala Harris",
      "text": "",
      "comments": [
         "one of the best presidents, and people, ever.",
         "I believe in many states if he were to pass before the Election Day, the vote would be invalidated.",
         "Years from now this will be one of those fun facts that blows people's minds.",
         "I built houses for you, have seen you preach 3x, and shaken your hand. Your work is now done and you can rest sweet angel. Thank you for your service.",
         "Heaven forbid, but if he died before the election you know the gop would scream “voter fraud!!”",
         "Goddamn.",
         "[removed]",
         "Does anyone know if, in fact, he voted, I really hope so!",
         "I wish he was able to stick around longer in DC to rid more corruption from government. He really had the best intentions",
         "100%, as someone who grew up in poverty under his presidency, his policies positively impacted my family and growth, literally, had food because of his policies and now am a successful business owner who is happy to pay higher taxes to help others the way Jimmy Carter helped us.",
         "But how do they find it?  Once its received isn't it just verified against the voters signature record, then the ballot removed and randomized with all the other mail-ins?  Or do they wait until election day to start that process?",
         "Most states have mail-in or early voting, they also have accommodations for those who are in hospice so as long as it's postmarked on or after the date of eligibility his vote would stand, also he's still alive so he hopefully will make it to see her actually get elected! Edit: 10 states specifically allow those ballots to be counted, 16 states prohibit counting those ballots, and the remaining 24 states, including Georgia have no specific laws on the topic, according to research from the National Conference of State Legislatures and his vote would be counted.\n\nEdit 2: did some more research I find this fascinating... \n\n10 states explicitly permits votes be counted—Arkansas, Florida, Hawaii, Louisiana, Maryland, Massachusetts, Montana, North Dakota, Tennessee and Virginia—have statutes that explicitly permit counting absentee ballots cast by voters who die before Election Day; one state-Connecticut-only counts these ballots if the deceased voter is a member of the armed services.\n\n9 states explicitly prohibit votes be counted—Delaware, Illinois, Indiana, Iowa, Missouri, New Hampshire, New Jersey, Pennsylvania and Wisconsin—have statutes that explicitly prohibit counting absentee ballots cast by voters who die before Election Day. Missouri states that such ballots be rejected only if sufficient evidence is shown to an election authority that the voter has died before the opening of the polls on Election Day, and the deceased voter's ballot is still sealed in the ballot envelope. (Kentucky & Missouri AGs Prohibit but no laws on the books, crazy)\n\nThe rest do not have an explicit policy, which is insane! Colorado, NY, Kansas allows challenges to ballots (no idea what that means), so there's no federal law protecting someone's vote who passes, I think that's sad if they were alive and got their ballot in on time that vote should be counted.\n\nHere's the link for info:\nhttps://www.ncsl.org/elections-and-campaigns/counting-absentee-ballots-after-a-voter-dies",
         "Thank you. Nobody has said. Nonsense headline.",
         "YES! The Carter Center confirmed his vote by mail.\n\nhttps://www.pbs.org/newshour/politics/at-age-100-jimmy-carter-casts-his-ballot-for-the-2024-election-by-mail-in-georgia",
         "Good question. Found this pretty comprehensive answer - https://www.verifythis.com/article/news/verify/elections-verify/what-happens-if-someone-votes-early-but-dies-before-election-day/536-072041c7-5bb0-4e54-8418-5e98802c4dc1",
         "See my response to the other person re: detailed state by state rules",
         "That’s all fine and dandy, but if the deceased isn’t someone famous like St Carter *how would they even know*? I’d be surprised if record data was shared.",
         "YES! The Carter Center confirmed his vote by mail.\n\nhttps://www.pbs.org/newshour/politics/at-age-100-jimmy-carter-casts-his-ballot-for-the-2024-election-by-mail-in-georgia",
         "Yes, I edited and updated, that's the argument as to why some states do not have a policy, how would you find the ballots?! They're not named, but other states do prohibit so not sure if the votes are tracked in those states, very interesting. In Georgia, President Carter's vote will be counted!"
      ]
   },
   "1g2sdms": {
      "title": "'Cancer Doesn't Wait': How Prior Authorization Harms Care",
      "text": "",
      "comments": [
         "Fantine Giap, MD, sat across from a 21-year-old with a rare sarcoma at the base of her skull. \n\nDespite the large tumor, nestled in a sensitive area, the Boston-based radiation oncologist could envision a bright future for her patient. \n\nShe and the other members of the patient's care team had an impressive cancer-fighting arsenal at her fingertips. The team had recommended surgery, followed by proton therapy — a sophisticated tool able to deliver concentrated, razor-focused radiation to the once apple-sized growth, while sparing the fragile brain stem, optic nerve, and spinal cord. \n\nSurgery went as planned. But as the days and weeks wore on and insurance prior authorization for the proton therapy never came, the tumor roared back, leading to more surgeries and more complications. Ultimately, the young woman needed a tracheostomy and a feeding tube. \n\nBy the time insurance said yes, more than 1 year from her initial visit, the future the team had envisioned seemed out of reach. \n\n''Unfortunately for this patient, it went from a potentially curable situation to a likely not curable situation,” recalled Giap, a clinician at Massachusetts General Hospital and instructor at Harvard Medical School. “I wanted to cry every day that she waited.'' \n\nWhile a stark example, such insurance delays are not uncommon, according to new research published in JAMA Network Open.\n\nThe study of 206 denials in radiation oncology concluded that more than two-thirds were ultimately approved on appeal without changes, but often these approvals came only after costly delays that potentially compromised patient care.\n\nOther studies have found that number to be even higher, with more than 86% of prior authorization requests ultimately approved with few changes.",
         "Friend used to enter doctor referrals and codes into an insurance company's system. She had no medical training. She'd have to approve treatment. Sometimes the codes would kick back questions. If the code was a typo or didn't match diagnosis she was supposed to reject treatment and send back to doctor. If she could tell it was a typo she'd approve treatment and ask doctor's office to correct paperwork. The insurance company kept giving her more and more to enter. She couldn't keep up. She was told to get someone to help her. Essentially hire a freelancer. She couldn't find anyone reliable. Eventually she hired her 13 year old nephew. He was reliable and motivated, got paid piece meal so he worked every free minute. I wonder how many people had treatment rejected by a 13 year old.",
         "This is what happens if you have Medicare DisAdvantage. Part A&B are very much worth it, you get what you pay for.",
         "screw for profit insurance & healthcare\n\nMedicare/Medicaid for ALL!",
         "Medicare and Medicaid both require prior auths for certain things.",
         "Medicare/caid tend to be my biggest obstacle when getting things for my patients. The issue is we have given insurance way too much authority in medical decision making.",
         "Sure. But they don’t have a profit motive to deny due coverage, like they attempt to do here all the time. Medicare doesn’t pay employees bonuses for denying people the coverage they deserve. For-profit insurance does."
      ]
   },
   "1g15vgr": {
      "title": "What is Harris' \"Medicare at Home\" plan and how would it work? - CBS News",
      "text": "",
      "comments": [
         "In the 80s my mom worked on a pilot project for the department of health and human resources that trained single mothers on welfare to be home health aides for the elderly on fixed incomes. The pilot was very successful and promptly shut down. If they take that plan out of mothballs it oughtta be a good start."
      ]
   },
   "1fyxsdj": {
      "title": "Supreme Court Decides to Let Texas Women Die",
      "text": "",
      "comments": [
         "Let makes it sound like their deaths are voluntary. The court is killing women in Texas is the more appropriate headline.",
         "Just Texas doing Texas things. \nThey already had the highest maternal mortality rate in the western world before Roe v Wade was destroyed.",
         "Abolish this rogue court!",
         "They will create a federal abortion ban at the first opportunity.",
         "The conservative Supreme Court justices have blood on their hands."
      ]
   },
   "1fy41xt": {
      "title": "Supreme Court’s new term: Trans rights, guns and 2024 election",
      "text": "",
      "comments": [
         "I'm going to give my educated guess here....zero trans rights...expanded access to guns for exactly the worst people...bend over backwards to give republicans every possible advantage in the 2024 election cycle ..."
      ]
   },
   "1fx1wie": {
      "title": "Inside the “Private and Confidential” Conservative Group That Promises to “Crush Liberal Dominance”",
      "text": "",
      "comments": [
         "They want to crush good ideas that the majority of people want without having better ideas and just concepts that favour them.",
         "\"we want to help people do the things they want and need to do\"...the Dems\n\n\"we want to make people stop doing what they want and need to do\"....the GOP\n\nand yet they say both sides are the same.",
         ">”Since Teneo began, I’ve been building hundreds of friendships among diverse leaders who have a deep love for this country and are working on innovative solutions to drive human flourishing for all. Teneo has made me a better husband, father, and leader.”\n\nA deep love for controlling this country, you mean. You do a lousy job of hiding your true plutocratic aims. \n*Teneo fecal*"
      ]
   },
   "1fwhmbo": {
      "title": "Amid Medicaid â\u0080\u0098Unwinding,â\u0080\u0099 Many States Wind Up Expanding - KFF Health News",
      "text": "",
      "comments": []
   },
   "1fv3tfi": {
      "title": "California’s $20 Fast Food Minimum Wage Sees No Job Loss, Slight Price Hikes",
      "text": "",
      "comments": [
         "This is amazing.",
         "Imagine the health benefits of people eating fast food less due to fair wages? Slight price increases of unhealthy fast food, which are now already overpriced, can only benefit the obesity problem.",
         "Now do EMT’s…"
      ]
   },
   "1ftknr4": {
      "title": "Photos: As Jimmy Carter celebrates his 100th birthday, a look through the decades",
      "text": "",
      "comments": [
         "So happy he made it to 100! He said more than his 100th birthday he was holding on so he can vote for Kamala, mail in date for Georgia is Oct 7, please, please let this lovely, dear man make it at least until then..."
      ]
   },
   "1fqkfib": {
      "title": "More trans teens attempted suicide after states passed anti-trans laws, a study shows",
      "text": "",
      "comments": [
         "The cruelty is the point.",
         "Unsurprising that after you take an already-marginalized population, and then seek to codify that discrimination in law, making it seem like all of society is against them, that many will fall into despair.\n\nHistory will not look back kindly on how trans people have been treated in recent years."
      ]
   },
   "1fq5jjr": {
      "title": "California May Regulate and Restrict Pharmaceutical Brokers: Pharmacy Benefit Managers have been under fire for years for alleged profiteering and anticompetitive conduct, but efforts to regulate the industry at the federal level have stalled in Congress",
      "text": "",
      "comments": []
   },
   "1fp0ydc": {
      "title": "Watchdog sheds light on FAFSA fiasco, from a birthday bug to call center failures",
      "text": "",
      "comments": []
   },
   "1fomqyq": {
      "title": "Tell your U.S. House representative: Vote no on the \"Fix Our Forests Act\" - Environmental Action",
      "text": "",
      "comments": [
         "But it’s called the “Fix Our Forrests Act”. Why wouldn’t we want them to do that?",
         "Really fucking sick and tired of politicians being able to blatantly lie about what bills do, starting right at the name.",
         "\"The Fix Our Forests Act bypasses critical environmental laws that protect wildlife and wild places and restricts scientific input and public participation.\n\nThis bill could have devastating consequences for threatened and endangered wildlife, especially amid rapid extinction rates and a climate crisis, both of which can be helped by keeping our forests standing.\n\nTell your member of Congress to oppose this bad forests bill.\"\n\nHelps to read why.",
         "Apologies. I thought the /s was clearly implied. I was commenting on the fact that it’s become pretty standard for lawmakers to give  misleading titles to legislation in a bad faith bid to trick people into voting against their interests.",
         "I just read the bill. You haven't cited a single section of this bill or offered any explanation why it is bad or why anyone should oppose it."
      ]
   },
   "1fmq4hx": {
      "title": "‘Everybody deserves a second chance': How bail reform changed Houston’s criminal justice system",
      "text": "",
      "comments": [
         "Except Trump. He is one person who doesn’t.",
         "He has already had about 7000 second chances."
      ]
   },
   "1fkhsfz": {
      "title": "Exclusive: Watchdog finds Black girls face more frequent, severe discipline in school",
      "text": "",
      "comments": [
         "NEWSFLASH: \"BLACK PEOPLE DISCRIMINATED AGAINST REGARDLESS OF AGE OR SEX IN THE USA\"\n\nAnyone that is black knows this already.",
         "[deleted]"
      ]
   },
   "1fjo059": {
      "title": "Senate Republicans block IVF bill, as Democrats elevate issue ahead of November election",
      "text": "",
      "comments": [
         "> Days before the vote GOP lawmakers dismissed the move as a \"show vote.\" Senator John Thune, R-S.D., told reporters Tuesday that \"Republicans support IVF full stop,\" and added, \"this is simply an attempt by Democrats to try and create a political issue where there isn't one.\"\n\nREAD: We love IVF and think it should be available to everyone so much that we will do everything in our power to prevent that access being codified into law.\n\n-Senate Republicans",
         "I really love how we have to constantly fight for stuff like this and never address the underlying systemic problems. \n\nLike this stuff SHOULD be addressed, but it feels like we never move forward anymore. Only fight off these gremlins in Congress"
      ]
   },
   "1ffy4s7": {
      "title": "MUSICIANS FOR KAMALA: A NATIONAL LIVESTREAM MUSICAL EVENT · The Democratic National Committee",
      "text": "",
      "comments": []
   },
   "1fe0jxe": {
      "title": "Taylor Swift endorses Kamala Harris",
      "text": "",
      "comments": [
         "Cats around America rejoice!",
         "Why is this making headlines?",
         "It’s joever",
         "Opposing MAGA is an easy bar to clear. Where would she land on true labor issues — if it were AOC vs Kamala?",
         "It's over. Kamala Harris has won.",
         "Because it is an endorsement that is driving voter registration among her fans and young people."
      ]
   },
   "1fdhlki": {
      "title": "Republican Health Coverage Proposals Would Increase Number of Uninsured, Raise People’s Costs | Center on Budget and Policy Priorities",
      "text": "",
      "comments": []
   },
   "1fab4o7": {
      "title": "After a study found toxic metals in tampons, lawmakers are pressing the FDA to act",
      "text": "",
      "comments": [
         "wtf! why didn't the study name the brands?"
      ]
   },
   "1fa2iu7": {
      "title": "New standard reply to \"Now is not the time...thoughts and prayers\" mantra ",
      "text": "Everyone is sick of the standard response to every school shooting. I would respectfully suggest the following:\n\n- Immediate follow up question - \"Okay, what day would you like to discuss this and I will put it on my calendar\"\n\n- Or, by progressives asked about other issues, like the border, inflation, unemployment, or insert topic here: \"Now is not the time to politicize the border. We need to be sending thoughts and prayers to the people struggling in our border states, as well as those struggling to navigate their lives to a better place in America.\". Or replace with whatever issue is being questioned. ",
      "comments": [
         "If now’s not the time, then yesterday was.",
         "You seem to be mistakenly assuming anyone who says now is not the time and brings up thoughts and prayers is responding in good faith. They are not.",
         "Now is not the time to talk about what could’ve been done yesterday. We need to be sending our thoughts and prayers to the people struggling with time management and executive function who only seek to make a better America."
      ]
   },
   "1f9k6cy": {
      "title": "Elon Musk shares theory that only 'alpha males' should vote",
      "text": "",
      "comments": [
         "Elon Musk is an out of shape, soft-handed internet addict who was born with an emerald spoon up his ass. Anyone who works a regular 9-5 is more \"alpha\" than him.",
         "Imagine his surprise when he learns that verbally licking the crank of other dudes isn’t very alpha",
         "Conservatives have no shortage of ideas on how to limit voting.",
         "The Silicon Valley billionaire who mumbles and stumbles his way through sentences and is built like a peanut m&m is very alpha.",
         "Really? The guy who simps hard for the GOP thinks he’s an alpha? \nWhat a douche nozzle.",
         "Imagine being Elon Musk and thinking that you're \"alpha\", lol. 😂\n\nMoney can buy a lot of things, but it can't buy you class.",
         "Then only alpha males get to purchase or use any of his products.\n\n\nWhich I'm fairly certain alpha males are specifically avoiding.",
         "unsurprisingly he believes voting should be restricted to those people\n\nexactly like him.",
         "There is no such thing as an alpha male. \n\nThis came from a book about wolf packs \n\nDrawing conclusions about humans from wolves is pretty silly. But..... \n\nThe author of the book made his publisher stop selling it and he's been telling everybody that the description in the book of wolf packs is completely wrong. \n\nGoogle it.",
         "Why don't you narrow it down even more, Elon? How about you need to be the alpha male son of a wealthy emerald mine owner too? F\\*&king arrogant jackass.",
         "The Republican agenda, right there.",
         "Or…instead….let everyone vote like the Constitution prescribes. What an arrogant pile of shit he is.",
         "But that would disqualify him. Fucking weirdo.",
         "Musk is worse and worse every time I read about him.",
         "My neighbor’s husband listens to a lot of far-right media and told a whole table full of women that he believes women and poor people shouldn’t be allowed to vote",
         "Is Elon Musk ok? Does he need a health check?",
         "He’s so weird.",
         "Aah the good ole “only land owners get to vote”",
         "good, he shouldn't be voting",
         "I would pay to see a fight between Musk and Ronda Rousey, or Gabi Garcia...  Ilona Maher? Hell, pretty sure Ariana Grande could take him.",
         "Let me share a theory: Elon Musk should leave us alone.",
         "How is that a “theory?”  Seems more just like a very dumb opinion.",
         "And the dude’s crank he’s licking isn’t even alpha, either.",
         "Is Musk referring to the discredited biological metaphor or the software release that's not ready for broad testing?",
         "The irony is that the people he supports would take away his right to vote first.  He’s an immigrant.  They fucking hate immigrants.  They have no problem catching some rich white ones in with the poor brown ones, they don’t care about collateral damage, especially when the collateral damage is immigrants."
      ]
   },
   "1f8t7em": {
      "title": "Millions lose Medicaid benefits as states re-evaluate eligibility",
      "text": "",
      "comments": [
         "I didn't listen to the article but isn't this basically happening in red states? And re-evaluate eligibility is pretty much just a euphemism for \"changing the rules to kick as many people off medicaid as possible while still maintaining the minimum federal requirements to retain funding\"?",
         "Oldest trick in the \"modern\" republicans election playbook ;  \nthey seek to transfer the emotions (they cause) onto oponents .  \n.  \nEmotional Contagion: The Psychology of Shared Emotions - Verywell Min   \nhttps://www.verywellmind.com/emotional-contagion-the-psychology-of-shared-emotions-8402628  \n..  \n.",
         "https://www.nbcnews.com/health/health-care/disabled-people-florida-still-struggling-get-medicaid-restored-unwindi-rcna169322\n\nMore than 25 million people in the U.S. have lost coverage during what’s been called the “unwinding” of Medicaid, according to the health policy nonprofit KFF. Roughly 70% of those who were dropped lost their coverage because of procedural reasons such as paperwork issues, although some may no longer qualify for other reasons, such as an increase in income.\n\nDropped with little notice\nMelissa Mazaeda, vice president of care coordinator J&M Support Coordination in Florida, says procedural mishaps have been particularly problematic for people with developmental disabilities, who often require extra assistance to complete the renewal process. Advocates for the disabled say far too many were lumped into the wrong Medicaid categories, were dropped with little notice and didn’t receive timely help when they were disenrolled.\n\nMazaeda said states should never have kicked the developmentally disabled off Medicaid in the first place. \n\n“They are never going to not need Medicaid. You don’t get over Down syndrome. There is no cure for cerebral palsy. You don’t get better from spina bifida or autism,’” Mazaeda said. “They’re going to require lifelong services. And the basis of that is Medicaid.” \n\nThe National Health Law program — a nonprofit that advocates for the health rights of low-income and underserved individuals — has filed civil rights complaints in Colorado, Texas and Washington, D.C., alleging discrimination against people with disabilities.\n\nIn Florida, a class action lawsuit accuses the state’s unwinding process of being not just sloppy, but illegal. Plaintiffs allege the state violated the constitutional rights of tens of thousands of Floridians, ending coverage “without adequate notice” and with “little or no explanation of the actual reason.”\n\nOf the 1.9 million people in Florida who lost Medicaid coverage, according to KFF, patient advocates estimate that thousands of disabled people like Eakin have been affected."
      ]
   },
   "1f8q2f9": {
      "title": "Abortion has huge financial consequences in a woman’s life — and in the economy",
      "text": "",
      "comments": [
         "I love the way people talk about this like it doesn't effect men, too. All the problems?  Yeah, those effect everybody."
      ]
   },
   "1f6otr1": {
      "title": "Why isn't the climate movement voting?",
      "text": "",
      "comments": [
         "Because progressives as a whole simply don't vote. For the last decade or so they have convinced themselves that it's either 100% exactly what they want or nothing.",
         "Because too many of them turn up their nose at voting and are waiting for The Revolution. They would rather play Bolshevik than do anything actually useful.",
         "When a headline asks you to assume a fact is in evidence so it can speculate on the cause they are being dishonest.\n\nThis is propaganda.",
         "Because regardless of people's beliefs across a broad spectrum of issues, and no matter how much most say they prioritize the climate, those issues that are immediately affecting personal interests typically are the actual motives driving voters. You care about the climate, but the effects are only ramping up and not having as big of an effect on you as inflation, the job market, medical bills, etc. Rationally, one will go with those more immediate needs.\n\nThis problem is magnified when there is a two-party system along with single-member districts which the US has both of.",
         "\n\nLike a toddler throwing a tantrum. \n\nDo they ever leave the house one wonders?",
         "Progressives don't have the clout to pull off All-or-Nothing tactics.  They have no Left wing party, and the Democrats aren't going to cave in to childish temper tantrums.  Some of these children need to settle down, get in the damn line, and accept that there will be obstacles and detours on the path forward.",
         "And then we complain that things get worse.  I can explain it until I’m blue in the face, but I can’t understand it for other people.",
         "I don't think it's fair to blame people for not voting for options that are uninspiring.",
         "Which is another big problem with progressives. You don't need to be inspired to vote. I'm not inspired when voting for city council. Or for the school board. Or when voting on state amendments or for or against certain tax regulations. Even for President I'm not inspired. I look at the two options (and for things like President, Senate, and most state wide elections there are only two) and pick the one that will move the political equation closer to where I want it.\n\nNothing is ever going to really change if you need to be inspired to do the bare minimal of turning out to vote.",
         "You're blaming people instead of politicians, and that's where I think you're wrong. People vote, things still get worse. If the Democrats won every seat in every legislature in the country things wouldn't improve. \n\nI've voted in every election I've been eligible, and have only been disappointed by the candidates I've voted for. That's on them, not on me.",
         "Oh. You're one of those people."
      ]
   },
   "1f2eg09": {
      "title": "Lowe’s changes DEI policies amid activist pressure",
      "text": "",
      "comments": [
         "Unfortunately, conservatives hate diversity, they hate equity, and they hate inclusivity. They are very invested in the idea that white men are being discriminated against. Conservatives also make up most of the customer base of these companies. These companies are far more interested in profit than morality and ethics. They'll do whatever they need to ensure those profits.",
         "The home improvement giant joins Tractor Supply, Harley Davidson and the maker of Jack Daniel’s in paring back programs.",
         "How do they now compare with Home Depot, a known right-wing organization?",
         "If you shop at Lowe’s, LET THEM KNOW!",
         "Why do you think “conservatives make up most of the customer base”? Everyone uses Lowe’s and Home Depot, and rabid conservatives make up a very small minority of the population.",
         "They give 94% of their political contributions to LEFT leaning organizations and politicians, def a great supporter of Dems and progressive policies. Lowes is 15 mins past my local home depot and I make the trek every time. Eff home depot.",
         "> The home improvement giant joins Tractor Supply, Harley Davidson and the maker of Jack Daniel’s in paring back programs.",
         "IIRC, Lowe's is also either black-owned or has a black CEO",
         "Tractor Supply is a little different, as it’s more oriented towards farmers and only found in ruralish areas than are predominantly conservative. All of these companies are caving to a small vocal minority of customers and politicians and it shows that they were never really serious about reform, which is completely unsurprising.",
         "They are a publicly traded company.\n\nBut yes the ceo black, not that its mattered, he's acted like any other would have."
      ]
   },
   "1f1tukq": {
      "title": "Economy, income inequality among top concerns for young adults, poll shows ",
      "text": "",
      "comments": []
   },
   "1ewr7lj": {
      "title": "3 more sets of remains tied to the 1921 Tulsa race riots found with gunshot wounds",
      "text": "",
      "comments": []
   },
   "1ev6ycs": {
      "title": "A 12-foot statue of Rep. John Lewis stands where Confederate monument used to be",
      "text": "",
      "comments": [
         ">The Cult of the Lost Cause had its roots in the Southern search for justification and the need to find a substitute for victory in the Civil War. In attempting to deal with defeat, Southerners created an image of the war as a great heroic epic. A major theme of the Cult of the Lost Cause was the clash of two civilizations, one inferior to the other. The North, “invigorated by constant struggle with nature, had become materialistic, grasping for wealth and power.” The South had a “more generous climate” which had led to a finer society based upon “veracity and honor in man, chastity and fidelity in women.” Like tragic heroes, Southerners had waged a noble but doomed struggle to preserve their superior civilization. There was an element of chivalry in the way the South had fought, achieving noteworthy victories against staggering odds. This was the “Lost Cause” as the late nineteenth century saw it, and a whole generation of Southerners set about glorifying and celebrating it."
      ]
   },
   "1erx8vf": {
      "title": "The abortion debate is headed to the ballot box. Here's where voters will decide",
      "text": "",
      "comments": []
   },
   "1er84i8": {
      "title": "Donald Trump cheers Elon Musk over firing workers: \"You're the greatest!\"",
      "text": "",
      "comments": [
         ">At one point, Musk, who has endorsed Trump's 2024 presidential bid, mentioned his desire for a potential second Trump administration to form a \"government efficiency commission,\" which he has volunteered to join. The former president then praised Musk for his handling of employees.\n\n>\"I love it,\" Trump said. \"You're the greatest ... I mean, I look at what you do. You just walk in and you just say, 'You wanna quit?' They go on strike, I won't mention the name of the company, but they go on strike and you say, 'That's OK, you're all gone ... Every one of you is gone.'\"\n\n>\"You are the greatest!\" he added after Musk chuckled. \"You would be very good [on the proposed commission]. Oh, you would love it.\"",
         "They just enjoy misery. The entire party is a goddamn ego trip based on money, power, and causing misery.\n\nThey don’t have a single policy that isn’t rooted in one of those three",
         "This is such weird ass child pantomime by adults. Nobody should take it seriously. It's more ridiculous cuz Elmo.",
         "Donnie boy and Elon the jackass have no idea what they’re talking about is breaking constitutional law, workers have the right strike! I love these constitution, Bible thumper Republican pipes, they try to tell you one thing, but then they over and over show you, just complete scumbag hypocrites."
      ]
   },
   "1eqbw17": {
      "title": "Insurance lobbyists block federal crackdown on costly retirement advice The financial services industry has blocked the Biden administration from requiring brokers to put retirees’ needs first — above lucrative commissions.",
      "text": "",
      "comments": []
   },
   "1eoidkt": {
      "title": "Get Ready Now: Republicans Will Refuse to Certify a Harris Win",
      "text": "",
      "comments": [
         "As an official act, it would seem the sitting president could order the seizure of all voting equipment and the interogation of all election officials in the entire country to sort it all out with complete immunity.",
         "Of the seven swing states, five of them have Democratic secretaries of state. \n\n(NC, NV, AZ, WI, MI)\n\nAs for Pennsylvania and Georgia, their secretaries of state have already refused to cooperate with this exact thing 4 years ago.",
         "Ok, so Biden won’t leave while they litigate it for 5 years like Trumps crimes and if he dies the VP will take over",
         "That will be very difficult is she wins by a landslide. The data is looking like that is posible.\n\nAlso us knowing their game takes a lot of the ability to do it.",
         "Make sure there’s no chance Trump can claim he almost won. We need to work to make it a landslide victory. Volunteer and canvass people!",
         "The counter move: Biden resigns in December, and Harris is sworn in. Stall certification of Kamala's win if you want, but still she would be president. ",
         "Let them reveal themselves to be the fascists they so desperately wish to be.",
         "Dems should plan a giant january 6th march on the capital.   Peacefully of course, they will dwarf whatever crowd trump can encourage to attend.\nTake back January 6th.  4 years ago Republicans used it to subvert democracy, this time dems can use it to stand up for democraxy.",
         "He owns SCOTUS, which is all he needs. So, while many of the comments here make light of what may happen after the election, I hope that actual leaders are taking it seriously and making plans for how to respond.",
         "I’m ready",
         "Dem SoS, mostly (?) Dem Govs, Dem POTUS. It won’t go the way they think or hope it will. They can delay it but in the end they’ll have to certify especially if the margins show clear wins in those states. Sow all the distrust they want, they’ll look like fascist toadies and I think, overall, people are sick of it.",
         "I've been hearing a lot of chatter that the problem is a ton of MAGA peeps that have been put in at county level elections offices. The idea supposedly is that counties themselves won't certify the real results that would then pass to state level officials.\n\nIt seems to decentralized to be effective enough ino though. Hopefully I'm not wrong",
         "Biden won by 7 million votes and they still tried to play games. The more states she wins, the more the magats will convince themselves it's fraud.",
         "Why would that be difficult if she wins by a landslide. What makes it more or less difficult is whose ahead in the senate. She could still win by 100 million votes and if Republicans control the Senate they can still block her. What's the plan B when that happens?",
         "They tried this in Wayne County, MI last time and it didn’t work.",
         "Have you listen to the magas? Listen to their reasons supporting fraud?\n\nIn their heads the size of the crowds, how many political hats, flags, pin, and noise dictated voters. I know it's weird but listening to them proves their mind set on that. \n\nHarris is now blowing that mind set out of the water. Try and say these energetic people didn't vote and see the pushback.",
         "Unfortunately we still have the electoral college, which means Biden won by like 50,000 votes in a few states. It just takes a few states playing BS games to throw everything into chaos",
         "A louder out cry.\nRepublicans fear pushback and they would get one hell of a push back. Plan B is not for public view.",
         "But Orange Leader himself said his crowds are way bigger!  Therefore he wins!",
         "I'm just not sure about that at this point. If they say they'll pardon the Jan 6ers, I'm not sure there's anything they won't do."
      ]
   },
   "1enzjz1": {
      "title": "Gavin Newsom vows to withhold funding from California cities and countiesthat aren't clearing homeless encampments",
      "text": "",
      "comments": [
         "So I'm really curious if the every town and city can actually \"provide people experiencing homelessness in the encampments with the care and supportive services they need.” Do they actually have the resources and beds for these people?",
         "And it will solve the homeless problem once and for all. \n\nBut\n\nI said once and for all!",
         "That's fucked up, Gavin. Let the cities make the decision.",
         "This headline is misleading. \n\n He is going to claw back funds from cities and counties that were allocated for the homeless issue because they are dragging their feet, refusing to do anything, or trying to use the funds for something other than what the funds were allocated for.",
         "Fucking hate this so fucking much. Wish someone would suddenly clear his house as a fucking \"hazard\"\n\nInhumane bastard",
         "Slight Futurama. \n\nLurrrrrrrrrrrrr"
      ]
   },
   "1envr7o": {
      "title": "Personal finances, net worth of Walz and Vance show stark differences",
      "text": "",
      "comments": [
         "so a worker VS an investor.\n\nsomeone who produces worth vs someone who exploits worth....got it.",
         "What do personal finances have to do with honesty, integrity and competence? Aside, of course potential for bribery?"
      ]
   },
   "1em7ebm": {
      "title": "Meet the man with the plan to tax the world's wealthiest 3,000 people",
      "text": "",
      "comments": [
         "Start with a Wall Street transaction tax of .5%.   Replace capital gains tax ax with regular income tax.   Make Social Security tax on all income.  Make law on if you claim residence in another country, you must pay the difference in income tax and Social Security taxes between countries if you want to invest in Wall Street or your company trade in US.",
         "[Gabriel Zucman](https://vcresearch.berkeley.edu/faculty/gabriel-zucman)"
      ]
   },
   "1elhc12": {
      "title": "Harris tells allies she has chosen Minnesota Gov. Tim Walz as VP pick",
      "text": "",
      "comments": [
         "This is good news, exactly who I wanted.",
         "What will Trump's nickname for him be?",
         "Good. She still has a path to Pennsylvania don’t worry. She’ll be OK",
         "Non-couch-fucker Waltz?\n\nHe really doesn’t have anything else besides the “radical left” bs on him."
      ]
   }
}