{
   "1gke537": {
      "title": "White, college educated, women for Trump (because there are so few of us, according to the left)",
      "text": "",
      "comments": [
         "Not as rare as you would think, but media narrative would certainly make you feel like a unicorn",
         "Same here 🙋🏼‍♀️",
         "Count me in! The propaganda would have us believe otherwise, but we’re out here!",
         "Same here! 👋",
         "Also according to Reddit. I isn’t realize this was a liberal hot pot",
         "Lol. Thank you. Felt a bit lonely for a minute.",
         "Take that, Mark Cuban!",
         "I am a woman, white and college educated. I voted for Trump!!",
         "White cat lady here! Voted Trump because I don't believe the propaganda.",
         "[deleted]",
         "Me too.... voted red straight across! 🇺🇸❤️🤍💙🇺🇸",
         "I am a lesbian woman and I voted for Trump",
         "Me toooo! 🇺🇸🙏🏻",
         "Gay guy here, voted for Trump. We exist!",
         "Yep, me too!",
         "+1 white college educated woman for Trump here in PA",
         "My Masters Degree white wife has never voted for president before, but voted for Trump. Side note, I’m a blue collar union guy and voted Trump.",
         "My wife just voted for Trump -who has 2 college bachelor degrees, and isn't white.",
         "Same here! 26 year old White, college educated women who voted for Trump. I wish more people my age were able to think on their own instead of being indoctrinated by the left.",
         "Same here!! There are many **Strong** and **Intelligent** women who voted Red! ❤️🤍💙",
         "Also a white, college educated woman who voted for Trump. 🙋🏻‍♀️",
         "Yep. We are all fascist, racist and uneducated garbage according to the left.",
         "God bless you!",
         "Yes!! ❤️❤️",
         "Thankyou my fellow Republican.",
         "They call it “manifesting”",
         "SAME!",
         "We need more of you ladies!",
         "LFG!!!",
         "Same here!",
         "hell yaaa!!!! me too!!!  lets go Trump!!",
         "Saaaammmmeeee",
         "My wife is also white and college educated and voted Trump. Although when we were voting she and the other white lady in the booth next to her gave a knowing look…\n\nKidding of course.  She was going RFK but decided to go Trump after he picked Vance; we had watched Hillbilly Elegy ages ago and didn’t realize it was about him until he got tapped for the VP spot.\n\n\nThe dems would have you believe all the white women “secretly voted Harris” because they don’t want their stereotypical abusive husbands to find out.  But unlike the Left, we know that women are more than their gender, can think for themselves, and make their voices heard.",
         "Me tooooo!",
         "Same here!! 👋🏻",
         "We are vast in quiet numbers and we are wise.",
         "We have very educated women on this side of the aisle",
         "Wait.  You’re an intelligent, educated woman and the left allowed you to think for yourself?  Stunned the thought police are not knocking on your door.",
         "Same",
         "My mom voted for Trump yesterday in CA.",
         "Me too! 🙋🏻‍♀️",
         "Let's gooooo 👏🇺🇸",
         "Thank you for your support! We will get this done!",
         "Thank you!!",
         "Considering the dems lie about dam near ecerything else, this is just another one.",
         "I just voted to allow abortion access in the state I live in. I believe women should decide what should happen to their bodies. I will not impose my personal believes on anyone else.  I also voted for trump, because I see no future for my kids with democrats in charge. I see my money being wasted in forever wars and getting sent to illegals. ",
         "They do exist!",
         "Same here. I am a late 40s, suburban mom. So much I don't like about him. An imperfect choice, but far better. Beyond the policies and general concerns I'll also be upset if she gets to be the first female President.",
         "Count me in!",
         "Let’s pray for America’s return as a proper democracy! TRUMP 2024",
         "I also voted today.",
         "Mexican/German college educated woman here, just dropped off my ballot!",
         "Very concerned about Pennsylvania right now. Get everyone you know to vote!",
         "Christian, white, educated woman with a husband, stepson, and baby on the way! We took our son with us to the polls and tried to explain as clearly as possible to a 5 year old what the importance of voting is. \n\nNaturally, red across the board.",
         "I sent my fiance a deep cleavage pic with my sticker on. He replied \"Yay! Boobies for Trump!\". Lol!\n\nComing from one of the most important swing states, Trump got my vote.",
         "My Gen-Z girlfriend (first time voting; also white, college-educated) voted for Trump with me yesterday in Colorado! More common than you think. We're sick of the woke shit and Democrats ruining our state here in CO.",
         "Thank you",
         "Cuban women for anti communism!!!!!!! 🇺🇸🇺🇸",
         "Mexican American women veteran with 2 degrees and a software engineering certification voted Trump",
         "💪 me, me, me 🇺🇸👊🇺🇸👊🇺🇸👊🇺🇸",
         "Bisexual, college educated, nurse for trump in a blue state 🇺🇸",
         "I am a white, college educated mom who voted for Trump!",
         "Thank you for doing the right thing and not keeping it a secret xD (god what a stupid ad)",
         "Good on you!\n\nDon't believe the hype.",
         "Good for you I voted for trump too",
         "Same here 🖐",
         "There are lots of us!!",
         "Ladies join the Cuteservatives Facebook group \nIt’s a big group of conservative women",
         "I'm (44f) on my third educational endevour for career change. Voted Trump 🤞🏻🇱🇷",
         "Same here",
         "Same here!! ✋🏻",
         "black lesbian for trump let’s all UNITE!",
         "The silent majority 🫀",
         "Me too. I’m not a racist. I’m not a nazi. I am actually a very nice person that just sees through the Democrats bullcrap and lies.",
         "I'm not even college educated and was smart enough to vote for Trump!",
         "Well said",
         "I am with you!! Two degrees and a masters!",
         "I've been paying union dues for 25 years, and once again,  I voted for Trump!  As did many union brothers and sisters.",
         "More of you than the media cares to admit or announce.",
         "Me too! I confuse the hell out of them. Masters degree, really into musical theater, board games, and dungeons and dragons.  Conservative my whole life.",
         "Veterans For TRUMP",
         "Her entire campaign headquarters is a bunch of 20 somethings… the squeaky wheel types… the safe space kids… the snowflakes… 😳",
         "According to the media, you mean…",
         "im genuinely happy you did your own homework, research and did not let the mainstream media decide your way of thinking.",
         "Let's goooo🫡",
         "Same !",
         "Has anyone on here seen the punk page? Literally all you see is swastikas and Trump and \"his voters nazi's\". I asked them aren't you guys supposed to be anarchists? If you vote, you're involved in government, they confused.",
         "With ya.",
         "Hey yo\nMe too",
         "My wife and I both voted for Trump today",
         "\"Ahh, you voted for Trump that automatically makes you uneducated and a racist\" --Some Democrat Somewhere, Probably.",
         "I used to think people like you were quite rare but the more I talk to other college educated women, the more I realize it's not really as rare as one might think. A lot of them just keep quiet about their political views to try and avoid conflict but there are more of them that support Trump than I ever would have thought.",
         "Hell yeah",
         "Me too!",
         "Hey, hey 👋",
         "Also one 💃",
         "Also college educated with 2 degrees, Summa cum Laude.... voted for Trump and no man or woman told me EVER who I had to vote for.\n\nThey claim conservative women are controlled by the men in our families, except I have 3 sisters voting for Trump and no father alive to control me, while the soy-boys on the left are made to bow down to their women at all times. \n\nI guess I must have used my own mind to decide for myself. Go figure.",
         "Right! There are none according them… I just don’t get them. Why do they think insulting women is the way to bring the Country together… seems to me, they aren’t very diverse, inclusive or equal at all… God Bless America! 🇺🇸💕",
         "Im also a white college educated women!",
         "I was #1207 in a small Alabama town. I’m also a smart, educated woman that also voted for Trump! Let’s win this!",
         "Trump 2024🇺🇸",
         "Same!",
         "SAME!! LETS GO TRUMP",
         "Same here!! 🙋🏼‍♀️",
         "Native American,  college educated,  Woman for Trump. \n\nBecause I have more than 2 working brain cells.",
         "28f, white, for trump!!!!! I know tons my age for Trump",
         "Same here.  Woman for TRUMP",
         "Same here 💗",
         "My wife too!",
         "I’m a white woman in college and i voted trump",
         "Stand tall your in good company here . I just tryed to post in r / pics got banned because I’m a conservative as jack said they can’t handle the truth",
         "Well, statistically, college educated women, at least in recent years, tend to vote democrat. I wouldn’t say there are so few of you all though. There are a lot of college educated women who don’t vote democrat. I think the left, in the least politically correct way possible, is trying to say that it’s statistically less likely. Glad you’re thinking for yourself! Do what you think is right!",
         "There will be women that will vote Trump. Women have jobs and need to pay bills too. Money talks and so rationally the economy is in shambles. We just have to wait and see.",
         "Another woman with the felon here!",
         "Same!! Did my civil duty this morning and voted for President Trump. 🫡",
         "Same here from Jersey!! Trump 2024!!!",
         "Sis you are not alone. I know multiple in CA.",
         "you're not alone! college educated, advanced degrees, mother, living in a blue state - voting for trump!!",
         "I voted for Trump in my blue state that never goes red. Almost felt like a waste of a vote Knowing my state will be blue regardless, but it felt good to exercise my right to vote. Maybe my blue state will have a stronger red margin than normal!",
         "Did you ask your husband first?",
         "It’s so weird seeing posts like this on Reddit. I’m used to seeing the brainwashed libtards complaining about Donald trumps criminal record that has NOTHING to do with how his presidency will turn out. They just say that to have SOMETHING against Trump. Now I’m not saying Trump is the best president in history, but he’s definitely the better of the 2 poisons for sure",
         "What abortion rights and access to birth control for all. I love creampies and using plan b is painful asf but I also want Trump to win.",
         "Same here. I am Chinese and 21 yr old in college and 100% for Trump",
         "All but one of the white, college educated women I know through business or personally are conservative both economically and socially.",
         "Well apparently Trump is a misogynist and will create a country where hating women is the norm.",
         "Checking in from a blue state! White, female college educated.",
         "Woah! All 4 of you are in this thread?",
         "Sheep voting for the wolves",
         "/S Are you sure you aren't just some slave woman that got your stove chains loosened just enough to go and obediently vote? /S",
         "Going to college doesn’t make you smart. I don’t understand why the left thinks that. You literally pay for a piece of paper that proves you sat in a class and learned from an outdated book.",
         "I'm sure there are many of us despite the media! Thank you for doing your part too!",
         "Here too.",
         "I’ve gotten attacked in here so many times by libs 😅",
         "They left X, when they realized Elon Musk wasn't going to be bullied into censoring Conservative voices, and came scurrying over here where they *do* censor us. \n\nDaily. \n\nOh, and he doesn't care about getting \"canceled\".",
         "Love to see it!! 👏🏻",
         "I didn’t think those existed!",
         "You’re awesome!",
         "Came here to say the same. \n\nThis must be shocking to the left… A woman can be gay, educated and very Republican.",
         "My sister is gay & all of her lesbian friends are voting for Trump too (IN). For her the most important issue is the non vetting of the illegals let in. She’s in law enforcement.",
         "Welcome to the side of REAL tolerance and acceptance 🇺🇸",
         "My two good gal pals… Vivian and Sylvia…. Cuban lesbian republicans! 😀😀🇺🇸🇺🇸🇺🇸",
         "Although most conservatives don’t believe you should have equal rights, whatever…thanks for the vote!",
         "I literally thought I was the only one! I’m not somebody who needs to see myself represented everywhere, but good lord sometimes it really sucks thinking you’re literally the only one out there in the entire country.",
         "May the lord help you. But thank you for the vote, especially from the young conservatives who can’t yet! ❤️🇺🇸",
         "Indeed, I listen to Dave Rubin and Guy Benson sometimes ",
         "whats PA looking like on the for yall",
         "Changing gears, I believe and support in Christian Universalism (CU) aka UR (Ultimate or Universal Reconciliation) and she doesn't (yet),  though we're both devout believers in God and Christ Jesus.\n https://www.hopebeyondhell.net/articles/further-study/eternity/ \n\n\n And https://salvationforall.org/ \n\n\n And with a great homepage https://tentmaker.org/books/Restitution%20of%20All%20Things/restitutionindex.htm",
         "Looks like Dem messaging may have backfired.",
         "You forgot deplorable. 😉",
         "they call it \"pick me\"",
         "Similar views here. Voted Trump. Done with wasting our money. I’m not a fan of abortions, but I do believe everyone has a right to say what happens with their bodies. ❤️",
         "Love this!!! I'm in PA, very happy to vote for Trump!",
         "I'm 3 courses away from my masters!",
         "My husband's a union member - LIUNA!",
         "I'm 3 courses away from my masters in library science and most people who find this out assume I would vote Democrat 🤦🏻‍♀️ crazy how people can have various interests that are not simply Republican or Democrat interests lol",
         "I love board games too!!! 😊",
         "Double here!\n\nMBA and in ChemE!",
         "Yes for some reason the punk sub kept showing on my feed!!",
         "And my daughter did too",
         "They definitely do say that.",
         "🤣",
         "Wait, we're allowed to think for ourselves??? But Kamala said....",
         "I wish I could give this extra upvotes.",
         "Funny enough he is only here in the US as a legal permanent resident and cannot vote but he can work, support our family and pay taxes that support illegals  🤷🏻‍♀️ make it make sense",
         "Colleges indoctrinate students to have leftist views so the Democrats probably think that those who go to college all think like them because we were taught to think that way and we couldn't possibly think for ourselves after college",
         "Thank you both.",
         "Thank you both.",
         "That’s not true. Conservatives think gays are people and deserve the best. (We are not for the trans stuff with our children or women spaces - big difference) What rights do straights have that gays don’t?",
         "Extremely NOT true..anti trans is not anti gay..",
         "Not even close to true. Lol. Just wow.",
         "Wtf",
         "Most of my conservative friends are pro gay AND trans. They just are against sharing bathrooms and sports mainly to ensure the safety of others. \n\n\nI don't know why this would bother anyone. At least they're willing to have a conversation without yelling or attacking anyone.",
         "That's one of the most ignore things I've read and I've read transcripts of Kamalas speeches. \n\nWhat equal rights don't we believe they should have?\n\nGo ahead. Enlighten us.",
         "You’re extremely uneducated. Educate yourself before next election please ☺️ (mainstream media isn’t education)",
         "Also https://christianitywithoutinsanity.com/ \n\n\n\"...Each in their own order...\" -1 Corinthians 15:20-28",
         "And literal nazis too, apparently. The left accuses the right of being \"hateful\" and \"evil\", but the only hate I ever see is predominantly from the \"progressive\" left.",
         "👍",
         "I got my bachelors degree through online learning because I was in the Navy and didn’t have the time for classroom. Glad I was able to skip the classroom.",
         "EXACTLY",
         "Anti making small children trans…. After they are 18? Go for it!",
         "Most leftist on here have the IQ of a rock. It’s very difficult to have a civil conversation with them. They just start name calling and think they’ve won the argument 🤷🏻‍♀️",
         "thats so accurate, ive never seen hate from the right like i do from the left, the main issue i have with a lot of left wing voters is them blindly believing the information that is said by the left without even considering checking the right, that said if someone has fully informed themselves then i have nothing to say",
         "Serious question though. Do you honestly believe that schools are taking small children and performing operations on them? Like is that truly what you think is happening?"
      ]
   },
   "1gkh4c5": {
      "title": "Latinos for Trump! 🇺🇸🇵🇷🇩🇴",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Thankyou my fellow Republican",
         "Thank you fellow American",
         "🇲🇽🇺🇸",
         "That shirt is loud and RAD. Love it!",
         "I'm not latino, but I just voted for the Don. Judt turned 18 a couple months ago, so I made it in time.",
         "If we win I will be surprised and happy.",
         "Thank you republican brother",
         "If bad bunny saw this he would be seething",
         "Me too!",
         "Thank you!",
         "Bless you!",
         "🇺🇸. Awesome.  😎.  The USA welcomes all who believe in Freedom. 🤗🤗🙏🏻🙏🏻",
         "Ws for trump! IFYKYK",
         "Let's gooooooo! LATINOO!",
         "🇲🇽🇺🇸",
         "Let’s all work together 😎🇺🇸🙏",
         "I agree",
         "Thank you! I’m white and half of my family is Mexican and I know a lot of Latinos for Trump, you’re not alone ❤️🇺🇸",
         "🔥",
         "👏"
      ]
   },
   "1gkf44y": {
      "title": "3rd time able to vote and 3rd time voting for him! Trump! ♥️",
      "text": "",
      "comments": [
         "Republican girls are way hotter than Democrat girls that's for sure.",
         "If you were Democrat you'd have been able to vote 3 or more times in this election.",
         "This is my first time being able to vote for Trump, as I just turned 18. I did my part today.",
         "I just counted how many times I’ve voted and now I feel old",
         "✌️hell yeah!",
         "Thankyou my fellow Republican",
         "Beautiful & Smart",
         "Thank you",
         "Pretty and strong🫡",
         "Wow thank you for your service",
         "Pretty girls for Trump 🇺🇸!",
         "[removed]",
         "Wow and beautiful 🇺🇸 let's go 🇺🇸",
         "I've been able to vote 3 times now, all for trump 🇺🇸",
         "Same",
         "Tysm",
         "My southern Belle 😁",
         "We’re going to win!",
         "Welcome to your 30’s! Lol.",
         "Roll Tide?",
         "Plus we never have to worry about getting the pickle surprise!",
         "And when she is dead too!",
         "When you're older you might understand why that is a bad idea.",
         "It's a win win bro!!!!"
      ]
   },
   "1gkk9yw": {
      "title": "*repost with all names covered!* My Instagram story triggered an example of the very tolerant left. Happy Election Day 🇺🇸",
      "text": "I posted this picture on my Instagram story today. This girl I used to work with immediately posted her story (pictured) so I called her out. She faked a marriage to gain citizenship as an immigrant from Croatia. Imagine not being able to have a coherent conversation and resorting to belittling someone with opposing views. I blocked her before she could continue insulting me. ",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "It's so sad the amount of hate these people have. Can't have a rational discussion at all.",
         "Thank you",
         "Ya because Cardi B seemed so smart when she endorsed Kamala she couldn't even speak from the heart when the teleprompter didn't work or think on her feet and say something half smart. Meghan thee Stallion was so intelligent at the DNC when she had to edit everything out of her songs because they are so ratchet all she could say was body ody ody ody...and let's not forget sexy red who said \"I voted for Kamala don't let them tell us what to do with our coochies\" they all seem so intelligent",
         "They all have that same condescending passive aggressive way of avoiding accountability for their actions. Just like the media they follow.",
         "That's what the left does.  We live in a world so good and safe that they had to invent problems so they could have something to cry about, and when that fails, they find ways to inject themselves into situations so they can cry anyway.\n\nI'm yet to meet a Conservative who hasn't lost a Liberal friend in which the Conservative was the one who ended the friendship.  These people are hateful, intolerant, and sad.\n\nKeep your chin up, you'll know quickly if not already that nothing of value was lost!",
         "I love that shirt and need one!😍",
         "At least she called herself out for being butt ugly",
         "Triggered as fuck. Trump save us.",
         "Ha, you can hear the envy in her words.",
         "Love it! The left are always triggered by something! 🇺🇸🇺🇸🇺🇸",
         "I cant stand these type of women. I cannot. My love you are stunning, gorgeous, and overall the ultimate standard in a woman. This is ridiculous at this point.",
         "Dang, she was passive aggressive from the beginning.",
         "You handled that super maturely",
         "She will never forget this moment! 😂 She shriveled! Good stuff, OP! Killed it with Class!! 🇺🇸",
         "It's the JOYFUL party!!! Full of tolerance and affirmation and JOY!! JOY, I say, JOY!!! 😂😂😂",
         "Always so condescending",
         "lol brah she got triggered. Bet you she got hit with the ugly shovel a few times jk jk",
         "All the worlds a stage.\nBe in the world not of the world",
         "I wish I could say I’m surprised! 🙄",
         "Awe how cute a political quarrel on another social media platform. Lol.",
         "This is exactly why everyone is so divided.",
         "It absolutely blows my mind the number of dems that have cut off family over politics!    My sister is pretty hard left, and we get along great.  We don't talk politics, but we never really have.   Family.   It's crazy.",
         "Etsy!!"
      ]
   },
   "1gk7mji": {
      "title": "Blacks for Trump!",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "A black woman said she’s voting for Trump in r/pics and got called a bot. Thank you for not being told you have to vote blue because you’re black. It’s dangerous to be told what you HAVE to do. Are you long term republican or first timer?",
         "Great! What state?",
         "\"If you have a problem figuring out whether you're for me or Trump, then you ain't black.\" - Biden",
         "I'm jealous of your body...lol - I'm old and pudgy. Keep up the gym membership!",
         "I just fucking wish it would quit with the blacks or whites or gays or furries or what the fuck ever. It needs to be America for freedom. That’s what matters. I get it. My mom is the same way only for Harris. I won’t talk to her for a week after today I’m sure lol. Good job doing the part",
         "MAGA!",
         "Hey bro, this is a no flex zone. 🤣🤣 (kidding)",
         "As a minority I find it racist when democrats expect me to vote blue. Always voting Red. Use your common sense, republicans have policies that are better across the board. Democrats just love their propaganda",
         "wtf is this man 😂 this isn’t tinder bud don’t make us other black republicans look bad.",
         "Mate I don’t want to make this about race but if Harris was white this would already be over and we all know it. Big up you though man! Wish I could vote from England 😭",
         "Let’s go!!!!! Thank you for not listening to the Dems redoric!!!!!!!!!",
         "Laundry day?",
         "LETS GOOOOOOO!",
         "Another common W",
         "Hell yeah",
         "Amen!",
         "He is definitely for Trump",
         "BIGGGG!!!!",
         "You’re a hero bro",
         "I like this guy. Be your own man and cast your own vote. It's about your decision, no one else's.",
         "Thankyou my fellow Republican. It's about time I get off my lazy ass and walk down to the voting booth.",
         "Now just get a few friends to vote also, preferably wearing shirts.",
         "The only color I see is RED WHITE AND BLUE BABY!!!!!",
         "yessir brotherrr 💪🏻🇺🇸",
         "You’re the future of America. Thank you friend",
         " Bravo 👏",
         "Bless you brother",
         "That's awesome my man 🤟🤟🤟",
         "Trump all day. Fucc Cumala",
         "Woohoo!",
         "I'm as white as bleached snow, but welcome aboard friend. Freedom is for all people who will defend it. I hope we are celebrating in a few hours.",
         "This is great and all.  But whats with the faceless shirtless selfie?",
         "You don't have to be for Trump. You can vote for policies.  Personally I vote for policies, If I voted for the morales of a politicians I probably would never cast a vote Republican or Democrat .",
         "Put on a shirt, hippie.",
         "🤝",
         "Hell yes .",
         "Thanks for the vote. Put on a shirt please.",
         "Everyone for Trump!",
         "Minority here voted Trump too, so sick of racist white liberals expecting my people to vote Blue no matter who.",
         " Not sure why your shirt is off but that’s ok. Thanks for fighting the good fight.",
         "Thats bro right there real fuckin american",
         "the thirst trap was definitely not needed 😂",
         "....whyd you take your shirt off?",
         "What happened to your face?",
         "Great!",
         "Amen!",
         "The man..🫡",
         "You are amazing",
         "I saw a  black woman go before a county council in Detroit who was wearing red Trump T-shirt. She stated \"no more blue no matter who!\" That was very bold for that woman to do. Black America can vote for who they want to - not for who they are told to vote for.",
         "Thank you!!",
         "I feel like it's the safest option right now to pick Trump. Kamala Harris is just a weirdo.",
         "Brown 👩🏽‍⚖️ here, for Trump! 3rd time voting for him!",
         "Sorry all I see is a fellow American.",
         "I personally haven’t met a black guy here yet in Louisiana who isn’t voting for Trump. Anyone who is in their right mind will vote for Trump. Regardless of color/race. Whether you’re born rich or born into poverty. You always have to stand for what’s right, and always stand on your beliefs. I went to prison for a long time at a young age, I was unable to vote once I got out due to parole. I am able to vote now and I am proud to say that I cast my first ever vote to Donald Trump.",
         "I'm glad your learned to think for yourself!",
         "Awesome!",
         "Wow, welcome!",
         "Everyone for trump !!!!",
         "Thank you for your vote.",
         "Lmaooo come on man. Smh",
         "Not goin to lie, I was kind of scared to scroll to the second pic.",
         "brother put on a shirt 🤣🤣🤣 we have kid friendly spaces .",
         "The shirtless pic wasn’t it, bro bro.",
         "First time!\n\nI voted 3rd party in the last two election cycles. I believed that Trump was just a standard, rich, entrenched politician.\n\nBut the establishment wants him GONE. Which gives me all the information I need",
         "r/pics is crazy I saw someone getting thousands of upvotes from posting Kamala eating Doritos",
         "The people calling us racist believe black people cant and shouldnt think for themselves, and should be reliant on welfare and government help. Imagine that.",
         "The ridiculousness of saying black Americans need to be democrats is crazy as the dem wanted to keep ppl down. Republicans are the ones who ended slavery and alot of other unfair regulations against all ppl.",
         "Ohio :)",
         "Damn. Guess I'm not black anymore 🙃",
         "But you are \"garbage\" - also Biden",
         "I know you’re not saying this with that username lol",
         "Gotta show off the six pack;)",
         "I worked my ass off for six pack!\n\nI'll be damned if I don't show it off 🤣",
         "Show the six pack ;)",
         "“But the establishment wants him GONE. Which gives me all the information I need”\n\n👆🏻100%",
         "Welcome! Thank you for your vote! One thing I cannot stand about our communities (I also am a minority) is that we want to be seen for our individuality yet they insist we vote as a monolith.",
         "They want him gone so bad that NY changed laws just so they could chage him but told all other business owners doing the same stuff not to worry you'll be fine. They just wanted to get Trump out and failed. Then the attempts on his life. How many ppl would go thru all that and still continue to fight for the ppl, not many.",
         "Happy to have you! Can't stand the stereotype about all conservatives being racist, so very glad to not see any of that here!",
         "R/pics is a breeding ground for idiots",
         "Nice!",
         "Ohio is really close rn. If he wins we'll say you were the deciding vote 😂",
         "This is probably a stupid question, but is the stuff in Springfield true?",
         "I was just going to say, according to Biden, you're not black. 🙄\n\nShit us yellow folk aren't even mentioned by the libs. They really don't want our vote. Good thing too because we're super conservative. They aren't going to guilt trip me into voting Blue ever.",
         "To a bunch of dudes? r/gay",
         "Can’t blame you for that!",
         "Fair enough!",
         "Literally no one would except DJT",
         "They just called Ohio!!!! GO TRUMP 2024",
         "Yes. It's an hour away from me, but im.so sorry for the people who live there",
         "Homosexuality is a sin, brother.",
         "You did it! 😂",
         "Whoah. All my blue voter friends think it's all fake, even the statements given by witnesses in Springfield. Stay safe out there, and keep your pets indoors!",
         "I am sure he’s telling the truth I trust everyone on Reddit"
      ]
   },
   "1gkhd2p": {
      "title": "I voted Republican for the first time in my life! ",
      "text": "After years of voting Democrat, I finally woke up and came to my senses. It feels good to share my political home with you all! I’ll be rooting for Trump tonight! ",
      "comments": [
         "Good for you. You made the right decision.",
         "Welcome, we all accept you!",
         "Welcome! Glad to have you",
         "Thank you!!",
         "Thank you guys!! I’m in Georgia too! I’m holding my breath that we can flip the state!",
         "Thank you!",
         "Welcome!!",
         "Always my favorite posts!",
         "I also did the same. I can’t vote for a person who claims to be inclusive when she doesnt believe middle class people are equally valuable. ",
         "You are always welcome! We are the *truly* tolerant ones.",
         "Way to go!",
         "Me too. I’m still a registered Democrat but voted red all the way across the board. Our country is not in a great position as it is without throwing in weak leaders.",
         "Welcome!!",
         "Same I also voted for a rapist and convicted felon. Go Trump!",
         "He has been charged with rape?",
         "No evidence for rape. And a convicted felon in the eyes of the corrupt establishment? Hell yeah I’m in.",
         "Oh, he was claimed to have raped someone, but thats obv false, the lady says she doesnt even remember what year it was and that it was in a public area.\n\n\nThe rape claims so so bogus",
         "Oh so allegations with no evidence decades after.  Yeah and they call us conspiracy theorists.",
         "Leftists overdose on msnbc and become idiots!"
      ]
   },
   "1gkm92n": {
      "title": "My liberal dad",
      "text": "My liberal, Korean immigrant dad has never voted Republican in his life. \n\nHe hated Trump - believed all the media said about him stating he’s “racist”. \n\nHim and I have had many arguments over our views. \n\nThis year that changed!! I could cry! ",
      "comments": [
         "Awe yay dad!!",
         "Wish I could get my mom to!",
         "“Economics”\n\nBiggest topic I pray voters remember at the poll!",
         "Good job Dad!",
         "My parents still buy into that liberal bs even though everything I have tried to prove to them you’re lucky",
         "Love your dad, he looked at what was best for the country! Thank him!",
         "God bless your dad!",
         "Go Dad!",
         "My family voted all red for the first time!",
         "Mom, dad, wife all voting for Trump! My brother wants Kamala for some reason bit he's not voting so woohooo",
         "😂",
         "Your dad woke up!! 👏",
         "LETS GO CO DAD (from a co native.)",
         "Yes! If nothing else, please remember that. That was what I tried to get my friend to remember. She’s a democrat, hates Trump and always has. This time she also hates Kamala, so I’m hoping that bringing up the economy pushed her for Trump this time."
      ]
   },
   "1gk98rq": {
      "title": "I have done my civic duty! Have you?",
      "text": "Just got back from voting to save the country! Prayers that we beat that witch Kamala and her little troll henchman!",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Fill in your bubble all the way! This makes me nervous (though I’m just super nervous today anyway)",
         "Voted in North Carolina when early voting happened. Third time aboard the Trump Train.",
         "This is THE ONLY sub that allows pro trump shit and I’m here for it. Hell yeah",
         "Damn dude fill in your bubble completely. Don’t give them a chance to throw out your ballot. They will do everything they can to disenfranchise you.",
         "+1 more in NC",
         "Me too! Hot moms in Pennsylvania vote trump! Cmon girls!",
         "Hey folks, I'm not American, I wanted to ask are these counted by hand ? Or are these electoral ballots scanned to get a digital count?",
         "Just got home from doing it idk if it will make a difference where I live but hey I tried",
         "YES I DID ON MONDAY!!! TRUMP!!!!!",
         "yep! voted in MO \nTRUMP2024!!!",
         "Hell yea!",
         "On my way now!",
         "Thankyou my fellow Republican. I'm a first time voter. And yes I voted for Trump.",
         "I voted! A gay guy here for trump \n\nHilary 2016, Biden 2020 and now Trump 2024. Took me long enough haha",
         "My entire family has confirmed they've voted. My niece, who lives in Georgia but attends Ole Miss, never received her absentee ballot. \nHer sister who attends U. of Georgia voted weeks ago, but my sister was too scared to ask her who she voted for 😬",
         "I never call out sick, but I was genuinely sick a few weeks back and decided to see if I could early vote. Took 5 mins to walk in and out here in Middle TN. No excuses!",
         "The white voids in your bubble triggers my ocd.",
         "I did... Trump Vance and Red straight across!",
         "My 3rd time voting for him in PA.",
         "Californian here.  No chance for Trump but hopefully we can get prop 36 passed and get rid of the horrendous prop 47.   Thanks Kamala.   I just returned  from voting and mentioned to the gal handing out the ballots that it is our civic duty to vote.  She had a glazed look in her eye and I said, \"the average person under 55 doesn't even know what civics nor civic duty means\".  Her continued glazed look and grin told me I was right.  Doubtful she could have even named the 3 branches of government.  We're pretty much doomed her in CA.",
         "Heck yeah I did !",
         "👍🏼",
         "And may I just say you done good.",
         "I just got back from voting and have never seen a line outside waiting to vote, a lot of senior citizens. I hope that’s a good sign, I’m nervous as hell.",
         "My wife and I went an hour ago.",
         "Outstanding and YES I HAVE! TRUMP/VANCE",
         "Voted this morning! ❤️",
         "Yes! Trump all the way baby!",
         "Did it last week 🇺🇸 MAGA",
         "I’m very close to retiring after the last 5 years. It’s time for a vacation.",
         "We voted last week during the week. It was a short time VS the Saturday we went early in 2020 and 2016.I'm not sure why I let the dates get by me as we have voted early many times during the week before.",
         "Voted for Trump for the second time in Commiefornia 🫡",
         "Another vote against fascism. Trump 24!",
         "I'll be going after work!",
         "Absolutely! My husband and I voted a few days ago! 🇺🇸 Keep Jezebel out of office!",
         "Post this in Pics",
         "Voted and was out the door of the polling station by 8:20. Glad I went early because you could barely get through all the people waiting in line to get back out!",
         "State?",
         "What state do you live in? It’s illegal out here in TX to have phones 100’ within a voting stations.",
         "There's a working families party?",
         "Yep! Red across the line.",
         "Fill that in a bit more they’ll probably pull some bullshit",
         "Me and the wife voted here in Michigan. Hopefully it will be enough 😂",
         "Thank you but that dot though 😧",
         "No I'm jamaican",
         "Ter Matt for president?\n\n\n/s",
         "Voting to end democracy. Good move.",
         "Same! Third times a charm!",
         "Same!",
         "Bro you’re missing out on r/conservative",
         "Don’t forget r/trump",
         "Feel like im a part of a few here that do that.",
         "R/Conservative exists. But glad to have you here",
         "Same lfg",
         "Can I vote for the Hot Moms as well?!?",
         "I'm not a mom yet, but someday I'll be in the hot mom club!",
         "I had to slide mine into a scanner that was mounted on top of a locked plastic bin. There used to be voting machines/booths with switches, but this is the new digital way",
         "Giving a damn will always matter. Thanks for dropping a little cure where you’re at, even if it doesn’t fix the disease.",
         "My thought exactly my friend, all we can do is try",
         "Welcome! My best friend of 30 years is a gay man who just voted for TRUMP for the first time too!",
         "Good for you, man! Welcome to the Trump train, my friend!",
         "I hope my family doesn't vote at this point! They're all for the opposition, no matter how much sense I try to talk into them -_-",
         "Good idea! Haven't gotten banned from there yet!",
         "I wish I took a picture of my vote for Trump to get banned from some of these subs and before they ban me call me every name in the book which IDC",
         "I just posted mine to see if if will get me banned they just deleted it",
         "I was in and out in under 5 minutes. There was absolutely no line. I was surprised. But I'm sure it'll be busier when people get out of work and stuff.",
         "I did mine at 7:40 and was out at 7:45 ish I already had everything I was going to be voting for",
         "Ct",
         "Ct",
         "Yeah but I think it consists of like 2 people lol",
         "This is the way!",
         "Yeah a few people have said that :/ too late now\n\nThe machine took it no problem so all I can do is hope for the best I guess",
         "He didn’t vote for the Cackling, DEI Candidate who with Joe (BTW where has he been) and destroyed this country. He voted to Make America Great Again!! Yeah I know she and you want America Last but that WONT be happening!!",
         "I’m voting trump specifically to make you 🫵 upset. Enjoy",
         "Trump isn't gonna be a dictator just because he wants to keep drugs out of the country bro",
         "You do realize we're a constitutional republic, right? NOT a democracy. But good try, buddy.",
         "I also voted in North Carolina - October 17th. My ballot was ‼️FULLY RED‼️ 🫦",
         "Oooo I'm gonna go post over there, too. I should have guessed there was one for conservatives. There's a reddit for everything lol",
         "They're heavily infiltrated.",
         "Same here, LFG",
         "Just please don’t get confused and vote for the “mamala!” 🤮",
         "Yeah mine got scanned too",
         "Okay thanks!",
         "Yeah I'm I very blue state ppl are shock when they find out I'm not a dem.",
         "Thanks and granted I’m not a republican. But I just don’t like the direction Biden had our country in. Trump is really the only option to save our economy",
         "Your screen name reminds me of Scott Jennings' description of Kamala Harris, \"she's a Duck-billed Platitude.\" 🤣",
         "First person in line was 90 something years old. Couldn't start anything til she verified the ballot boxes were empty and fill out the paperwork. They had to keep moving a chair from the registration table to the opened ballot boxes, help her slowly cross the room. then back to fill out the forms. After that it was moving pretty fast.",
         "Nice! Speaking of which, do you think Republicans really could win the fifth district? \n\n(I think it's the 5th district... The one next to New York State)",
         "Exactly! (And I'm a woman- not that it matters much lol)",
         "Be sure to request flair over there from the mods or you’ll get locked out of many threads today.",
         "Same here, but I've been noticing a lot of Trump signs in my neighborhood, so that gives me at least a little hope!",
         "I feel like a lot of people are in the same boat as you. They just feel enough is enough, and somethings gotta give. The economy is trash right now, and people of all backgrounds are struggling. My big concern is the single issue voters that only care about social issues like abortion and whatnot. Like that's the most important thing happening in our country right now. It's just crazy.",
         "Ohhhhhhh nooooo! That's awful! Haha \n\nIt was one of those auto generated ones and I just went with it lol",
         "I really wish I could say yes, but Ct is pretty hard-core blue and even more so down by New york. Im hoping and praying, but in all honesty, I don't think so. I live in central ct, and we have a pretty decent mix here. I'm just hoping that enough people are fed up with how things are going, and there'll be a much needed change. But humans are creatures of habit and don't like admitting when they're wrong so...",
         "But he has to have about two weeks' worth of generally conservative viewpoints and comments to get a flair",
         "*Every thread ever",
         "Ah yes.  Good clarification!",
         "Oh thanks for the heads up guys.  Guess I'm not posting over there lol",
         "You can post there and comment on threads with no flair required but one is required for about 95% of the time"
      ]
   },
   "1gkc56k": {
      "title": "Trump 2024! 🇺🇸",
      "text": "",
      "comments": [
         "Damn right he's a legend",
         "Loving these images! This is the candidate I voted for!",
         "Put this man in a room with Putin and Jinping, and he's commanding attention and leading the conversation.\n\nPut Tampon Tim in a room with Putin and Jinping, and he's leaving crying calling his mom.",
         "Donald Trump day🫡",
         "Yes sir. Did my part, even if Iowa is red I don’t want to chance it!",
         "I'm a European. May I ask why you love the image of him being arrested? In the Netherlands, a politician with 34 charges wouldnt have any support anymore.",
         "Thank you.",
         "Imagine that you had a popular politician that you supported in your elections, and corrupt national and local governments that colluded to bring spurious charges against your candidate in order to influence the election, and that the charges were brought in a place where the electorate voted 94% against him in the past, and the judge was corrupt and gave the jury illegal instructions.\n\nWould it still prevent you from supporting him?\n\nIt didn't prevent us from supporting ours, either.",
         "The prosecutor promised that if elected she would get him for something.\n\nAnd the 'crime' he committed was something never charged before.. basically they bent the law and found a jurisdiction filled with people who hate him.\n\nA lot of legal experts expect it will be reversed on appeal.\n\nBasically a political witch-hunt so people like you can read the headline and think he's some criminal masteind",
         "Because the charges are bogus and throwing him in jail was supposed to be a way to get him out of the way.  His mugshot was supposed to make him look weak and the left salivated for it to come out, only for it to be released and instead say \"not today\".\n\n\nIt was just another victory of his.",
         "It’s the defiance in his face. His support is stronger than ever due to the left side weaponizing the government against him.",
         "If there is evidence of him doing what was described, which there is, then yeah, I wouldn't vote for him anymore.",
         "\\>A lot of legal experts expect it will be reversed on appeal. \n\n  \nI watched the oral arguments and think the appeals court will try to split the baby. Probably lower the fine amount. Only one of the judges seemed to truly question the charges brought and the whole structure of the prosecution's case.",
         "There is evidence of him doing things. None of the things were illegal however, when you peel away all the layers of contrivance the corrupt Democratic machine has tried to stick onto all these fake indictments.\n\nThat's why all these cases are faltering like a house of cards.",
         "There is absolutely evidence!  ...of course, what was done wasn't illegal, was done by his lawyer, if it *had* been illegal it was misdemeanors they couldn't have charged him with because the statute of limitations had expired, and the three \"possible underlying crimes\" they gave the jury as a multiple choice are \"crimes\" that not only weren't crimes, but were crimes he wasn't charged with and couldn't be charged with because the statute of limitations had expired on those also.  That means the presumption of innocence applies, so there were no underlying crimes, which means the misdemeanors couldn't be elevated to felonies.  That's before we get to the star witness being someone who had already been caught, tried, and convicted of perjuring himself against Trump on three prior occasions (and got caught doing it again during this trial), or the judge's illegal jury instructions.",
         "If you watched the oral arguments on the appeal, then you know that the appeals court judges were talking about censuring the prosecutors because the case was so bad.  That's not a \"split the baby\" ruling in the offing."
      ]
   },
   "1gk7my0": {
      "title": "Voting FOR My Interests",
      "text": "I’ve been quiet this election, not wanting to rock the boat. But since it’s Election Day. I’m gonna ask you - if you’re voting for a candidate who didn’t even have a primary election because you have a gay or transgender friend of family member, and you “care about their interests,” as a gay man diagnosed with gender dysphoria here are my interests:\n\n-A secure border\n- An end to funding wars \n-The protection of human life at all stages from from conception to natural death\n- The protection of children from a billion dollar industry that wants to mutilate their bodies before they turn 18\n- The protection of femboys and Tom boys who would grow up in any other age to just be gay or gender non conforming\n- The right to 100% free speech - freedom of speech IS freedom from consequences from the government \n- The right to have the first female  president win because she is better than any man in power - not because she is a DEI\n- The protection of women from men invading their spaces\n- The protection from the state forcing a sh0t onto me\n- The protection of my religion (Christianity) from an atheist death cult \n- The protection of illégal migrant children and innocent refugees (make them citizens, not slaves)\n- The continued criminalization of mind altering drugs \n- The protection from sterilizing children who aren’t trusted to drink or vote or get a tattoo, but for some reason can destroy their bodies \n- The right to “just be gay” \n- The protection from erasure of the homosexual and lesbian communities by the alphabet mafia who seek to redefine what gay is \n- The protection from transgender people from military service \n\nTrump didn’t get rid of gay marriage back in 2016, when he had a Republican super majority. He does not endorse Pr0ject 2025. He did not ban transitioning for consenting adults. He did not not ban gay people from adopting. So if you’re voting today (which I beg you to do) because you “care about the interests” of your gay friends and family? Well I’m gay, and here’s my interests.\n",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "I know several gay conservatives. I think it's pretty insulting for one side to believe they \"own\" a demographic. Freedom, security, and a good economy benefit everyone regardless of their combination of skin color and genitalia.",
         "My best friend who is gay and his partner both voted for Trump in AZ!",
         "Right on Welcome!!! Dems pray on LGBTQ+ communities!!! And they do nothing for them. Ignore some of these comments",
         "I don’t want no gays in my party\n\n\nJk welcome in just wanted to do a bit of trolling with the top of this comment \n\nBut seriously we need more people like you to stand up and admit that Trump ain’t the evil guy the left thinks he is especially people of the communities they claim he hates",
         "YES! Future elections are going to depend on voters like you who are brave enough to stand up for who you are and what you believe. This is not your Dad's/GrandDad's Republican party anymore and if we're to normalize the virtues of smaller, more limited government, we need more brave souls who can champion the message from all walks of life. I salute you.",
         "This is great! Make sure you try to get everyone you know to do the same.",
         "Welcome to sanity! Live your life, love your spouse, and for the love of PB&J sammiches, never forget the lessons of the Biden-Harris tyranny.",
         " My sister is gay and wants a better future for all. She is voting Trump. Welcome aboard friend",
         "Both me and my partner voted Trump!! NM",
         "Let’s goooo!  This new Republican Party is the TRUE Party of acceptance.",
         "Welcome! The left will continuously tell you we hate you. I am a conservative Christian woman and I welcome you and literally anyone else who wants to join ranks. \n\nTHANK you for thinking independently and clearly and not falling in line with every other gay person just because they tell you to.",
         "Go you brother, you seem well informed on the issues important to you.  Honestly, however people vote, this is what we should hope for.\n\nAgree with who you are and your stance.  We are thrilled to stand with and by you.",
         "Gay Trump voter in VA!",
         "Did you know that Trump was the first person elected that ran on support for the gay people and gay marriage? Crazy how people forget that.",
         "Hell yeah brother",
         "Preach. 👏",
         "You don’t look gay. Always laugh at that Trump video",
         "Heck yeah! Welcome to the Resistance friend!!! 🇺🇸🫶🏻",
         "It's not a choice to be gay, but it is a choice to be a liberal.\n\nEdit: I 100% stand by this comment, not sure why I'm getting downvoted, unless you think it IS a choice to be gay.",
         "#TRUMP",
         "Welcome to the party of real love and acceptance! ❤️",
         "Let's go ! 🇺🇸❤️",
         "Glad you’re voting for the right side. Can’t wait to vote next election",
         "Let's go ! 🇺🇸❤️",
         "I think it's possible that the Republican party is going to see an increase in participation from the gay community over the coming years. I think the GOP has largely abandoned any notion of trying to overturn issues that have largely been settled at the national level like marriage. Fas as I can tell that was the only thing democrats had that could be targeted specifically to them. Gay men and women are not indebted to vote Democrat forever based on issues that have become increasingly non relevant to them. They'll have to actually earn their votes with better policy just like Republicans have to.",
         "fuck kamalism and bidenomics",
         "Yay!!!",
         "My son is gay, he’s not at the point where he voted for Trump, but he did NOT vote Harris!",
         "Go girl",
         "I like the sentiment, but isn’t this rainbow upside down?",
         "[removed]",
         "While I may not support gays,I appreciate that yall are smart enough to support someone who knows who to run a country,thanks.",
         "Just don't forget, sodomy is deadly sin.",
         "There's a great film called \"Elephant in the room\" which discusses the difficulties of those in the gay community who support Republicans.   Let's just say that most are not tolerant of someone fishing from a different pond.",
         "Democrats are better on LGBT specific issues, but none of that matters if I can’t afford a roof over my head or food on the table, if I can’t arm myself to protect myself, etc…",
         "It is not a choice to be gay",
         "Exactly. Gays are not automatically liberals, you said it well. I just wish prosperity for Trump and people who voted him",
         "It is a mental disorder that can be treated, if a person wants to.",
         "So? It’s a rainbow 😂",
         "Oh? You’d rather be vote for Kamala?",
         "It’s really not wise to shit on people agreeing with you",
         "Dude, what the fuck? Why ostracize people who are supporting the same cause as you? You can disagree about religion some other time, right now we need to all pull together.",
         "Excuse me? Glad I’m voting for a guy who likes gays. I’d vote for Kamala over you",
         "Oh absolutely!! They Race bait and Box people in!! Trust me. I’m 2 hours North of San Francisco!!! It just not safe anymore!! Welcome To MAGA my fellow American",
         "Separation of church and state",
         "Have you met any gay people???",
         "It ain’t the gay rainbow though",
         "Curious as to what this MF had to say.",
         "[removed]",
         "I don't know why you think it is \"shiting\", Christians should be guided by: love the sinner, hate the sin.\n\n\"If a man lies with a man as with a woman, both of them have committed an abomination; they shall surely be put to death; their blood is upon them.\" Leviticus 20, 13",
         "So you are saying we can ship the gay guy off to a camp later, but we want his vote now.",
         "Not separation of Christianity and Christian morality from the state.",
         "What the fuck?",
         "Worry bout you Weak Ass Country… ENGLAND",
         "I’m just gonna recommend you shut up and sit down.",
         "Read the room. You’re not doing anyone or any favors. \n\nThe Venn diagram of Republicans and conservative Christians is not a circle. \n\nWhat are you hoping to accomplish here? Whatever it is has been about as effective as people blocking traffic for hours for *(insert cause here)*.",
         "Troll",
         "Read the room. You’re not doing anyone any favors. \n\nThe Venn diagram of Republicans and conservative Christians is not a circle. \n\nWhat are you hoping to accomplish here? Whatever it is has been about as effective as people blocking traffic for hours for *(insert cause here)*."
      ]
   },
   "1gkbgiz": {
      "title": "I did my part",
      "text": "Got downvoted to oblivion in /pics lol maybe I can get some karma here to balance it out. ",
      "comments": [
         "Same but my site did not allow cameras",
         "Thankyou my fellow Republican.",
         "In line right now in L.A. County...Red shirt, Santa's image, and \"BELIEVE\" on it.",
         "Who else keeps refreshing reddit and getting Dem crape. I just spent one hour downvoting all of them, D.Trump day.🫡",
         "🔥",
         "Me too last week! Fingers crossed.  I’m here in Texas so waiting for Texas polls to close so I can watch.  In the meantime watching everything else.",
         "Too early but looks good for Trump, the 25% black vote for us might make the difference!",
         "I’m in California, I didn’t even need to show an ID.. vote probably won’t matter but with thoughts like that, change won’t happen. I would love to see CA turn red and be part of it.",
         "We're supposed to share these photos a week after the election ????  \nIf you snuck a camera and of course 😉",
         "Kern county for me, line was short this morning. Stay strong in those long lines!",
         "Lol, they changed my reddit feed so that no political sites at all come up.😂🤣😂",
         "It helps with the popular vote! If he wins both the popular and the electoral, it gives the Dems less leverage to try to make his presidency a reason to get rid of the electoral college.",
         "Pipe dream, California has fallen decades ago",
         "California was in the past. Could change.\nAt least you are muddying the waters\nIm in Tn and they checked my id and made me sign legal documents",
         "Ridiculous that Newsom doesn’t require ID this year.  How does anyone know an illegal didn’t vote?",
         "Voted for DJT, and for Garvey twice, but really it was against Schiffless twice. Garver seems to be RINO-leaning.",
         "I agree it’s a pipe dream, next election I plan on being in Georgia so my vote will mean more.",
         "Newsom in California passed a law recently where they don’t have to show any id.  Feels like he’s letting the millions of illegals vote.  US Supreme Court shouldn’t allow this.  Dems always find a way to cheat.",
         "You don’t.. they asked my name, address and birthday, that is how they identified me.",
         "Did they tick you off of a list at least? Well thanks for voting red!"
      ]
   },
   "1gknsxt": {
      "title": "RACE CALL: Donald J. Trump wins Texas",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "#TX STAYS TX",
         "“wE’rE GoNnA FLiP TeXAs!” \n\nShut the fuck up Harry Sisson",
         "God bless Texas",
         "Yes",
         "The discord Redditors pretending to be Texans are in shambles",
         "YESAAAAAAAH"
      ]
   },
   "1gkaloq": {
      "title": "18, just voted in my first election in Michigan",
      "text": "",
      "comments": [
         "First of many I hope!",
         "Thank you",
         "Thankyou my fellow Republican",
         "THANK YOu from your neighbors in wisconsin",
         "Thank god you turned 18 need all the votes we can get",
         "Hell yea good for you man, you’re way more mature than most your age.",
         "You Gen Zers are making me cry! Honestly, I had written you off and I’m sorry for doubting you collectively! 🇺🇸",
         "Congrats! How exciting!!!!",
         "Indianna",
         "Michigan crew signing in"
      ]
   },
   "1gkdpxy": {
      "title": "Americans: “let’s pick the same person who’s been there 4 years and hope for a different result” oh and “orange man hurt my feelings”",
      "text": "I do hope that we win (FOR ALL AMERICA) not just saying RED when I say we.\n\nThis country is getting in flux of illegal migrations, many people who do not assimilate to American culture and morals and ideals. For example even the drug and sex trafficking is rising in my county (San Bernardino California).\n\nIncident of crime has almost doubled since 2018, can’t imagine what it is now.\n\nHope this prediction turns out to be true so we can focus on the country.",
      "comments": [
         "Where did you find this map? I have no idea what to look up to see live updates. I keep finding maps that aren't filled in yet.",
         "That whole upper corner is blue why are people in those states so goofy",
         "Well, let's hope Polymarket is correct. Four more years of this BS is too much.",
         "What’s the gold color for on WI and NV?",
         "This is a wildly optimistic map.",
         "If democrats had someone with ANY charisma they would be winning big. They screwed up by going with \"woman\" instead of someone who can put on a good show up on stage like Bill Clinton or Obama. I guess it's really hard to be funny and charming onstage these days in the dem party because someone will be offended.\n\nKamala is just the worst. I didn't like Hillary but respected her cunning and ruthlessness. \n\nWe are all part of Kamala Harris' dream where finds herself on stage, running for POTUS and no clue what she's doing.",
         "If you are having trouble following the poles check out @realcharliekirk on YouTube.",
         "Polymarket",
         "Polymarket app",
         "Because the big cities and crowds are filled with misinformation.\n\nThink of old Rome. They distracted and controlled the population through games and entertainment. (Coliseum) meanwhile the empire was falling apart and they kept voting for the same people over and over.\n\nIt’s what majority of the people voting democrat do. Interestingly I rarely meet anyone who can have a candid conversation without spouting talking points that were lies or disproven.\n\nAnd that’s why we have so much insanity going on today. Trick people into thinking rich are stealing from the poor, promise them money and services disguised as helping the common man, and trick everyone into thinking that being prideful and nationalistic for your country means you are a racist.",
         "I live in the upper corner, in Maine specifically. Besides Portland the entire state is red.",
         "Indeed - it’s now at almost 80%",
         "Thanks!"
      ]
   },
   "1gkbesl": {
      "title": "VOTE VOTE VOTE🇺🇸🇺🇸🇺🇸",
      "text": "",
      "comments": [
         "I have never been so nervous."
      ]
   },
   "1gkdf11": {
      "title": "It's Election Day. The fight is only beginning. ",
      "text": "",
      "comments": [
         "We have a few hours left in some states. GET TO THE POLLS. VOTE TRUMP.",
         "Indianna,done",
         "[removed]",
         "My husband wore a shirt to work today with this picture on it."
      ]
   },
   "1gkig9b": {
      "title": "Another Vote for Trump!",
      "text": "Did my duty in the Ocean State!",
      "comments": [
         "Let’s fucking go",
         "Thankyou my fellow Republican",
         "👍",
         "Great choice 🇺🇸🇺🇸👍🏻",
         "Yall are deceived\nAll the worlds a stage\nBe in the world not of the world"
      ]
   },
   "1gki7xn": {
      "title": "This may be the funniest interaction to come out of this election cycle",
      "text": "",
      "comments": [
         "I don’t get the joke?",
         "Oh shit.  She hit him with the classic southern belle dickpunch",
         "I fucking love this. I always knew they were chill.",
         "I don't get it.",
         "The Left praised him/her when she transitioned. They are supposedly the party of acceptance and inclusion however as soon as he/she showed support for someone other than their ideal candidate they hate on someone who was at one point an icon for their ideals.",
         "I don't think it was a \"joke\".  The guy was taking a jab at Jenner for being transgender....which is ironic funny I guess, but not \"ha ha\" funny.",
         "The Left praised him/her when she transitioned. They are supposedly the party of acceptance and inclusion however as soon as he/she showed support for someone other than their ideal candidate they hate on someone who was at one point an icon for their ideals.",
         "I never cared about reality TV stars either way, but if she supports a rapist for president I don't like her.",
         "She doesn't, but nice try! Trump has never been convicted of rape. Kamala has welcomed actual rapists in by the hundreds with open arms. Maybe worry about reality instead of your weird fabtasies.",
         "So sorry you support the open flow of monsters like this into the US. This 12YO was raped for hours strangled to death and dumped in the river. Brought here to you by Kamala Harris. Notice how the news doesn't say a word. I hope you never have a child to go through this horrible way to die.\nYou voted for that?\n\nhttps://nypost.com/2024/09/10/us-news/jocelyn-nungarays-mother-tells-congress-12-year-old-was-raped-strangled-by-migrant-monsters/",
         "Why didn't Trump fix our immigration laws?",
         "I support fixing our broken immigration laws.",
         "He did. Biden reversed nearly everything he did. Nice deflection though lol.",
         "Letting illegal border crossers in by the millions and not even trying to slow it down has been the policy for the last 4 years. It is very broken and it will continue under Harris...\n\nNo matter who is let in. No matter how much sex trafficking of children is going on. As long as the Dems end up with a future voting advantage.\n\nThey count on legacy votes to make it a one party system in the future... Also the census body count in these blue cities will help give the Dems more electoral votes. The amount of suffering doesn't matter to them.",
         "Harris broke those laws she was in charge of the border that was the only Job President Biden gave her."
      ]
   },
   "1gkhzhd": {
      "title": "18 year old, first time voter. Happy to bring a swing state back to red. ",
      "text": "",
      "comments": [
         "Love this!!!",
         "Thank you young Republican! You are carrying the torch for the future generations",
         "Good for you"
      ]
   },
   "1gkl9xu": {
      "title": "My fellow Republicans I voted for Trump. Thankyou everyone else that voted for Donald J Trump God bless you.",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Thank you for you're vote. Every one counts. Feeling good here because my state (Kentucky) has already been called for Trump! I hope your state is next",
         "Voted for Trump!!!!! 🇺🇸",
         "Keep up the good work",
         "Amen brother",
         "NY. First time voter. God bless you"
      ]
   },
   "1gk718w": {
      "title": "Trump Jr retweet.",
      "text": "PENNSYLVANIA ELECTION INTEGRITY:\n\nEarly this morning we learned that Republican poll watchers in Philadelphia, York, Westmoreland, Allegheny, Lehigh, Cambria, Wyoming, and Lackawanna Counties were being turned away.\n\nWe deployed our roving attorneys, engaged with local officials, and can now report that all Republican poll watchers have been let into the building. \n\nWe will keep fighting, keep winning, and keep sharing updates.",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "I know I’m naive, but it still shocks me the way the left wants to cheat. As an American first, I want election integrity. It’s really appalling.",
         "Election integrity should never be considered controversial.  The fact to the left it is a controversy tells you everything you need to know.",
         "While it's great this has been rectified, the fact they were brazen enough to do this in the first place is extremely unsettling. \n\nUntil attempted voting interference is prosecuted effectively, people will continue their attempts to cheat.",
         "Still after the election is over the offenders need to be charged with Election Interference, Civil Rights and Voting rights violations. Prosecute and Penalize or it'll just keep happening.",
         "And are the people who refused to let them in being dragged off by the cops? Or are they allowed to remain with an ongoing agenda to effectuate cheating in the election? (I’m sure I know the answer).",
         "What was the reason given to not allow them in?",
         "Philly DA on election fraud: F around and find out",
         "This time feels different. Seems like the RNC is prepared for the attempts to deny election integrity",
         "Jail time for those will stop others.",
         "Them having to do this is honestly so fucking stupid.\n\nWhy is it people always try to bullshit until there's sudden threat of legal action in this country",
         "This is such BS.  If you’re not doing anything nefarious why would you try to keep ANY poll watchers out?",
         "\"When they can't cheat, they can't win\". - Hugh Hewitt (who is RINO-leaning)",
         "I’m not even the least bit shocked that the communist democrats are so brazen in trying to cheat and steal elections. They got away with it in 2020 and 2022 with no consequences or accountability. They will keep cheating and stealing elections until they are all put in prison.",
         "And yet Texas has barred them from watching and you don't complain about that?\n\nVery hypocritical.",
         "Isn't it amazing that we never hear of Democratic poll watchers being turned away. Wonder why that is? ❓🤨",
         "How dare these ppl just ignore the laws.",
         "We’re ready for these idiots this time.",
         "Evidence?",
         "Saddest reality is all there dumb followers walk around chatting \"free\" this and \"free\" that meanwhile the democrats is a war for profit mongering machine , their own values literally go agaaint the party and they cheer for thr death the pay for everyday they protest supporting this corrupt party. I know there are tons of good democrats but they can't speak up or be outcasts for sure.",
         "It surprises me less considering how evil they are. But it still manages to shock me a bit. \n\n\nLike, this country desperately needs a winner called tonight. It would be so beneficial. But of course it won't happen because the six swing states suddenly need a week to count ballots. ",
         "They will try every conceivable way to help rig the outcome.",
         "Exactly, it’s disgusting. I’d rather have a free and fair election and have my candidate lose than to have an election where we had to cheat to win.",
         "But they aren't American first.",
         "Without integrity, we will have chaos.",
         "Yes, you are naive.  This is what they do.  Been doing it for decades",
         "And then they’ll have the gall to say this election or 2016 was stolen.",
         "I am 100% the left could NEVER win a clean, fully informed election.. ever.  And they know this also.",
         "Sentence hard enough to deter others in the future. They showed their hand last election, so we know what to look for. They don't care that we know they're doing it. We knew it last time and it didn't go anywhere, so that just made them bolder this time to double down. Make offenders on either side have consequences no one else wants to chance. Criminals know how soft the justice system has become. They interviewed a guy in Spokane Washington a year or 2 ago that had his 100th arrest and asked him if he'd learned his lesson or if he'd do it again and his reply was if I got arrested 100 times, how many times do you think I got away with it. No cash bonds, catch and release laws, sanctuary cities, loopholes in the system and lack of serious consequences for offenders are what's ruining our great country. People start seeing either a getting away with it, so they decide to do it too.",
         "Absolutely. There should be someone in charge of every polling location. If there are verifiable claims (which should be easy to obtain with mobile phone video) of any Republican (or other) poll watcher having been turned away whoever is in charge of the polling locations at which that occurred should be immediately arrested for election interference and civil rights violations and hauled off to jail.\n\nEnough of this already. It's time to treat Election integrity with the seriousness it deserves. I really hope thar some figurative heads will roll over this fuckery. ",
         "Probably because they think (D)ifferently.",
         "And not a short sentence in a cushy country club prison. Spend time in gen pop and I can about guarantee they'll never break any laws that'll risk any chance of going back ever again. Keyboard warriors and the entitled don't fare very well in jail/prison. No soy lattes or vegan  curries or mommies to save them",
         "Came here looking for this comment but figured if I made it myself, I’d just get banned.",
         "Lets hope you are right.",
         "It shocks me how blatantly they do it",
         "I just hope they have hundreds of attorneys and poll watchers in these swing states too! I'm in AZ and I hear/ see nothing here to indicate this!",
         "It should send them to federal prisons, it is a federal crime. If they knew it carried a long jail sentence in one, hopefully it will deter them from cheating.",
         "No proof of election fraud in 2020. Zero. None. Provide one link to an article citing actual proof and not conjecture. You can’t. \n\nI’ve voted Republican all my life until this election. What Trump did in 2020 is disgraceful. If McConnell had any balls, the country wouldn’t be in this position of electing this traitor.",
         "No one said shit about 2020 but this time they’re admitting they ain’t gonna let Trump win or in"
      ]
   },
   "1gklgr0": {
      "title": "My parents are first time voters and…",
      "text": "I got them to vote for Donald J. Trump. I would have voted how ever I am 16 and unable to. I am glad I was still able to help even if just by 2 votes. Let’s go America #Maga2024",
      "comments": [
         "Awesome! Love it.",
         "You’re all morons. And I don’t vote. I’m not voting for Trump and I CERTAINLY wouldn’t vote for Kamala. But yall dumb.",
         "Ok?",
         "Chose the better of the 2 poisons, how’s that dumb?",
         "If you don't vote, you're giving up your right as an American and letting others control your life. Sounds pretty dumb to me.",
         "Can’t you see?"
      ]
   },
   "1gkif0y": {
      "title": "LET'S GO!!! 🇺🇸",
      "text": "TAKE AMERICA BACK!!!",
      "comments": [
         "Trump train is rolling!!!",
         "Smh"
      ]
   },
   "1gklef9": {
      "title": "White millennial woman, college educated (MBA and M.Ed.), married with children and I was never more serious, committed or intentional in my vote.",
      "text": "And I got to fill in the circle 3 damn times thanks to Rank Choice…. Spending the rest of the night praying and just believing what should happen will happen…. God Bless you and your families and may we wake up tomorrow with a more stable, logical, moral, intelligent, prosperous, positive and powerful way forward for our great nation. ",
      "comments": [
         "God bless you",
         "You have another white millennial educated woman here ✋🏻 Master’s graduate, mother of two beautiful girls, full-time government employee, married to a man in law enforcement. I love America 🇺🇸 and I love Trump! ❤️🤍💙",
         "I hope we don't do RCV in Ohio I think that's the next thing people want to get on the ballot",
         "It's dumb because it would have basically no effect both Dems and Republicans would put both theirs first and the other last putting 3rd party in the middle, so maybe 3rd party would have a chance but that would be useless for across the country votes."
      ]
   },
   "1gk75dl": {
      "title": "Oprah says that if Trump wins, \" we will never have the opportunity to cast a ballot again\"",
      "text": "",
      "comments": [
         "Oprah is an asshole.",
         "Translation:  “If Trump wins there is a much higher likelihood that I get exposed for child trafficking”",
         "Because nuking the filibuster, opening voting to non citizens and packing the Supreme Court will save democracy",
         "Oprah says that if Trump wins, \"it is entirely possible that we will never have the opportunity to cast a ballot again\"  \n  \nFriendly reminder that no one voted to make Kamala Harris the democrat party's nominee. Every accusation is a confession.",
         "She should leave the country if Trump wins",
         "Sue her.\n\n1 billion defamation lawsuit.\n\nEnough of this bullshit propaganda lies",
         "Projection. The only person who would do that is  Kamala, or maybe Walz.",
         "If Trump wins, we will never have an opportunity to cast a ballot for Trump again.\n\nThat is a little sad",
         "Ah yes the party that nominated their candidate without a single vote cast for her 🤣",
         "they've already implemented fascism. That's why they are so furious with Elon. He's the only tech guy that truly told them no.",
         "Another Diddy freak… very strange string of coincidences with these celebrities who are endorsing",
         "Hopefully the illegal aliens won't - and whoever voted 29 times in Michigan won't.",
         "What evidence do they have for this? I mean, Republicans have the evidence of the Dems opening the border and the verified fact of the majority of illegal immigrants being shipped to swing states. They also have the evidence of the weaponization of the Justice System against their political opponent. So what evidence do they have that this would happen if Trump wins?",
         "Says a billionaire witch.",
         "I don’t understand how the left and it’s media has just blatantly lied this whole election and got away with it.",
         "Newsflash he’s been president before",
         "They are desperate.",
         "Says the person who actively supports the democrats that actively attacks our first and second amendment. I have been censored and banned from speaking in places simply because of my religious l/political beliefs and new gun laws are becoming more and more strict. They are part of an aristocracy group that grows in power and actively seeks to suppress the opposition by using hate speech/misinformation as a weapon to censor us and any one that doesn’t agree with them. The freedom of speech is to protect everyone’s rights to express their opinions and not be attacked for saying it. The freedom to have arms is to protect the first amendment and our selves from tyranny. Once a government suppresses its people’s ability to freely speak their minds is when the government has become authoritarian Oprah is part of this aristocracy group just look up her property in Maui after that horrible fire, look at it today and look at the working people’s property and you’ll see how separate she actually is from the average American. I didn’t leave The Democratic Party, the Democratic Party left me and I found a new home! In The Republican Party 🎉",
         "The best result for the country is Trump wins electoral and popular vote. Lower intelligence people will see how they all lied on the left about Trump. None of thier BS will happen.",
         "That’s funny he was president for four years already and I can still cast my vote for him today",
         "These celebrities need to bed held accountable for their blatant lies and misinformation. She should not be allowed to get away with straight up fucking making shit up and lying to people to try to swing an election. It's infuriating knowing it's a complete lie and these assholes are pushing it as truth.",
         "Oprah is such a moron",
         "She’s just like harris. So inspiring. Inspiring me to never be dumb as rocks like them.",
         "Pure projection.",
         "Does she not realize that if Trump wins that this will be his last term?",
         "Then Oprah is either an idiot or a liar ",
         "🤣",
         "He was already president and we're still casting ballots....",
         "She's obviously on the Diddy list.",
         "SHE won’t be able to vote, because she’ll be a felon.",
         "He already won once and lo and behold Oprah continues to vote.",
         "I wish I could make hella money and a career out of just walking up and lying out my ass too",
         "Such crazy talk. Mind blowing that she is allowed to spew lies.",
         "[removed]",
         "If only that were true.",
         "Accuse those to which you are guilty. That's the Democrat way.",
         "I hear this sentiment a lot, but I've never heard what basis anyone has for making this type of statement. I realize it's really just ridiculous propoganda/fear tactics, but what is it that Trump has done/said that would make them feel like they can get people to buy into this fear?",
         "I don’t listen to celebrities",
         "She was his original vp pick in 2000. Smh",
         "I hope if Trump wins he drops that list and she gets raped as many times as she did to all the little children",
         "It’s the other way around!! Dems put illegals in swing states!! Will be a one party system !!! Oprah can fuck off with her Diddy parties",
         "She also claimed Obama was the smartest man in the room.",
         "they are such liars. Technically it is the opposite way around. They will continue putting illegals in swing states and giving them amnesty/right to vote so we can cast our ballots all we want but it wont really matter",
         "\"Accuse your opponent of that which you are doing to create confusion\".",
         "Oprah comes out of the woodwork for special events after today she’ll go back into her closet.",
         "Says the party allowing illegals and just about anyone and everyone to vote in our elections. Other countries don’t allow it, why should we? I actually have never seen hypocrisy this bad, everything they accuse the right of is exactly what they’re doing.",
         "Yeah he will take away your right to vote just like last time he was president! Oh wait, last time he protected and strengthened rights while giving freedoms back that Obama took away and he helped us have the best economy in the world 🤦🏻‍♂️",
         "UTTER NONSENSE!!! The lies that people saying is disgusting!!",
         "Can we just stop the insanity already?!?  This fear-mongering nonsense is too old. They’re so scared and it’s showing.",
         "We know that's what you want to do Oprah, you don't have to tell us.",
         "Bitch used to think he hung the moon. Encouraged him to run in the first place.\n\nhttps://youtu.be/SEPs17_AkTI?si=g1nwyTTWoGkwEXF4",
         "They said that in 2016 too.",
         "Where do these maniacs get this crap. They act like Trump wasn’t in office for 4 years and left office peacefully. Crazy.",
         "These idiots seem to forget we already went through a Trump presidency, and the world didn't catch on fire. Im so sick of the lies and fear mongering. It's just insane at this point.",
         "This is the equivalent of slave drivers telling their slaves that Abraham Lincoln is coming after them with an army to kill them, not free them lol",
         "Oprah is a moron.",
         "Is America really going to listen to this liar who tried funneling our funds to Maui and not providing any semblance of her ridiculous wealth to make a game changing contribution?",
         "Oh for eff sake. Go back to giving out cars not scare tactics",
         "That's fear mongering. It's also incredibly dumb.",
         "Yeah just like the last time he was presid- oh wait",
         "Everything they say is a confession of what they are doing/ planning to do in the near future",
         "She was best friends with Trump before he ran for office in 2016 🤣",
         "All they can do is resort to lies and fear. \n\nThat's like me saying if you kiss a pigeon the sky will turn purple. \"What ifs\" are a stupid use of scare tactic.\n\nPlus he was already president and didn't even win a second term. If he was going to be corrupt, the first term would have been the chance!",
         "Sad comment from someone who used to call Trump a friend. These people need to get a life and just stop with their lies.",
         "WTF is wrong with these out of touch slobs.",
         " Projection on what they do, it's so open now its horrible.",
         "Says the side who tried to remove the their opposition from the ballot",
         "I hate when people make such obtuse statements on either side. That’s so ridiculously false lol",
         "Wonder how close to P. Diddy she is? Anyway, no coincides in politics …",
         "Fuck Oprah!",
         "She also said she was going to leave USA in 2016. Still waiting for that one",
         "Tell Oprah I said go 🤬 yourself",
         "They always blame Trump for what they plan on doing",
         "Good lord these people….",
         "This stuff pisses me off",
         "She's not a stupid woman. I don't know why she would say such a stupid thing.",
         "She is so dumb.",
         "More fear mongering by the lady that lit Hawaii on fire so she could buy up the land. Not to mention Weinsteins BFF.",
         "Those are the lies that all these simpletons believe! They think they will be put in jail by the military!!! They’re idiots and it shows!",
         "Same with every accusation by democrats. Exactly the opposite.",
         "I wish Oprah would just keep her mouth shut. She’s disgusting",
         "The same Oprah that is involved in human trafficking and worries about being found out?",
         "Yes, because it happened when he was president before. They’re such idiots",
         "But he already Won once and I cast my Ballot twice since then. What is even That !",
         "That is the dumbest thing ever. Omg.",
         "I hear that Maui is nice this time of year.",
         "She is part of the problem the elites are afraid of losing power so their projecting",
         "What a dumb b. She was partying with Trump back in the day before he ran for President.",
         "Oh look another diddy list suspect trying to sway us to vote Kamala",
         "I did hate it how last time he was President he ended elections.\n\nOh wait shit...",
         "Another diddy list crying false made up narratives. Keep reaching. I don’t think the hate tactics are working. I actually think they’re backfiring on the Democrats.",
         "Oprah can duck a bag of sicks.",
         "Oprah has been to the island and freakoffs so",
         "Remind me in 4 years to vote.",
         "maybe she is talking about herself only in relation to the pizza gate",
         "lol",
         "But he won already before.",
         "You know they are scared when they are putting all the liberal celebrities up for show and endorsement .  The handlers know Kamala can’t bring in the support alone because she is even more unlikable than Hillary.  I think what we have seen the last two weeks have been panic moves because they are throwing stuff against the wall and hoping it sticks.  Oprah should have reminded the crowd how she’s middle class too!  🤣🤣",
         "And they call us fear mongers.",
         "I don’t remember Democrats voting on their current representation president? Or did Oprah forget about that one?",
         "Neither of those claims are proven.",
         "Says the one backing a candidate that wasn't democratically nominated as the candidate.",
         "I’m done with the craziness of these insane lefties! I can’t wait for Trump to win and expose just how absurd their ideas and baseless claims really are!",
         "She can kiss my Rep ass",
         "Dems are trying to fly in as many illegals as possible to swing states, followed by path to citizenship asap. That and no voter ID, what do you think? There won't be any more 2 party system is Kamala wins.",
         "She’s an absolute delusional maniac, who spews horses..t every time she speaks.",
         "Dumb take",
         "I like how they are just copying everything we are saying 😂",
         "what an idiot",
         "Hahahahaa who is Oprah? Or Whoopie? Or Joy?",
         "Well if Kamala wins, we won’t need to cast ballots again because when they grant amnesty to all of these illegals, the Dem’s have bought votes for the future elections.",
         "That’s how normal people feel for if Kamala gets in",
         "Oprah is also a moron. Along with anyone else who is stupid enough to not understand the fact how our government works and why such a thing can’t happen.",
         "Oh I think I’ve heard this one before around 2016…",
         "https://www.instagram.com/p/DCATdo9TSuI/?igsh=MTZsMnJheHA1NWZ1NQ==",
         "Remember, they project and accuse the right of what they are doing",
         "This is fear mongering at its best.  Smh",
         "I'd cast a ballot to cast her and all her dipshit friends out of the country.",
         "Oh my gosh, how much more ignorant can she get?! Redundant question, of course.",
         "Good she will never be taken serious again when it turns out to be fine.",
         "Every single thing they say about him is exactly what the current administration is doing to the people",
         "What's the logic behind Oprah's delusion?",
         "Kind of doesn't mean much when the same thing was said in 2016 and yet here we are, casting ballots again",
         "Good, I hope that’s true, too, Oprah. That’s EXACTLY what the plan is. 😉🙏🏻",
         "She’s an idiot too.",
         "When Trump wins, and ABSOLUTELY NONE of the ridiculous things the Dems are claiming actually comes to pass, I wonder how many people will wake up and realize they've been lying the whole time just so they can stay in power.",
         "Crazily enough, just 24 years ago trump wanted her to be his running mate.",
         "No, not Oprah. You mean the person who profiteered off the Hawaiian fires? She donated a whole 5 million before asking for our money.  Then buys 870 acres for 6.6 million. Not that Oprah. MAH PEARLS!",
         "I love how much you say with so few words.\n\nBrevity truly is the soul of wit.",
         "She’s afraid she’s gonna get exposed for something awful.",
         "Lets make this top comment",
         "💯",
         "Oprah said the same thing in 2016.",
         "Bingo",
         "First I've heard about this, is it a well known thing?",
         "Yep, and she’ll be incarcerated as a convicted felon and be ineligible to vote.",
         "YEP",
         "How?",
         "How did you get to that translation? She says “we” not “I” because she’s talking to a crowd.  Am I watching a different video maybe?",
         "Don't forget inserting a presidential candidate when no one voted for her",
         "The only way to save democracy is to take U.S. citizens out of the decision making process entirely!",
         "Exactly, they’re simply telling us what they’re going to do and projecting it on Trump. Truly immoral pieces of shit.",
         "Oh right! She was installed by the virtue signaling posse.",
         "Why is that not a point that is brought up more often?",
         "So a man who has openly supported the constitution, wants to trash that constitution to get rid of elections. Yeah, fear mongering.",
         "Absolute projection.",
         "Very sad!",
         "Yet definitely a wealthy aging cat lady",
         "I like option c.) both an idiot and a liar",
         "Diddy, Weinstein, Epstein?  Damn, is Oprah a billionaire child trafficking czar?",
         "Also, what diddy party did she attend?",
         "Not really, but she has no morals. She'll lie with the ease your fingernails grow, she is part of the swamp, and she was the \"Madam\" for Harvey Weinstein, she literally brought young girls to his casting couch. Sex with any form of coercion on the lady is just wrong.",
         "And I absolutely guarantee you that in four years, when Vance is running against Kamala, Oprah's going to say the EXACT SAME THING about _that_ election.",
         "OK, so answer me this. How many times has Trump been right?? it seems that these conspiracy theories keep coming true why is that? I’m thinking that the Democrats are hiding a lot of shit.",
         "I'm usually toxically verbose. My dad used to call me \"Motor mouth\". God I miss that old man.",
         "Diddy list. Hello???",
         "Like she's ever been \"oppressed\"?",
         "Indeed, also c for Harrison and how he disappointed me when seeing him on YouTube this morning: \nhttps://m.youtube.com/watch?v=-QjVIJd9NbA",
         "Found the diddy party pics: https://x.com/mtgrepp/status/1853662472240341472?s=46",
         "Considering we are voting for trump, we cannot exactly be the ones talking about morals.",
         "It won’t be Vance vs Kamala. Kamala will be a pundit on ABC if DJT is elected.",
         "I think this is the end of Harris’s career. She won’t run in 2028 because the ticket of the Republicans will be Vance Gabbard in 2028.",
         "She’s always friends with these disgusting people…",
         "She was in the color purple…\nOnly time i can recall",
         "Han Solo has finally moved to the dark side. So sad 😞",
         "Considering the darling of the left, bill clinton jammed a cigar into someone other than his wife....🤷‍♂️\n\nAnd let's not forget the foibles of heels up..\n...",
         "Sure we can. He hasn't stolen money from us. \"Morals\" is a huge subject, that he has had sex with multiple women is meaningless, that he hasn't stolen from the U.S. Taxpayers is huge.",
         "Sad to see Indiana Jones got castrated and fully selling out and simping :/",
         "But, he did steal money by not paying others.   He did steal from taxpayers when he lied about corporate tax cuts benefiting wage workers.",
         "Tell me I know fuck-all about commerce and opex without telling us I know fuck-all about commerce and opex.\n\n[It benefits wage workers by making more available jobs.](https://www.nber.org/reporter/2023number3/how-do-corporate-taxes-affect-economic-activity). More importantly, the cuts helped traditionally underrepresented demographics in the US manufacturing space.\n\nBut keep getting your economic policy analysis from NPR."
      ]
   },
   "1gk93hu": {
      "title": "I voted!",
      "text": "Share your voting experiences here.",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "PA here, voting for TRUMP!!!!",
         "Harrisburg PA, TRUMP",
         "My wife and I voted yesterday in Minnesota. The atmosphere was tense, but not in a hostile manner, a lot of people there were registering to vote for the first time, my wife noticed a lot of Latino voters  \noverall, I was happy to see that people were registering to vote, and at the same time, they were either going to vote that day, or vote today.   \n  \nEither way, it was a good turnout",
         "First time voter for Massillon, OH. Voted Republican the whole way down. Poll staffers did a quick cheer and congrats to all those who said yes when asked if they were first time voters.",
         "First time voter for Georgia. Was pretty decent, not too much of a line surprisingly.",
         "Voted for Biden in 2020 and am ashamed of it. Happy to work to right that wrong and voted Trump today. Hoping for the best",
         "first time voting, turned 18 eleven days ago. voted trump and Dave McCormick in Pennsylvania. hopefully my vote helps win him the election!",
         "My lady tried to lecture me about voting for bro “Trump trying to get you young black men with that economy” I told her yeah cause it was better lmao\n\nCame all the way from My school (Fordham university) for this",
         "I voted early a week ago yesterday in NC.  Voted for the entire Republican ticket.  Left the non competitive with no Republicans blank.",
         "Nome, Alaska! Voted!",
         "Corvallis, Oregon, Early Voter for Trump!",
         "Voted red in AZ. MAGA!!!!!!!!!",
         "Voted Red in MN-3",
         "Unfortunately I’m technically not old enough to vote yet, but I’ll definitely be voting R in the Midterms and for Vance in 2028.\n\nLETS GO TRUMP!",
         "MAGAin Ga!",
         "Voted in MA, even though my vote realistically doesn’t count I still made sure to make my voice heard and do what I can.",
         "#Trump",
         "Trump in KY.  I took the day off to take people from the partial assisted living community to the polls.   I told them I was only going to take Republicans.  Two voting runs of 3 people each are done.  I just finished lunch and I'm going for another run to bring Seniors to the school to vote.   I brought my dog with me. I'm letting all the people with Trump gear pet Tank.  He is loving all the attention.",
         "Floridian here! Voted Saturday. Husband and I both voted for Trump 😊",
         "T\nHopefully the following issues will see such media attention as to warrant the following abbreviations:\n\nGTG - Go Trump Go!\nSTC - Stop The Commies!\nLEI - Lockup Election Interferers\nHAG - Hardcore Attorney General\nCCD - Convict Criminal Donators\nTLC - Traitorous Liz Cheney \nBCS - Biden Crime Syndicate \nO&D - Oprah & Diddy\nEND - Ellen N Diddy\nPAS - Prosecute Adam Schiff\nNMN - No More Nadler\nTPM - Take Pelosi's Money\nCCP - Convict Crooked Pundits \nTS2 - Terminate Section 230\nDTM - Dismantling The Monopolies",
         "I voted about 2 weeks ago in this blue state.  \n\nBut at least my vote for Trump/Vance can go towards his popular vote count and maybe even win that also.",
         "This is my third election I can vote in, once again my vote went Trump. Voted in NC during the early voting period.",
         "Voted a few days ago here in Florida. My husband and I, my mother in law all, and my dad’s whole side of the family all voted red. My grandma and my mom and my sister don’t vote. I haven’t asked my brother, but I know he’ll vote blue because his wife is extremely blue.",
         "👏",
         "First in line showed up early. Pretty cold but cast my ballot.",
         "I got lucky and was able to vote this morning in Alabama.  My county has a big issue going on right now that has delayed people to vote due to misprinted ballots.... Basically, the amendments were not printed on the back of the ballots.  They have extended voting hours until 9pm........",
         "I dropped my ballot off the same day I got it in the mail.",
         "Sadly can't vote yet 1 more year though",
         "my precinct voting location moved, sometime between the primary and today. used to be at the fire station, now its at a church thats technically outside the precinct. parking there is better however.",
         "I voted a week ago. Met one person walking out when I went inside. I had the place to myself. Everyone was very sweet and it was a quick, efficient process. (I showed up about 5 minutes after that location opened at 7am.)",
         "Happy Election Day to all, even the haters and losers!",
         " AZ. I voted in October via mail in ballot.  Checked online, my ballot status is “accepted”. Mail in ballots don’t have the same excitement as in-person voting, but so long as my vote is counted I’m good.",
         "Red all the way down, except I left county commissioner blank (guy is a major turd muffin)",
         "Same here. Lots of folks who stayed home in 2020 came out tonight to vote for Trump!",
         "How’s it looking out in Georgia ?",
         "Welcome to the club, glad to have you.",
         "Congratulations. I'm almost 20 so it's my first election too. Voted in your neighboring state, Ohio.",
         "Me too! Voted red in MN-4",
         "Voted in CA, where Trump has no chance of winning. But I still hold out hope. Also used my vote to say SCREW YOU to every tax hike and bond question on the ballot, plus put former Dodger star Steve Garvey into the U.S. Senate. He got this vote even though I am a diehard SF Giants fan, and even though the Giants care nothing whatsoever for Republicans in general.",
         "I voted for all the races except State school board because the woman running was endorsed by the Ohio Democrat party and she was running unopposed. I don't know how in Eastern Ohio we couldn't find a Republican for State school board",
         "Pretty good, at least over in Dahlonega. Like every second house has a Trump sign in front of it lol.",
         "LFG lol"
      ]
   },
   "1gk5i41": {
      "title": "If you are so inclined, pray.",
      "text": "Those among us who are faithful to God, pray. Sure, pray for the outcome to go our way, but pray more that whatever happens, we draw closer to God and that we walk more in line with Christ.\n\nGod has seen nations rise and fall but I don't think it is time for ours to fall despite the forces that are acting to that end.\n\nPray for our country, our leaders, our friends and families, and pray for our enemies.",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Take nothing for granted. Get out and vote!",
         "It's niceto see such open-mindedness about religion and spirituality in this thread.  \n\nHappy Election Day!",
         "Praying for the safety of his family and for the safety of this country.",
         "Praying for Trump today",
         "Say a prayer before you vote.",
         "Believe me, I am praying more than I have ever prayed my entire life!! 🙏🙏🙏",
         "The man survived for a reason, he has to win! 🙏🙏🙏",
         "Even for those that aren't very religious or spiritual. \n\n\nSending more positive and good energy out in the world is never a bad thing. ",
         "I always pray: \"thy will be done.' It could be God's will to make our society end. Sodom and Gomorrah also ended.\n\n\nWe'll see if God is with us or against. The will of God be done.",
         "I am praying but it the end God has this all planned out.  Whatever the result it is his will and it’s according do his plan.  Does this mean that if Harris wins he is for Harris? No, it just means that it is something that needs to be.  Does it mean we shouldn’t get out there and vote because it’s in his hands? ABSOLUTELY NOT!!!!  If you haven’t already done so vote like your life depends on it!!!!!!!",
         "May Christ be with you American brothers, I pray from Ireland that President Donald Trump will succeed in his campaign! ❤️",
         "Amen 🙏",
         "This reminds me of the quote from Abraham Lincoln when he was asked if he believed God to be on his side.\n\"Sir, my concern is not whether God is on our side; my greatest concern is to be on God's side, for God is always right.\"",
         "Oh I am praying",
         "Please pray to our Lord Jesus to guide the our fellow countrymen to the right thing and destroy the axis of evil!",
         "Praying that freedom and peace are the outcome of today's election.  God is not finished with the USA.",
         "🙏🇺🇸💕 the Lord spared him for a reason… hopefully we’ll have that reason in a few hrs 🙏",
         "Pray, go vote, pray again.\n\nLet’s win this thing!",
         "I'm an atheist, but I am hoping this election turns out well for Trump and by extension America.",
         "I pray this is a fair win or fair loss. I pray that people will be okay if trump wins and stop slandering him, trying to impeach him, and straighten out the new so they remove propaganda and actually cover the news. All news, not just popular topics and slander. I pray that people will be greatful for the good he brings and the power he puts back into we the peoples hands. As it seems everyone just forgot the years under trump and somehow bidens terms made us better, when in reality it made everything worse and effected everyone drastically except the group that doesnt need to worry about financial impact.",
         "🙏",
         "I’m an atheist conservative voting for Trump. I’ll be saying a small prayer tonight!",
         "Already done.",
         "[removed]",
         "Prayer is the most powerful tool in our arsenal.",
         "Amen.. thy will be done.",
         "I don't know what to say",
         "Prayer is a daily duty. Every day, three times a day, facing Jerusalem, we pray.\n\nOn awakening we pray the \"Modeh Ani\". Since I was born in Texas... Modeh Ani Texas Style:\n\nhttps://youtu.be/271YZsbm4IU \n\nI give thanks before you, King living and eternal, for You have returned within me my soul with compassion; abundant is Your faithfulness.",
         "[removed]",
         "[removed]",
         "that's a good point! thank you!",
         "I agree with you. This may be the end of our nation. But my hope is for a turning point and a restoration. I do think this country is an exceptional example of what a country can be when subservient to God.... we have certainly lost that.",
         "It’s as if prayer doesn’t work",
         "What kind of moron thinks dumb ridicule affects anything. Even if it doesn't work, at least we're not being complete dicks like you.",
         "Are you Christian?",
         "Not being snarky just want to know, since we are on the other side of the world, is facing Jerusalem East or West?  I was reading Daniel last week and i think it was chapter 6, it was mentioned that he faced Jerusalem to pray 3 times a day. ETA I believe Daniel would have been facing West.",
         "Just watch the video how cute is that?  I have no idea what it means but I’m assuming it’s good prayer.  This is gonna be a good way to keep my election anxiety at bay!",
         "Just read the translation…“Modeh Ani”. ☀️☀️☀️🙏🙏🙏",
         "From end to beginning God gots this …. No matter who wins it is He that will accomplish his purpose!!!",
         "Just because he doesn't intervene when and how we want doesn't mean he doesn't ever intervene.",
         "Mediation is not gonna intervene in an election if mediation doesn’t intervene in childhood cancer. Hope for the best but meditation is useless.",
         "You can certainly choose not to believe in God but your reasoning here is faulty. \n\nThere are ideas about how people think God should be and then there is what thr Bible says about God. You are making a God you think should exist and arguing that because your version doesn't exist then no God exists. A more logical approach is to use the model of God that is claimed to exist and measure against that. Nowhere does God say He will prevent all suffering.\n\nGod has intervened in childhood cancer (not that I expect you to accept seemingly miraculous healings from cancer as literal miracles from God). Saying God doesn't intervene is a claim you can't prove and there is evidence to the contrary. Given that, it is more reasonable to say that, if God exists, He doesn't intervene in all cancer cases. And that is certainly true. God doesn't always intervene and there is reason for that explained in the Bible.\n\nIf you create a model of God that doesn't align with the model of God from the Bible and you argue against that, then you have created a straw god and are not actually debating with anyone except your own inaccurate perception of God.\n\nThat said, no one is saying not to vote, no one is saying we shouldn't also rely on ourselves to make the change we want in the world. \n\nYour comments here serve nothing but really to spite this version of God you conceive of but no one argues exist. I argue that the God of the Bible exists, not the God rangerhawk824 thinks is in the Bible.",
         "Prayer is powerful. If you are not inclined to believe that, fine, but do you think your comment helps? Nowhere is it suggested here that we should not vote.\n\nMake comments that help.",
         "Its as if there is a plan, and praying for things to not go according to the plan will not alter the plan.  Prayer is not a guarantee of getting what you want.\n\nGod has three answers to prayer: yes, no, and wait a while.\n\nI can pray for Trump to win - but if God's plan is that the end times are now, then Harris may need to win in order for that to happen.  We will see.",
         "My husband and I just had this conversation.  Hopefully I can explain it via text.  God is like the parent taking away candy and telling them to eat their vegetables when their kids hate eating vegetables.  When bad things happen and you can’t understand why God would do something like that you have to step back and realize it’s so something else can be revealed.  If you close your eyes to God just because things don’t go your way you, might miss it.  Prayer does work but it’s not a magic wand.  I personally feel we need to have on going prayer with the Lord and try and read and understand his word in order to make sense of our crazy world.  Today my prayers will be for the safety and peace for those voting, of our election workers and candidates and little if any signs of fraud.  I will be praying that tomorrow there will be a clear choice on who was the winner and people of the United States will have no reason to contest the results.  I will also put in a bit about Trump being President  that the majority of those elected today will be Republicans or not far left Democrats.",
         "Not taking this as snarky either. Good question. \n\nFriends who escaped the USSR to Israel prayed toward Jerusalem, which was to the south. The tradition is based on the Dedication Prayer of King Shlomo found in Divrei Hayamim II (II Chronicles) 6 where Shlomo talks about Israel praying toward the Temple. Most synagogues in the U.S. have the \"Ark\" on the eastern wall, some do not have the building made that way, but when there are prayers about Jerusalem the congregants still face east. Where I attend the Ark is on the western wall, but then we are on the west coast of the US, so it works.",
         "A good English translation is, \"I give thanks before you, King living and eternal, for You have returned within me my soul with compassion; abundant is Your faithfulness.\"",
         "Prove it. When does he intervene? The burden of proof is on you, not me.",
         "Thanks for getting back to me.  I live in Columbus, Ohio and I have never heard about this until reading Daniel.  Ironically enough our house has windows on the North,(Front) and South,(back), of the house.  My favorite place to pray is in our living room looking out the south window slightly to the east.  We are also currently building an addition at the back of our house for our Master bedroom so to get the eastern exposure in the mornings that I have been longing for.  When sitting on my patio alone at night I often pray/talk to God and find myself looking off into that direction as well.  Though it was my preference but thinking there could be more to it. Thanks for sharing this with me.☀️☀️☀️🙏🙏🙏",
         "I love it and will screen shot.  I try and pray every morning before opening my eyes and getting out of bed.  I thank God for creating another day for me and my loved ones. And thank him for being in my life and giving me the opportunity to exist and experience the world he created.   This prayer seems to be very similar but more to the point.",
         "Requiring proof would involve a lack of faith, which is a fundamental part of Christianity. Something you don't understand, obviously. Nor do you want to.",
         "Prayer can be three things, 1) a conversation, perhaps seemingly one-sided, between you and God, sharing your thoughts (that He already knows) 2) petitionary, asking for things. A Rabbi once told me, \"We pray for rain, not on our own crops, but for our neighbors' crops, and maybe some rain will fall on our crops too.\" So I pray for good things for friends and family, and when something good comes my way, HALLELUJAH! and 3) judgment, when we pray Ha Shem is judging us.\n\n***\n\nI'm a non-Jew, but I follow the Jewish path as a Gentile. I've tried to convert three times and each time bad things happened. Once I lost my job suddenly the day I signed up for conversion classes, then six years later I was signed up again and boom again lost my job. I gave up for a few years but then I announced at shul my intentions, and before I could sign up for classes the CovidScam hit. All the classes went to online, and only the Reform classes were available. So I think I'm stuck being a Shabbos Goy, and I love the people in the shul I attend, altho this last few months have been over Zoom because I had a skin infection I could not get past. Started in April and I still have a little of it left. Staph infections can be passed in various ways, so since the majority of the shul members are 70+, I've stayed home and Zoomed. Today I get to see the dermie and see if she says I'm fully cleared. The High Holidays online were not as good as being there, and Reb Dennis does such a wonderful show on Yom Kippur. One of our members is a retired opera singer and her singing \"Avinu Malkeinu\" is amazing.",
         "In Judaism we thank God for the functions of the body. Even pooping.",
         "[removed]"
      ]
   },
   "1gkb3af": {
      "title": "This BLM Leader Is Voting for Donald Trump “We’re not stupid\" ",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*"
      ]
   },
   "1gkict8": {
      "title": "Get Out And Vote Regardless ",
      "text": "We need every vote even if you live in a heavily red or blue area. Every vote counts.  Give a few moments to complete your civic duty.   Go team red!  ",
      "comments": [
         "Yes! STAY IN LINE. HOLD THE LINE. VOTE TRUMP."
      ]
   },
   "1gkdv8b": {
      "title": "election anxiety",
      "text": "22 F here voting for Trump. I obviously want Trump to win this election because I'm genuinely scared of what will happen if Kamala wins. Practically having open borders for prisoners and murderers to continue to flood in, inflation will rise even more, etc... \n\nMy problem here is, if trump wins, the left will just burn our cities down again and riots will ensue. it will just be another reason for ransacking stores and an opportunity to loot again instead of working hard and getting a job to afford these things. I live close to a major city and I'm just seriously scared!! I hope I'm not the only one who feels this way... I just feel like we are going to have unrest until the next election no matter the winner.",
      "comments": [
         "Harris stands no chance against Trump in a fair election. He beat her long ago. He just has to beat fraudulent votes now",
         "Trump will be the better one to manage the potential unrest for sure. Kamala is nothing but a puppet for the deep state, and if they cheat enough to get her in the white house, America is doomed.",
         "You have good reason to be concerned. More is riding on this Election than people are aware. Elon Musk's conversation on yesterday's Joe Rogan Experience Podcast was a bit alarming. Rogan, a Liberal, and former Libertarian,  publicly endorsed the Republican Party for the first time shortly after the enlightening discussion.",
         "If you are in Portland or Seattle I would leave town for the evening.",
         "Tbh it will be fine either way. You/we will all adapt to the new norms and figure out how to make the best of it. Don’t get too caught up in all this",
         "I've mentioned this to my family.\n\nLet's assume Harris squeaks out a win over Trump\n\nThe House is projected to have a Republican majority, and the Senate is projected to have a Republican majority. Harris really can't do much with either and pass alot of \"her\" agenda. Furthermore, if she wants to rule throught Executive Orders, the Supreme Court is still 6-3 majority for Conservatives. Essentially she would be a lame duck POTUs for the first two years. There are silver linings to look forward to in the event that Trump doesn't win tonight.",
         "Just think about the move to can Biden and install Harris. The Democrats have been in deep trouble on this election for a long time. They really need a stroke of luck for Harris to win but right now it's hard to say where that's coming from. The only groups she gained voters with are childless women. She has lost droves of voters who supported Hillary. \n\nTrump represents our best path forward, but in the event he loses we still need to push our Congress on these same issues - Border, inflation, law and order, ect. There is also work to be done to preserve this new Trump coalition that has brought in Jewish voters Latinos, blacks, and Asians who traditionally \"voted blue no matter who\". The work never stops either way in politics and it's messy.",
         "We did our part and yes I’m in the same boat as you. We have to keep pushing and hope for the best at this point. It goes to show that millions like us deeply care about this country. We just have to wait and see.",
         "It’s baffling to me why anyone could vote for her. Most unpopular VP, selected -not elected by a primary, 70% of the country thinks we’re going in the wrong direction. She’s flip flopped 180 on many stances, on others she’s never made herself clear, she has to read off of a teleprompter or she’s lost. Just because of abortion! Or Orange Man bad!?",
         "i don't have the TV on anyone now what they are saying ?",
         "I just keep telling myself that nothing could be worse than the last two years. 3 attempts on my life and I’m still alive (barely).",
         "[deleted]",
         "I hear you,  yet I try to remind myself God is in control  https://www.godfire.net/according.html",
         "Harris wouldn't have survived a 2024 DNC Primary. She was one of the first to drop out in 2020. Then Joe chose her as his DEI VP running mate.",
         "I agree with this",
         "Wasn't really anxious in past months but for some reason really anxious today, thanks for your words. My friends and family are all radicalized and are acting like today is the decider if we have communism or WW3.",
         "thanks this honestly helped me put it into perspective. Just a crazy world we live in",
         "But I guess my question is why would anyone want a government who only cares about half the nation’s interests? What’s the point of that? I ask this because I’ve been undecided for months and I question both Dems and Republicans about this because I hate the divisiveness.",
         "Inflation will likely rise if Trump becomes President.  The Democrats have thoroughly screwed the economy and it will take time to fix.  Inflation will rise **more** if Kamala becomes President.\n\nTaxes are likely to go down if Trump becomes President - one of his objectives will be extending the 2017 tax cuts, and he's promised other tax cuts.  Taxes will absolutely go up if Kamala becomes President, because she campaigned on increasing them.",
         "For sure. She would have been tossed aside immediately in a primary. The only reason they kept her was because the campaign money could be transferred to her but not a third party.",
         "It actually is a decider. Watch this clip from yesterday's JRE podcast - [https://youtu.be/DWVev5-2Db0?feature=shared&t=314](https://youtu.be/DWVev5-2Db0?feature=shared&t=314) Flooding swing states with immigrants for their votes, which will eliminate swing states, and destroy a true two party system.",
         "Haha yea this kinda thing happens every election, and then life goes on. WW3 has been right around the corner since the start of the Cold War, and we’re all still here.",
         "Elon stands to gain A LOT business wise from Trump being the president.  I don't fully trust his talking points.",
         "It's generally good to be somewhat skeptical, but it is a logical fallacy to dismiss an argument because of who said it, rather than by refuting the argument itself.",
         "Can you dispute what he's saying about the Democrats flooding swing states with immigrants for their votes? No, you can't."
      ]
   },
   "1gknh5e": {
      "title": "healthcare worker for trump! ",
      "text": "nurse practitioner from wisconsin voted for trump! any other healthcare workers vote for trump?? ",
      "comments": []
   },
   "1gkny73": {
      "title": "NYT needle now leans TRUMP",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "This is similar to 2016.  About 6pm PST it swung that way and never changed.  2020 it never moved that way.",
         "Here's hoping."
      ]
   },
   "1gka0sj": {
      "title": "For peanut and Fred. ",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "What's the deal with the doubled up choices on that ballot, I've never seen one like that",
         "Thankyou my fellow Republican",
         "lol if a squirrel helped decide 2024",
         "New York ballots have multiple options. DJT will be under republican and conservative, KH will be in working families and democrat"
      ]
   },
   "1gkha7a": {
      "title": "Helping turn PA red! PLEASE VOTE!",
      "text": "",
      "comments": []
   },
   "1gkas3d": {
      "title": "R/ClosetedTrumpvoter",
      "text": "Okay…. \n\nSo I have just voted in my first ever presidential election. By the title of this, you know who I voted for. Let’s also say that I’m a minority in almost every (common sensual) way. I befriended a lot of left leaning people before the election, and I love them dearly. I truly and genuinely hope that whoever becomes president will do right by this country. I know that’s a lot of faith for very corrupt people, however I’m sick of the mindset of hating your neighbor/friend/family for voting on opposing views. I used to be the very opposite of what I’m preaching, so I’m very familiar with that mindset. If I told myself even a year ago that I was voting for Trump, I’d probably cuss myself out or think I was delusional… like for real. I was very anti Trump, anti Republican Party, and anti anyone who supported anything to do with Republican/libertarian views. I do not agree with every point that Trump has made, so let’s be clear about that. I 100% do not agree on how he wants to handle the wars having to do with Gaza/Palestine and Ukraine. The one thing I will say though is we do NOT need to be funding other wars and genocides while our nations people continue to suffer unemployment, a housing crisis, and inflation. Additionally, however, I have been very fond of taking care of American citizens and an economic boom. This would mean creating mass job opportunities, allowing for energy in the US, and allowing those who want to be legal citizens in the country. I also want to see more done about crime, mass sh00tings, and policing which I feel like Trump and Kamala have been silent and/or have not really spoken on. I did a lot of research and watch both candidates speak in interviews, rallies, and more. I made an informed decision, but it sucks that I can’t tell anyone who I voted for. No advice needed here, but I thought I’d just share a perspective that some could relate to. \n\nAlso a swing state voter lol.",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Good for you. You made the right decision.",
         "You seem to have a good mind set. Welcome aboard.",
         "Join the club of minorities who act like they voted Kamala but actually voted for Trump. Not sure how big this group is though.",
         "I live in the bluest of blue areas. When people ask who I vote for I tell them. If they launch into a tirade I tell them to talk about something else. Don’t take the bait",
         "I’m a bit closeted, too. This was also my first election.",
         "I know how you feel.\n\nIf my college freshman self met me today, he’d be horrified. But that’s how life is.\n\nYou’ll know who your true friends are by if they treat you the same way regardless of how you voted.",
         "I'm with you been an independent for yrs but the way the dem has fucked shit up so bad these past 4yrs I voted straight red. I'm with you on Trump I don't agree with him 100% but we had alot better when he was in office and other than the racist coming out of the closet while he was in office it wasn't bad. I know he won't be able to fix everything they did wrong be hopefully he can fix a good chunk of it. Cause I'm sick of being ck to ck and everytime raising every 6mo. When Trump was in office last time my car insurance went down twice since bidens been there it's raised 4xs and now is double what I was paying. Food has tripled my rent went up 45% over the past 2.5yr and I was at the same rent price for 6yrs. Everything is getting out of control and we need it fix or this country is going to see it's ppl turn on the government and start wars here.",
         "Yah I definently think we are a pretty big group... just no one talking. I just refuse to vote for selfish reasons and identity politics.",
         "I have pretended to be a kamala fan on many occasions, mostly with people I work with or when i’m with my gay friends. I am not a great actress so this was hard for me!",
         "Me too totally blue where I am and I proudly voted red and didn't even go I to a both for it as they were all full. I filed mine out right on the counter and then put it into the machine"
      ]
   },
   "1gki3ym": {
      "title": "MAGA SC!",
      "text": "",
      "comments": []
   },
   "1gkhwhg": {
      "title": "Trump",
      "text": "I pray to God Trump wins 🙏 ",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "I pray that he will win by 312.",
         "St. Michael, the archangel, defend us in battle.",
         "Hell yes"
      ]
   },
   "1gknt9y": {
      "title": "Tim Stanley: It's beginning to look like Donald Trump is going to win",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Donald Trump might pull this off. It’s too early to say; we might not know till the middle of next year, or whenever some [antediluvian state finishes counting by hand](https://www.telegraph.co.uk/us/politics/2024/11/05/us-presidential-election-2024-when-dates-candidates-voting/). Plus Electoral College madness means that Trump could surge in the popular vote yet still lose via Pennsylvania, Wisconsin and Michigan (the reverse Hillary). But consider the following:\n\nFirst, he took [Florida easily, including Miami-Dade](https://www.telegraph.co.uk/us/politics/2024/11/05/us-election-latest-news-polling-trump-kamala/). Joe Biden won that county in 2020; Hillary Clinton swept it by nearly 30 points in 2016. What’s made the difference? Trump’s doing well among Latino voters, presumably men.\n\nSecond, there are hints he’s gained ground among the affluent in Virginia, which is supposed to be a lock for Kamala; Wasps with degrees are her people.\n\nThird, he seems to be scooping Georgia, which might have been competitive and certainly suggests the sun-belt is safe (Texas is also not in play). Fourth, an NBC exit poll gives him a six point advantage among independents in the critical state of Pennsylvania.\n\nExit polls generally indicate that [“the future of democracy” is a leading issue,](https://www.telegraph.co.uk/us/comment/2024/11/06/americans-voting-out-of-resentment-and-fear/) which breathless TV commentators assumed was a good sign for Harris. But lots of Republicans think the Democrats stole the election in 2020, so they might be recording concern for that issue as well.\n\nThe other major matter is the economy, and Trump polls stronger than Kamala on that one for obvious reasons (ie inflation). No wonder election betting seems to slightly favour Republicans, along with the *New York Times* and Decision Desk HQ.\n\nBut, yes, there’s a long night ahead, and none of us knows anything for sure. It’s a delight to watch British TV presenters disclose the latest thing they read on CNN as if it were a personal insight (”I’m predicting now that Harris will take Vermont and the Pope will carry the Vatican”).\n\nBut what we can decisively say at this juncture is that of the four options – Trump easy win, narrow win; Harris narrow win, easy win – the Harris easy win is off the table. Despite January 6, a rape trial, “eating the pets” and a comedian calling Puerto Rico a “floating island of garbage”. I wonder if Joe Biden might have done better?\n\n**Read more from The Telegraph:** [https://www.telegraph.co.uk/us/comment/2024/11/06/its-beginning-to-look-like-donald-trump-is-going-to-win/](https://www.telegraph.co.uk/us/comment/2024/11/06/its-beginning-to-look-like-donald-trump-is-going-to-win/)",
         "Trying to comment on texas page and they won’t let me 😂",
         "I’m not saying nothing until I see 270 by Trumps name.",
         "Vote! Oh wait ..",
         "I'm predicting Trumps 2024!\n\nIt's gotten really quiet on the front page of Reddit not a mention of Kamala 🤣",
         "Great analysis. Thx!"
      ]
   },
   "1gkb1zn": {
      "title": "Voted Red up and down today",
      "text": "Voted red up and down the ballot here in TX, besides keeping Texas, Texas, let’s make this country great and amazing once again! ",
      "comments": []
   },
   "1gkioso": {
      "title": "Harris acted like someone on phone voted for her",
      "text": "But turns out it was just her camera that she was talking to 🤡💀",
      "comments": [
         "Screw Harris! I can't stand her.",
         "Everything about her is fake and it's cringe",
         "Yeah, everyone can just call up the VP and tell her how they voted..."
      ]
   },
   "1gkg9fh": {
      "title": "WIFE AND I WORE ORANGE! Supported Trump and didn't get bounced from the polling location.",
      "text": "The GOP table outside figured it out right off. ",
      "comments": [
         "I wore a RED shirt, someone yelled at me to see my shirt, so I turned and looked around, showing my red shirt with Santa's image and the word, \"BELIEVE\".",
         "I wore red nothing happened",
         "Why would you be bounced from the polling location?",
         "Bounced you know, thrown out.",
         "Ok but why",
         "You're not allowed to wear campaign materials inside the polling location."
      ]
   },
   "1gk9z10": {
      "title": "Teflon Don has my vote!",
      "text": "",
      "comments": [
         "Thankyou my fellow Republican"
      ]
   },
   "1gk749n": {
      "title": "Trump ends 2024 campaign with historic midnight rally, ready for single greatest victory in our country's history ",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "I know the optimism is there for a Trump Blowout, but please don't kid yourself - this will be close",
         "Let’s go 🇺🇸",
         "People are so confident in his win. I wish I was as confident. I’m nervous as heck that we get Jezebel in the house next.",
         "Dad always said \"one point or a hundred, a win is a win.\""
      ]
   },
   "1gk7mtr": {
      "title": "Michael Cohen announces he is leaving the United States and that he’s already working on getting a foreign passport with a new name if Donald Trump gets elected President.",
      "text": "",
      "comments": [
         "Maybe they can all charter one huge airplane and leave together. Con Air.",
         "Reasonable on his part.\n\nHe perjured himself on four separate occasions, claiming Trump had committed crimes, and so far he has been prosecuted for three of those.",
         "Byeeeeeee",
         "Good. Best wishes. Bon Voyage\n\nNow that's one less idiot we need to hear about. Never liked him anyway. Bye Felicia 👋",
         "This shows exactly how irrational they are. I have not seen one Trump supporter says s/he will leave the US if Kamala wins. Mind-boggling !",
         "Best go where there is no extradition treaty, Mikey, because your ass is facing criminal charges for violating client-attorney privilege, several charges for your many perjurious statements, and for acting under color of authority.",
         "I bet. With the number of uncharged crimes with your name on them...You better be picking country with no extradition.",
         "Bye Felicia",
         "Adios!",
         "Yet another pretentious asshole who I hope lives up to his word. Eat shit, we want our country back!",
         "They all said this in 2016, I don’t think a single person who said it actually followed through to my knowledge.",
         "Cohen is a sack of shit!",
         "The guy makes more money trashing Trump than he did working for Trump. \n\nHe went to prison Democrats say?\n\nThis guy went to club Fed briefly and decided to make up nonsense. After books, media appearances, talk show circuits he’s made incredible sums. He’s not going to leave because he wants to stay in the U.S. making money trashing Trump.",
         "I’ll fund it one way, no return!!",
         "👋",
         "Buh bye",
         "Buh bye",
         "Don’t let the doer hit you where the good lord split ya",
         "He needs go pay back the 30 grand he admitted under oath that he stole from Trump first",
         "Good.",
         "What other country will take that P.O.S.  Hope he finds one and he stays wherever that may be.",
         "They never actually leave. It’s all bluster.",
         "We hear this every election and none of them ever follow through. If this guy leaves then good riddance. He will be back. He obviously has TDS for thinking this way.",
         "His new name will be Marty Cohen",
         "As a convicted felon, I do not believe he can get a passport... legally.",
         "Well…bye",
         "Bye",
         "Too bad these fools aren't held accountable for the words they say.  Tons of them did this the first time Trump won, no one left.",
         "Con Man Air"
      ]
   },
   "1gk5z23": {
      "title": "Kamala got caught telling a family in Pennsylvania to go back inside their house so she could stage a door knock 😂",
      "text": "",
      "comments": [
         "Can't make this up! Fake Kamala Harris caught red-handed trying to stage a door knock for the cameras. This is what happens when you have a VP with no authentic connection to the people.   \n  \n:| Does anyone really think she's got the country's best interests at heart?   \n  \n: And what's with the 'go back inside' comment? Who does she think she is, royalty?",
         "Everything about her is disqualifying.",
         "Remember nobody actually voted for her to be the candidate.",
         "Imagine if this was Trump tho. Sad and weird af how one sided this country is",
         "TBH, Not really a big deal in the grand scheme of things.",
         "I’d tell her to fuck off to her face.",
         "So she can go to one house twice but still hasn't really been at the border long enough to understand the problems she has caused?",
         "As fake as you can be",
         "Her hideous laugh",
         "I mean, I saw the video and knew immediately that it was staged. I hardly think something like staging a door knock is going to shock them into voting right, so it’s pointless to even bother with this.",
         "If she came up to my house, I'd close and lock the door so quickly. That is, if I even answer it in the first place.",
         "Another Photo op - how fake. It's intended purpose was to 'look real' a falsehood.  I hope the Campaign Finance folks dive into her stuff. No way that much money was spent and rules weren't broken.  There's a super huge money pile you guys! Get some heavy duty fines and penalties going! Rake in the cash, make your Dept Heros!",
         "It's like an episode of MTV Pimp My Ride where they would set up a fake door knock and reshoot multiple times until they got the proper reaction. Everything about her is FAKE!",
         "We just had this, His working at mcdonalds was fake as the secret service had to set up safety procedures.",
         "It's not like they're going to let her just walk up to a door without doing a security check lol",
         "Her laugh alone makes me want to fucking die"
      ]
   },
   "1gkf4vj": {
      "title": "Can't do it from the couch ",
      "text": "",
      "comments": []
   },
   "1gkhni9": {
      "title": "I voted early, but figured I'd share this for election day.",
      "text": "",
      "comments": [
         "The swing states need this!!!"
      ]
   },
   "1gki4bs": {
      "title": "You can't even trust her to make a phone call ",
      "text": "Classic! \n\nhttps://x.com/DC_Draino/status/1853910864409113062?t=eK1QCmg8YkU-DTtnLpYEfA&s=19",
      "comments": [
         "Everything about her campaign is fake.  She even faked the door knock video from this week.  The people were outside, they were told to go back inside and pretend Harris was knocking on their door and they didn't know.",
         "Just a show, all it has ever been they don't want a leader they want a puppet."
      ]
   },
   "1gk50v8": {
      "title": "So True ",
      "text": "",
      "comments": []
   },
   "1gkgmge": {
      "title": "Power outage in Pennsylvania. Stay In Line.",
      "text": "Totally normal election.",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Dear Lord!!!"
      ]
   }
}