{
   "1gju7cn": {
      "title": "This is John Heisen. This man is dying from terminal cancer. One of the last things he wanted to do is vote. Every vote counts. Thankyou John.",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Prayers for John ❤️🙏🇺🇸",
         "Im sorry everyone I wasn't sure how to title this. I could only take snap shots. You can't share videos on this subreddit. I'm not sure how long John has but let's all vote for Trump in his honor.",
         "I'm going to make sure I don't forget you, John. I saved this picture on my desktop and I will thank you every day.",
         "Prayers for him 🙏 and I’m happy to see he had the opportunity to make a difference ❤️",
         "A true patriot!",
         "God bless! 🙏",
         "🙏🙏🙏",
         "Thank you, Mr. Heisen! 💙",
         "This man is an American Hero! Hats off to him!",
         "May he wake on Wednesday to see a victory!",
         "Thank you",
         "This is beautiful Thank you John.",
         "God bless you, John.\n\nAnd FIGHT FIGHT FIGHT.",
         "Amen",
         "Good idea you can also look his name up and watch the video if you're interested. Im still learning how to provide links. I as well will honor John tomorrow",
         "I will certainly do that. Thank you for posting. \n\n\nIn his last days, he cares more about the future of his fellow man than his own comfort. So rare these days.\n\n\nHit me right in the feels."
      ]
   },
   "1gjrb1d": {
      "title": "We Defeated Communism Once in 1991. And We Can Do That Again Tomorrow!!!! VOTE!!! MAGA 🇺🇸🗳️ ",
      "text": "",
      "comments": [
         "American liberals by and large are not communists.",
         "Bro, what’s up with that pic of Tulsi?",
         "Everybody remember, RFK is not conservative by any means. He's a plant in a third party to try and take votes off from Trump.\n\nDo not vote for him.",
         "JD should be represented. He crushed the VP debate and the Rogan and Theo Von podcast episodes.",
         "American liberals are very right of communists"
      ]
   },
   "1gjkopr": {
      "title": "My First Vote! 🦅MAGA!!!",
      "text": "I am a first time voter who came from India. Voted for Donald John Trump. MAGA! Proud of my Decision ",
      "comments": [
         "Greetings from Cook County!",
         "Congratulations!\n\nPeople who weren't born here see clearly how the left will destroy the greatest country ever.\nMy neighbors escaped Poland to come here and can't understand why so many people here think making the US a socialist country is a good idea. They lived it and are voting for Trump.\n\nThey also took the proper path and a long time to become US citizens.",
         "Good job man I did my part as well on Friday. Live and voted in Westmont",
         "Thank you for your vote",
         "I voted today too! MAGA!",
         "Hell yeah, glad to see foreign born citizens care about America more than a lot of the privileged people born here who take it for granted.",
         "Is there a Polish community there?",
         "Greetings from Kane county!",
         "Downstate neighbor from you. Doing the same tomorrow. It can feel like being hostage in IL, voting Republican in National Elections, but we need to slog ahead ! MAGA, friend.",
         "Notice how they made the sticker blue",
         "Illinois turning red would be insane 💯💯💯",
         "Ayyyyyy let's go! 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸",
         "Congrats!!!",
         "My wife and I are voting tomorrow morning. 😃",
         "DuPage represent!!",
         "Dupage... IL?\n\nHowdy Neighbor.",
         "lake county, IL here and i’m casting my first republican presidential vote! have voted for democrats since my first time voting in 2000!!",
         "Greetings neighbor,  how excited are you to see the results.",
         "Good luck in Cook County... Chicago is  going to hell and yet they keep voting Democrat.",
         "Exactly! The devaluation of US is clearly visible from the Biden administration. We need to stand together and Make America Great Again. I hope there will not be any foul plans to mess up the results.",
         "I’m a first gen American and my family has always voted blue, this is the first time myself and my family have voted all red! \n\nThis country has gone to shit, only republican policies can save us now.",
         "Thank You. Just doing my part for my country and my fellow citizens. We need to be on the top again and Make our country Great again and Trump is the only option right now.",
         "Let's make it happen. 🦅",
         "Of course, this is the country who helped me to build my career and a stable life. I would give my life for my country. I'm proud to be an American and the values we hold. Proudly voted Red. Anyone and everyone who really loves America from the heart should vote Red",
         "Not OP but yes there’s a very large Polish population in Chicagoland, more so in Cook County (where the city of Chicago is) but Northern Illinois and Southeastern Wisconsin have sizable numbers of Polish immigrants.",
         "Excited and nervous lol",
         "I can't understand why people are voting for Kamala. Because she is a woman? She is as incompetent as Joe.",
         "Me and my brother voted today for the first time and we both voted red. It is like I don't see blue as an option. With all that's going on around I don't understand how people think Kamala is an option. Hoping to see Trump go back to the Whitehouse",
         "Haha!! So it's not just me. I have a feeling that even if we win or lose there will be civil unrest. Hopefully the transition is smooth and all Americans lives are safe.",
         "She has no policy. She says what her people tell her will get more votes. That is why she is flip flopping.\n\nKamala will not be the President She will be a puppet just like Biden is now. I think Biden isn't capable of making any decisions anymore... Dems need to realize with Kamala they are just voting for the oligarchs and lobbyists that are really in control of the Democratic President.... more of the same as Biden."
      ]
   },
   "1gjp3qe": {
      "title": "Prediction for Trump and Harris victory tomorrow. (I don't believe it will be close) ",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "I think it will be 312 but 329 would be incredible.",
         "What’s up with everyone saying Kamala is leading in Iowa? I find that hard to believe",
         "I doubt it’ll be a landslide like this. If you believe in prayer, just keep praying.",
         "i really hope so, harris would be even worse than biden, which was already a disaster for this country.\n\nim not eligable to vote but i donated $18.48 to the campain",
         "I think he has it.\n\nHe won't take Virginia, Michigan, or Nevada though.",
         "I am willing to wait in line for hours and pray my vote gets accounted for Trump’s victory. If Kamala wins, we are legitimately doomed",
         "Arizona is so red, more red like a dark red wine. Greetings from Phoenix.",
         "Trump leads earlt voting in all of the sun belt and nevada. I don't see how he loses them considering republicans have electikn day advantage already",
         "So if Trump wins one of WI or MI can he lose PA",
         "No way NC or AZ goes for Harris. They're not really as close as the media says.\n\n\nThe fix is in again in Georgia thanks to a meddling court.",
         "Praying for it",
         "I don't have the words to convey how badly I want Trump to decimate Harris's campaign tomorrow, whether it be by a little or a lot.",
         "What’s the most likely blue non swing state trump could take?",
         "There is a lot of hoping in this video.",
         "Virginia?",
         "I think that it will be the closest election of our lifetimes. I think we’re about to have ourselves a repeat of 2000 bush/gore",
         "My father voted for Chase Oliver because he said Trump couldn’t admit that he lost 2020 and it caused too much bullshit. He wants Trump to win over Harris still. I voted Trump.",
         "If demorats win im just going to stop paying taxes like everyone else thats moving here.",
         "I'm from Canada and I acknowledge although Trump may not be perfect (no one is) he's the best person for the job because he will prevent WW3 and make the streets safer so Godspeed Trump and MAGA!",
         "That's pretty bold to make NH red, although I think he's within the margin of error there. I'd keep NH blue and I think Michigan is almost too close to call, but they don't tend to break from how Wisconsin and PA votes.",
         "PRAYERS UP",
         "I'm from south GA and it's gonna break my heart if we stay blue",
         "Optimistic",
         "Are we talking actual vote? Or the ballet box stuffed one? Asking for a friend 😋",
         "Paint it red!",
         "Someone mentioned it on X last night:  \n\n- Some states will not have their results the first night.  \n- There will be numerous instances of foul-play, legitimacy inquiries.  \n- Major investigations and lawfare underway thru the remainder of the year.  \n- Trump ends up winning, but we don’t find out until sometime in January.  \n\n(Summarized)",
         "Why do we think Virginia is flipping?",
         "I don’t think all swing states are going one way or the other, but who knows",
         "+NY",
         "As much as I'd love for VA to go red, I just don't see it happening. The state is basically run by Northern Virginia. It's seen a TON of influx of migrants and people moving from the Northeast/California over the past 20 years.",
         "Take nothing for granted. Get out and vote!",
         "This is pretty close to what I have on my prediction map",
         "That’s because liberals cheat",
         "I’m gonna troll on you if he loses tomorrow. But I hope he doesn’t.",
         "I can’t believe anyone would vote for Harris. Even a feminist because you would want HER to be the first female president? She’s going to fuck it up so badly it’ll take another 200 years to get a female in this position.",
         "Let the unburdening begin!",
         "Keep praying, guys. God is with us 🙏",
         "Only need NC, GA, & PA. AZ & NV are bonuses",
         "If VA, NJ, or NH flip early in the night it’ll be an absolute bloodbath and we can go to bed early",
         "Honestly I think at best it’ll be in the 280s for Trump",
         "Trump wins Nevada, Iowa, Georgia, North Carolina, Harris could win by a slim margin",
         "wasn’t new york light blue?",
         "Watch today’s episode of Stu Does America",
         "I pray this is right, we can’t take four more of Obama and his team.",
         "Unless they cheat again",
         "I really wish Virginia would go red and most importantly get rid of our senator Tim Kaine. Can’t stand that guy. And I think Trump is getting Nevada and either PA or Michigan and probably Wisconsin too.",
         "Let’s go!!!  If you have not cast your early vote, crawl over broken glass and/or some spilled Lego bricks tomorrow if you have to.  Make it happen!!!!\nAt least when Trump and the rest of the country hands Kamala a pink slip tomorrow, you can know that you played an important role in making that blue wave of liberal tears flow!!",
         "I hope you’re correct with my state being in red 🙏",
         "Soooo who’s winning you think? From a non biased perspective, who do you guys think it’s going to win?",
         "Thank you my neighbor from the north , I hope you guys get rid of Trudeau soon",
         "I too believe it will be a landslide. It's going to be a #redwave !! \n\n  That said, the Dems have a plan in place to prevent the inauguration if and when he does win. They plan on using the 14th amendment to stop him from taking office. The 14th amendment specifically says that a person who has been found guilty of insurrection, shall not be lawfully allowed to become president. That's why the Dems have been pushing the Jan 6 insurrection narrative plus instigated the events on Jan 6th so hard..it's been their plan for years. It's been their plan since his first term.\n\n\n  Mark my words! You will see this play out when Trump wins! \n\n Get ready for the next civil war!!",
         "From your lips to God’s ears",
         "I strongly believe it will be rigged and Harris will seemingly win it.",
         "This would be great if it did turn out like this.  But I feel like this will only happen if we don't allow the demoncrats to cheat and steal votes and burn ballots and \"keep counting until the candidiot is ahead",
         "I’m thinking New Mexico to",
         "looks like 2020 with a bit more red.",
         "Trump has had so much support this election. Majority of the people I know are or have voted for trump already. I only personally know 2 people voting for her- which says something because I have a large, diverse family & friend group. I work with mostly all females, and the only male in the group is voting for Harris. \n\nKeep in mind that the demographic most likely to answer polls- are liberal women. Not very representative of the entire nation. Older folks and men aren’t really going to be answering polls, they want to be left alone OR simply are not able to access internet (or don’t want to) due to age- yes, even in this day and age- there’s still a lot of older folk who don’t have internet or cell phones. Obviously that’s not everyone, but still a large group of people we forget about.\n\nHarris has had her campaign blown up on social media & has paid lots of high profile celebrities to speak at her rallys/endorse her as president. I mean, what, Beyoncé was paid $10 mil to speak at her rally. These things really give the illusion that she’s more favorable than she is, which is the goal of her campaign. Talk less, smile more, make others do the talking. I just cannot see how someone so… well, unqualified could make it this far. Am I saying she’s not qualified experience wise? No not necessarily, I mean, we’re voting for trump, who hadnt been involved in politics much at all until elected. BUT it’s her intelligence and communication skills that are SEVERELY lacking in this aspect. It’s embarrassing to watch. I can’t imagine her speaking to any other important leaders of other nations, or giving presidential addresses, etc. it’s the feeling you get when you see the really drunk girl at the bar trying to dance on the table. You know, “should we really let her do this?”, “someone should maybe stop her before this gets worse”, etc. \n\nGuys. If she gets in, I think we know what happened.",
         "1. Literally no way she wins Iowa. That one poll was garbage.\n\n2. What's up with red VA but blue MN?",
         "If both va and nh flip, so will ny, loose va and nh and that's our election",
         "That’s the closest map I’ve seen so far",
         "MSNBC-\n\n“Why are so many Americans fascists?”",
         "She's not. I live here. Polk, Story, and Johnson counties are liberal, the other 96 want Trump.",
         "Largely (or solely) a recent poll from a highly regarded pollster. That said, it was only 800 people.",
         "And 808 people were polled out 3.2 million Iowans.",
         "A poll came out that stated she was ahead, while 10+ other polls say elsewise.",
         "I am praying for this 🙏 🇺🇸",
         "Selzer has been very accurate in her polling of Iowa. Her latest poll is Harris +3. ",
         "Maybe all the people who silently will vote for her. I could see that.",
         "It was some outlier. Everyone called bullshit on it.",
         "Selzer poll",
         "Kalshi shows Trump favored to win. 80%",
         "Well, I heard she has a great comeback story.",
         "It was an outlier poll, Trump will win Iowa by 8-10 points.",
         "Comma Lah leading in Iowa?\nSay it ain't so Joe",
         "Fake news",
         "amen!",
         "How'd you settle on that amount?",
         "Out of those three, I think Nevada is the most likely.",
         "He may get Va… those of us south are red everywhere. Also, we flipped last election to a red governor…. Fingers crossed!!!!",
         "Nevadan here. He’s taking it.",
         "Detroit absentee returns are half of what they were in 2020 and the far less people voted early in person.  Republicans always dominate on election day voting here. I don't see a Harris path to victory unless they find 90,000 mail in ballots tomorrow.",
         "I don't think he will take VA but I will say- I'm in Northern VA (very blue) and see an overwhelming support for Red in comparison to previous years. Very interesting to see, especially in my neighborhood!",
         "Virginian here, there's a wave of energy in the air I've not really felt in any of the 30 years I've been around on this rock.  Neighborhoods that flew Kerry, Kaine, and Obama signs proudly are not flying the Kamala flag, and when you see the local Democrats placing their signs out, it's in front of unsold houses, undeveloped lots, and public land.  On my own street, three of my neighbors removed their signs one by one as she continued to bumble and stumble her way through her teleprompted campaign, it's not that they aren't still voting for her, but they're damn sure not as proud of it.\n\nAt work I spent seven years in a position as the lone white person on my crew, before my promotion in September, and slowly but surely over the last two years I've watched all but two of them turn from heavily negative on Trump and become vocal supporters and voters for him.\n\nA lot of people in Virginia are sick of the rhetoric without results that the Dems have slung over our state for years and years.  Youngkin showed a lot of Virginia that the Governor's chair isn't just a free paycheck for some scumbag to do nothing in, and the events of London County still ring through the schools across the state.\n\nI will personally be surprised if we go full red, but I don't think we're going to be as blue as people seem to think.  Our polls were tainted by the fact that the Virginia native is the minority of the states population because of so many interstate migrants (New Jersey, New York, etc.). and initially many of them packed their politics with their pants, but I think finally some are waking up to what ruined their home states, and I hope they can course correct before they ruin mine.",
         "Nevada is his best swing state right now. Michigan will likely vote with Wisconsin and Pennsylvania. ",
         "I think there are big automotive implications in Michigan.  If he wins that, it's a wrap.  \n\nI don't think Michigan wants to stop building ICE.  Just my personal opinion.",
         "I personally think he takes Nevada, loses MI and WI narrowly.",
         "PSA; As long as you're standing in line when voting closes you still get to vote so don't leave",
         "Saw the signs while in vacation - you have a beautiful state.",
         "I have tons of family in AZ & in Phoenix. Love it every time I get to visit. Gorgeous state.",
         "True , but the early votes maybe taking away from the votes from Election Day",
         "He’s closing out in Pittsburgh of all places. It’s fucking WILD that he’s down the road from Butler—and me. In crazy blue Pittsburgh.",
         "If he wins the other 4 swing states, yes, he only needs one of those 3.",
         "I’m in Georgia and he’s not winning here.",
         "Let’s all pray, and continue to pray or it’ll be complete chaos.",
         "MN, NH, VA",
         "There have been a couple of tie polls for Virginia. Turnout can make it happen",
         "This is so crazy to me. What do people see in her?",
         "If he wanted Trump to win over Harris, then he would've voted for Trump. 2020 was four years ago, and Trump admitted he lost it.",
         "Just stating from lived experience but most undocumented immigrants get false identification to be able to work while they wait for actual residency paperwork from the fed. They still get a paycheck like everyone else. they still pay taxes like everybody else.\n\nBut they get no vote. So all the taxation with no representation. They’re paying into Medicare and social security but not getting the reward at the end of the rat race. \n\nTo make matters worse, they’re taking all the shitty, high labor, low pay jobs that most white Americans don’t want to do. It’s almost always back breaking uneducated labor jobs. \n\nMight be a better argument to say that we should catch and fine/charge all the employers that are hiring and exploiting undocumented labor. \n\nIf there are enough Americans willing to work, we wouldn’t need undocumented labor. Without jobs, illegals wouldn’t come here.",
         "I moved to Virginia when Kaine was governor.  What an asshole.",
         "I think Donald Trump will win. I don't prefer either candidate.",
         "Trump is going to win, Kamala is not doing as well as Biden was in 2020 trump is doing better now then he was in 2020 however I believe this is going to be close very close",
         "I'm independent and I think is going to win. I think by a landslide too.",
         "I’m independent; voted for Trump in 2016, voted for Biden in 2020 (I know, bad mistake lol) and voted early for Trump in 2024. I really really do think Trump v Biden would’ve been a complete landslide & Trump would’ve won. When Kamala was first announced to succeed Biden, I thought for sure without a doubt that she’d win. Now, I’m not sure at all. There’s millions of people that love her, but there’s millions that don’t. Same with Trump. I do think Trump could win, but it’ll be painstakingly close and we probably won’t have anything official for a few days, if that ends up being the case. If he won, they’ll find ways to count and recount every single vote and take their sweet ass time doing it. If Kamala wins, it’ll be announced Wednesday morning.",
         "Who’s burning ballot boxes?",
         "As a Minnesotan we have always been blue unfortunately.",
         "Man they need to be dismantled after this. Serious defamation charges need to be filed, something.",
         "Johnson County Republican here….I want Trump 🙋‍♂️🙋‍♂️",
         "It’s an outlier, what you need to look at is RCP per-state and national poll averages, they show Trump ahead, way better than he was doing even in 2016.\n\nLast time I checked his national avg was +0.1 while in 2016 it was Clinton +2.",
         "I wouldn't worry. I could poll 800 people from Polk, Johnson, or story county and get a harris plus 3, while ignoring the other 96 counties too.",
         "her two biggest polls this year were Trump +20 to help the Dems oust Biden, then Kamala +3 to help keep Republicans at home. she's a joke.",
         "If I remember correctly I had read somewhere that first time voter registration was +19R and they weren’t counting that.",
         "One poll isn’t enough to predict the outcome of an election. Just because there’s one poll from Iowa, possibly focused on voters in Des Moines, doesn’t mean it reflects the entire state’s preferences. There are many other votes from counties across Iowa, including Des Moines itself. Trump has consistently led in Iowa, and a single poll with a sample of 800 people doesn’t necessarily represent the hundreds of thousands of voters across the state. Polls aren’t a definitive or objective method to forecast election results. Let the votes come in, and you’ll see—Trump will likely win Iowa by around 10 points. So, let’s hold off on relying too heavily on speculative polls.",
         "I know, this is terrifying.",
         "Revolutions of 1848",
         "Nevada has a very good Union operation. On polling day they're get out the Vote is excellent, even if Trump is ahead in the polls.",
         "Which is highly likely if they think they're in trouble",
         "The union workers in Michigan and other states in the auto industry are worried about their future.   Worried about possible future mandates, but also the trade deals.  Trump was right when he said if China succeeds in being able to build and ship their EVs here from Mexico, it would be an economic blood bath for our auto industry.   Regardless of union, this weighs heavily on the minds of workers whose livelihood could just disappear.   There are always worries and fears in the manufacturing sector. This is different, this time.  It's more real than it ever has been.   Fingers crossed for a repeat of 2016 with Michigan.",
         "He's been significant;y ahead in Pennsalvania for a while. Michigan and Wisconsin are closer.",
         "It’s really is easy to think that when you make it up entirely in your own head",
         "I'd assume a lot of them are low propensity voters. Republicans worked very hard to go after them this cycle.",
         "What do you mean he's closing out?",
         "So Georgia NC & Arizona",
         "What makes you say that? Looks like he’s about a 67% betting favorite in Georgia.",
         "& if Trump flips one & wins AZ,GA,NC he will win & lose the other swing states",
         "Abortion rights and TDS",
         "I mean he didn’t vote for Harris though. He is annoyed with trumps behavior. And tbh I see his point. Trump is the better choice for the country but he says too much stupid shit that makes it easy to defame him. We need someone like Italy has as their prime minister. She is a right winger but she’s no nonsense no bullshit she doesn’t fuck around and she verbally pulverizes the left with facts. Everyone forgot about Trump and his Mexican remark back in 2016 and he probably almost got their vote but now that stupid comedian he had probably cost him the Hispanic vote again or a large portion of it. I think Trump is better than Harris but we need someone more serious and my father has always voted unpredictably.",
         "Yea me neither tbh. I’m not a “LETS GOOO TRUMPPP” type of person but I’ve done my own extensive research and after making my own judgment, from an initially non bias standpoint, I would say trump gives us the most hope for our already failing society.",
         "Just Google it- it’s happened multiple times. Oregon state and Washington state and more too. NBC News “Police said an “incendiary device” was found in a ballot box in Oregon’s largest city, while local officials said potentially “hundreds” of ballots were damaged in Vancouver, Washington.”",
         "BEEN. \n\nI'm not on the ground there, but if it's anything like Virginia, and if my assessment of the polls is accurate, I really do think it flips this year.",
         "Can we all just do a class action suit for all the besmirching we've had to endure?",
         "Is that how she conducted the poll?",
         "Polls can be manipulated easily. I agree",
         "Then again polls always underestimate him there, ESPECIALLY Wisconsin.",
         "My apologies he’s finishing up in Grand Rapids. Like the last 2 campaigns. But he’s in Pittsburgh at 6:30 where the Pens play.",
         "Last campaign stop",
         "Yes",
         "its sad. They don't even need a primary. Their candidate does not matter it is all run by the deep state.",
         "Fair enough, but Trump's actions speak louder than words. Next ticket I can guarantee you it'll be amazing now that Trump reformed the GOP. We'll have JD Vance, Tulsi Gabbard, Vivek Ramaswamy (hopefully), and I pray Candace Owens 😭",
         "Me too but it’s usually democrat",
         "Bingo, they are playing off the ignorance of social media",
         "We need to reform the way we talk about immigration. The race and nationality of the people who are coming in may be a factor for some of us, but as I’ve noticed from the woman who runs Italy she never talks about race, she just refuses to be called racist and says the country needs to be protected. She doesn’t let herself get baited into leftist talking points. It’s better we have someone that can outsmart all of the defamation from them.",
         "and the regular media and the scare tactics \"Trump will have an abortion ban\"- even though abortion is left up to the states. And \"Trump is a nazi\" with no evidence or even \"trump is a dictator\" even though we had four years of him as president..."
      ]
   },
   "1gjgdvx": {
      "title": "Tomorrow, let’s make America GREAT AGAIN. ",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Anybody else low key nervous af. The only time I felt like who choose will actually make a difference in the way things are.",
         "Vote! Vote! Vote!",
         "As a lifelong Democrat for 16 years, I made the choice to move over to this party and vote. It wasn’t influence, it wasn’t power, it wasn’t presentation. It was common sense, it was the country in dire need of strong leadership, it was the idea of how we as a country can longer stand the divide. When I came over I was always a secret conservative before, the values outweighed my liberal beliefs then by a lot. I’d be outcasted for my firm beliefs because of it. I got so much flack for being in this side of the political spectrum than I did over in the left. It’s blind hate and no real independence over there. You are really not allowed to think for yourself or you are labeled. \n\nI remember when I was still Democrat in 2016 I voted Hilary, I know, I know…. Anyway I said that to a coworker who’s a Military Vet who was also for Trump, and you know what he did? He shook my hand respectfully and thank me for exercising my rights and that was it. We were still friends. Now when I came over here I get called garbage, racist, fascist, idiot, moron, traitor, coward, and every insult under the sun. But when I look back to that day when I was hand shook by Republican just for doing what is right, I know where I belonged. So anyway god bless you, all, and let’s win us our country back and let’s take out the garbage!",
         "Vote people!!! Your votes all matter!!! 🗳️",
         "Tomorrow is going to be such a shitshow regardless of who wins. \n\nI thought the Bush years were insane. Little did I know",
         "If you voted for Trump your not done yet. Get 9 others to vote for Trump or anybody that can help. We need a turn out bigger then 2020. ",
         "I’ve already voted! I’m just gonna be sitting back and watching the election unfold. If Trump pulls the victory, I think I’ll crack open one of my bottles of Louis XIII to celebrate.",
         "I'm headed to the polls tomorrow with my family and we are all voting Trump.",
         "I hope he loses.",
         "Fingers crossed ! America First",
         "What a looooong 4 years this has been",
         "I’m genuinely nervous and scared. It’s not being biased but it’s the fact that we LITERALLY need trump back. We can’t keep living this expensive life with dangerous people coming into the country and wars happening. And kids being brainwashed by LGBTQ",
         "More important than in 2020. Can’t allow this mess to continue.",
         "LEST FUCKING GO!!!!!!",
         "[deleted]",
         "I’m a life long republican, but after 2020 and how he dragged the country down with him, and tried to get votes thrown out with no basis and no evidence, I’ll never vote for him or anybody he endorses for the rest of his short life.",
         "“but muh abOORTtin reets🥺”",
         "Is anyone else terrified she's going to come out on top somehow?",
         "I think we’ve got it in the bag. Considering polls- don’t look at them. We’re in a good spot that 50% of the country supports trump according to polls. \n\nThese polls are not sampled for bias and are highly unregulated. The majority of poll answerers are going to be Democratic women.",
         "Trump 2024! 🙏 ❤️ 🇺🇸",
         "Sorry too tired, maybe in 2028 😁\n\nKidding I made America Great last week so if anything happened I still had time to do it.",
         "[deleted]",
         "Please",
         "If he looses I fear there will be trouble. Not from him from us !",
         "America is on trial in this election. Either way it will be very clarifying where we are headed as a nation. If Kamala wins then the America that we came to know and love is over. We will be unwelcome in our own country and they will dismantle the GOP.",
         "I’m getting Saul Goodman vibes.",
         "If this nation is to survive we must return it to its Godly roots.",
         "Harris will be installed unfortunately",
         "I feel like trump will win but I also feel like Kamaloser and her party will find a way to bullshit the election",
         "Im feeling  confident but very anxious.  A Christmas day type of feeling.  Did I get the one present I truly wanted? \n\nWe have the dems 4 years and look at where we are.  If that isn't a wake up call to some of them, we truly are a lost nation.",
         "welcome to the party of family and party of america! The more warriors we have, the stronger we will be to march on! People aren’t saying that they’re switching to party for no reason or promoting for Trump, it’s because people tired of this same machine lying over and over and we need desperate change since us Americans see what hellhole our country is headed towards and the only person with balls in this election is Trump who wants to stick it to the big elites and turn this country around! We love you anyways if you disagree or have different opinions on something , but we shouldn’t hate each other which democrats and legacy media has been successful in teaching! We are Americans, By the people, Of the people! 🇺🇸🦅",
         "We welcome everyone with open arms. We can’t say the same about the other party. Good for you for seeing the truth and escaping the division the media puts on us.",
         "You and me both friend! Good to be here",
         "I stand with you, friend. I was a hardcore liberal democrat, but was not extreme to the point I didn’t listen to other ideas. All it took was empathetic ears and an open mind to see that trump is the best choice. This is the first time for me since I began to vote that I am voting for a republican president.",
         "Thank you.",
         "They’re not even hiding it anymore.",
         "Let's*",
         "You know they actually believe that trump is against birth control too? I watched Kamala’s rally from Wisconsin and that’s what she said. That is such a dangerous lie to be telling people.",
         "Too big to rig!!! Get out the vote!",
         "The thing we have on our side this time, is Elon Musk. He’s still giving $1,000,000 away every day if people in swing states sign a petition to save the constitution. He’s drumming up enthusiasm in the swing states like crazy.",
         "So true",
         "But hey. Anything to get rid of the orange man! Who cares if she is trying to manipulate men into voting for her, shes a black woman, after all!",
         "I'm sorry my friend this story doesn't have a happy ending",
         "Yeah everyone knows when more people get out to vote the more republicans win. Oh wait maybe I have that backwards?",
         "Be ready.  Great times are ahead.  I'm so happy for us.  Glad to be on your team.",
         "Sorrry, buddy, but you’re not psychic and in control of time",
         "It depends on who turns out to vote.  Millions of evangelical Christians are conservative and would vote Republican, but typically don't vote.  Democrats don't target them for voter outreach for that reason.\n\nThe people Democrats *do* target for voter outreach are imprisoned convicts (in the states that allow them to vote), the homeless, drug addicts, and other populations of uninformed people.  It turns out that ignorance is a good predictor of voting Democrat.",
         "I wish I was wrong",
         "Why so confident? She may well win but this is one of the closest elections in US history. This isn't 2016 or 2020, Trump isn't even an underdog here"
      ]
   },
   "1gjobbo": {
      "title": "We The People",
      "text": "",
      "comments": [
         "I love how a squirrel has become the face of the Republican Party now 🐿️\n\nIf they’d break into your home to murder a squirrel, imagine what else they’d be willing to do",
         "It’s a sin what they did",
         "This needs to be a shirt immediately!!",
         "This is probably not the most important thing we should be focusing on right now, but the squirrel bit someone, and they put it down to test it for rabies. How did this story blow up like this?",
         "This was clearly a show of force. - \"Look at what we can do for literally zero reason. Go ahead. Give us a reason.\"",
         "He could have just took the rabies vaccine. Let the little guys live",
         "It’s only a matter of time before they break into your house and take one of your family members because you upset someone in another state."
      ]
   },
   "1gjimfw": {
      "title": "Tomorrow is the day we take our country back, you can't afford to sit on the sidelines. Stand and FIGHT with president trump!",
      "text": "",
      "comments": [
         "Get out and vote our nation needs its more then ever.",
         "Everyone get out there and vote republican",
         "This cultist Nazi already voted.",
         "Dang it I already voted Trump last week. Wish I could do more.",
         "👎",
         "Vote people! We need every one of you! We defeated communism once already in 1991. And we will do it again tomorrow!!! VOTE!!! 🗳️ 🇺🇸MAGA!!!!🇺🇸",
         "Crazy how much friendlier this sub is than r/democrats",
         "This is the biggest election of my lifetime. They tried to k!ll the man to keep him out of office, then he stands with fist raised and implores us to FIGHT. He is a legend.",
         "They’re doing anything they can to destroy us, and we can’t let it happen! Go out early and VOTE!!!",
         "Voted Republican only for everything. The left is destroying our country. They vote for their own demise and want us to do the same."
      ]
   },
   "1gjmv5r": {
      "title": "flawed priorities RIP Peanut ",
      "text": "Don’t get",
      "comments": [
         "Democrats logic",
         "The fact that they don’t see the irony of their own stupidity is baffling 🤣",
         "P’nut was taken in by a wild Animal shelter worker when he was orphaned and was living indoors against the law, so they killed him in a democrat run state.\nBut democrats want to protect “undocumented immigrants” living in the country illegally.",
         "Oh this made me cackle",
         "The fact that the state's own website said that squirrels have never transmitted a case of rabies to a human, you would think the guy that P'nut had lived with would know the symptoms of rabies.\n\nThis is government overreach and while rats swarm NYC, maybe that should be a priority.",
         "The way they went about it, too, just makes it sooo much worse. Raided the man's place with 11 or 12 people. For a squirrel and raccoon. Kept the man detained the whole time. He wasn't even able to care for the many other animals he has in his sanctuary.\n\nIt's such deplorable behavior.",
         "Was peanut the squirrel in Elmira NY? I can't confirm if he really was. I was born in Elmira.",
         "Right. I think his mom was run over by a car. Sad. And I know we’re talking a squirrel. But the message is clear",
         "Exactly",
         "The message is clear to me, but underneath the picture it literally says “Don’t get”.  Sounds like someone wanted an explanation to me. your post so it looks like you asked for it.",
         " i definitely didn’t mean to add that! Error on my end. I didn’t even notice"
      ]
   },
   "1gjpb0c": {
      "title": "Just voted for Donald Trump.",
      "text": "This is the first time I've ever early voted. There's quite a few people there at the courthouse today...\n\n I don't know, man, I just... I'm really nervous, and anxious.. the vitriol of the Biden/Harris administration is abominable, and Kamala Harris is nothing but a puppet for the military industrial complex and the New World Order.\n\nAs a follower of Jesus Christ, in our faith, we do believe that no matter what happens, Jesus is still King of kings and Lord of lords, He will still rescue his church, and punish the wicked..\n\nBut even then, Christians still have doubts and worries.",
      "comments": [
         "I’m anxious too. All we can do is pray 🙏🏻",
         "I’m nervous as heck. Pray pray pray. It’s in God’s hands now",
         "The Liberals are so stupid to believe their social media platforms and  mainstream broadcast media. That's not truly representative of America.\n\nIdeally there will be a mass exodus of those losers out of the USA.",
         "As an atheist and a republican, if you didn't act like your religion was better than every other religion, people would take you more seriously.",
         "Amen! 🙏",
         "thanks! you made the right decision!",
         "LOL.  Says the atheist.  You guys act like you're the smartest person in every room.  The atheism sub is literally a 24/7 bash session on how stupid Christians are."
      ]
   },
   "1gjtba5": {
      "title": "Trump voters are garbage?!?",
      "text": "Make America great again! And then annex Canada and do the same here please.",
      "comments": [
         "You know what they say one man’s trash is another man’s treasure"
      ]
   },
   "1gjvadc": {
      "title": "BREAKING: Georgia Supreme Court has ruled in favor of the RNC and Georgia GOP, stating that no election office can extend voting to accept ballots after Election Day.",
      "text": "",
      "comments": []
   },
   "1gjqiad": {
      "title": "Keep an eye out for this",
      "text": "Just got the below as a text message. No idea if it's true. Has anyone else heard of anything like this? Not sure how credible this is.\n\n\"I don't know how true this is, but thought it was worth sharing anyway. Make sure your ballot is completely clean and everything is correct or it will be void and not counted, no matter who you are voting for. If you find an error, request a new ballot. Praying over this election process!\r\nThere is a small mark pre printed in the Democrats box for president.\r\n\r\nIf you vote for anyone other than democrat it will register as a double selection- voiding that ballot.\"",
      "comments": [
         "I'm a poll worker. If two boxes are filled out, it will kick the ballot out and tell you, at which point you can get another ballot. That one doesn't look filled out enough to count",
         "If they have a trick, it will be used.",
         "\"Looks like a Kamala ballot to me\" -blue haired they/them poll worker",
         "Oh no, please tell me hanging chads don't exist anymore anywhere! \n\nNo one else needs to try and interpret things like that"
      ]
   },
   "1gjtc8b": {
      "title": "Can't wait until tomorrow ",
      "text": "The meltdowns will be epic. Get your popcorn ready...🍿 🍿 ",
      "comments": [
         "Crazy eyes and cloud yelling in T-24 hrs.",
         "Remindme! 1 day"
      ]
   },
   "1gjw53f": {
      "title": "Joe Rogan endorses Donald Trump on the eve of the election ",
      "text": "The Joe Rogan Experience' podcaster announced his endorsement of Trump after interviewing X owner Elon Musk\n\n\nNOV 5!!! ✊️✊️✊️🇺🇲\n\nVote Trump. Vance 🇺🇲\n\nDon't forget to vote Trump. Vance 🇺🇲\n\nVote Deaton!\n\nVote Tina Forte!\nNew York City 14\n\nSwamp the Vote USA\n\nswampthevoteusa.com\n",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*"
      ]
   },
   "1gje8bz": {
      "title": "My prediction for the final results election map.",
      "text": "Someone already did they which made me want to post my own. (Can we have a pinned thread for these so people can post theirs and we can see who’s right?). Anyways, here it is. The first map is my opinion on the likelihood of each state, the second is the final results.",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "It all hinges around PA... I'm not sure I'm going to be able to breathe for about the next 48 hours.",
         "Curious why you have NV breaking blue? Not that it matters in this scenario, but the no tax on tips seems appealing there and the early vote is showing strong favor toward Trump.",
         "God damn I hope\nYou’re right. The amount of people saying that they think the economy is “the best in the world” is scaring the fuck out of me.",
         "I’m hoping this is a worst case scenario. It’s very possible he can pick up Nevada, Wisconsin, Michigan, and Virginia. And I’m not giving up on what would be jawdropping – New York!",
         "I hope you are right",
         "I live in WA and the only reason it continually is blue is because of Seattles population.",
         "Kamala had her shot for 4 years while Joe has been sleeping. Will only be worse if she takes the wheel again. So many celebrities and dems are delusional",
         "Michigan is not going blue there is a Trump sign every two houses and very few Kamala.",
         "Eh I still think (as a Wisconsin resident) Wisconsin will be slightly red but I could be wrong",
         "I think he either gets 2016+ or loses. I just don't see him losing Nevada and keeping Arizona or losing Wisconsin and Michigan a d keeping Pennsylvania. ",
         "Get out and vote people.",
         "Get out and vote!",
         "I’m actually scared of us not winning Texas, and nobody’s talking about it.",
         "B-b-b-but muh Iowa poll!",
         "I can't see NC and Georgia flipping blue after they got railed by 2 hurricanes, map looks pretty accurate",
         "I have a deep sense that this is not gonna go the way of red",
         "Arizona and Pennsylvania are dubious prospects for Republicans. \n\nThe last notable election in AZ was Kari Lake, and there's been no notable systematic or demographic shift that I'm aware of, so we don't have much of a reason to think that it'll be different this time.\n\nPA has Philly. I don't know why we even consider it a swing state anymore.\n\nFrom my analysis, the only hope Trump has is record-breaking, overwhelming turnout in several key states. Go vote right now.",
         "Harris is going to regret not picking governor Shapiro",
         "You can never trust nc to stay red... Charlotte and Raleigh are too big and too blue... and the red Appalachians have been flooded and are still in dire straights",
         "I’m worried Trump won’t win. If he doesn’t win Pennsylvania then it’s over. And I’ve seen a lot of support for Kamala recently. I don’t think we can handle another 4 years of democrat rule.",
         "This is more realistic \n\nI think Trump will get 300+ though\n\n302-236",
         "Are you sure about Iowa in the first pic?",
         "I would flip Nevada red and that's about my take.",
         "I’m in PA, and it’s gonna be a long week. I did the best I could, I convinced several friends who have never voted before to come with me tomorrow. Other than that, it’s out of my hands.",
         "This looks the most realistic to me so far",
         "This is better than the many I see on tik tok saying Harris is going to have 315 votes",
         "You think the Dems will take both WI and MI?",
         "I think that trump is going to sweep the rust belt because he is already poised to win pennsylvania. And all the rust belt states have voted the same for a long time I think for about 40 years or so.",
         "I’m greedy. I want over 300 electoral college votes.",
         "I think that is pretty accurate",
         "Who cares if it’s right or wrong? Only thing that matters is that Trump wins.",
         "I'd be fairly impressed if that happened",
         "NV is flipping red though.",
         "I hope you’re right!",
         "I hope this is near accurate. I can’t wait to see my woke teachers crying on Wednesday 😂 ",
         "My exact map",
         "Penn and AZ seem to be the big swings this election",
         "Could iowa go blue ?",
         "We get enough crap polls lol",
         "And if it’s not exactly that, then there MUST be fraud.",
         "Yep Pretty much.",
         "Let's go!!!",
         "Hi PA Resident here.\n\nIts actually really blue in the parts that matter to electors. Places like Perry County, Luzerne, etc which have small-mid size populations and are out in the sticks ive noticed are more red. \n\nPA is decided primarily on Harrisburg, Pittsburgh, Lancaster, and Philly. Those are all blue this time around.\n\nI cant fucking stand Kamala though...",
         "My prediction is half that map on fire Wednesday or Thursday",
         "California I can assure you is not a hard blue.",
         "Pennsylvania and Texas are a toss up. Let’s hope they go red",
         "I think this is his only path to the Oval Office…\n\nUnfortunately, the con is on in PA… the deep state won’t let him have it.",
         "As a Republican living in PA I am absolutely going to be holding my breath for the next 48 hours. I have so much anxiety about this election and knowing I live in the state that will be SO crucial to him winning or losing.",
         "Aren't there like 180,000 new Amish voters in Pennsylvania this year? They're all voting Trump. Dems shouldn't have tried to mess with their land.",
         "According to poly Pa is turning red",
         "I’m so anxious today. My household voted last week so that’s out of the way. I will be white knuckling it until the dust clears 😢😩😓🙏🧎‍♂️‍➡️",
         "PA is going red",
         "I like to expect the worse, and also Las Vegas is still a large city and thus likely democratic.",
         "Early voting is trending Republican.\n\n[https://mynbc15.com/news/nation-world/republicans-lead-early-voting-in-nevada-numbers-show](https://mynbc15.com/news/nation-world/republicans-lead-early-voting-in-nevada-numbers-show)",
         "NV can go either way tomorrow but regardless it won’t affect the outcome much.",
         "You just have to remember that the majority are bots and astroturfers.  They fill up comments with their BS and downvote any logic to oblivion so it’s never seen.",
         "Me too. It’s gaslighting and I’m convinced all the people voting for Kamala got the jab causing them to go senile.",
         "Remember that the majority of people with common sense are not on their phones spouting nonsense 24/7. If you ask me i believe even though trump is ahead in the polls they are still putting their thumb on the scale when it comes to harris. \n\nThink about it. This isnt like Hillary vs. Trump or Trump Vs Biden. Ive never seen a presidential candidate as incompetent as Harris. She has bombed every single time shes been on camera. As much as the news and media makes it out like 50% of the country loves her im sorry im not convinced.",
         "LOL.  Who the hell is saying that?!?",
         "America does have one of the greatest in the world.",
         "VA resident here, Virginia is more likely in my opinion than people think, it definitely *leans* left, but it’s not impossible for us to get it, we got Youngkin elected here",
         "Voting red in Wisconsin tomorrow 🫡",
         "Same with us here in Virginia but replace Seattle with NoVA, Norfolk, and Richmond.",
         "I think Oregon and Washington should agree to push Seattle n Portland into the ocean to be their own communes and unite into one big red state",
         "Seattle, and Tacoma, and Bellevue, and Redmond, and Olympia, and Bainbridge, and Everett. Obviously spokane and tri cities and gig harbor are more red leaning, but its a lot more than just seattle that votes blue. If people working in the tech industry start to lean more red the state will as well cause you’ll start winning cities like redmond and bainbridge, but until then this state’s gonna be blue for a while",
         "Signs don’t vote!",
         "I wish I was in your area of MI cause all I see is Harris signs. It’s crazy.",
         "Signs don’t vote!",
         "They keep saying PA, WI, and MI generally vote together.",
         "VOTE VOTE VOTE",
         "Yessir",
         "Trump will win Iowa by 8. Possibly double digits. 0% chance she flips it.",
         "He should be. That recent poll was a total fabrication. It’s known as a push poll to get democrats out to vote. It won’t work. Trump will win Iowa by a comfortable margin.",
         "Yeah, I looked into the stats on the poll and it was ~800 people (small), over 80% said they've never supported trump, over 60% said they are never trumpers. and it didn't have a question including what your party is, just who would you vote for today. So basically they interviewed exclusively blue and blue leaning people. And trump still almost out polled lol",
         "PA here as well (Pittsburgh area…..yikes) but the Amish community was a huge win.",
         "I do unfortunately. WI I think its a tad more likely for us, but I don’t see us winning MI",
         "I do unfortunately. WI I think its a tad more likely for us, but I don’t see us winning MI",
         "I live in NV, I don't see it happening unless the culinary union is voting red for the no tax on tips.",
         "no, that poll was completely stupid and contradicts all the registration data and early voting data",
         "This is a prediction, not a poll.",
         "The majority of people will go on election day.",
         "Is your prediction that Harris wins PA?",
         "We’ll see, I hope you’re wrong (not out of malice for you, just out of hope we win PA).",
         "Wouldn’t be surprised.",
         "I say the same with Virginia, unfortunately the cities are so blue that the rest of the state sort of gets overridden.",
         "California resident here. It’s sapphire blue.",
         "The State Supreme court ruled that none dated mail in ballots could not be counted, that's a huge win for the GOP",
         "How’s it looking in PA, in all honesty? Which way is everyone leaning or does conversation feel?",
         "Me too (I’m in Pittsburgh area…yikes) but I will say winning the amish community is a huge win.",
         "Rally the troops, get your sane friends to vote",
         "And how fucking hard it is to poll the Amish?😂 nigh impossible I would say.",
         "They shut down one of their grocery stores and made them angry.",
         "What do you mean? Are you talking about illegal immigrants?",
         "Fingers crossed, man!  It was close last time.",
         "I lived in PA in bucks county in 2020. The truck of ballots showing up throughout the night was crazy. Gov Wolf changing the rules 2 weeks before due to \"COVID\" restrictions should have been illegal. The only way we win is if we harvest ballots with our ground game to keep up with the Dems. That means combing the suburbs which are traditionally red. Dems got it easy by focusing ground game in the cities.\n\nIt's possible. But I hope the Trump campaign throws every dollar we can at harvesting ballots, which is completely legal in PA.",
         "Hard to trust Polymarket though since it was skewed heavily by the multi million dollars poured in by some rich French guy or whatever.",
         "I'm just hoping PA doesn't swing blue",
         "I understand the caution. We shouldn’t get comfortable, at all. \n\nVegas is a stronghold for Mormons who almost always vote republican. They value family values and I would imagine trumps stance on abortion and trans rights secures the majority of their votes. \n\nI’m just saying I wouldn’t count out NV. Based on the demos that live in their major city, it’s possible this time around.",
         "Las Vegas is a tipping city and those workers would likely vote for Trump due to his 'No tax on tips' campaign promise. I expect Nevada to go red this year because of this",
         "Las Vegas is very blue collar, and the people are hurting.  Food going up really hurts you when you don't earn much.",
         "I remember this being the case in 2020 for some states. I wouldn't hold you're breath.",
         "Dems",
         "I’ve seen maybe 10 different house with them, all my neighbors are Trump everything. I saw a few in Ann Arbor but even then not what you would think from a place that is so LGBtQZBPL&$@£¥%",
         "Fingers crossed. I voted one hour ago",
         "It's funny because I spend so much time in Central WI for work and that's about as Trumpy as it can be.....it's almost like Milwaukee is just a Chicago suburb at this point",
         "I hope ur right , but that pollster is considered to be very accurate",
         "That is what polls are lol",
         "I get that, all CA members of this sub will hate me for saying its turning pink. But the truth is Socal has a lotttt of outspoken Trump fans. Anyone who works and works hard Ive had conversations with and they are trump supporters. Besides them actually paying attention, Its mostly a matter of one being more truthful and keeping his word, than the other slandering and just being another Gavin Newsom.\n\nBut Ive met a lot of Kamala supporters here, but its within specific demographics that always have a few things in common 1. Agree with their social circle so they dont loose their job and or social status. 2. They want to do the right thing and haven't looked outside of the news. (A small handful started watching News from other countries and didnt understand why they are supporting Trump and saying things that contradict what they've been told)\n\nSo California has a very high chance at being pink, or light blue. But neither Hard blue or Hard red.",
         "Who's to say they'll want to poll Amish folks? They're all voting for Trump and they can't at all let their followers think that Trump might win the election. If they do that, they'll have no way to manipulate the Dems and libs into rioting.",
         "The Amish traditionally do not vote.  ...but this year, the Pennsylvania state government decided it would be a good idea to raid an Amish farm.\n\nSo now they're voting.",
         "Apparently the ground game has motivated tens of thousands of Amish to vote for Trump.",
         "Agreed. I think that’s the state we’re all watching. If PA goes red, we win. If it goes blue, we can still win! \n\nJust make sure you vote regardless of where you live.",
         "Fair, I just often associate NV with CA because of location.",
         "Gods let her loose MI!",
         "The pollster weighed the poll 7 to 1 democrats to republicans.   And even still had Trump only losing by 3.",
         "Emerson has Trump up by double digits in Iowa, Emerson is also an accurate pollster",
         "polls are asking people to disclose how they voted, predictions are guesses-- not actually asking people",
         "If we lose PA, we’ll need GA and AZ to win followed by either MI or WI",
         "New Hampshire and Nevada is also a winning combo.",
         "I love that we have so many paths to victory tomorrow. But keep being persistent and telling everyone you know to vote.",
         "NH just not realistic though",
         "Polling averages have him down 5 points, but polls in 2016 and 2020 had him down like 6-7 in states he won or lost by a hair.",
         "Tru but I can't imagine a scenario where he loses PA and somehow surges in NH"
      ]
   },
   "1gjl9jk": {
      "title": "HOLY SH*T 🚨 Kennedy Campaign dropped the BEST ad for the Unity Team that Trump built 🔥 You are not just voting for Trump, you are voting for the BEST Unity Team ever created 🇺🇸 THIS IS MASSIVE 👏",
      "text": "https://x.com/MTGrepp/status/1853138762513187263/video/1\n\nVote Trump. Vance 🇺🇲\n\nDon't forget to vote Trump. Vance 🇺🇲\n\n\nSwamp the Vote USA\n\nhttps://swampthevoteusa.com/",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "And why is this the first time I’ve seen this",
         "I don’t think I’ve ever watched an add so many times",
         "🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸",
         "Umm I wish this had been playing on my TV all month!",
         "Gave me Goosebumps"
      ]
   },
   "1gjhsbb": {
      "title": "#Justiceforpeanut ",
      "text": "",
      "comments": [
         "It’s sad to see the dems would kill a squirrel over illegal immigrants that are raping and exploiting our citizens",
         "Justice For Peanut! MAGA 🇺🇸",
         "A 5 year old girl was just raped by an illegal immigrant in Long Island. So sickening where NY priorities are at right now.",
         "let’s not act like it’s ok to wish our party was killing immigrants now"
      ]
   },
   "1gjht9a": {
      "title": "Speaking Of Corrupt Media...",
      "text": "",
      "comments": [
         "Hahah this is exactly what the MSM does!!!",
         "Sounds like the NPR radio hosts (the national program, not local). The same radio program that [suspended Senior Editor Uri Berliner for five days without pay](https://apnews.com/article/npr-editor-resigns-conservative-liberal-c259642e3920e99d5f05a7fe1a90012e) after he published an essay in The Free Press criticizing the organization for lacking viewpoint diversity and exhibiting a progressive bias.\n\nUri subsequently resigned, stating \"I cannot work in a newsroom where I am disparaged by a new CEO whose divisive view confirm the very problems\". That new CEO, Katherine Maher, had a history of disparaging President Trump on social media, prior to her even being promoted.\n\nAs evident by NPR's continued biases, she and her minions aren't letting up on pushing their biases and divisive narratives."
      ]
   },
   "1gju4rt": {
      "title": "You are receiving an immigrant family lol!",
      "text": "Just goes to show you that even the Dems don't want it in their house. That's funny!",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*"
      ]
   },
   "1gjr8xs": {
      "title": "Democrats need to apologize for hating America",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "They never will.",
         "Why do Democrats even insist on voting or participating in elections when they always talk about how much they hate the country? They should just leave.",
         "I for one don't want to hear more of their lies and platitudes. Fuck 'em.",
         "Have you ever heard a Democrat say they hate America? If I disagree with someone, I don't accuse them of hating America. Honestly, posts like this just fuel partisan bickering. Its ridiculous.",
         "Have you ever heard a Democrat say they hate America? If I disagree with someone, I don't accuse them of hating America. Honestly, posts like this just fuel partisan bickering. Its ridiculous.",
         "https://youtube.com/shorts/FCdLIHp7GRs?si=gTemHM0xPlOqmhhC"
      ]
   },
   "1gjwdo4": {
      "title": "Joe Rogan endorses Donald Trump on the eve of the election",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*"
      ]
   },
   "1gjhi5n": {
      "title": "FCC Forces NBC to Give Trump Equal Airtime After Kamala’s SNL Spot 🤭",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Now if the FCC would do the same to the main stream media who has been pushing Kamala this whole time, then we have something close to fairness.",
         "[deleted]",
         "Does every individual have free will to decide this election or is God in control?  You can't have it both ways."
      ]
   },
   "1gji9bg": {
      "title": "This de-transitioner is voting for Trump, and her story will break your heart",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "I guarantee in like 5-10 years there’s going to be a ton of these people who ruined their lives because selfish activists and big pharma enabled literal children to do this shit.",
         "A miracle. So glad she is sharing her story. Someone has to speak up for the children…the future of America. \n\nIt isnt okay to push that on kids. Growing up is already confusing and difficult, for an adult to put that in your head and not shut it down as it comes up is satanic agenda from the pit of hell. I consider myself pretty moderately right…but this is just insanity.\n\nNo its okay johnny, wearing mommys heals, maybe you ARE a girl and later we can mutilate your gens…and you can be a cat if you want too…\nLiterally classified as a mental disorder.",
         "The left is trying to silence and erase de-transitioners. And we are not going to let them do that.",
         "She is brave for doing this",
         "I think you are right. The future will be very ugly for these poor people.",
         "The fact that the left sees it as “taking away healthcare for trans children” is a disgusting gaslight"
      ]
   },
   "1gjl92x": {
      "title": "Nikki Haley: Vote for Donald Trump an 'easy call'",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Why did she flip against Trump?",
         "I think nikki haley should have been used more in the Trump campaign.  She speaks intelligently and with strength in addition to being pleasing to the eye. She would make a great example for young girls to look up to. Not Kackling Kamala who cant even voice her opinion unless its pre-written for her.",
         "She chose to run because she thought it would have been in her best interest. Her attacks against him were extremely mild compared to some of the things he said about her and his surrogates said against DeSantis.\n\nThat said I still voted for her in the primary and have since voted for Trump in the GE."
      ]
   },
   "1gjekjb": {
      "title": "Donald Trump is fired up, calling out alleged election fraud unfolding in Pennsylvania",
      "text": "",
      "comments": [
         "If California can get it done.. PA can",
         "Donald Trump is fired up, calling out alleged election fraud unfolding in Pennsylvania with the support of \"fake news.\" He points to several counties and states now saying it could take days or even weeks to finish counting.   \n  \nTrump insists that election results should be finalized by 9-10 p.m. on Election Night.  \n  \nThe mainstream media has already hinted at a potential \"red mirage,\" which may initially make it look like Trump is winning, only for a possible Democratic victory to emerge later, much like in 2020.",
         "I mean we all know the Democrats are going to cheat again",
         "It’s absolutely unacceptable for these results to take so long. Big ass states are able to do it same day but swing states suddenly need 10-14 business days? Yeah okay",
         "Make Elon the secretary of efficiency and clean this up. Voting should not be such a concern",
         "Good on him calling it out!!! We all need to do this ",
         "PA cant start counting mail in ballots until 7am on Election Day. That’s why it takes them so long to finalize everything.",
         "Blame Congress for this. They blocked a bill to be able to start counting mail in ballots early. They have to start counting on Election Day. It will take a while and that's by design",
         "Smell anything putrid there, \"much like 2020?\"",
         "And if anyone dares protest it, they’ll be locked up and completely shunned. We’re already in this authoritarian fascist country these brainwashed people think Trump is going to bring.",
         ">The mainstream media has already hinted at a potential \"red mirage,\"\n\nThe _Red Mirage_ phenomenon was so telling last year.  Fox uncovered a DNC talking point about _Red Mirage Turned into a Blue Wave_ and ran that story a week before the election. I went to bed at 2AM after what I thought was a Trump win only to wake up to Trump falling behind and all news agencies running _Red mirage / Blue wave_ stories. The point of my comment is not who won or lose, but that it showed so clearly that mainstream media was just publishing pre-approved DNC talking points.",
         "I think this sub has democrats in it, and some of the republicans follow, not knowing. It happened in the trump sub. \n\nI agree with you and can't see how a true republican would downvote you for what you said.",
         "We do. So the two questions are:\n\n1) Will Trump be able to win in spite of the cheating?\n\n2) if Trump can’t overcome the cheating, what are we going to do about it? \n\nI’d love for any and all conservatives to answer #2",
         "Why tf (not taking it out on you) are they still using mail in f**king ballots?!? I’m cool with early voting in person but all this “trust” were supposed to have that the ballots are from ACTUAL people just isn’t there",
         "It shouldn't take weeks no matter what. This is just their BS way to steal the election.",
         "We used to go to the polls, fill out our paper ballots and turn them in on election day and the results were announced later in the evening. This has nothing to do with not being able to count until election day and everything to do with the fact that we now have an unprecedented (other than in 2020, and we all know how that turned out) amount of mail-in ballots, which in many counties as long as the postmark says Nov. 5, it'll be counted. That's why some places will take longer, because even if you're mailing something within the same city, it'll still take days to get there. Please note I am not saying this system is secure or that I trust it, I don't and wish everyone voted on election day in person, I am simply trying to explain why this is happening.",
         "Drain the Sawmp then!",
         "Because I don't love blanket statements. I know a lot of dems who are genuinely good people. We want the country to be better- we just have different ideas of getting there. I also think statements like that are divisive and I'm just not into that. \n\nThere are some really good dems out there. There are bad too. But there are good and bad republicans as well.",
         "I've bought plenty of supplies ... will leave it at that because I don't want to be raided and euthanized like Peanut LOL",
         "There's no reason to believe mail in voting doesn't work. The military has been a big user for ages.",
         "Here in Colorado we’ve been voting by mail (or drop box) for a long time and it’s great. Aside from that idiot posting the passwords we’ve never really had issues here. The ballot is 6 or so pages long with all the local issues and it took hours of research to fill out. Then I drove to the drop box a mile from my house in pajamas last night and put it in. Whole process (aside from filling out the ballot at home on my couch) took 10 minutes tops, no lines, and I drove right up to the ballot box, got out of my car popped it in, and walked 4 feet around my car to drive home. Easiest thing ever and that’s how it should be.\n\nI don’t want to work all day, drive home an hour, then get in line to vote at 6pm (cutoff is 7pm) then stand in line outside and by the time I’m home and eat dinner the whole day is gone. Also then you have to memorize like 20 ballot initiatives wi th deceiving language.  I’ll do it, and have in other states I lived. But damn CO’s system is so much more convenient and easier. Now I get to go right home from work on Tuesday and chill.",
         "In 2020, Biden got many, many millions of votes from that brand new \"ballot by mail\" process in many states, especially swing states.",
         "I got zero clue. I get the need for allowing people who may be deployed, sick or away at college to vote but there really needs to be a better system.",
         "There is absolutely no reason they can't start counting before the election. This is being drawn out for a reason.",
         "Mail in voting deadline should be 2 weeks before the election.",
         "so you are a Liberal ... there are no good Dems out there .... you included",
         "> The military has been a big user for ages.\n\nYep.  Of course the ballots are tightly controlled by the military, and there is no chance of illegal aliens using them, or people voting multiple times.\n\n...and in this election, [the military is reporting that it was sent too few ballots, so a lot of enlistees won't be able to vote.](https://www.bizpacreview.com/2024/11/03/lawmakers-want-answers-from-pentagon-over-failure-to-send-absentee-ballots-to-active-duty-service-members-1499916/)",
         "How many people used the identities that non-citizens stole for work purposes to register to vote on their behalf and get ballots in bulk to invalidate your vote, those of your family members, and your neighbors?",
         "He’s the most popular president in modern history /s",
         "There was, then Democrats ruined it with mail-in ballots because of the spicy flu.",
         "Elections before 2020 did all their counting on Election Day. Wasn’t an issue before….",
         "I believe mail-in voting shouldn't exist. People should go to the polls and vote in person, like we had done for pretty much the entirety of our history. The mail in system has no way of determining if the person whose name is on the ballot is the actual person who filled out the ballot. It can't be impossible to either make fake ballots, or to intercept someone else's ballot and fill it out for them. The only mail-in ballots should be absentee ballots.",
         "\"there are no good dems out there\" tell me you don't want a united country without telling me you don't want a united country",
         "Just saw that on redacted",
         "For those downvoting his comment, /s at the end means sarcasm.  I know that not everyone knows about /s.",
         "They never did all of their counting on Election Day. When the news/candidates announces a winner it’s based on unofficial results. The States put the official results out later. \n\nStatistics are why we don’t care about counting all the ballots before announcing the winner. If a candidate is up a million votes and 100k left to count. Those 100k won’t move the needle. When elections are super close like in 2000 or 1960 that’s when it matters.",
         "I agree. You can research why Congress blocked being able to start counting early. It doesn't make much sense to me",
         "Thank you kind Redditor",
         "You’re welcome."
      ]
   },
   "1gjwry0": {
      "title": "Early PA voting turnout may lead to strong GOP victory, IF people vote on Election Day",
      "text": "Compare 2020 numbers with 2024. 4x Dem early voters, now only 2x. If most republicans go out and vote again on Election Day, it will be an easy win for Trump. Whoever wins PA wins the election. Go Vote! ",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*"
      ]
   },
   "1gjkf7m": {
      "title": "Illigeal immigrants delivered to Kamala supporter's house.",
      "text": "You got to watch this, lads. This has to be one of the funniest shit I've seen in a really long time.\nhttps://youtu.be/9oYdQ6T_utg?si=7ezD_pjfKFJcGC7Z",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Funny because libs love to throw around NIMBY every time some huge expensive project like public transit paid by tax dollars gets shut down. They want open borders and housing for these people but not where they are at which is NOT IM MY BACK YARD at it’s finest. Literally everything they support they are against when it comes down to them doing the giving the whole party is just based on virtue signaling and getting someone else to pay for it",
         "Hahahahaa that’s pretty good!"
      ]
   },
   "1gjiepw": {
      "title": "As the world watches the U.S. election unfold, many, especially people in Latin America, believe that Trump is the only option to prevent the decline of American economic power and influence.",
      "text": "Joseph Humire, an expert on Latin America and executive director of the think tank Center for a Secure Society, told Fox News Digital that many Latin Americans hope for a Trump victory on Nov. 5.\n\n\nHumire said the Biden administration's policy toward Latin America has resulted in it being \"the worst that I’ve seen.\"\n\n\nVote Trump. Vance 🇺🇲\n\nDon't forget to vote Trump. Vance 🇺🇲\n\n\nSwamp the Vote USA\n\nhttps://swampthevoteusa.com/\n\nLatinos for Trump! Luchador!\n\n\nhttps://youtu.be/jjsqncOWTYk?feature=shared\n\n\n\"The last four years the region has gone into a very difficult direction,\" he said. \"Food inflation is really high. Organized crime and violence are really high. And, you know, little by little, they're losing their democratic practices. There's a huge democratic backsliding happening in the region.\"",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "All my Colombian friends want Trump! They hate Petro!",
         "Wait I thought the Latinos hated trump because of an off hand remark by some comedian? /s lol tomorrow is gonna be fun if the cheating isn’t rampant.",
         "World War 3 won't be that bad, vote Kamala for the military industrial complex!",
         "And they’re correct. Funny how people in foreign countries who have lived under communism, authoritarianism, and banana republics like Trump.",
         "If he loses it’s only bc of cheating right? Idiot.",
         "Military spending increased under Trump despite declines in personnel and, as he frequently touts, no new wars. What is that except feeding the military industrial complex?",
         "It was fixing some of the neglect under Obama."
      ]
   },
   "1gjrfrg": {
      "title": "Passed on to me from a reliable source, it's looking good for Trump ",
      "text": "🚨Breaking: From our NY State Conservative Party/GOP - NYC Councilwoman Vickie Albrizio Paladino...Queens/Her release-- 😎 I Report, -- You Decide...\n\nJust spoke to a Democrat consultant friend on the ground in a swing state who told me I could repeat some of what we discussed. Here's what I can tell you; take it with a grain of salt if you like but I think he's being straight with me.\n\nNobody really thinks Kamala is going to win at this point. Canvassing is going poorly almost everywhere, with few exceptions. The party is getting their high-follower influencer accounts to push out motivational stories just to keep morale up and get them over the finish line with some dignity, but it's not great. The Iowa poll was good to give a shot of adrenaline to volunteers, but nobody important believes those numbers are real.\n\nOf all the swing states, they're hoping Michigan comes through and possibly a late-night miracle in PA, but nobody is counting on either of them. They don't think Trump is actually going to flip VA or NH, but the fact that they've even entered the conversation is indicative of how bad things could potentially turn out.\n\nThe early vote counts are just beyond what they expected to see for Republican turnout, and has Dem strategists rethinking whether it was a good idea to make such a big push to broaden early voting in the first place. Republican low-propensity voters are activated in a way nobody really expected and the polls didn't capture it. Yes it's possible those early Republicans broke Democrat in an unprecedented way, but very unlikely.",
      "comments": [
         "I think Trump will win big. RCP average shows a dead even tie for the popular vote. He was down big in these national polls in the last 2 elections and still won in 2016 and narrowly lost in 2020. If he’s this close in the national poll, he will sweep all the swing states",
         "Don't get your hopes up. What happened in 2020?  The nation went to bed after the polls closed and Trump was ahead in quite a few swing states....the next morning the Dems \"found\" just enough votes to turn those states blue. The Dems will find just enough votes to install their puppet.",
         "I can only hope that Trump wins the EC and is re-elected as President.",
         "Let’s win bigly, bros!",
         "We won’t know shit until Inauguration Day. It’s not over until someone’s butt is in the seat",
         "I remember when that happened, I just knew they were trying to figure out a way to navigate it and say they won. It gave me such a bad feeling in my stomach. They are commies with no integrity.",
         "You remember seeing the CCTV video of the suitcase that came out from under the table when the Republican monitors were removed from the tabulations room? Yeah me neither, I guess that never happened.",
         "Exactly , early voters could be taking away from people who normally vote on Election Day"
      ]
   },
   "1gjt9lo": {
      "title": "P'nut and Fred did not kill themselves. Democrats hate pets. ",
      "text": "I don't want to live in a world where the government loses 325,000 children to sex traffickers they can't find, and then spends five hours searching a house over a couple of rescue pets. ",
      "comments": []
   },
   "1gjwfb0": {
      "title": "I wish I could post this publicly but I’m sure I’d get stoned",
      "text": "I think Megyn did a fabulous job of pulling together a lot of the policies the democrats are screaming over. She not only brought up policies they believe will change but also facts behind them (ie they cannot change the abortion laws due to the way our government is structured). I think it’s fine to agree to disagree but I no longer feel safe voicing my political opinions. As someone in their 20’s, pretty much everyone I know (high school, college, etc) all are very vocal on their stance of why they love Harris but if I were to say the same for Trump the backlash is immeasurable. I am sick of their hypocrisy and unwillingness to even listen to a critic- their opinion is the only right and just. Plus, they talk about how much they hate our country so why don’t they just leave then?",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "I am sick of going on social media and only seeing the left’s views. Nearly every sub on Reddit is singing their praises but if you say one negative thing (as voiced on this sub) you are immediately banned. They are limiting free speech and people are too dumb to see it due to their herd mentality. I  am just so sick of my generation and their blindness to politics. They have no idea what’s happening and I fear they will never understand it.",
         "And the scariest part is they vote blindly not realizing they’re quite literally voting for the very policies that will also destroy them and their children and children’s children. It’s like some scary black mirror episode where we’re the only ones awake to going on. It feels like we’re the minority yet the asleep majority have the right to vote and install corrupt people who want bad for us."
      ]
   },
   "1gjsibu": {
      "title": "This is my prediction for Trump tomorrow… what do you think?",
      "text": "",
      "comments": [
         "As a Pennsylvanian , I see it going red . That's why Kamala is here as I type .",
         "PA going red for sure, so at least swap 19.",
         "I think Michigan is turning red (again).",
         "I like to think it won't be that close, that people realize she has been in office for the last 4 years, but I was of course wrong last election.",
         "I think pa will go red other then that looks good",
         "No love for PA ?",
         "Seeing a lot of pussified predictions on here today. \n\n\nTrump takes Arizona, Nevada, North Carolina, Georgia, Michigan and Wisconsin. He's gonna take New Hampshire and maybe New Mexico. I think he keeps NY and NJ to 10ish and nearly takes Virginia. \n\n\nThen we make America great again ",
         "I think it’ll be like 2016 where Hillary already had her congratulatory party before the results finalized because they’re so confident they can cheat because of how easy they got off the last election. Even if they do get close the magnitude of their cheating will be so much greater and easier to catch",
         "Disagree about Nevada. The Culinary & Bartenders Union in Las Vegas always does huge amounts of ballot harvesting on general election day where it collects mail in ballots from union members that work in the resort casinos and then brings those ballots to the election department's offices. This swings the race by 1-3 points for Democrats. Since 2004 Nevada has always supported a Democrat in the presidential election. \n\n\nPennsylvania, Wisconsin, Michigan those are neck & neck because we saw how wrong biased pollsters could be and get it wrong in 2016, 2020. Voter participation is the key for Republicans to win, no apathy allowed, everyone must get out and vote!!!",
         "Indiana red??? Wow",
         "Go on YouTube Watch “Election Time”",
         "I think New Jersey may turn red - sleeper state. Add New Hampshire too.",
         "Where can I fill out a map like this?",
         "What if each side gets 50/50?",
         "I think Omaha, NE might go red. Long shot, but it’s close.",
         "Will he get WI?",
         "Wisconsin is the least likely of Wisconsin, Michigan, and Pennsylvania to go red.  It doesn't make sense to have those blue and Wisconsin red.",
         "I hope so.",
         "As a Pennsylvanian I’m worried about shenanigans and hoping that it ends up not mattering in the long run.",
         "I hope you are right",
         "I like your optimism, but I just don’t feel really good about Pennsylvania. I feel much better about Wisconsin.",
         "I’m not so sure. But I would love to be wrong!",
         "Idk I’m just trying to be cautious… this is the most realistic for me considering 2022 midterms and other factors",
         "Remember Fetterman?",
         "Pretty sure it’s more caution from experience. For instance the 2022 Red Wave",
         "Again, it’s not me trying to be a pussy, it’s just me trying to take an instinctual middle ground kind of prediction. This prediction is not meant to be definitive of what the result might be. I could be completely wrong. The Democrats could win in a landslide tomorrow due to other things. Could be a Republican landslide tomorrow. I don’t know. This is just what I’m going with my gut. Again, you don’t have to agree with it. I’m just simply sharing what I think might happen tomorrow.",
         "I’m 18 years old, and Donald Trump is the first candidate I’ve ever voted for! Everyone needs to tear the veil off, shake off blind allegiance to the Democratic Party, and vote for common sense!",
         "IK... I’ve been watching election maps every day this past week and I’m kind of on pins and needles and it’s very nerve-wracking to think what the outcome might be tomorrow. I definitely think that Pennsylvania could turn red but I’m not for sure. We just want people to get out there and actually vote. Polls and other things are kind of like glimpses of what people might vote for but they’re not objective. So I want you to get out there and vote, vote, vote so we can save this country.",
         "I hope nj does , I just voted for djt",
         "https://www.270towin.com",
         "Me too. , we vote anyway . I hear Trump has more lawyers with a better sense of where the shenanigans take place .\n\n My wife and I have off tomorrow as I am expecting long lines . It will be one of the few times in my life where I'm hoping for a long line .",
         "Me too.",
         "PA here. Have some faith in us. I feel PA is gonna pull through for Trump again. Godspeed!",
         "High five!",
         "Thank you!  Time to start my homework now.",
         "Yeah my wife and I are up in Bucks where there has already been shenanigans. We’re obviously heading up to vote tomorrow and like you we hope for a great turnout. Good luck and Godspeed.",
         "I’m up here in Philly lowkey they scared out here lol",
         "Can I tell you my wife’s very liberal coworkers are taking the next two days off for mental health?"
      ]
   },
   "1gje767": {
      "title": "🚨 Kamala Harris staff just CALLED THE COPS on me for standing peacefully inside a Kamala Rally",
      "text": "",
      "comments": [
         "Yikes … honestly I’m praying this nightmare is over and the good guys win on Tuesday.\n\nThe Kamala Harris / Biden experience has been a total disaster for the world",
         "IMPORTANT: I was invited and had a full credential.  \n  \nThe Kamala Campaign kicked me out for taking photos of their poorly attended event. This is how hard they are trying to control the narrative.  \n  \nI was kicked out for telling you the truth about their failing campaign.",
         "All the markings of a troll/misinformation account.",
         "The Democratic Party is doing things just like a high control cult does. It’s crazy.",
         "So funny how they hate the police until they want to use them against peaceful Americans.  Cops shouldn't even take calls from demoncrats",
         "no. no you didn't. you are a spamming posting bot account",
         "WOW Kamala Harris staff just CALLED THE COPS on me for standing peacefully inside a Kamala Rally.  \n  \nDidn’t bother anyone. Didn’t even talk to anyone. Kamala staffers were literally \\*shaking\\* at my presence. One had my X profile open on their phone.  \n  \nCops were totally confused",
         "Police state wow",
         "And Trump is the danger to Democracy according to Democrats who are a proven danger to Democracy.",
         "Im sure this isnt the full story, but they can kick you out whenever due to a Kamala Harris rally being private property, much like a democrat can be kicked out of a trump rally due to it being private property.\n\nBut like I said, im sure this is not the full story. Im sure you were being annoying. But even if you were not, they can kick you out.",
         "We already had to file bankruptcy when my husband lost his job and my hours got cut. I don't know how much worse this can get, and I really don't want to know. I'm ready to not be pissed off and disgusted about our government. I'm excited for the change, but scared they will cheat and steal another election.",
         "I feel like you're leaving part of the story out",
         "Were there not supposed to be photos? This feels like a: \"your side, their side, and the truth\" situation.",
         "…I feel like there was more to this story that you’re not sharing?",
         "You aren't alone. They are full tilt believing their own bullshit, just hope they aren't to the point where they feel justified doing what they insist trump did.",
         "Nope. I've seen the video where he was asked to leave. The police couldn't give him an answer other than \"They're uninviting you.\"  This dude wasn't saying anything, being disrespectful or anything. Literally just standing around."
      ]
   },
   "1gjlggy": {
      "title": "Does America really believe reparations will unite America. My guess is no, but remember… a vote for Kamala is a vote for unity. 🤢",
      "text": "\n",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "The only reparations that anybody should be getting is getting the money back that the government has spent on illegal immigrants.",
         "I feel like you answer this type of question on reddit of all places you'll get crucified for it.  If you're 160 years old and older you should 100% get reparations.  Otherwise wtf do you deserve reperations for?",
         "Reparation talks usually startup about 1 yr out of the presidential election and ramp up as the election gets closer. Its just one carrot of many the dems love to stick in front of their base. It isnt going to happen but that wont stop them from bringing up again in 3.5 yrs from now."
      ]
   },
   "1gjffog": {
      "title": "Bullied for supporting trump. advice needed ",
      "text": "Bullied for supporting trump \n\nHi there . I am a 20F .I am someone who is very shy and doesn’t have many friends at all . \nI am a former democrat and now I am a trump supporter becauze I realized how much propaganda and lies were being told about him. I also see how more people thrived during his presidency. Myself included \n\nI  felt called to speak out on my instagram story. I have seen so much lies and propaganda and I just needed to expose it . I made a couple posts about how the economy and stuff was better under trump and I have made many posts exposing  Kamala and her lies and her fraudulent behavior , stupid policies etc . Many stuff I’ve found on here , memes and what not \n\nHowever , I feel kinda hated for it . I already have low self esteem and struggle to make friends and everyone my age is like a brainwashed democrat who thinks black and white . I’ve had people swipe up on my story  and call me disgusting . I’ve lost many aquritances , potential friends , followers , destroyed relationships with family members and more.\nI truely believe in what I’ve been posting and I belive I am doing the right thing but I know how brainwashed and black and white these folks are and I feel like I’ve made my loneliness situation a lot worse now no one wants to be my friend now that I’ve made these posts . \ndoes anyone have advice on how to be confident in your support for trump ? \nEven when so many people just see you as terrible for it . Ugh. ",
      "comments": [
         "There's a disproportionate number of Liberals on Social Media platforms. \n\nOne more day and the degenerates will be too depressed to post their propaganda.",
         "Check out the book the Anxious Generation. It will put into perspective some of the problems with social media and how it negatively impacts your mental wellness. Don’t let down votes get you down. Internet friends aren’t friends. Good for you for sticking up for what you believe in. 💕",
         "I am sorry you feel that way. It’s so sad to see the hate the left throws out as us. Marriages, friendships, parents and children. It’s tearing us all apart!",
         "Now you know who the real ones are! We welcome you wholeheartedly. \n\nI have been bullied and ridiculed too. In fact, I lost two lifelong friends. Some of my distant family members no longer speak with our family. Yet, those are the same people who are very hateful, miserable, and have nothing better to do than spew hateful and divisive rhetoric. \n\nYou’re very strong and brave for sticking up for your beliefs and not letting someone control you. I don’t know where you stand religiously, but Jesus loves you, and I am positive He is proud of you for making an independent decision. \n\nI can also guarantee that you have followers who stand with you too, some may be too afraid to speak out though.",
         "This is the reason I believe it's gonna be a blow out.  Way too many people have been put down and mocked over a difference in ideas and called Nazis and garbage.  I think the Dems will be shocked how many people avoid talking about being right wing and hide it.\n\nI hope it's a tidal wave that leaves their self righteous asses wondering what happened.",
         "Keep your head up. Most of then believe what the media and democracy machine say regardless of what's true. They want to push you because it makes them feel superior and righteous, because they've been told we are racist and nazis. Hold to your beliefs and morals, sacrificing that for people like them would feel worse than anything they can do or say to you.",
         "23F here who totally understands. The reason so many people our age are Democrats is because they're weak and misinformed. Be okay with being the strong, informed minority. I lost two of my closest friends since middle school in 2020 when I vocally supported Trump. It hurt. But the results of their progressive, liberal ideologies and worldview spoke for itself in how their lives turned out. They're unhappy and lacking any kind of direction. Know when to defend yourself and when you're talking to a brick wall.",
         "You are not alone it take courage to vote agaisnt what others think is \"right\" hopefully it will be over by Wednesday and you have voted, you have not need to tell anybody how you vote, vote your conscience the rest can live with their own conscience. Take time off and avoid social media we all need less of it causing anxiety.",
         "Was it here on reddit ?  Reddit is a liberal sespool. I would just mute their subs and you'll eventually stop seeing so much of it.  Dont sweat it though. You're doing the right thing,dont let them discourage you.",
         "Avoid social media for a few days, you'll feel better.\n\nAnd don't be ashamed if you voted for Trump because you have the arguments, you bring the evidence and the concrete facts.\n\nThe Democrats, on the other hand, only have hate.",
         "A good portion of the country is brainwashed.\n\nThank goodness you saw through all that, and you came to your senses.\n\nWelcome aboard!",
         "Welcome to the struggle for the Republic.",
         "Welcome to the club. Happy to have you here",
         "Use it as fuel. It should double your resolve. Most conservatives will probably agree, we all have liberal friends, but very rarely are liberal people tolerant of conservatives views.\n\nIts kinda absurd how many people in my life I've alienated by believing something as simple as \"hey so grown men probably shouldn't be fighting women in the UFC\".",
         "Ignore the noice, three are people who get off on stuff like this. They are basically keyboard warriors. If you look this demographic, it would typically be a soyboy who loves to code or a woman with a degree in made-up genders. ",
         "My 25yo daughter just voted for Trump. She’s disgusted by inflation. Maybe email your local Republican Party office and see if they have a group of young voters? They are growing now.",
         "In theory You are actually too young to be a republican and « fully awake » xD I can promise you half your friends will turn republicans in the next 10 years. Seriously who bullies for a different political ideas? These people are crazy; never be emotional about politics just ignore the hate and don’t feel compelled to want to educate people this truly leads to nowhere just do you an prosper :)",
         "The full extent of your choice is to be right and hated for it rather than be wrong and liked by it. That’s a respectable quality and the right people will quietly support you.\n\nThat being said, you don’t need to be a loud Republican supporter. No need to bring politics into your social media life if that’s not the direction you wish your life to go. If you’d like politics to be a bigger part of your life, you can join local Republican groups. If not, cast your vote, spend less time on social media and make friends through other meaningful hobbies",
         "just know you are smarter than they are",
         "Find better friends there are people who support him openly and passionately get out there and make it known more people like him more than you think",
         "Stick to your guns, if someone can't respect that you have different views then them than they shouldn't be part of your life. That's the thing about democrats. It's their way or the highway. Scream that they want to have a voice and their opinions respected yet won't reciprocate.",
         "Ignore them, they’re mentally unstable",
         "Welcome!!!! I hear ya. Hey we’re here. Pm me anytime.",
         "First off, Welcome! It takes courage to stand up for what you think is right. Don’t let the squeaky wheels sway your beliefs. You made a choice based on input you personally have experienced. \n\nA lot of people feel the same way you do, they just don’t vocalize it. Rightly so, look at how people are ridiculed when they do? They (the left) has the media bias on their side. If it’s being played on a television, they tend to believe what the TV tells them, and they believe that they’re righteous in their actions. \n\nKeep your head up! Think for yourself, you’ll be much happier",
         "There is a saying never speak about money, religion or politics... Definitely, don't post about it , this is the result you're going to get. \nSorry, feel better...",
         "I personally refuse to discuss politics unless I am confident the person I am speaking to is also republican. I also do not post on political stuff on social media.\n\nI have told the few lib friends I refuse to discuss politics with them because it is a waste of time as neither of us will budge on our beliefs. 50% respectfully agreed and we never discuss politics, the other 50% refuse to even speak to me anymore.\n\nAs for random people trying to gauge my political affiliation, I make it a game to be as vague and confusing as possible or be completely absurd. I have told many people I voted for Kanye in the past 2 elections.",
         "I would recommend not talking politics with people who aren’t like minded",
         "This is where you keep your yapper shut. Until you're around Trump supporters. I did a job for a biden hack. (What I call them) I was quite happy to tack onto his bill, 15% for boring the life out of me about how wonderful he was.\n\nSometimes you must just be quiet. Bite your tongue, and let them ramble on.",
         "They might be a bunch of PDF files so be careful. Those who preach the loudest have the most to hide.",
         "Who cares about them? I’m a 22 m who really is not afraid of making my political opinions known on social media. I’ve learned not to give a damn about their opinions.",
         "Get used to it. Its the only thing that the democrats know how to do. Scream and yell nazis. Yet when you step back there the ones who actually are turning into fascist",
         "I hope things get better. If people cannot separate politics from friendship or a relationship you are better off, you are so much more than you who you vote for every 2 or 4 years.",
         "Nothing triggers the libs like supporting Trump except Identifying as a follower of God.  I block all haters",
         "I’ve lost so many friends when they found out about my beliefs. I never even spoke politics but they saw I followed Trump and dropped me. It sucks but it shows the type of people they are and how they aren’t mature. You’re allowed to believe whatever you want. It’s unfair how libs get to spread their beliefs and immediately call us horrible names because we support Trump. It sounds so corny but just be yourself",
         "I have many liberal acquaintances and when they make comments about Trump or republicans in general that are so outlandish I just bite my tongue, even though I don’t want to. I know if they ever knew I supported Trump or agreed with many of the things he does, they would immediately treat me different and cause a rift that would be toxic and make my workplace especially toxic. \n\nIt is crazy how Republicans are so silent but we have to be - otherwise we’d potentially be a social pariah or face repercussions. \n\nWe are here for you though - just know you are not alone and there are a ton of people who agree with you!",
         "I had my relationships severed with many family members and friends over posting about my support for Trump on Facebook last election. Many of my cousins and such won’t even talk to me because of my support for Trump. So I understand. It’s not fair. I’m still going to support and stand for truth though regardless of how my democrat family members and “friends” treated me. I’m so sorry this happened to you also. It doesn’t feel fair sometimes.",
         "Liberalism is something most of us (conservatives) eventually grow out of because it's what you're taught to adhere to in schools. Most teachers tend to be liberals. Most people in college are still in their *'taught what to think not how to think'* phase.\n\nA lot of people realize when they're out of academia that the real world isn't so conductive to the bullshit they've been taught and decide on their own. Just keep politics to yourself, because people are usually pretty tribal especially about Trump.",
         "Reddit x that by 1000",
         "I really appreciate this thank you so much 🙏🏻🙏🏻❤️❤️❤️❤️",
         "They're not liberal.   That's the fucked up part.  Calling nazi and garbage isn't liberal.  They're behavior is maxis and/or fascist.  \n\nTelling people what to think mixed with name calling is not liberal.  It's bullshit child like behavior masquerading as liberal.  \n\nWanna watch a 'liberal' squirm?  Tell them you're embarrassed by their behavior.",
         "Yeah, reddit and imgur are not the best place to judge who the majority is. Full of liberals that swing so far that direction it's almost nonsensical.",
         "Most of them left Twitter after Elon bought it. Cry babies. Lol. ",
         "Reddit is all about censorship",
         "It's the norm. Branch out and find like minded people. There are alot of conservatives. Alot of young woman and men.\n\nMore woman want a man that can protect to the best of their abilities. Less woman want to watch their guy get beat up by 4 home invaders and get knocked out/killed leaving you alone and totally vulnerable.",
         "I love liberal tears though."
      ]
   },
   "1gjdh97": {
      "title": "LMAO Cardi B's teleprompter was broken and she had no idea what to do for over a minute",
      "text": "",
      "comments": [
         "Lol it's so funny to me that they need to be told what to say and can't just wing it",
         "LMAO Cardi B's teleprompter was broken and she had no idea what to do for over a minute until someone ran on the stage to give her a phone to read off. Holy embarrassing.",
         "She had no idea about many things including how to rap",
         "She should of just kept saying \"32 Days\", over and over again.",
         "Been waiting for this moment for my whole life.....and I can't think of anything \n\n\n-Cardi B",
         "“Wwwuuuun segun gguaaaaiizzz”",
         "Another incompetent idiot just like Skamala.",
         "The second hand embarrassment 🥴",
         "Surprised she didn't whip her tits out"
      ]
   },
   "1gj2xuf": {
      "title": "All Praise Kek",
      "text": "",
      "comments": [
         "And they call us a cult.",
         "Brace yourselves for Dem's projection, \"I'm not possessed, you are!\"",
         "Still a disgrace there was no primary",
         "Be honest... This and the last election were never about liking their guy. It's just about how much they can get every one to fear/hate trump.\n\nWorked for them last time and Biden hid in a basement the whole time.",
         "I have to laugh because there are several subreddits I have apparently been shadow banned from.\nWhenever I go to respond to comments on these subs, I get a notice I can’t comment and to try again later.",
         "Yet they are the hive-minded.",
         "There was a primary. Biden got the most votes with “Uncommitted” getting the 2nd highest amount of votes.",
         "Correct, the last 2 elections have been Trump vs “I’m not Trump”. That’s basically been the strategy and it worked in 2020 but I think people are tired of it at this point."
      ]
   },
   "1gj25zk": {
      "title": "Move Over Daylight Saving Time...",
      "text": "",
      "comments": [
         "Should have said 8 years ago. 4 years would be 2020 and no one wants to go back to the Biden Administration with Covid-19",
         "Nice!  Love it!",
         "So we’d be just about to reelect Biden?",
         "I KNOW you meant 8 years. It's okay, honest mistake. :D",
         "I’d say we would have learned from our mistake and not vote him in again but looking around Reddit that didn’t happen"
      ]
   },
   "1giso5t": {
      "title": "First time voting for president ",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Interesting that your state's ballot shows the electors as well. Also novel that the vice president is left off. I hadn't seen that variant before.",
         "Go post this in r/pics 😂. That sub has been full of ballots for Kamala...in wonder how long it would take you to get banned",
         "Pleas post this in r/pics and see if they even allow it to stay up. 100s of pics of Harris votes in there eveeyday",
         "Every second post in r/pics is \"I voted for Kamala! (please give me updoots!)\"",
         "So nervous but staying hopeful!",
         "Same!!  Get out and vote everyone!!!! We got this…. I truly hope so!",
         "At 33yo I voted for the first time and for Trump! Unaffiliated in NC (and a woman) and this was the first election where I felt my vote really mattered. Staying hopeful we see a red wave on Tuesday 🤞🏻",
         "Nice",
         "Congratulations",
         "Trump 2024",
         "I'm 20, voted for President for the first time in my life, and am happy to say my first ever Presidential vote was cast for Donald Trump.",
         "Way to go!!",
         "👏👏👏👏👏🇺🇸",
         "MAGA",
         "Welcome new voter, and you made a good choice!",
         "Congratulations on your first Election Day!  My family made our first election and first presidential vote a special day. Went out for dinner and watched the returns.  It should be a national holiday, in my opinion.",
         "Hell yeah!!!!!",
         "I have to sub to Republicans to see Trump voters. This platform is doomed.",
         "FFS why couldn't my parents do it 3 months earlier... :(\n\n  \nBut nice. Looking forward to Tuesday!",
         "Great Choice! Trump 2024",
         "I'm not a Republican, but I'm so proud of you! I mean that genuinely. even though we might fundamentally disagree, I'll support that right for us to disagree forever. idc what anyone says, voting is important.",
         "People in r/pics will post the same thing but with Harris voted for instead of trump and get 90K upvotes, post this on r/pics and get banned from reddit. Crazy how that works right?",
         "I'm a democrat-leaning lurker but gosh I wish you guys could post in r/pics, it's so fucked up that they won't let you and it's censorship.",
         "I love how this sub doesn't buy virtual medals for people like the left leaning subs. The gap in money management skills is clear.",
         "Good job!",
         "Thankyou",
         "I’m excited to vote for the first time too!",
         "I'm a California voter and I approve your vote!",
         "Would have loved to see a female VP with Trump. Would have been an interesting election.",
         "Guys I believe in certain states it's illegal to post whom you have voted for check yalls shit. And that came form Vance",
         "You did good!!",
         "I’ve never seen a ballot that has the electors on it. That’s kind of cool.",
         "Put this in almost any other major sub and you’ll immediately be banned. Absolutely wild",
         "Why did I think it was illegal to take a picture of your ballot? Was this ever a thing or am I imagining it?",
         "Is it legal to take a picture of your ballot I heard its illegal",
         "What state? Cool that they list the actual electors. ",
         "Good choice I’m voting tomorrow",
         "Lucky, I won’t be 18 until January,",
         "great choice sir",
         "What state is this that lists your electors?",
         "Can someone vote the Socialists for me Pwease 🥺🥺🥺👉👈",
         "At least you voted correct",
         "Good job!",
         "why does this look like a drawing from the simpsons",
         "Me too and I'm 57! Hoping for the best.",
         "FYI: posting this in /r/pics will get you an immediate ban, if you're not already banned.",
         "NPL party?",
         "Likely because they printed the ballots before the Veeps were selected.  Or it could be the policy in that state.  If anyone has any insight into this, please share.",
         "I saw one trying, but was ignored.",
         "Oh yes there is only one correct viewpoint on everything over there.",
         "This is why: https://thefederalist.com/2024/10/29/busted-the-inside-story-of-how-the-kamala-harris-campaign-manipulates-reddit-and-breaks-the-rules-to-control-the-platform/",
         "Leave the sub and any other ones that have become 100% shill machines.  I've unsubbed from so many of the default and large ones that have gotten political.\n\nThen I see a pic of old man Walz ordering pizza, w 82k upvotes, laughable.",
         "Mods have to approve the post apparently",
         "People have already been banned for posting it",
         "I got banned on that sub for less this weekend.\n\n\nThe Harris Campaign posters, upvote bots and mods are in full force in the run up to the election on that sub.",
         "Saw one person say it took them 2 minutes to get banned.",
         "It would be a good experiment!  Let us know if you do.  I'd love to know what happens.",
         "Instantly",
         "It doesn’t take long in either sub, either way tbh.",
         "If she wins, it is good to know people legitimately voted for her. I voted Trump. I think he is the better choice, but to each their own.",
         "Even r/pics is all about politics lmao. Some people truly can't live their lives without politics. It's absolutely sad.",
         "Me too!",
         "What is your opinion on the possibility of Vance running in 2028? I’d personally love to see that as well as Candace Owens running as his VP. Vance/Owens 2028 kind of has a nice ring to it.",
         "Hopefully there’s many more in your state!!!!!",
         "Oh agreed!",
         "Candace Owens would have been an amazing choice for that. She’s awesome.",
         "It’s legal in my state. I looked it up before posting.",
         "Some states it’s illegal. In mine it’s not",
         "Only in some states.",
         "I had to wait till 21 to vote. 😭",
         "The Ballot would probably have Joe Biden on it if they made it prior to the VP picks lol",
         "This honestly might be one of the last subs that isn’t like that",
         "You can say that for all these political subs",
         "So? Manipulation is clearly fair game capitalism. What do you think Trump is doing? 🤣",
         "[I commented on a post](https://imgur.com/a/eDQ7uFF) in r/politics on Trump's remarks about sending Liz Cheney to war. \n\nMy post basically just said \"*You are all being disingenuous. What he actually said was ...*\"\n\nI got a ban for incivility linked to the offending comment. Thinking that this *must've* been a missed click on their part, I sent them a question about the ban.  [Luckily, they clarified for me what the issue was](https://imgur.com/gallery/BEoMBwm), and now I understand that they are being completely unbiased and fair.....\n\n>**Summerie**\n\n>It's \"incivility\" to call somebody disingenuous?  I can't think of a less offensive way to tell somebody that they are not being truthful.\n\n>**/politics mods**\n\n>Yes.\n\n>If you think someone else is engaging in bad faith, please file a report or write us a modmail if there's additional context that we need which won't fit in a custom report.\n\nIt blows my mind that they typed that out and sent it without an ounce of shame.",
         "It is sad to watch reddit go full partisan hack",
         "You get perma banned instantly.",
         "Reddit is a Liberal echochamber. It's hardly representative of the USA.",
         "Thanks for being reasonable while also being thoughtful enough to respect that there is more than one opinion.  We need more of it! 👏",
         "r/pics is Pro Liberal Politics, Anti Conservative Politics.",
         "I've been saying for years I'd love to have her in office. I love her book. She's such a smart and well articulated woman. She'd do amazing!",
         "Vance and owens are good , but id like to see tulsi gabbard as the first female president.",
         "I'd probably vote for him",
         "I’ll be 21 for the next one",
         "Oh that's true. It could be the state or even county.  They all do it their own way.",
         "I agree!!!",
         "Tbf democrats aren’t even allowed to post or comment on here about their beliefs, good chance this comment bans me or gets me reported.",
         "Perma ban is such a joke. It’s quite easy to make many accounts, unless they are capable of IP banning?",
         "Seems like most online platforms are. They must spend more time online than we do. Too busy at work. Lol. No but they spend all that time online and just read headlines and never deep dive into finding out the entire story so they know everything before jumping to conclusions. But some people just don’t have the capacity for it. Politics, no matter where you stand on them, is a very toxic rabbit hole to go down.",
         "Of course it doesn't. There are more English countries than just the USA and all of them are more left-wing.",
         "Not true at all. The only reason why trump won the other time was because the popular vote didn’t count as much as the electoral vote. He lost the popular vote each time.",
         "I think most of us are like that right now. It is the radical ones that stick out. But having an open and honest discussion, even if we disagree is a must for the success of our country. We used to agree on what should be done. We just disagreed on how to get there. Then would vote on that. I would love to be unified more. We need to vote on what is best for the people. Because politicians say one thing and do another. They lie, cheat and steal. No matter who we are talking about. They got there somehow. It isn’t easy. Don’t let them make it so we fight each other. We have a country of people to protect and build up.",
         "I won’t report you or even downvote you, but I also won’t feel bad because 98% or more of the subreddits currently are like that towards conservatives.",
         "Welcome to r/republican. We are open to your view points for a peaceful conversation.  I wish I could say the same for anything outside of a few subs.",
         "I would be skeptical of anything online. There are too many Democrats in every other country like Europe, Canada, Australia, etc.",
         "It's so true, but I for one am glad Elon bought X/Twitter.  I do believe he's fighting to protect free speech.",
         "The only reason Trump won the other time is because our electoral system doesn't rely on the popular vote and never has.",
         "Rule 5. Do not make comments consisting entirely of leftist talking points or defending leftist ideology.",
         "He Voted for Biden last election season. He did not appreciate how Biden treated him when it came to electric cars. Without Elon, electric cars would not have the popularity they do today. As a side note, we are still years away from having the infrastructure for them to really compete with gasoline powered vehicles. But I think having options is always a good thing. Don’t ban or push one or the other. Just have options and let it happen organically. Then when it came to his son transitioning, he did not like the way that was handled and started turning to the red side. I like Elons new mindset. I don’t agree with him on everything and thats ok. I agree that him buying twitter did have a big impact on this election season. As well as facebook interfering less. I don’t know about you guys, but I feel like trump won last time. I don’t think Biden had as much support. Now Hillary vs Trump. I totally thought Hillary was going to win. So many people wanted to make history with a black president and then a woman president. But going back to this election, no one liked Kamala. She dropped out. She is already the sitting vice president. If she wants to do something, she can. Right now. People see that. The people voting for her are the people that are anti trump. People who are aligning with identity politics and people who want to make history. I just don’t see any genuine support for Kamala. People that love Kamala for being Kamala. But we will see if the hate for trump is enough to keep him out of office. I just want the country to do well. So the people living in it can do well. Right now, I think Trump can do that for us. He learned a bunch and is doing much better with the way he handles things than he used to. I think he can get things done in a less divisive way and faster than he did before. Fingers crossed.",
         "Yes, but the name of the sub is \"Republican\".\n\nMeanwhile, Republicans get that same treatment in a sub named \"politics\".",
         "Well yeahh… its a partisan subreddit 😭",
         "I dont report anyone, didnt even know it was a rule. But to be fair it is like that on any partisan area, i got banned from r/fuckthealtright for something i said and i dont give a fuck about it. I wish r/politics wasnt partisan and actually allowed healthy discourse though."
      ]
   },
   "1gjp40l": {
      "title": "Republicans take lead in swing-state early voting",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "The Republicans are entering[ election day ](https://www.telegraph.co.uk/us/politics/2024/11/04/election-donald-trump-kamala-harris-live-updates/)with a historic lead in a majority of states, figures show.\n\nThis is the first time that registered Republicans have outvoted registered Democrats in more states since at least 2008, with early voting traditionally favoured by Democrats.\n\nAcross two-thirds of states that produce early voting data by party, registered Republicans outperformed the Democrats in votes cast.\n\nDespite the high numbers, nationally more votes have been cast for the Democrats because [some states have much bigger populations than others.](https://www.telegraph.co.uk/us/politics/2024/11/04/how-us-electoral-college-works-why-created/)\n\nCrucially, early voting among Republicans is higher in Nevada and North Carolina, two[ key swing states](https://www.telegraph.co.uk/us/politics/2024/11/01/what-is-swing-state-key-battlegrounds-us-election/) that will determine the election.\n\nThey have also overtaken Democrats in Iowa and Florida, two states that historically tend to lean Republican, but more recently went blue.\n\nArizona, another key state, was Republican before the 2016 election. In 2020, this lead went to the Democrats. However, this year Republicans lead once again with a margin of 41 per cent to 33 per cent.\n\nAcross all states, around 36 per cent of [votes cast before election day ](https://www.telegraph.co.uk/us/politics/2024/11/03/us-presidential-election-2024-when-dates-candidates-voting/)have come from registered Republicans, compared to the Democrats’ 37.9 per cent.\n\nThis is the slimmest national gap on record between the two parties and a reflection of changing views on early voting which, historically, has favoured the Democrats.\n\nIn 2020, just 30.5 per cent of early votes were made by registered Republicans.\n\nAs many politicians were encouraging early voting due to the coronavirus pandemic, Donald Trump repeatedly raised [suspicions about the practice.](https://www.telegraph.co.uk/us/politics/2024/10/31/polling-chaos-risk-undermining-us-election/)\n\nIn a series of tweets and conversations in September that year, he suggested that foreign countries could easily produce “counterfeit ballots”.\n\nHe stated that the ballots were “uncontrollable, totally open to election interference by foreign countries, and will lead to massive chaos and confusions”.\n\nBut this year, the Republican party has encouraged members to adopt early voting. This has led to a surge in Republicans voting which, in turn, has pushed early votes to historic highs.\n\nAs of Monday evening, 78,185,854 early votes had been cast, equivalent to 49.4 per cent of the 2020 electoral turnout.\n\nThis is almost two-thirds higher than in 2016, when around one in three votes were cast before the election.\n\n**Read more from The Telegraph:** [https://www.telegraph.co.uk/us/politics/2024/11/04/republicans-take-lead-in-swing-state-early-voting/](https://www.telegraph.co.uk/us/politics/2024/11/04/republicans-take-lead-in-swing-state-early-voting/)",
         "I’m in NC and am fairly sure the Independent early voters also outpaced Dems (saw it quickly on the news)",
         "Now we just need to finish the job, absolutely swamp the democrats with votes tommorow."
      ]
   },
   "1gj2utn": {
      "title": "So MUCH joy",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "This isn't 2008 and Harris isn't Obama or what Obama promised back then. Looking at these photographs it doesn't seem like the Obamas are having a good time.",
         "I couldn’t vote back in 2008, but regardless of opinions, it felt historic to see Obama become president. He was an outstanding public speaker who gave powerful speeches. But here we are, 16 years later, and they’re still holding on tightly to power, unwilling to let go.\n\nFormer presidents really should take a step back instead of campaigning for the next candidate—it’s too biased and disrupts the balance we need in the process.",
         "His brother even endorsed Trump lol..",
         "Biden turning it all over to Harris was has given them both the epitome of joy!",
         "the blues approach to treating everyone as kids being told off in order to force us to vote for them isn't really working as well this time around.",
         "Obamna",
         "You can almost swap their faces.",
         "God, she is so unattractive 🫢\n\nI use She lightly, cause she looks more like a man",
         "Those guys look like they have had a ruff couple months",
         "All our enemies are suffering, and that is good.",
         "She makes maxine waters look like a super model",
         "They want to be unburdened by what has been.",
         "Top and bottom",
         "The haters are still hating lmao. The Obamas literally hate everyone except Oprah because they liked her money.",
         "I didn’t pay much attention to Obama in high school, and even kind of liked him because I didn’t know much. Now when I look at him and hear him talk, he’s got an evil bad vibe to him. Pretty sure he’s friends with Castro’s brother who loves killing people too.",
         "2 men!!",
         "Just 2 dudes hanging out",
         "Please get them outta here",
         "They had to go to work. They didn’t want that.",
         "That's what Evil looks like",
         "Just 2 Men mad at the world!!!!",
         "Right! 😂 More like really worried! Notice how frail they look.",
         "I guess being mob bosses isn’t as glamorous as the movies portray. \n\n🤷🏼‍♂️ Who knew?",
         "No one has a good time being potus. You’d have to enjoy half a nation hating you. Who could do that?",
         "Obama, Biden, Harris basically fucked over her own entire party",
         "They don’t care, it’s not about a single president anymore it’s about this corrupt group that runs everything, Trump stands in their way to complete and total power.",
         "I agree with that. I think ex presidents can have a few words in too see who they can potentially vouch for but all and all they shouldn’t campaign for someone else. It just sounds way too desperate for attention. “All or nothing “ playbook is just a form of fear mongering.",
         "[deleted]",
         "[removed]",
         "And america!!",
         "It's become more of a popularity contest. It's all about making yourself look good and make the other look like a fool."
      ]
   },
   "1gjruv5": {
      "title": "Voting has consequence's ",
      "text": "Whenever the rubber meets the road you may get a loud sequel.",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*"
      ]
   },
   "1gji9xu": {
      "title": "Kudos to CNN for the honest reporting",
      "text": "https://x.com/shaunmmaguire/status/1852716609749516696",
      "comments": []
   },
   "1gjj53s": {
      "title": "Check out this nifty chart",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "I simply don’t even know how this race is close and how people agree with Kamala. May I ask, where did you find this fact sheet? Is this from an unbiased news source?",
         "I have a sneaking suspicion that it’s from millionvoices.org",
         "I bet if you asked a democrat to check off agree ot disagree there with no indication as to what is associated with whom/which party, they'd agree more with the republican side than they even think.\n\nEdit: most that I know are simply, Blue no matter who.",
         "Oh boy my comment looks pretty dumb, I just noticed the big text that says it haha!",
         "Honestly, this sounds very accurate. They would probably also say that Trump is a liar and won’t deliver. It’s impossible to argue with people who are very opinionated."
      ]
   },
   "1gjiwe5": {
      "title": "Compare and Contrast",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "👋 Waves 👋 at woke dude for Horrible Harris humping the down vote button. Dude that shade of lipstick is so not you. 😄",
         "That’s it in a nutshell! But that’s also literally their only message on the left."
      ]
   },
   "1gjadk0": {
      "title": "Are you ready to win?",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "I’m honestly terrified. One moment I think there’s no way Kamala will win, the next I think she will.",
         "Ready but the fight starts afterwards",
         "Everyone needs to get out and vote"
      ]
   },
   "1gj2i9e": {
      "title": "Georgia's nearly 4 million early votes bode well for Trump, top state Republican says | Fox News",
      "text": "",
      "comments": [
         "Apparently pa too. 500 thousand votes shifted to the Republican side here. Biden won 2020 here by only small margins",
         "And the closer to election day the better. Nov 5th is a red voting day",
         "If this number is true its insurmountable for dems, that's a 1 million point swing",
         "Don’t put anything past them.  We know what they’ve done in the past and how desperate they are to cling on to power!"
      ]
   },
   "1gist83": {
      "title": "Charlie Kirk - We need 3 million Trump voters to show up in Pennsylvania on Tuesday to win!",
      "text": "https://x.com/leslibless/status/1853064318658478485",
      "comments": [
         "Our family of 3 will be there, voting red all the way",
         "Remember folks show up early, prepared, and bring people with you. Work together and we can win this!",
         "My whole extended family of 10 will be there and we’ll all be voting red.",
         "turned 18 9 days ago. voting trump",
         "Please vote people. Get everybody you know to vote RED. This has to be a collective effort! ",
         "Keep pouring it on! Rasmussen’s head pollster, Mark Mitchell, suggests Trump is poised to secure a landslide victory that could resemble Ronald Reagan’s historic landslide win over Jimmy Carter in 1980.",
         "This is awesome!  Only 3 million?  And I tallied up the votes from this thread and we’re already at…13.  Yay!",
         "How many voted Day Of in 2020 for DJT?   Just want to know what it was last time.",
         "I don’t care how, just come up with the votes.",
         "Check in with friends, extended family, and neighbors to make sure they’re voting too. PA is critical",
         "Bless you. Stay safe.",
         "🫡",
         "Happy Birthday.  I hope you get a gift that makes things great again, lasts 4 years, and pays dividends for the rest of your lifetime!",
         "Be a good influence to your friends. Cheers.",
         "Make sure to register",
         "From someone who doesn't know much about pollsters, (me), are there specific ones who are more trustworthy than others? It's so frustrating to hear different things from different people.",
         "May God intervene once more and allow us to have peace on this planet.",
         "Voted early this year, voted in person in 2020",
         "Legally",
         "You should care how",
         "Trafalgar, Rasmussen.",
         "Same here.  But still want to know what the day of count was for 2020.",
         "Normally, I'd agree, but since the liberals don't play by that rule, we need to do whatever it takes to win so we can fix it.",
         "That’s traitor speak. A vague concept of liberals cheating isn’t enough proof to condone “whatever it takes to win”.",
         "That’s a negative, ghost rider. We have to be the better people. Showing weakness if we cheat anything.",
         "So you want to become like them??? Absolutely not. Don’t stoop to their level and give them something to throw back at us.",
         "Agreed, let’s not destroy democracy anymore than it already has. Real goal should be exposing voter fraud, then again knowing democratic party voters.. they wouldn’t care if their side cheated.",
         "A vague concept? So you're willing to lose and our country lose because we didn't do anything why they cheat?.. That make sense, I guess",
         "Again, I normally agree, but when that doesn't work, then what?",
         "Stand by a let them destroy democracy and show the fraud like we have and let nothing happen. Got it.",
         "Tell me exactly what they are doing to cheat.",
         "Are you for real? Fulton County was taking ballots with no republican poll watcher. They tried to keep illegals on in Virginia. Pennsylvania had most only democrat poll watchers until they got sued. Their is a lot more like this going on"
      ]
   },
   "1gj7onn": {
      "title": "I did my job in California.",
      "text": "",
      "comments": [
         "Your new job is to move to a better state",
         "Alright, alright! Job well done.",
         "Nah…. We stay and fight in here. Never give up!",
         "I commend you... Plus weather and golf year round!\n\nTrump2024 from MN."
      ]
   },
   "1gj4ic4": {
      "title": "Orkin Releases 'Rattiest Cities List' and Democrats Won't Want You to Make the Connection",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Ewwe . Gross.",
         "More people in a city = leans Democrat \n\nBigger city = more food for rats not as spread out",
         "NY... Made the list 5 times. 😳👍",
         "It must be that (D)ifference again. 😆"
      ]
   }
}