{
   "1gksukk": {
      "title": "Congratulations everyone! We did it! While rest of Reddit sulks, let us all celebrate. Salud!🍻 ",
      "text": "Love from Canada 🇨🇦❤️🇺🇸",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "I’ve not seen Reddit and all the left subs so quiet in a month 😂😂😂",
         "Maybe Democrats will learn to not appoint a candidate in the future without a primary vote… \n\nCrazy that they were the ones saying we were a danger to Democracy while they actively dismissed Democratic processes.",
         "I have heard that they are Mourning in r/pics and have announced that for three days no pictures will be posted.",
         "I’d upvote you but look like Reddit’s not allowing that right now. 🙄",
         "I’m not conservative by any means, but my disdain for the DNC, liberals & the complacency of dems have only grown into hate\n\nI may not share the same views as the majority of this sub; but one thing I know we all can agree with, and by the looks of it the majority of Americans, is how weak & feckless Democrats are & their inability to do anything meaningful because of a silly naive belief that our institutions are to be relied on without question & are without fault; which is at the core of liberalism\n\nPeople are angry; we’re tired, we’re overworked, underpaid & shits fucking expensive. The empty promises made by any politician only further fuels the divide.\n\nThe smugness & elitism attitude liberals tend to portray themselves as, backfires in their face every time\n\nTrump is seen as essentially a wrecking ball to the institutional sectors of our government & honestly I don’t blame the majority voting for him for that very reason\n\nAnd quite honestly, fuck it.\n\nEdit: This is my NSFW profile. Just a fair warning if you snoop lmao",
         "Let’s go! 🇺🇸❤️",
         "Went to a lot of /reddits (pics, New Jersey, Texas, democrats, etc) everyone is quiet lol\nI’m ready for the meltdown",
         "We did it! ",
         "Big huge win",
         "Well done, red wave!",
         "Salud🍷 MAGA",
         "Salud",
         "If Kamala had won, the trending topics would be all over it. Instead..*silence*… & I’m here for all of it. Suck it libs",
         "I’ll be having fun talkin my shit too 😂 seen so many panic attack post today",
         "Maga",
         "Brace yourself for all the lawsuits that the Dems will undoubtedly pursue. They will scramble for new charges and try to implement all his punishments handed down already before he takes office. They will not go peacefully.",
         "So much for turning Florida blue.\n\nDon't you make my red state\n\nDon't you make my red state\n\nDon't you make my red state blueeeee!",
         "Reddit did its best to suppress conservative posts.  Downvoting, hidden comments, shadow bans, outright ban.  Didn’t work.  Truth cannot be suppressed",
         "God Bless DJT, JD and the USA",
         "Woke up to a Red Kingdom… God Bless America",
         "If I wasn’t pregnant, I’d raise a pint!",
         "Watching different stations this morning and a lot of the reporters seem shocked that Trump won the majority of the minority vote. \n\nTruly, this is not a shock. Trump ran on a platform of AMERICA for AMERICANS, all Americans, regardless of skin color or ethnic origin. \n\nKamala and the Democrats were so keen on “separating” Americans into different groups to appeal to these groups specifically, and with that completely missed the larger picture.",
         "Bro their feeds are, Harris wins Colorado, Bernie sanders wins for his state.. I left a message to the democrat sub saying I’ve been banned and downvoted to hell over this election and by just saying I’ll vote for trump. I said respectfully fuck all of you lmao",
         "Absolute meltdown on r/politics. They think Trump voters are idiots and billionaires will now control the fate of the u.s.The delusion and stupidity of the left is on full display in their comments.",
         "The man was impeached, arrested, shot at, and said F you I'm still here. \n\nTrump 2024.",
         "Yep my bans will be over soon...maybe",
         "Bots are going crazy now",
         "That amount of doom and gloom is hilarious lol. Maybe after 4 years some of them will have the humility to admit they were wrong and everything is going to be ok.",
         "As the liberal tears begin to fall, I would just like to say thank you to everyone that still believes in this great country. This election showed that Americans are not backing away from their morals and beliefs",
         "Hi Canada! We love you back! \n\nAmericans really aren’t the garbage the left wants you to believe we are. \n\nAnd we don’t want or need a second mom going around ruining life to protect us from scary things like thinking and ourselves.",
         "We also won the popular vote too boys",
         "I'm seeing some really sad stuff on here and while I'm happy Trump won it's breaking my heart to see just how hateful dems really are. But 🍻 to trump winning",
         "Seeing the liberal tears fall was my reason for opening Reddit this morning.",
         "NOOOOOO BUT ABORTION IS THE NUMBER 1 MOST CRITICAL ISSUE IN THIS COUNTRY. WW3 IS AFOOT OVER THE RIGHT TO MURDER UNBORN CHILDREN!!!! 😭😭😭😭\n\nLol. Unbelievable people vote one way because state’s have the right to choose their abortion laws now. Boohoo.",
         "Woo hooooooo!!!! We did it!",
         "🥳",
         "MAGA! No more 51k bot upvoted Kamala pics!!",
         "From Paraguay, I'm drinking to this, salud and congrats!",
         "Reddit is amazing right now. Happy victory Wednesday my fellow republicans",
         "I was so excited to come into my Dem centric office today in Center City Philadelphia. I have had to listen to them praise Kamala every day for the past few months. It's so quiet today you could hear a pin drop.",
         "Now that the adults have spoken, I feel a huge sense of relief! The nonsense had to end at some point. \n\nHe won the electoral college AND the popular vote! I’m so proud of America for doing what’s best for our country!",
         "#EVERYONE GET IN HERE!!! 🍻",
         "Wahoo!  Electoral and popular vote!",
         "Blue hair’s in shambles",
         "Yuge",
         "Party time",
         "It’s beautiful 🥹",
         "It is so very satisfying!!!!",
         "God Bless America. The good still outnumber the evil!",
         "So happy for all you patriots… might not be American but this is also a win for the world…",
         "I feel the biggest relief waking up this morning. I’ve been so worried about our future, especially my child’s. \n\nNo more criminals passing through our borders \nNo more high prices in everything \nNo more threat of men coming into my bathroom \nNo more push for defunding the police\nNo more attacking our children with gender bullshit. I’ll feel more confident with putting my child in school now. \n\nWith the stress of 2020, then the riots, the uncertainty if I’ll have a job because of the vaccine mandates, then the borders, and the uncertainty with the multiple wars…the uncertainty of being able to afford necessities…I can now finally breathe  now…SIGH\n\n🇺🇸",
         "Unreal. Trump is a once in a generation talent. I’m amazed. \n\nWe have a four year reprieve from The Left’s vision of totalitarian rule. Will we get more than that? Depends upon actions taken by Trump. We can talk about that after the transfer of power on Jan 20th.\n\nFree people rejoice, it looked like a the Left would have a thousand year rule across the globe just a few years ago.",
         "🇺🇸🇨🇦",
         "SALUD 🍻",
         "Stocks are surging higher this morning!",
         "Thank goodness he won",
         "So relieved that this country still has a fighting chance now. Good work everyone!",
         "She had ample time to do something as VP and just could never answer the question, \"What will you do differently than sleepy Joe?\". Congratulations fellow conservatives. Job well done.",
         "I can’t freaking believe it. I feel like I can breathe again for the first time in four years.",
         "HOLLAAAAAAAAAAA WELCOME BACK DADDDDY",
         "I’m part of a NA sub and I just saw a post “idk how I’m going to stay sober now that Trump has won.”  🙄🙄🙄 thankfully no one was feeding into their bs. “Waaah Trump made me relapse.” I’d love to see someone say that in an actual meeting and watch other peoples reactions. I’ve seen people who took their sobriety seriously relapse due to loved ones dying or losing their jobs or homes. For example, there was a mother who was clean for 20 plus years and unfortunately her daughter who rarely used drugs overdosed on a fake Xanax (laced with fentanyl). Her daughter was only 17 when she died. That poor lady wanted to end her life by taking a hot shot and it took her everything in her power to not do that. I’m sorry if you relapse because of a political election then you probably didn’t want to get clean in the first place, that or you just want attention. I’m trying so hard to just stay quiet because I don’t want to get banned.",
         "FUCK YEAH!! AMERICA HAS SPOKEN!!! SOON THE WORLD!!!!",
         "Hard-core lib who has definitely argued with a bunch of people in here. A big wakeup call for us dems fs, but you guys won fair and square, respect.",
         "YES!!!!!!!!",
         "Let’s celebrate by watching the libs have meltdowns",
         "Were.....TURNING THE PAGE!",
         "Why are we posting here.... im prettyvsure we get r/politics now right??",
         "Michael Moore, enjoy your toast this morning.",
         "Group therapy time lol",
         "Amen, Good riddance!",
         "I’m English and stayed up till about 5am (was well over by then about 90% counted in the last few states) before I fell asleep. Watching the democrats slowly realising as they started losing the battlegrounds was one of the funniest things I’ve ever seen. \n\nFor what it’s worth at my age (30) last night felt like one of the most important nights of my life and I haven’t been to the USA in about 16 years. Ironically was California, FUCK that now 🤣\n\nCertainly very happy for you lot, and when I do come over to do some diving it’ll be Florida this time 🫡",
         "I’m totally watching The View today for the first and only time in my life! Should be a good meltdown.",
         "Oh yeah baby, four years of peace and economic success",
         "Haven't seen any mass moving trucks heading to LA or NY for all those celebrities....",
         "I love the tears, on just about every subreddit.",
         "LETS GOOOOOOOO",
         "Funny how the day after an election all the “normal” non-political subs allow political satire and commentary, memes, and general politics when they normally don’t.",
         "Something to be said about our silent majority here. Sure we get muted and bashed on reddit... but the sane hardworking Americans made their opinion known yesterday!!",
         "Republicans went out and ABSOLUTELY SMASHED the voting booths. I’m so proud of everyone and thankful for this victory. Cheers everyone!!",
         "Cheers! MAGA 🦅🇺🇸",
         "Cheerio!!!",
         "Love it. A day for them to realise that they don't know everything.",
         "Honestly i’m surprised the NYC reddit is almost some what republican, somewhat reflecting what happend there this election. RED WAVE BABY.",
         "What an absolute glorious moment in time!! I’m not fully convinced that Trump can do all he has set out to do in the face of the political climate in the world but I know he will try to make tangible changes to the deep states hold on the country.",
         "Fellow Canadian I am ecstatic right now!",
         "😂😂😂😂 I just opened Reddit expecting it to be a mad house and this is the first post I saw. Woohoo!!",
         "Proof that the American people care more about our border, economy, inflation, than they do your feelings. DJT!",
         "DADDYS HOME!!!",
         "LFG, Christmas morning is upon us",
         "It’s almost like running a whole campaign on emotional responses to abortion (that’s up to the states anyway) and calling someone Hitler doesn’t work. Loved the turnout with minorities for Trump.",
         "What’s funny is how much hate they spew and they still can’t understand why the majority of the country decided to vote against them… I cannot explain how satisfying this feels… I am just so excited to have team sanity back in the WH. Now comes the real work",
         "It's a good day for our side, fam.  Controlling inflation and the border need to be the first focus ... they need to take advantage of possibly getting complete power (if we get the House).\n\nSCOTUS - anyone that wants to retire should announce it this coming February.",
         "We did do it and I knew we would ! She had no background or backbone. She kept the Biden lie going. \nNow we need to start prepping someone.",
         "Was a very nice way to wake up.\n\n(This comment doubles as my incoming \"Banned from other subreddits for participating in a 'hate speech' sub)",
         "Yay!!!!",
         "Let’s fucking go!!!!!",
         "RGR",
         "Dems over on X saying we cheated and for Kamala not to concede that their needs to be a recount.....",
         "YEA! 🇺🇸🦅🦅🦅 normally I stick to X but I found my people here",
         "Salud indeed!",
         "Yeah! Hopefully he can institute change in the 4 years he has. I pray he is safe and no one shoots or kills him.",
         "[https://babylonbee.com/news/trump-wins-3rd-election-in-a-row](https://babylonbee.com/news/trump-wins-3rd-election-in-a-row)",
         "Blasting YMCA all day 🥳🇺🇸",
         "Cheers!",
         "The Dems are planning \"revenge of the Sith Dems.\" Donald should sign the insurrection documents in January ASAP.",
         "Yes, but let's be classy about it. Take the high road.",
         "🥂 LET'S PARTY!! WOOHOO!!🥳",
         "Congratulations all! With a clean sweep we really should be able to make some real progress!",
         "Thank GOD for finally opening their eyes.........",
         "We're so back baby",
         "Yeah… I told my mom yesterday… REDDIT IS GONNA BE SOOOOOO MAD! Hahahahahahahahaha TRUMP BABYYYYY!",
         "This is unbelievable. Imagine the courts!",
         "Woohoo for us the internet aware normies",
         "USA USA USA!",
         "A bunch of us are watching the View for the first time to see the meltdown.",
         "Well I’ve been banned from a group for “edgelording, and spreading Trumps lies.” Lol. This is absolutely hilarious and ridiculous at the same time.\n\nFor anyone interested in the comment that got me permabanned:\n“You know Trump wants to force ALL healthcare providers to offer IVF coverage? He actually mentioned this policy plan before Kamala, ANNNNND rvw is a Supreme Court issue. The president can try to push the issue but they don’t make the decision... Trump’s stance on abortion is that it should be elective up to 24 weeks, with the exception of life threatening circumstances. I know people aren’t going to receive this comment well so I’m just going to stop there.\n(ALSO, I have struggled with infertility for over 4 years with multiple losses and no LC. So this IS a concern for me.)”",
         "Proud man from England here, I'm glad you've won tonight as it bodes well for my country too. Well done all! It just shows that the majority of Americans aren't as stupid as we think, just the blue minority half are the loudest.",
         "We the people have freaking spoken loud and clear. America played NO games last night and it's beautiful. 🇺🇲🇺🇲",
         "Strolled into work today (where a ton of employees are liberal) doing the Conor McGregor strut. :D",
         "Listen, you have no excuses to get shit done with control over everything…don’t fuck it up. Our future depends on unity and moving forward.",
         "I'm so happy right now it's like a dream come true.",
         "Yessss!!",
         "GO TRUMP! God blessed America!!!!\n\n#MAGA!!!!",
         "Democrats have been a fear mongering machine!  Using apocalyptic language against their opponent to put fear in their base.  For many that fear is really in their heads - shame on democrats for doing that to people.  However, many have not been buying the rhetoric and have switched parties and their eyes have opened up.",
         "There’s a post in r/Georgia that says they want to become pregnant in the next year, but are scared to now. They asked what will happen if “something happens” during the pregnancy now that Trump will take over.\n\nThese democrats just want the easy way out of everything. If your child has developmental issues or delays or an extra chromosome, that doesn’t mean something is “wrong.” Grow the fu!k up and learn that babies born with special needs are human beings. They still deserve life. \n\nLife won’t be easy, but no one’s life - regardless of your ailments, ability or what have you upon birth - is ever promised to be easy. \n\nThey could easily be talking about the health of the mother too, which I realize that, but as a sister of someone with special needs that post really pissed me off this morning.",
         "Cheers all🍸",
         "Had a 🍺",
         "Now is the time to extend the Olive Branch?………. Naw fuck that!  We know that doesn’t work.  Like Conan said the good things in life are, “To crush your enemies, to drive them before you and to hear the lamentation of their women. Trump needs to get to work, soonest.",
         "Woooooooooooooooooooooo!!!",
         "Exactly!!!",
         "🇺🇸🍻",
         "Gotta love it",
         "Most amazing news. Amen",
         "Amen",
         "Karma is a bitch",
         "Awesome! 😝 \nAll the subs that are locked just blows my mind.",
         "Hell yeah!!!! Common sense prevailed!!",
         "Hell yeah! 🇺🇸🥳",
         "TRUMP 2024!!!! Salud!!!",
         "But wait.  This is the end of country, and maybe e\nThe world!!  Just ask Deniro.  Fucktards",
         "Cheers",
         "Chin chin!",
         "Unhinged Democrats will stir up something and create chaos in the days leading up to inauguration on Jan 20th. There will be some drama …. I am pretty sure. And dont forget the MSM owned by liberals. Lets see if they change their rhetoric towards Trump or still continue to call him Dictator or Hitler or Fascist or Racist or GARBAGE. Only Time would tell. I am so glad TRUMP is our 47th President.",
         "Well done folks! The United States couldn’t endure another 4 years of open borders and weak leadership. It would’ve been the end of this great country… Now we sail on the tide of Freedom, with affordable cost of living, secure borders, and most importantly, respect from other world leaders. 🇺🇸",
         "So darn happy last night!  I never stay up late but boy did I last night/this morning.  To heck with the redditors!  Hopefully Trump gets retribution for everything they out him through.",
         "Astroturfing didn’t work",
         "WOOoOoOoOoOoOoOOOOOOO",
         "Nice !!",
         "🍻",
         "YOUNG MAN!",
         "it great thing",
         "I didn’t think it would be this……easy.",
         "Tell it to your mamala Kamala",
         "Michigans sub is all about Gretchen being pres in 2028 already 🙃",
         "Bro every left sub is panicking and crying about Trump being President now when nothing bad will happen to them \n\nIt's laughable pathetic",
         "W",
         "We did it bois and girls",
         "Now do something meaningful. Fix healthcare. Fix Social Security. Fix extreme income inequality. Stop committing political suicide on the hill of banning abortion.",
         "I am very curious to see what kind of president he shall be the second time around.",
         "Your turn soon",
         "They really just need to move on and be unburdened by what has been lolololol",
         "You’ll see what Reddit is up to rn if you sort by popular, it is in shambles",
         "Her campaign was totally focused on fear mongering. Her supporters are probably hiding in bomb shelters!",
         "Facebook. I don’t see them saying anything lol",
         "They don't get it. They don't understand. They still believe all the bad scary stuff is still gonna happen. I can't wait to troll some of them when 2025 doesn't materialize as any policy.",
         "The money dried up. They will find a new sugar daddy soon enough to tell them what to say. I don’t even know where they go from the kill babies coalition. It lost. They torched and alienated everyone who had any other issue. They are ours now. So what’s is left for them to talk about?",
         "IT'S GENUINELY BEAUTIFUL!!! And I'm not even in the same continent ❤️",
         "I mean, what would you like them to say? Lol. They’re not going to contest this or say that this was a fake election. That’s foolishness, just as it was back in 2020. Not trying to stir up anything but I think people should just accept things for what they are.",
         "Lmao, literally 😂😂",
         "/r/pics is a shambles 😂",
         "They’re all waking up to this! https://youtu.be/09RnYVGThng?si=InnGcAtMC8hgtd1K\n\nPoor kids.",
         "I believe it’s primarily her fault they lost, if not her the conspiring of her entire party. They all presented Biden as fine until it couldn’t be hidden at the debate. Then last minute she swoops in to secure the nomination. I believe the whole time she knew everything she strategized for her own selfish gain against her party interests. They really gave her a 50% chance to win when she had like what a 9% favorability rating in the democratic caucuses in 2020? The democrats failed their own party trying to keep up a lie for one man.",
         "Her post election autopsy is going to be interesting. What exactly was the tipping point for the swing voters. Tying herself to an unpopular president probably didn’t help her chances",
         "Someone put it great last night, and on NBC of all places. \n\n“They’ve made this campaign more about hating Donald Trump than being an actual party”",
         "Correct. Biden’s cognitive decline was increasingly getting worse and the DNC knew that. They panicked and threw Harris in the front seat without a primary. When asked what she planned on doing differently from Biden, she literally said nothing comes to mind. That was the first of many nails in her coffin and voters began to see she was just going to be an extension of the last four years.",
         "That is absolutely hysterical 🤣",
         "From the little I've seen a lot of the propaganda bots have left and a few people are actually celebrating",
         "No joke, every political thread in my state’s sub is locked.",
         "And I’m so ready for Bobby to take action and get the chemicals that are banned in other countries, OUT of our food!",
         "I voted for Harris, but I agree. I've had enough of this bs where democrats pander to the woke shit and dont show any sort of backbone. I don't regret not voting for Trump, but I should have voted third party.",
         "Well said",
         "You should see the GenZ sub, they are having insane meltdowns while not being able to read above a 5th grade level graduating high school these days.",
         "I'm pretty confident they'll meltdown in private then switch to Trump hate.\n\n\"Trump saves nun from burning building\"\n\n=\n\n\"Trump forcibly abuses nun while removing her from her home\"",
         "Turn on msnbc. That woman is nearly in tears. Dressed in black.",
         "My city sub, which is stated apolitical, was not just a little while ago. I won't post it, but verbally told them to suck it, lol",
         "🙌🏻",
         "They’re so off center too lmao. The amount of “women, how are you doing this morning” and “you won’t have more money btw” posts that I’ve seen is insane. Trump should implement some more education for the general public while he’s at it because clearly there’s a major issue 😭",
         "What’s funny is people say “he’s a convicted felon” all of the time… but he was never convicted— he was indicted but the charges were dropped. 🤦🏽‍♀️ Just goes to show people don’t understand how our government works.",
         "i was worried that it would be close and it would get messy but it is over. complete sweep total democratic annihilation. there wont be anything. there is nothing for them to do but look to 2028.",
         "I think that’s dramatic. I don’t think anyone will do anything. It’ll be a quick four years and we’ll be back again with new candidates.",
         "Nor the will of the people. We didn't just speak, we ROARED!",
         "AND RFK. If the DuNCes hadn’t blocked RFK— he would’ve had my vote. But their crooked attempt to keep him out of office is what pushed me to vote Trump. MAGA/MAHA all the way!!",
         "Congratulations 🎉",
         "Same",
         "Hahaha. Do it. 🤣 Vance ‘28!",
         "I am glad we have been unburdened of Kamala.",
         "Did we just turn the page on what has been our burden?",
         "Some are saying that the next couple of years are going to be dark times, indeed.  And, even tho they do not believe in the 2nd amendment, they might now be buying a gun and learning how to use it",
         "😂😂",
         "Gold.",
         "They need to learn how to stop banning people for nothing, because all it does is trick democrats into thinking that there is no opposing views. Already have seen numerous posts about how they only saw Kamala love and that nobody they ever chat with here are opposed to their view.. Well yah, because they get banned so quickly.",
         "The silent people have spoken, Reddit isn’t everything - that must hurt",
         "💀",
         "Ohhh I’ve been lol",
         "Yup same shit. ALS quiet in the land of smelly cheese",
         "I think you underestimate the sheer lunacy of the left if you think they’re just gonna lie down and take it. News stories today will be unhinged as they  possibly can be. Should be quite entertaining to see lol",
         "I vote based off policy but Kamala didn’t do it for me this year, she was very arrogant and I hated how she only appealing to people with no policy. I still can’t find what she was running on besides giving money out and Charli XCX. At the end of the day, this is a politician who rather than make any important speeches would rather make TikTok’s to Charli. We need professionalism, policy, and not relying on the teenagers. The brat summer that was popular among young voters but more popular among people who are not of age to vote. Her campaign didn’t reach out to the elderly, or gen X. Just Gen Z which a good chunk of that generation is under age.",
         "They need to do some deep soul searching. I am a middle of the road guy that felt really turned off with the left for many reasons. A few are the weaponization of the DOJ, the hateful rhetoric that led to 2 assassination attempts, celebrating abortion. Many more to list.",
         "Her choosing the worst possible candidate for VP didn't help. I swear to God Biden must have said \"I chose the dumbest VP\" and she said \"hold my beer\".",
         "They did that in 2020 and it was successful so why not? \n\nUnfortunately they did not factor in that Americans now knew the consequences of voting only against Trump and found that Trump was actually the better reality.",
         "I know and I can't decide whether that's hilarious or pathetic",
         "Yep. PA is locked down.\nWOOHOO!!!",
         "Yes, please! I don't have much to say about fluoride since I grew up on well water as did my son, but I really want to see red dye to be banned like Europe.",
         "I also voted for Harris begrudgingly; her campaign was a mess once the DNC started fucking with it. Pandering to the center, attempting to “meet in the middle”, repeating the same monotone lines about Gaza  \n\nWhen I noticed her tone shifting in an attempt to be perceived as more moderate, that’s when I knew Democrats have STILL yet to learn from their past failures \n\nIt’s the same fucking cycle over and over and over \n\nCompletely inept and incompetent",
         "\"...while *evicting* her from her home.\"",
         "Thank youuuu!! This baby is very wanted, and we are so excited!!",
         "More people need to hear Vance talk. That mans got a great mind!",
         "She couldn't even make a speech to her supporters who waited outside for her all night.\n\nThis is a person who lacks integrity and doesn't know who she is.\n\nEvil has been defeated.",
         "Amen!",
         "I'll give lessons",
         "Exactly.  Juan Williams on Fox last night was attributing it to racism of the bros.  Was nice to see Harold Ford push back on him, but dude was sticking with the line that the racist/sexist bros wouldn't vote for a woman of color.",
         "There’s nothing they can do besides talk about it, and that will have equally minimal impact. It’ll die down. Just have to wait it out. I’m not underestimating anything, I just don’t think there’s a reason for me to be so concerned or stressed. If anything, I think that’s a bit dramatic. He won, there’s nothing to be done.",
         "Fun fact, planned parenthood was invented by Margaret Sanger, who, had a husband in the KKK, and invented this to eradicate \"less desirable\" babies. And when Nazis were in court, they used her planned parenthood book as an excuse and some of them got off. They also used to give out Margaret Sanger awards, and Hillary Clinton received one. And they fight for this. ",
         "That too, msm described Vance as the worst VP pick and Walz as the perfect VP pick. \n\nCrazy how wrong that was. They too, were so fixated on the demographics of their picks and not the actual capabilities, experience and competence of their picks.",
         "I’m getting creamed over in r/videos this morning. They posted today’s song was American Idiot by Green Day. Then they’re trying to take the moral high ground. I’m like dudes you’re calling the majority of voters idiots. You don’t have the high ground.",
         "💕💕 so happy for you!!",
         "Vance has been one of my favorite surprises of this cycle. I love watching the media try to back him into a corner. He’s too smart for every one of them. Always comes out on top.",
         "She pulled a Hillary lmao",
         "She canceled her speech and her campaign workers sent everyone home. It was no longer a celebration.",
         "Sore l00ser haha, disrespectful as hell to the fools who were there 😂",
         "You are right! They literally waited for her for 12+ hours, and she never came! When they found out they lost they all left really quick and nobody has heard from Kamala since. SORE LOSER!!! At least Trump would accept it! (But he doesn’t have to cause he WON!!!!!)",
         "I felt bad for all those people standing around waiting...then they were told she would not be there.  It shows how she really feels about her voters.",
         "If they cared even 2% about competence, Harris would still be fucking up California. That state can't seem to drop the very people everyone else despises, like Pelosi and Schiff? She's the queen of insider trading and a lush and he looks like a damn weasel. Slimy little bugger. I simply don't understand. Do the voters not care about the condition of SF that they see every single day? Why?",
         "I agree!",
         "The disappointment was \"hillaryous\"",
         "Idk if she's even a sore loser more than an incompetent one. She probably doesn't know how to handle it, like how she can't handle interviews or the border.",
         "Their hopes were dashed away along with their spirits by that move.",
         "That was a stretch but I’ll give you my upvote😂"
      ]
   },
   "1gkt0sk": {
      "title": "TRUMP WON! WE'RE SO BACK!",
      "text": "",
      "comments": [
         "Reddit is mostly in melt down mode right now.",
         "Not only did he win, he's going to completely dominate the electoral vote and win  the popular vote",
         "The party is over. Time for Oprah, Beyonce, and all the rest to pack their shit and move abroad. 🥂",
         "Even Hillary had enough class to call the man and concede. Guess there's not much cackling coming from the cackler tonight",
         "Black man who voted for Trump here. Sry more of my demographic didn't come out but they are making progress. MAGA 2024!! LFG",
         "KAMALA YOUER FIRED!!!!!! GTF OUT OF HERE!!!! \n\nSick of these asshole democrats making life harder for us, they can all go straight to hell! ",
         "The smearing campaign that happened on reddit for the last 2 months has backfired massively😂😂 as a Canadian I'm happy for america that Commiela didnt win, and can't wait for 4 more years of crying liberals! Hopefully we can get a new leader soon 🇨🇦🤝🇺🇸",
         "I WOKE UP SO LATE THIS MORNING BUT TRUMP WON! CHRIST IS KING! GOD IS WITH US!",
         "The left can't whine that trump didn't win the popular vote this time, they are a bunch of cry babies",
         "Look at how much the gap closed in some of those blue states… like holy crap, NY and NJ had a heck of a turnout… he’s on track to win the popular vote too.",
         "the amish had enough",
         "Proud to be a fucking American 🇺🇸!",
         "R/pics having a breakdown ! Suffer libs !!",
         "I love how the map you posted called it with … what I’m assuming is Alaska and one Maine vote? The mainstream media wouldn’t call this for another three hours and then they credited Wisconsin. But I love that rural voters pushed it over!!! They should get full credit. I don’t know if that is a narrative that is being purposefully avoided? Maybe because campaigning in a rural area is virtually impossible. But I love rural America so let’s give them credit where credit is due.",
         "I wonder if Dems still want to expand the court?",
         "Fk out of here democrats. I used to vote democrat but I voted for Trump this year. Tired of how hateful democrats are.",
         "Now comes all the crying about how we have to get rid of the electoral college despite DJT also winning the popular vote.",
         "Kamala couldn’t even show up to her own rally to thank her supporters!!",
         "FUCK YES!!!! Congrats folks!!!!!!!  We're back!",
         "Hell yeah!! 🇺🇸🇺🇸🇺🇸",
         "I feel soo relieved!!",
         "Talk about a Red Wave.  He dominated.",
         "It's still coming up as 267 on all of my searches",
         "All my friends are so mad because they think their rights are being taken away 😭!?? Where did they even get that from 😭",
         "Someone on r/politics literally posted a suicide hotline like wtf 💀",
         "Congratulations everyone and America in our victory. Every American whether they voted for him or not will benefit from his administration.",
         "Trump 2024 Let's Go !!! 🥳",
         "Just got on Reddit to see the meltdown. Most communist leftist site and that’s saying something.",
         "We back baby we back !!!!",
         "Doesn't anyone think it's odd Biden got over 80 million votes and Trump over 70 million in 2020. More people registered to vote in this election than last and neither candidate got close to 2020 total numbers.",
         "Kamala one, Kamala all,\nTo the Trump Inauguration ball\n\nHarris helped by being lazy,\nBiden too, four years of crazy\n\n“President Harris” nope, not ever,\nTrump for the win, ain’t he clever\n\nExcuse my poem, it’s very snarky\nBut no one here wanted more malarkey\n❤️🇺🇸‼️💯",
         "Welcome back bitches!",
         "THANK GOD",
         "God Bless America ladies and gentlemen!! 🇺🇲",
         "It feels so good!",
         "I just woke up to this!!!!!!!!! 🥹",
         "Oh, happy day!",
         "The people have spoken. God has spoken. Hopefully we can finally move in a positive direction, fix our broken country, and lock away the evil ones.",
         "Praise Jesus!",
         "SO GOOD",
         "Reddit is going crazy, people won’t accept it lol. And if you even see somone say they voted for trump they have like 100 downvotes because downvoting is gonna change the election 😭😭🗣️",
         "I'm still trying to figure out with such a massive turn out the total vote is only 136 million compared to 151 million in 2020 and 126 million in 2016.",
         "MN being in play is crazy.",
         "Oh geez Trump and Vance knocked on my door this morning. They are here for my freedom 🤣",
         "We are baaack!",
         "# Post on r/pics See how they react.",
         "Morning in America",
         "Kamala Harris is what happens to a candidate when you do nothing and just assume every voter will check the box that has your name. Nope. Not in this country. She can just go snap, cackle and pop.",
         "Can't wait until Jan 6th 2025. I'm sure it'll be \"mostly peaceful\".",
         "It’s a GREAT day, but nothing will top watching Heels up Harris count in the electoral votes 😂",
         "The lib tears have never tasted so sweet!",
         "I'm still kinda mind f'd that this many people would vote for a doubled down version of the last four years",
         "GOD BLESS AMERICA!!",
         "WERE SO DAMN BACK BABY",
         "All the reddit commies crying rn I’m having a blast🤣🤣🇺🇸",
         "Yall there’s a post in the GRIEF thread about how to cope with him winning 😂😂😂😂😂😂😂",
         "goodbye inflation😭 i can breathe!",
         "https://m.youtube.com/watch?si=M0U3BHMfLff8RmSQ&v=gKQOXYB2cd8&feature=youtu.be\nIt’s a win like this.",
         "I don’t think Arizona is blue…",
         "[removed]",
         "as as republican, do we believe trump will follow through on Project 2025. That is the items everyone is talking about right now.",
         "Start playing New York Groove.\nhttps://youtu.be/DXeeY9D9u94?si=AAspra0U4YkZpDCx",
         "as a CA resident I knew CA was gonna be pink. I needed to share this since It was apart of my prediction and other CA residents here were in disbelief. This is from the NY times and there was a lotttt of Trump support here. Glad to see it.  \n[https://imgur.com/a/ShzWZF1](https://imgur.com/a/ShzWZF1)",
         "They still are in denial about the last four years",
         "Hilarious. Go to the Reddit States... like Texas and North Carolina.  They are \"so disappointed\" in America. Cry bitches.",
         "Feels good to win",
         "I’m gonna be drinking some liberal tears tonight baby!",
         "I love it!",
         "276-223 is the worst number a liberal wants to hear",
         "RGR",
         "Amazing win everyone!",
         "Pennsylvania is now my favorite state.",
         "Hail to the king baby!!!!!!!",
         "Helllll yeahh",
         "YERRRRRRRRRRRRRR",
         "The Dawgs and the cats are safe!",
         "❤️❤️❤️showed up and showed out last night! Excited for the future of our nation",
         "Indeed. I'm very interested in what he will do.",
         "I am unburdened by what has been",
         "Hows /politics taking this?",
         "Awesome!!! Congrats fellers!",
         "Get ready for the mainstream news media getting ready! To make up tons of fake news stories about Trump. \n\n“When Trump didn’t reply to the black CNN news reporter at the end of the press conference, that’s how we knew he was a racist!”\n\n“Trump secretly wanting WW3, says anonymous source!”\n\n“Trump is just really bad at golf, did you know he’s also bad at running the country!”\n\n“Trump hates you, here’s why!”\n\n“Why we need to back Joe Biden in 2028!, 90’s is the new 60’s!”",
         "theyre saying we \"cheated\" now rofl",
         "👏👏👏",
         "Haha",
         "So fucking funny, Reddit seething rn",
         "[Scoreboard.](https://cdn.discordapp.com/attachments/1178583575063429171/1303724524868468777/cm-chat-media-video-1c039a834-3d99-426a-b6a7-c42ad224245b318400.mov?ex=672ccb94&is=672b7a14&hm=d277fc85cbba288961364ddc81aa853af869d2933c97a3e3e6d82c369afb99e0&)",
         "I don’t think it’s 270 rn, it’s 267, innit?",
         "I really wish this was real, don’t get me wrong trump is up 267 to 224 but the election isn’t called yet. \nAlso, do you think the democrats will riot? It seems their best way to get their point across or try to secede from the union like they tried to do during the civil war.",
         "They really need to just accept their defeat and he unburdened by what has been",
         "r/politics is in shambles lol",
         "I know. Its so enjoyable seeing them say \"democracy is over\" and other shit after weeks of \"Trump bad. No way he wins\" only for him to win by a large margin.",
         "Im loving it. They're actually just insufferable babies.",
         "And it’s glorious. Taking my stabs at them and taking my downvotes with pride.",
         "I can't even go make fun of them, the amount of cope and seeth is so vast it's awe-inspiring. Gloating now would be like screaming at the ocean for being wet.",
         "Woke up early, got some coffee, read some crazy lib comments.... life is so damn good rn",
         "It’s been so quiet … what now?",
         "I love hearing them say things like, \"I hope they realize what they're done.\"  Totally unaware that they who didn't vote for President Elect Trump are the minority.",
         "Subs like r/atheism etc are having the biggest meltdown of their lives. They're saying they're gonna move to New Zealand or a Scandinavian country 😂😂😂😂",
         "And amen.",
         "They're all saying \"You guys insisted the election wasn't secure and that there was cheating. Suddenly now that he's won, you've got zero complaints and are saying it was valid?\" \n\nHow do we respond to that? They've at least got a bit of a point.\n\nI've been explaining that the polls didn't BOARD UP their windows, lock their doors, kick watchers out, and then report sudden spikes in vote counts, so regardless of how legit it is there weren't any massive red flags like before that just scream fraud",
         "And I am here for it! Let those liberal tears flow!",
         "You should see the stuff they’re saying, calling us idiots and hoping we die. It’s funny",
         "I love it 😂😂",
         "It’s awesome",
         "It’s very quiet! Can’t wait to rub it in!",
         "It’s important to note that Reddit is over 50% non-US.  This means at least 1 of every 2 people you talk to is seeking to create foreign influence.  \n\nSharing viewpoints isn’t bad, but they need to clean their own horse before they point at our dirty kitchen.\n\nWe need to talk and share ideas but think where it’s coming from and what their motives are.  \n\nAlso, don’t be a poor winner.  We need to come together now, Americans first parties second!",
         "Is this not reddit?",
         "Even the romance book sub I’m in is going crazy lol. Make it make sense",
         "lol you mean the Dems on Reddit lol 😂",
         "It’s so so bad out there. Take care all. LIVING RENT FREE sums it up.",
         "America has spoken, so many people I know (myself included) voted all red for the first time ever! We’re fed up with the radical left policies and ideologies",
         "Adios to the REAL garbage!!!",
         "Seeyah Oprah, get the hell out of here",
         "They will be moving into a jail cell once the Diddy lists are released",
         "Nothing from the hyena",
         "TBF he never conceded lol",
         "Perpetual no-show.",
         "Yup. I'm a woman who voted for trump. I'm a minority now lol",
         "Kamala it’s ok, just move on and be unburdened by what has been.",
         "We're praying for you Canada! 🥰",
         "What does Trudeau do that is bad? ",
         "More than ever.",
         "👍",
         "Her shtick. She blew off everybody, including her own.",
         "WE dominated. America has had enough.",
         "Was there an opposing candidate this time?",
         "Cause they won’t call Alaska despite it not being a swing state",
         "Same place they got the rest of their delusions. Drank the kool-aid.",
         "Oh. So they're not happy over yonder?",
         "Well done!",
         "The left weren’t able to harvest ballot due to it not being a pandemic year",
         "Now we see if Democrats in Congress follow through on their threats to prevent him from taking office.",
         "I'm wondering how many lamps she threw at Dougie and staffers last night.",
         "Trump won Wisconsin. \n\nHe’s got 277",
         "Maybe you were looking at New Mexico. Arizona was still greyed out on this map.",
         "[removed]",
         "Please wake up.",
         "We did!  We prevented them from cheating as much as they wanted to, and that is cheating!",
         "He won Alaska.",
         "Bud ur late it’s 277 and it’s official",
         "277 last I looked",
         "Trump just won Wisconsin it's real we're good",
         "They'll for sure riot, they're probably already preparing themselves.",
         "Finally unburdened by what has been for the last couple of months 😂😂",
         "Haha, 🤣 so good",
         "YESSS!!",
         "🤣\n\nMy god that is _AWESOME_!",
         "Hilarious, just went through the comments and they don't understand how they lost after the 4 year circus this country just went through....",
         "Right after Fox called the election last night, r/politics briefly flipped red. All the new posts were flooded with MAGA comments 😂",
         "I wanna go see",
         "That's so nice to read this morning! There are some murky waters I do not tread into and that sub is one of them.",
         "And the popular vote, which they can never shut up about during elections!  That is the icing on the cake!",
         "I don't give a shit about Internet points. I'm having fun. \n\nThey are rude to us so much and we just sit there and take it. Now it's time to be rude back.",
         "So gracious. I'll gloat for ya.",
         "Same. Woke up hours before sunrise and somehow the world seemed more vintage and sane.",
         "They are plotting an excuse, can't use Russians again..",
         "The silence is beautiful",
         "Republican athiest chiming in and celebrating my ass off today! And I’m staying here! 🇺🇸",
         "They're wishing god and hell existed so they get justice, has to be the most stupid stuff I've seen in reddit",
         "You have the right answer. There were no random spikes in the middle of night. The vote shift to the right is significant, she never had the support that Joe. The Dems could have avoided this, but they intentionally chose to not do so.",
         "EXACTLY!  However we did have to fight against that in some places yesterday because that’s what they were doing.  There weren’t any mysterious ballot dumps with all Republican votes.  They need to find new ways to cope with this.",
         "No, a lot of them think there was cheating and have a hashtag trending on x donotconcedeKamala until every vote is counted.....They believe a lot of votes weren't counted and there should be a recount",
         "Well said, even though it’s fun to gloat a little, but yours is the best way.",
         "It won’t. A bunch of fragile people who didn’t get their way and can’t deal with it.",
         "Reddit is very left leaning in general, so that’s most redditors.",
         "Why would he? That election (when he was in power) was stolen by the democrats! This election (with the democrats in power) was free and fair! /s",
         "Did you know Kamala was raised in a middle class household?",
         "The last official act of Kamala is to pardon her husband for knocking up the nanny and smacking his previous lady around",
         "Yes!!!! Maybe I’ll decide to vote for dems again once they get their heads out of their ass!!!! WE DID IT!!!!!!!!!",
         "Seizing/freezing bank accounts of donors to the truckers protest.",
         "Don't know why your being downvoted for asking.\nBut let's say he's Canada's version of Kamala.\nFreezes bank accounts to the trucks of that convoy and I'm sure if he isn't already, wants to rule with an iron fist",
         "This guy has increased inflation, increased the price of goods and services with a carbon tax plus other taxes. Enacted authoritarian rules during covid, froze bank accounts of conservative protesters, spent more money than every single government before him combined, called millions of people \"a small fringe minority\". There's so many things I actually can't even keep track anymore",
         "So true",
         "This. They don’t want to admit that Alaska is going to put him over. It’s not even close there and was never in play.",
         "👍❤️",
         "I wonder how hungover she is today.",
         "Yep. I think so. This is incredible- and I’m proud the country is not represented by most of Reddit",
         "Ah, well, I think I forgot to refresh the page.",
         "I’m trying to figure out which rock they have been under the last 4 years. They’re saying the country will *now* be in shambles because of DJT. Seriously, where have they been?!",
         "And they call us “sore losers” 🤣",
         "I saw someone say idk how they lost when everyone on reddit liked Harris",
         "Kinda explains things, hu??? Willful ignorance has a steep price.",
         "Because they are stupid….. you know…. Knowing the truth, but believing the lie",
         "Same, brb",
         "Exactly lmfao I’m having so much fucking fun",
         "Same hehehehe",
         "You must be new.",
         "They can try. Watched idiots all over Reddit trot that one out last night.",
         "Lol oh yes they can",
         "The joke's on them.  God and hell exist, as they will eventually discover.",
         "Ohhh well I learn something new everyday. My bad lol I mean I figured as much due to all the leftist down voting my comments lol 😂 I was just trying to have a conversation or debate….they didn’t like that 🤷🏼‍♀️\nI had over 1000 karma lol lesson learned 🤣",
         "I rest my case lol. I wish he conceded. Would have had even more red votes.",
         "Wow I definitely haven't been told that 2700 times! I had NO idea",
         "Wait really?\nI can't believe that; if only I knew that sooner....\n\n\n\n\n\n\nI STILL WOULDNT HAVE VOTED FOR HER.",
         "That sounds like socialism and collectivism.",
         "Nevada and Wisconsin both have Trump +4/5 favorites with 95% of the vote in. Not declaring Trump the winner here is so petty.",
         "Oh goodness, that cannot be a pretty picture.",
         "They’ve been brainwashed to think Trump is a fascist, racist, etc etc, so they have no time to think about actual problems at hand-like our shit economy. \n\nThey don’t even deserve the good that’s coming our way.",
         "Imagine the gall! Our country was smart enough to put our country first!",
         "Lol confirmed in shambles.",
         "ITS SO FUNNY HOW MANY LEFTY SUBS THERE ARE. I ENJOY SIPPING THEIR TEARS",
         "😭😭😭😭. Hilarious response.",
         "🤣",
         "And you expect anything else from the left why?",
         "We’ll see whenever she finally rolls out of bed to deliver her concession speech.",
         "Brainwashed is definitely the perfect description.",
         "Yes and this is scary because there have already been attempts on his life, you know more will come. Their tactics to scare him off the campaign trail did not work.",
         "...but they will be damn happy to take it.",
         "I don’t",
         "That's going to be a ramble that no one wants to miss.",
         "It has definitely crossed my mind that they will try to assassinate him again."
      ]
   },
   "1gktp39": {
      "title": "Greatest comeback story in American History 🇺🇸",
      "text": "",
      "comments": [
         "Once Biden said Republicans are garbage, that was the end for the democrats. \n\nYou can't call half of Americans garbage as a sitting president and expect to get the vote on election day.",
         "Team America ……..fuck yeah",
         "To all of those asshole Redditors:\nfile:///var/mobile/Library/SMS/Attachments/64/04/A5BABB10-1BA1-4723-AD9E-F84E51C3D078/Resized_Screenshot_20241106_080502_Facebook_1730901959223.jpeg",
         "Between the garbage comment and pretend biting babies on Halloween, I think the Biden family purposely sabotaged her campaign out of spite.",
         "file:///var/mobile/Library/SMS/Attachments/85/05/E54FF2FB-A90A-4AB1-9528-38A7DF992D63/IMG_0991.jpeg",
         "Let’s be magnanimous",
         "[removed]",
         "Yeah it didn’t link!  But it was awesome lol!"
      ]
   },
   "1gkurfm": {
      "title": "Remember to respect our fellow Americans.",
      "text": "Just wanted to put this here to remind y’all of this, I saw a post on the Pennsylvania sub calling for respect between us all and they got called a pedophile for supporting the winning candidate. Let’s just remember that we are all Americans in this country, and having opposing political views should not make us hate each-other. I’m serving in the military in Japan right now and no matter who we support over here we all respect each-other. I joined because I love ALL Americans even if I don’t agree with them, American lives no matter who they are, are most valuable to me. What we really need is an America that respects each-other, GG. AMERICA RAHH 🇺🇸🦅",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "I also am serving in the military but in Guam. I just was telling some of my junior Sailors that I can't wait for this election to be over because I'm tired of all the hate and vitriol. At the end of the day we don't have to agree politically but at least respect one another.",
         "I agree with you, wholeheartedly, and think this election and the last 3.5 years were the most divisive this country has ever been. With that being said, if you try to tell the left that Trump isn’t going to put them in camps, women won’t just be baby factories, or dispute any other far fetched ideas, they won’t believe you. They have been so brainwashed into hating that man, that they would rather see him fail all of us, than hope he does well as president. \n\nWe need unity in this country, but I don’t think we well ever truly see it again.\n\nStay safe out there OP, and thank you for your service.",
         "Democrats are not going to stop today just because she lost! The attacks will keep coming. MSNBC and Rachael Maddow already last night starting in on the Trump is a dictator talk. Already starting in on how he is best friends with Putin. How every country in the world wakes up today scared to share intelligence with the the US. Just wait until The View airs today and rest of the liberal media circles the wagons. It’s going to be 4 years of fighting. \n\nI’ll be respectful to the people trying to destroy my political views when they learn to respect people in general.",
         "How much respect did Republicans get the last 4 years? When Republicans win. We have to get along be nice and bipartisan. When democrats win we are nazis and antianerican and need to sit down and shut up.",
         "Totally agree. I am hoping that this is the start of the end of politics being the cornerstone of people’s identity and we can start treating each other as equal neighbors again. Different ideas, but all Americans. Thank you for your service.",
         "I have respect but they're claiming that the majority of Americans voted against her because she's a woman and not because she was a hollow candidate is ridiculous, majority don't give AF.",
         "The left's entire presidential run was about hate. They had nothing to say about themselves to have you vote for, only bad things about their opposition for you to vote against.\n\nI agree with what you're saying but you're overlooking the part where it's a one way street. I was in the military myself, and I get what you're saying. But out here in the civ world, it's not the same. They don't depend on you and you on them. They're willing to throw you in the trash for the slightest disagreement.",
         "Dude I’m from PA. It’s insane to me how intolerant the PA sub is…",
         "I will not show respect to people that called us trash",
         "I would have agreed with you until they did what they did to trump in court, in media, and in person.  Fuck them.  You can earn my respect back, I’m not giving shit to democrats.",
         "It’s hard when you see so much hate towards your political party online. I thought about this last night though. We should love our neighbors even if they’re assholes. \n\nI’m sick of seeing people calling us dumb or saying we must have too much lead in our pipes for voting for trump. How are you gonna speak like that about the people who keep this country running?",
         "They've spent 8 years trying to tear us, and America, apart. \n\nThey've not respected us, at all, and still won't. \n\nYet we will still treat them like humans.\n\nbecause that's what *real* tolerance looks like.",
         "I’m gonna gloat on Reddit for a while longer.",
         "Like they did? \n\nRelease our non-violent J6 political prisoners from the DC gulag, expunge their false convictions and restore their rights.\n\nMaybe then we’ll talk.",
         "So the left is just going to stop lawfare & falsehoods? Accept the electoral results and play nice from now on? \n\nMaybe I will respect the neighbors that turn their nose up at my MAGA signs, but in no way am I done fighting the establishment",
         "Thank you for your service!",
         "It's a shame Democrats talk about being inclusive, but yet are divisive.  Agree, we all need to be civil and respect other views.",
         "I agree, but I also think Republicans are not the primary source of the problem.",
         "Always have. Can't say that it's been reciprocated. But I'm old enough to remember when you could still talk to people you disagreed with politically.",
         "No.\n\n I'm not going to be the bigger person. I and people who believe like i do have been insulted, belittled and slandered for far too long. They fucked around. Time for the find out part.",
         "I dont hate anyone, feel bad for them? Yes!! Don’t understand them? Yes waited 4 fucking years while their bullshit was pushed down my throat? Also yes!!! \nI just want to watch them melt!!",
         "Meh.  I wanna rub it in just a little bit.  If those assholes hadn’t been so damn cocky as a result of their echo chamber, I’d show some grace.  But these SHOCKED Dems are the ones calling us stupid.  Give me a break.",
         "Gets hard to sometimes, they grind my gears 🤯",
         "There's only hate from the bots. It's a social media problem. It's not us.",
         "Well said.",
         "I’ll be respective and not gloat over this historic win I’m very proud of. Unfortunately people on the left are just crying and making a scene after they lost fairly. I’m just gonna have a very happy low key day knowing that the right candidate won for making America great again. God bless America!",
         "It's a shame Democrats talk about being inclusive, but yet are divisive.  Agree, we all need to be civil and respect other views.",
         "They won't respect us. Honestly, the destruction they have caused, I'm fine with not being the bigger person. They need to learn a lesson. Trump and the Republicans will teach them in the coming months/years with the white house, Senate, and House. It's time to teach them how wrong they have been.",
         "I’ve seen countless democrat friends posting “if you voted for trump we can’t be friends” etc. 😅",
         "Thanks for your service, but today is my day to talk a little shit!\n\nTomorrow will resume as normal, probably....",
         "Nah…. For all the hate and lies they have put us through for the last 8 years. \nIt’s time for a little payback.",
         "Please show them more  respect than they have shown us!",
         "no need to put anyone down, they bring enough on themselves as is",
         "Thank you for saying this 🙏🏼",
         "I honestly think this will spell the end of the woke era.  They will not regroup.  Democrats are not stupid people, they will have learned hard lessons from this election and permanently eject the tyrannical irrational group think crowd from their midsts.  This is a good thing for Democrats, it will make them stronger in the end.",
         "We all bleed red white and blue. Fuck yeah, I love my democrat bros",
         "I agree. I just pray people don’t go rioting/looting",
         "FUCK NO. I want revenge. They pushed the clot shot on us. They weaponized the Department of Justice. They pushed war after war after war. They mutilated children with their sick trans ideology.",
         "Yup, Republicans need to take the high ground now. In Michelle's Obama's words \" they go low, we go high.\" The only difference is that Republicans might actually try to bring the country together again.",
         "In New Jersey they’re already talking crazy, I can’t stand this place",
         "Thank you for your service. My father, OBM, was in the USN and was stationed in \"Occupied Japan\" for two three year tours. My brother was in the Marines on Okinawa headed to Vietnam when the decision was made to pull out. If I could get to Japan for a month, I'd be in heaven. Mt. Fuji, Biwa Ko, so many wonderfully manicured gardens.",
         "Always! I will never stoop low as deranged libs. Respect, listen, and stay independent thinker.",
         "I agree.\n\nI also agree that it’s hard when you’re being called every horrible name in the book and read all the insane misinformation they tell each other to keep the hate and fear alive.",
         "Well said. The time for healing is now.",
         "This, 100%. Be dignified and kind. Be above it.",
         "It shows you who the classless group is and who the intelligent and level-headed group is",
         "Thank you for your service.",
         "Respect is earned. And the Dems have done nothing to earn it.",
         "Yeah, seen the worst of this sub bragging about getting banned from various subs for troll posts.",
         "Seriously, just because someone has different beliefs, political views, or values doesnt mean they are evil.\n\nSo of my best friends live completely opposite lives when compared to me.",
         "Let’s push for unity and peace.",
         "Oh man, it’s just getting started. Another 4 years, the dems are only gonna get worse",
         "I can't agree more. Right now, there are so many vicious and nasty commets out there. I actually saw a post supporting the idea of cessation. It's crazy.",
         "Thank you for your service.",
         "That's why I'm even more glad he won.  The media needs to be held accountable for their egregious lies.  Hopefully seeing that trump isn't super mega hitler will turn even more people off from msm",
         "Well said. I’ve seen so many people in complete despair, and honestly, I feel for them. They’ve been influenced by echo chambers and mainstream media. I’m not sure how we recover from that, but hopefully, the next four years are prosperous, and those who spread lies and fear-mongering are held accountable.",
         "The last 7.5 years imo. Trump started waves before he was even elected and it only got worse. FWIW I am left leaning. I do not like Trump at all. (I’d also like to point out I think Kamala was a horrible choice 4 years ago when Biden picked her and that didn’t get any better when the DNC pushed her on us.) Anyways… I think he’s the weed that helped started the deep divide in our country and only fed the flame. But with that said I don’t think there will be camps, baby factories, etc. I don’t think it will be as hellish as the far left screams just as I don’t think the past 4 years were as bad as the far right claimed it to be. \n\nBut at the end of the day I do agree with OP. Please be respectful. Remember all the FJB stickers. All the Brandon memes. Parading around MAGA flags, proud boys and anti Biden stuff. I know most republicans didn’t do that and only the cultist minority did. Remember that most democrats and/or liberals will wake up today, sigh at the loss and go to work.",
         "Sunny Hostin is even more bitter than Joy Behar. Entertaining.",
         "Exactly. Why play by the rules when they don’t?",
         "As a Kamala voter I agree with you. Voting against her for being a woman is ridiculous. I think centrist, libertarians, swing voters and even some democrats voted against her because of money. At the end of the day most voters care about what’s in their checking account after getting their check and paying bills. Trump nailed it at his rallies when asking if people were better off 4 years ago than now. It is hard to say no to that question unless you’re in the 1%.",
         "I for one and I think a significant amount of voters don't care if a woman were to become president. But for fuck sake at least put up a competent candidate. Someone that speaks in complete and coherent sentences not a fucking word salad. Once Kamala went off the teleprompter script she was a deer in the headlights.",
         "Happy Cake Day and Happy Post-Election Day!",
         "Welcome to Shitsylvania.",
         "Great point. Respect is indeed, earned. Get to your earning, lefties.",
         "Yep.",
         "Same",
         "Don’t forget the group that was sentenced earlier this year for praying outside an abortion clinic. Both groups must be pardoned on day one!",
         "Didn't Liz Chaney accept false testimony from a witness? A former member of the Trump cabinet testified she took notes during the Jan 6th event. It was later determined that the handwritten notes were not that witnesses handwriting.",
         "I'm old enough to remember a democratic party you actually COULD talk to.",
         "FAFO all day long.",
         "And I've finally been un banned from all the woke sites, seems we can have a litte fun🤷‍♂️",
         "I'm gonna gloat. Waited too long to not milk it.",
         "Sadly this is true. I've already been called a racist twice today.",
         "There's the real beauty of all of this: you cannot trust the msm. Now EVERYBODY can see it written in red.",
         "The dissonance associated with discovering you've been duped.",
         "How many times did either of the Democratic front runner get shot at or a firearm allowed within 200 yards of their location?",
         ">Remember all the FJB stickers. All the Brandon memes. Parading around MAGA flags, proud boys and anti Biden stuff. I know most republicans didn’t do that and only the cultist minority did. Remember that most democrats and/or liberals will wake up today, sigh at the loss and go to work.\n\nIsn't that precious?",
         "I'm wearing my red, white & blue today. Make of it what you will. Truth triumphs.",
         "FJB",
         "They can’t cry foul because it wasn’t close but I guarantee within a short time they will be right back to calling us all nazi cult members. As Howard Stern used to say….bunch of yentas.",
         "We just annihilated them on election day. They might finally understand that they have to stop, or they will keep losing.\n\nI love Trump, but he is generally unliked personally. He *still* beat them this badly and won even the popular vote. Imagine if next time we run a more likable candidate and Dems are still acting this same way. It'll be more like a Reagan-Mondale landslide. They'd be cooked.",
         "I don't disagree with you, but I also don't want to stoop to their level.",
         "As someone in the top percent (idk about 1%), I can confirm that we are not better off still. Easy to see why Trump won when you look at all the factors. \n\n* Mass immigration problem, yk the one Trump said was going to happen \n* Rising prices for everything, buying groceries to properties\n* Kamala only seemed to target women and LGBT people, leaving a lot of young guys feeling disconnected. As a younger guy, I honestly feel she gave me no reason to vote for her, this is in addition to wanting to continue to support wars. I wouldn't go die for this lady or her administration if it came down to it. \n* She became a main candidate without anyone wanting her after Biden dropped out and failed to distinguish herself from him.\n* Kamala suggested taxing capital gains which is a horrible idea, considering investors are the ones who not only stir the economy but also help create jobs.",
         "They had one named Tulsi Gabbard and they chose to ostracize. the person that wiped the floor with Kamala in debates. But they can't pick a traditional Democrat who isn't an extremist and is a war hero who believes in common sense because it goes against the machines plans. They did this to themselves, it's only a matter of time before they fabricate another pandemic or something to try to derail the next one.",
         "There's a reason for cake!",
         "😁🎉",
         "The border. Ukraine. Political prisoners.\n\nBare minimum on Day 1.",
         "Agreed, 100%.",
         "I have been called racist so many times I lost count.",
         "That contrasts the statement, just be kind and understanding. Everyone has differing upbringings.",
         "Kammy bailed on showing up for work last night.",
         "You lost me at ‘understand’. \n\nBut I get your sentiment",
         "I’ll stoop to whatever level they’re at in order to destroy their death cult ideology.",
         "Don't forget \"drill, baby, drill!\""
      ]
   },
   "1gkt592": {
      "title": "Whos gonna tell the rest of Reddit trumps not gonna get them",
      "text": "Everything is acting like the boogie monsters under their bed\n",
      "comments": [
         "They’ll just spout this same bs for 4 years and start over with the next candidate",
         " Pfft nothing any of us say will change their minds. They are delusional. Let them stew in the pot they made.",
         "Is there an alternative forum site to Reddit that isn’t so liberal controlled?  This election it has been just a huge dem propaganda machine.  Couldn’t even look at cute dog subreddits without a cheesy forced post of Kamala uncomfortably petting someone’s dog and a caption like “I CAN’T! Vice President Harris pets a dog. ❤️❤️ #shesallofus”",
         "They’ll have to check in to a mental hospital first",
         "They won’t believe anything we tell them they are going to be pissed from now to the grave.",
         "If they didn’t figure out the first 4 years, they’ll just have to live with their own self-destructive fear.",
         "Let them figure it out for themselves",
         "It's all in their crazy legacy media brainwashed heads. Nothing can help. They'll just have to grow up and deal with it.",
         "If you go to some of the traditional liberal news sites, it is amazing. You will read that Trump ran a vicious and hateful campaign and still prevailed against Kamala Harris‘s campaign of joy. What? Campaign of joy? MSNBC says “how do we stop Trump now.“ I don’t know why I am surprised, I would think that seeing the scope of the victory would cause these places to pause, for sanity to resume. But they are fully unhinged.",
         "I'm trying to but they r freaking out.",
         "They won’t believe you if you try. Time to get the best sleep I’ve had in 4 years",
         "Lol, who's going to tell MSNBC that the race is over?",
         "Also a felon just in their minds and their manufactured indictments. He isn’t a threat to democracy, just to their version of what is a democracy.",
         "On r/SuicideWatch, i tried posting that Trump will not come for them, along with a little empowering message.\n \nGuess what? THEY BANNED ME FOR IT.\n \nEdit: ITS BECAUSE THEY DONT ALLOW ANTI-SUICIDE ACTIVISM.",
         "But, if there isn't fear mongering from the elites about Trump, how will the left raise funds?",
         "Already been doing that. Every Republican here has a duty, we need to put aside all the hate that's been spread, we need to rebuild 🇺🇸",
         "Not it",
         "They’ll convince them selves and continue to gas light each other into thinking Trump him self will be knocking on their door to excute them, and then after 4 years they’ll say they barely survived.",
         "They would t accept that",
         "At some point you would think they have to start questioning things. Who is lying to them? Trump or their media sources. The dude crushed it nationwide, so obviously some people woke up.",
         "They are so fuckin dramatic",
         "Who can tell the bots anything?",
         "but but they gonna lose all rights to human.....",
         "Stay safe out there everyone, remember last time he won there were riots and violence every where. Keep your head on a swivel and conceal carry.",
         "I stopped trying. Even yesterday the daughter lashed out at me about them taking over the Capitol. She voted for him but needs some serious education. Not sure how to do that in the face of years of lies.",
         "They live their whole life's being scared. Don't worry about them.",
         "Better chance than not that all of their lives will improve over the next 4 years And they'll blind in ignoring to suit themselves.",
         "Not it.",
         "Do not tell them, let them cower in their basements. Thereby leaving the rest of us alone",
         "The proof indicated that they are outnumbered. Just download every single thing that pops up on your feed like demonstrates their clueless whining and let the numbers here start to demonstrate the numbers from the rest of the country..",
         "Unfortunately he already came for my freedom today 🤣. I snuck this post in before he took it",
         "they will just screech at you if you try to help. not worth my time.",
         "Here’s what will happen: nothing will happen to these people and they will claim it’s because of the Democrat congress members that stopped evil Hitler Trump",
         "You can try but I don’t think they’ll believe. They’ll probably just call you a racist Nazi fascist whatever.",
         "Good. Let the authoritarian Leftists cower. \n\nThe evil scum. \n\nBut no need to talk about any actions, until Jan 20th.",
         "Watching redditors echo chamber shatter and crumble to the ground in real time scross the entire platform is incredibly fascinating to watch.",
         "Been saying that. They don’t listen",
         "Unhinged lunatics. Therapists are about to get a payraise.",
         "Part of me hopes he does what they’re afraid of him doing",
         "Trump is the boogeyman that is coming to... reduce their taxes and decrease violent crime? Clearly, they should be very afraid.",
         "People dont understand.  Little to NOTHING will change, the same as if Kamala was elected.  The Dems will gridlock everything they can as hard as they can just as the Republicans have for the last 4 years.",
         "People in multiple subs say they're going to take \"mental health\" days. Over the Election results?????",
         "Not me. Those dudes are so rabid that even trying to talk to them normally gets you bit",
         "They should live in fear. LMAO",
         "I’m sure there will be a bunch of “peaceful protest” for the next coming days.",
         "Nah, let them sulk a while. Besides, victimhood is their whole thing",
         "I just wish they could honestly understand simple things like, was your bank account better today or 4 years ago? These are black and white facts that affects the average American.",
         "Shhhhh, they are hiding. Just let them hide.",
         "Nah I heard he's gonna deport all libs",
         "They won’t listen.\n\nI don’t know who told all these kids that the world is over, but they are the greatest troll of all time.\n\nI went from feeling bad for them, to now being irritated that they can’t stop telling each other bullshit and fanning the flames. Some of the most insane posts and comments have to be AI.",
         "OP I tried to tell them. And already got banned post election on r/pics. Guess theyre still at it picking and choosing who can say what.",
         "This is exactly how they were in 2016",
         "They all getting ready for Hitler 2.0 right now",
         "Don't bother they won't believe it and will resent not being able to be the victim they think they are.",
         "Sorry but let's face the facts , there aren't enough Psychiatrist's in the World to treat all of them",
         "It's their problem. They hide in their echo chambers that feed their mental illnesses. They have to want to be saved, then leave and save themselves. \n\nStop listening to lies",
         "One thing that is throwing me off is people voting whether Abortion is on the table for this election, abortion is a huge factor but its already been decided by the SC that its on a state level, and Trump himself stated he prefers it on a state level instead of a National Ban. And both candidates said they won’t “take” guns away so I really think that Kamala and Trump are closer in policy than we think aside from taxes and the border, but I feel like a closed border is a no brainer on account of all the fentanyl coming through",
         "I can’t tell them because I got banned from the sub.",
         "I kind of wish he'd go after some of the mods.",
         "but... der project 20205!!11!1!1!1",
         "My other alt just got banned from a map sub for basically saying _Dems need to reevaluate why they lost and adjust their policy and message_ and instead they just want to yell at how bad and uneducated we are.",
         "They didn’t learn it the first time around and they’re not gonna learn it now.\n\nIf Trump’s a Nazi, he’s the most incompetent Nazi since… well, the Nazis.",
         "I'm going to wait.  Let them flood Canadian Borders. Sorry Canada... you can always ship them to a 3rd World Nation.",
         "I don’t bother with people who are delusional and seeing hallucinations.",
         "The parents of someone I know are on occupied Ukraine. I wonder who will tell them. We don't even know if they're alive tbh. Anyway maybe you think I'm a bot or something. At least someone is having good emotions.",
         "It’s 2016 all over again. They will need their safe spaces, and feelings nurtured by those who are also “broken”. Then it will start all over is 2028. The same crap. The same media lies. The same ignorant bullshit. The left is broken, I keep hope they will wake up. A lot did this election.",
         "Do you remember 2016? Women were crying because their children were going to be executed by rascist police and all the outrage at college campuses. It will probably be something similar. I hope there aren’t more assassination attempts.",
         "Pretty much all major Texas related subs, r/Texas, r/Dallas, r/Denton have been swarmed with this type of cheery Kamala worshipping garbage, and anyone who posts an even remotely conservative opinion gets shouted down and brigaded. It is the most unrepresentative liberal fantasy land.  I wonder how many are even actual Texans and not bots or people outside the state.  Not a Texas sub but r/Christianity is the worst! Almost every other post is political.  The last few weeks it has been all about why Christian’s should really vote Kamala and today it’s about how Trump is ungodly.  The sheer mass and timing of these posts seems pretty bot-like but it’s exhausting. I’d like to talk about things not politically related too. I don’t know if there is a path to equalizing Reddit or if we just need to say eff it and go make another, better forum site where patriotism, capitalism, guns, evangelical Christianity and conservatism are encouraged.",
         "Leave them with their miserable thinking. I love that they will sulk for the next 4 years, while the rest of America thrives.",
         "Reddit is so far away from what the real world is actually like. Take everything you see on Reddit with a grain of salt. Not worth getting worked up over",
         "While I definitely agree with you it's probably what this sub would've done had Harris won.",
         "They’re breaking a lot of their subs rules talking about how awful we are as human beings and mods just don’t care haha, really telling",
         "It's hilarious to me that they don't realize they will never know who voted for him. He won the popular vote and the electoral vote. That means odds are very high anyone they know could have voted for him and just says the opposite. Think about it take 5 democrats and I bet at least 1 voted for Trump the implication of that should terrify them.",
         "Don’t care about them.  Let them cry and shake in their boots.  We can’t convince them otherwise.",
         "I feel like both sides act the same way with the opposing candidates. Almost an “end of the world” mentality. I did not care for either of these candidates but I don’t think we will die because of them. It’s not that dire.",
         "It really has me worried. Because if there's a worse candidate than Biden or Kamala they might actually find them and rig their primaries for them when they run!!",
         "And then they will attack us when they make it too hot.",
         "Omg r/music was the worst, That sub became totally political.",
         "There was Voat, but that was like.....gosh years ago. After a bunch of questionable subs were banned?",
         "r/teenagersbutbetter is so bad rn",
         "Truth social",
         "Millennials thread was a liberal propaganda machine",
         "They can pissed off all they want.",
         "[removed]",
         "Communicating with people who have mental health challenges can be really difficult. While I’m not saying all liberals fall into this category, I believe a significant number are.",
         "Oh wow… that sub is sad. I am trying to remember today to not gloat internally, and pray for those who are genuinely distressed over this.",
         "I just peeped in there, holy shit ppl are wild!",
         "Damn, they’re wild over there",
         "Well look where we've been the last 4 years. Democrats won control in 2020 but what did Biden do?? \n\n- He weaponized the DOJ to chase down and persecute his enemies especially Trump. Here [is his narcissist smile about it.](https://youtu.be/hIt_5Q24BSQ?si=CmARa4B-BpYIwTG_)\n\n- He forced people to take an unproven medication that many like kids and young adults were not scientifically justified to take. \n\n- The withdrawal from Afghanistan was a catastrophe.\n\n- There was a vast government censorship campaign with social media that was so bad that it instigated a billionaire to get involved. \n\n- A budget with spending so uncontrolled it shot inflation much higher than it needed to be.\n\n- But the Democrat oligarch boot lickers had to rig their primary system so the only candidate worse than Biden would be the candidate.\n\n- Did I forget to mention all the people who drowned in a hurricane while immigrants were living it up in four star hotels??\n\nI could go on and on. \n\nThat's all we got from Biden et al.\n\nAnd now Democrats are suddenly wondering exactly how they lost this election. Really??? Isn't it obvious??",
         "Ya people are already saying my life is over, my child’s life is ruined, and they’re going to die.  Last I checked you lived thru his last presidency.  If your life hasn’t changed for the better, than take some accountability for your own life.",
         "Nooooo, we were trying to get rid of enough whacko libs as it is. Please don't send anymore!!!",
         "The worse they are the less likeable they are to voters.",
         "It's Gavin Newsom. He's the worse candidate.",
         "Seriously what is it with Trump supporters and thinking the election is stolen? Even Trump himself said this seems like a fair election, before votes were even counted.",
         "r/AskWomenNoCensor is awful too. Was one of my favorite subs until today lol. Probably best to just get off of social media for a week or two until the uneducated hot heads stop crying",
         "Should be renamed to teenagersbutbiaseddemoctrats",
         "You’d be right. Almost everybody that I know that has mental issues are on the left.",
         "NOW I KNOW WHY.\n \nTHEY DON’T ALLOW ACTIVISM.\n \nGee, i wonder why they kill themselves.",
         "Wow\n\nEdit:\nGot banned over there myself.\n\nThought I was nice about my reply too. 🤷",
         "Yes it was obvious.",
         "They could have won.  If they took a reasoned and sensible approach a year and a half ago, anyone could have looked at Biden and known the guy is on his last legs.  He was on his last legs in 2020.  They had all the time in the world to find, promote and bring forward a coherent nominee that was center left.  \n\nThe undecided voters of the country would have eaten up a nominee that held some democratic lines on some stuff, but was far more center with immigration, economics and foreign policy.",
         "I just hope there isn’t any one that crazy who does harm to them selves or their family because they believe all the propaganda they read on reddit and think the conservatives are going to come for them.. I know there’s bound to be a couple though",
         "Bruh, former dem here allow me to explain.\n\nBurning ballot boxes, PA fake ballot scandal, boom boom threats to polling stations, etc.\n\nPeople are sus because bro, because some of this shit is sus.",
         "This time. Last time… not so much. Nobody could have predicted the blatant cheating going on, combined with the lack of integrity in the courts to take any of the allegations seriously, *and* the mainstream media all going to bat for one side over the other. \n\nAfter Covid, economic crises, a new war, soaring gas prices, crime, inflation and four years of placing the blame on the people and not themselves, the DNC has proven that old homage:\n\nCheaters never prosper.",
         "He literally was posting that there’s major fraud in PA just last night.",
         "Yes if by fair you mean letting non citizens vote because they sign a piece of paper that say I am a citizen seem completely fair. Maybe you can talk you bank into letting people access you bank account if they sign a paper that says they the owner of it. 🤣",
         "Just took a 5 minute stroll through the sub for the first time and wow lol....",
         "Professional victims. they don’t want help, they’re actually happy in a sick way.",
         "the rest of reddit doesnt see that",
         "They didn't want someone who had their own positions.  They wanted someone who could be controlled.",
         "We don't know who set those fires yet. The bomb threats were from Russia. But please tell me about the PA fake ballot scandal? I looked it up and nothing really came up. I'm interested in knowing the truth instead of believing whatever either party tells me. I'm not here to debate or disagree or anything, I just want to know what's really going on.",
         "What exactly is your proof of cheating? If you can prove it I'd be happy to believe it",
         "I didn't know that. I was just looking for answers, not an argument or debate, sorry",
         "True, but compassion comes from everywhere.",
         "It's not about who. It's about the fact that it happened.\n\nWhy wouldn't people be concerned when ballots burned?\n\nPennsylvania DA found fraudulent registrations/ballots last week, it was all over the news.\n\nEdit: sorry it was the attorney general, not the DA. My bad",
         "Is Russia in the room right now?",
         "Do you believe this was a record turn out as it is being reported then why is there only 136 million votes vs 151 million in 2020. 15 million really sat out a record turn out vote.",
         "Put it this way, in poll after poll, roughly 70% of registered Republicans believed the Biden victory was \"illegitimate\".   Name one other Presidential outcome in history where a number was even 10%?  Hint - there is none.",
         "Please check out:  https://sharylattkisson.com/2020/12/what-youve-been-asking-for-a-fairly-complete-list-of-some-of-the-most-significant-claims-of-2020-election-miscounts-errors-or-fraud/",
         "You misunderstand, I’m not arguing with you and I don’t disagree with your sentiment, Trump supporters have absolutely been wrong about election fraud and lying about the “stolen election” for too long. It’s crazy. But it also makes total sense because Trump has done nothing but scream fraud and cheating. He only thinks the election is fair if he’s winning.",
         "Ask Hillary.",
         "Honestly, I don't know. I wouldn't be totally shocked if that many people really did just not vote because I've seen lots of people take pride in the fact that they're not voting, especially in this election. But I also wouldn't be shocked if it WAS rigged, the government is sneaky on both sides",
         "thank you",
         "This needs to be posted to r/Democrat",
         "15m did not sit out. I'd bet $100 to your favorite charity. There is NO way on Earth Biden was the most \"popular\" president elected.",
         "Personally, i believethere's some cheating every election. Maybe not conspiracy levels but there's very likely at least someone somewhere on each side trying to manipulate things so their side wins. It happens all the time all over the world. People try to cheat to win.",
         "People posted it there and were banned. Pretty sure I’m also banned. If you want to, go for it - enjoy your ban, too!",
         "Instant Ban.",
         "[removed]",
         "Agreed. “Fuck Joe Biden” chant started not long after he took office.",
         "But he was. Most votes ever. More than Obama! \n\nThere is no way that's possible w/ out some sort of cheating."
      ]
   },
   "1gkyu2y": {
      "title": "“Women’s Rights”",
      "text": "Women on the left have been blasting this narrative that a Trump victory is a threat to women’s rights. The only “right” they’ve indicated being taken away is abortion, which clearly isn’t an issue that the president will even have to address. \n\nThe whole message is that if you vote for Trump you don’t care about women. But as a woman who has a daughter I feel like I HAD to vote Trump to protect rights she has that are much bigger than abortion. Her right to free speech, her right to assemble, to protest, her right to exist as a female in exclusively female spaces like sports and restrooms, to bear arms, her right to a secure border and safe streets, her right to not have gender confusion or mutilation pushed onto her, her right to be educated and raised by her parents and not the government. Most importantly her right to be an innocent child. \n\nIs there something I’m missing? ",
      "comments": [
         "> Is there something I’m missing? \n\nNo, you pretty much nailed it.",
         "If the Democrats were going to protect abortion rights, why didn't the Biden administration do anything to fix Roe v Wade?",
         "As a mother with a daughter, I am absolutely *RELIEVED* this morning. I haven’t been this happy in a hot minute. And I can’t wait to not spend $200 every week in groceries!!! 🥳🙌🇺🇸",
         "Try not to judge me for this you guys but I’m a 31 F and just finally voted this year for my first time ever. I always thought I was either democrat or liberal but also didn’t really care and thought everyone was crap and thought our country was just whatever. Something changed in me towards the end of these last 4 years when I saw what happened to our country. It got so bad that even I finally had to pay attention. Even I finally was like “Oh wait…this all makes me extremely uncomfortable, what the f*ck is even going on.” Even I finally was like “Okay wait I think I love my country enough that this all has to be stopped”. My husband and I also started TTC this year and I think having to realistically think about my future children’s future flipped a switch. I am SO proud to say that I, a WOMAN, VOTED RED, for me, for all women, and for my future children!!!",
         "As a woman i absolutely wanted to protect my rights, thats why i voted for Trump,",
         "All of this!!!",
         "The real irony is that now women can actually vote, at a state level, on the “rights” they want. We all can. The less federal overreach, the better we all are.",
         "Thank you for saying this. I’m absolutely mind blown by all the posts & comments I’m seeing about women terrified, crying, and so anxious about their rights and the rights of their children. He has literally been the president before and what rights did we lose? All he did was allow states to make decisions on abortions, so if that’s what they’re upset about, they should be mad at their own state. I’m in disbelief at the delusional things I’m seeing.\n\nI had a MC in January and had no problems getting the medical care I needed. I’m currently expecting a son & daughter. I voted red FOR my kids. I want them to be safe in our country, have rights, and not have to eat poisoned food.",
         "Trump doesn’t even have any real control over that iirc, it’s down to the states. Not 100% sure, so feel free to correct me",
         "The liberal party needs to learn they can’t just win elections by planting us as the worst humans alive on planet Earth while also preaching about inclusivity and bringing the country together\n\nHarris would have been so bad at bringing anyone together and even if she pulled off a Hail Mary in 2024 she would have been smoked even worse than this in 2028\n\nNew Jersey at a lean margin is insane!!",
         "Well, my family - to my surprise - all voted for Trump. I was sure my leftist son wouldn't, but he said, and I quote, \"I couldn't bear even the thought of hearing her cackling one more day!\"",
         "Whenever I see a leftist say something about they want to protect their daughters abilities to have an abortion I hit them with “So you’re okay with her having a train ran through her frequently without consequences.” And it usually gets them to shut up",
         "It’s disgusting how they paint us as immoral! I 100% agree with you",
         "It's crazy to me. Ive heard people from the left spouting off things like JD Vance wants to track women's periods, and a Republican government will put them to death if they need abortions for any reason. Those same people say that trump ran and won on a campaign of fearmongering and propaganda. Absolutely wild",
         "“Relax, you can still abort all the babies you want” is what I want to say to these brainwashed liberals.",
         "You hit the high points on how the \"progressives\" are nothing close to progress.",
         "1000% agree with this statement. Now I feel women should have the right to choice what to do with their bodies but the left is over looking all the bs they are trying to take and only focusing on that one thing. And maybe if they protected them self with birth control condoms and the other ways they wouldn't need abortion so much.",
         "Trump didn't have a pro or anti women's rights platform. The entire thing was a strawman policy they campaigned against. \n\n\nIt's probably why they lost. They weren't campaigning against real issues",
         "Bravo. But with politics the truth doesn't matter, just what people believe.",
         "helll yeahhh we love our women, thats why we voted ❤️🇺🇸",
         "I keep telling my lefty friends “nobody wants to take your right to murder your ugly annoying baby in a demonstration of piety to your dark god molech” , we just want “common sense abortion legislation” .",
         "Don’t forget the Democratic Party is in office and hasn’t issued the reinstatement of roe v wade… I wonder why they aren’t getting it done?",
         "Everything you said is true 👏",
         "Republicans haven’t taken abortion away! They just deferred to the states. Now the citizens of each state get to choose their own abortion laws.",
         "I voted this year only for my daughter.",
         "100% agreed!👏🏽\n\nUnfortunately abortion is not a right, it’s a privilege. Since abortion is a service, we don’t have an unalienable right to abortion, since it’s predicated on another individual performing that service. \nIt should be a states issue, just as our founding fathers intended. It’s not a *right* that needs to be protected under federal law.\n\nI voted for Trump, but I also voted for abortion access in my state election. A women’s right to abortion now lies in a state election, and this likely won’t be a presidential issue ever again.\n\nTo each their own, but I find it weird that abortion is a voting issue for some people. It feels like an uninformed take. You want to “protect” your child getting cream pied and their ability to abort the fetus? Lol. It’s so strange. \n\nMost people will go their whole life without having an abortion. It’s an issue that won’t affect the majority of Americans. Yet the economy, taxes, and inflation we feel every. Single. Day. And that’s not a voting issue for these people!? Go figure.",
         "Nailed it",
         "Nailed it 👏",
         "I do have a question and hoping to not get blasted. \nAs far as the abortion piece-While I don't agree with it. \nI can be on hesitation/potential on board if it's before 8 weeks and/or for medical issues(threat to the mother), forced entry(don't wanna say it), or incest. \n\nWith states like Texas-the ban includes medical correct? \n\nAnyways, on board with all of what you said otherwise.",
         "So OP, you prefer your daughter to die than to have the possibility to abort an unviable fetus causing her severe complications? Quite cruel. Hard ti believe millions of mothers in USA actually prefer death to their daughters.",
         "I thought they tried and failed. I don't see the issue. It gave voters and states more power. If you want more or less abortion get out and vote for the appropriate candidate. Or move to another state.",
         "They had all the branches and a supermajprity in 2008.  They could've done it then.  It's nothing but a voting issue for them, they don't believe their own rhetoric",
         "Exactly they had many chances to pass something since roe v wade ruling to when it was overturned yet did nothing.",
         "To be honest, I don't think prices will go down... I'm thinking we will have more money to buy the groceries. Regulated prices like gas... And corn.... Might go down... But the idea is to have a better job making or keeping more of your money earned to spend it...",
         "Thank you for this. I just got into a huge argument with my mom because she couldn’t believe how I could vote red. I also considered myself a Dem for my entire life up until the last few years. I’m glad to see I’m not the only one going through this shift",
         "You are right Supreme court made a statement that no president will be able to change it and it is a state by state thing.",
         "Texas allows for medical but most states allow for all the exceptions",
         "Even RBG said that *Roe* needed to be overturned and she further said that if it came to the Court, she would vote to overturn. She died before that happened, but even as blue as she is, she understood that *Roe* was a bad ruling, as it legislates and that is not the job of the Court. Giving power back to the states to decide is the correct decision.",
         "You are both in good company! Don’t forget, Trump, Elon, Tulsi and RFK Junior all used to be Democrats too. :-)",
         "If women are really that concerned about getting access to abortion, either move or travel to a state that allows abortion.",
         "Honestly RFK was the reason I even decided to start hearing yall out lol. I loved him and then we he endorsed Trump it was a no-brainer for me!",
         "Or become more engaged in your local elections (which should be the norm)"
      ]
   },
   "1gkv28e": {
      "title": "How It Started / How It's Going",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "This is going to be one of the greatest days EVER!",
         "Well, that didn’t age well! Next time don’t listen to CNN, ABC and etc. propaganda. 😅",
         "Gosh, I suppose they felt overly confident that the whole of America outside of that liberal was completely ignorant. Looks like this on backfired. I found a post earlier in the Spokane reddit about a lady with a bottle of Korbell next to Draino in her fridge. If Trump won, she said she was drinking the draino. Upset that people urged her to do so now... some people are unhinged and completely clueless.",
         "\n\nIf you have to brag about how educated you are, you are not necessarily making the best choices because you are only chatting with yourself.",
         "I don’t understand how people here on Reddit get on here and think they know better than universally accepted statistics.\n\nGender equality was nowehere near the biggest issues of this election, the biggest issues were overwhelmingly inflation, immigration, and the economy. Harris polled terribly in all those topics.\n\nWhy do we deny the answers right in front us on this website? It’s foolish and weird how badly redditors here gaslight and argue facts",
         "LOL",
         "It’s going to be so hard not to go back to all those posts where people made their guaranteed prediction or bet and not ask them how they feel now.",
         "🤣🤣🤣🤣",
         "Some folks need to learn things the hard way.",
         "I remember this post it’s hilarious now. That and the Selzer Iowa poll that was about 15 points off.",
         "5 Million more people voted for Trump and he won the EC.....hahahaha! Love it!\n\nThey thought they were going to win with all their bumper stickers and yard signs.....difference is Trump supporters don't put them out as the left will vandalize property of his supporters so we just smile and sit silently and let our vote do the talking.\n\nThere are so many people having meltdowns right now and I am loving every second of it.\n\nSomeone posted a photo of the statue of liberty crying into her hands. Why, because we held an election and the person you wanted did not win? Sorry, (not sorry), that is call democracy, deal with it.",
         "I guess he lost 10k. They are so sure of themselves all the time and that is the dangerous part.",
         "lol",
         "Can’t afford a phone anymore",
         "Hahahahahahahaha",
         "LMAO!!!",
         "Whew. Imagine not just crying over it but also losing cold hard cash over it.",
         "😂 good thing he has that degree",
         "Hahahahahahahahahahhahahahaha",
         "Now let him get in and start fixing some of the major issues we’re running into. First thing he needs to do is Russia and Ukraine to the table and find a way to end the conflict. Second broker peace in the Middle East again, especially between Palestine and Israel. Once those 2 are complete he can start working on other issues.",
         "bro is so cooked ngl\nHe's probally in crippling debt now",
         "Major oof",
         "I was just thinking of this too",
         "😂😂",
         "Lmaoooo",
         "Ha!",
         "But he had an advanced degree in policy analysis (associates from local community college)!",
         "🤓",
         "Hahahahahahhahahahahaha....I saw that guus post and was like...WTF?!?",
         "I bet $100 on harris but voted for trump, that way if he lost I would get paid in compensation, but if he won, that's what I wanted in the first place.",
         "You can bet your ass this post was the FIRST one I went to",
         "This is awesome the left deserves everything they have coming for the way the ban, Harass, and lie about what has been happening",
         "These recent elections show that you cant trust early voting",
         "DOH! That dude right now, \"Whatdoyamean I lost\"?",
         "Hahahahahahahahahahahahah",
         "Wow, their job in political data and \"advanced\" degree in policy analysis really paid off!",
         "I hope there can be fair reporting rules put in place",
         "🙌🏼🙌🏼🙌🏼",
         "Ive seen at least 3 tiktoks with that same message",
         "No disrespect, but those should not be the first priority.  Although I do understand the impact to America, we need to focus on illegal immigration and the economy.",
         "My boss and I call that emotional hedging lol",
         "Yes, news media like cnn and all that brain rot needs to be neutered by trump, they have brainwashed too many people 😭"
      ]
   },
   "1gl0yg2": {
      "title": "Go tell your Mamala ",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Now she can go back to her middle class neighborhood.",
         "Nobody I know liked her. Not one person.",
         "They couldn't steal it this time!",
         "She would’ve done so much harmala\n\nThis is truly karmala\n\nThe silent majority has spoken, la la la la la.",
         "Trump should officially offer her some menial,  brainless position in the WH.  Janitor or some shit",
         "Now, let's ACTUALLY turn the page.",
         "Farted",
         "Worried about what her supporters will do.",
         "She is such a sore loser too. Radio silent all day yesterday and today. Now won't speak until 6 pm tonight? Just concede. You lost Harris. Take the L and get out of here.",
         "🙏😂",
         "Hell yeah!!!!",
         "Looks like she's going back to putting her head down",
         "🤣",
         "I think Biden voted for Trump",
         "They were being closely watched by everyone",
         "She already has one",
         "Get that last breath out",
         "Did you see Jill wore all RED when she voted!!  LMFAO",
         "I did not but I’ll have to look it up 🤣 \nIt’s a new day in America 🇺🇸"
      ]
   },
   "1gkybjs": {
      "title": "That was fast. ",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Why is the Texas sub full of democrats?",
         "A recession is step up from the current depression of the Dems",
         "Some women on Reddit have already reported being shackled to hospital beds and forced to have their children /s",
         "I got banned from r/Florida and I’m a born and raised Floridian. MOD’s are BIG MAD after last night.",
         "Yeah dude, I got banned from that page a few weeks ago. Fuck them. I created Texas_Red page to try and get real Texans a place to speak their mind.",
         "I was banned from a different texas sub today for commenting Trump 2024. \n\nLike ok, go enjoy your scream. Lmao please.",
         "“Spam” lmao",
         "The Dems created the coming economic fall. Harris said it in the debate, it's coming next year. You already know they are going to blame Trump. Complete setup.",
         "# Post the pic of Biden wearing the Trump 2024 hat to r/pics I was perma-banned from there for posting a pro-GOP pic last week. It was my first \"offense\". I appealed. The Mods laughed. Liberal garbage dump.",
         "Oh man, I haven’t been banned from a sub yet. This week is gonna be my first!",
         "You're a savage and I love it",
         "It's amazing that every democrat saves the economy from  the evil Republicans but no Republican has ever helped the economy. Ever in life. According to Democrats. They inherit nothing.",
         "He caused a recession?",
         "Well go thru a little shit the first yr while he tries to fix all the bs the dems did for sure. But it won't be 4more yrs of the bs we just put up with.",
         "I love the enforcement of the First Amendment here on Reddit. /s",
         "They mad mad 😂😂",
         "Haha, they banned me about a month ago for talking about trump positively. I waited til now to rub it in. The mods get your messages if you reply to their ban message 😉",
         "The cope is palpable",
         "All the weirdos from Austin and San Antonio gather together to “prove” Texas is blue 💀",
         "Cause none of them are actually from Texas 🤣",
         "The page is ran by Dem and he blocks and bans every Republican that pops in. That's why it seems like there's so many Democrats for Texas. There really isn't.",
         "All \"location\" subs are.  The Florida sub is in full meltdown right now about their own states votes.",
         "Just read about the mod there Anna Trash Panda. His/her goal in life is to dismantle republicans. You are better off muting it and moving on. \n\nOur voice is better heard not joining subs like that. It will dry up when they have nobody to argue with and lose interest.",
         "Reddit is SO blue and we see clearly w the majority vote that it’s not representative at all",
         "It’s the same in the FL subreddit. They were so convinced Florida was going blue, and I got downvoted and my comments deleted anytime I said they were crazy",
         "Man I am in the Texas Reddit and the last few weeks I’ve been thinking shit trump is gonna lose if Texas is talking like this… even Texasgun Reddit downvotes trump support crazy.",
         "Florida too. Annoying",
         "Bots",
         "I received my handmaid’s outfit this morning /s",
         "Thank you.",
         "Could you elaborate?",
         "The only thing blue about democrats today is their bruised asses after the spanking they just took.",
         "Act like*",
         "I strongly believe that. People in r/Texas claim to move to Texas just to vote blue. Doubt it.",
         "I think you are wrong on this. I left California for a reason and else leaving democrat states is not voting blue when they get here.",
         "I wish it were just the location subs. They are everywhere they think they can stifle free speech/thought/expression. Go have a look at r/facepalm... it's hilarious. People were talking about moving to mexico earlier.",
         "So is Georgia. All political threads were locked this morning. I haven’t looked since about 6:30 though.",
         "Tbf that might only be because they don’t hit that 60% recreational weed vote and it got denied again",
         "Are you the crazy that dressed up to vote? 🤣🤣",
         "Harris mentioned in the debate that economic trouble is coming in 2025. Her argument was that Trump's policy plans won't stop it, but hers will. They will blame Trump for what they have obviously been trying to make happen, a collapse of the economy of America. When it happens, and it will happen, it will be like Covid. Trump is bad, Trump caused this, etc... Mark my words.",
         "I was talking about the Texas subreddit not being filled with people actually from Texas. Anyone can participate in the subreddit. That’s probably why Texas seemed so blue only on Reddit",
         "Genuinely I hope they do.\n\nLet the cartels deal with them.",
         "You caught me. Just went to the doctor and went to the grocery store before they revoke my healthcare and my husband won’t let me leave the house, too.",
         "Right but like what’s driving that economic collapse. Kamala said a lot of things with no basis, it’s why she lost haha.\n\nNot trying to argue with you either just trying to point out we shouldn’t really put weight in what she says unless she was able to logically and succinctly explain it, which I don’t think I ever saw her do for anything.",
         "Damn straight. I hope Obama and the Clintons join them.",
         "Wait... you're allowed to leave the house?? Is he some kinda liberal? I assumed you'd  escaped!",
         "We have all seen the Democrats out of control spending.  Americas debt is now pushing to 40 Trillion. They spent all our money on foreign wars, illegal immigrants, social justice programs and policies. I believe the WEF, the new world order, is real and the only way they can succeed is by tearing down America. What best way to do that? Destroy the economy. It's all setup to happen next year, Kamala even called it out ahead of time. They will blame Trump for what they caused. I'm not sure how else to explain it, hope that helps.",
         "I'm inclined to agree. The flip to that is that the machine is still running the country until jan, not beyond the realms that they set an economic time bomb.",
         "I did escape! And I felt like my life was going to end as soon as I walked outside.",
         "Well, stockholm syndrome is the only true way to train a wife tbh. 🤣🤣",
         "On a serious note I did go to the doctor and the store and in my neck of the woods there was a sense of happiness in the air. Everyone seemed to have a bit of pep in their step today.",
         "That's great to hear."
      ]
   },
   "1gksrck": {
      "title": "Coming soon….",
      "text": "",
      "comments": [
         "I’m loving every minute of this!",
         "Already happening. The idiots over in r/pics have their hair on fire.",
         "Even with all the media bias in her favor, including reddit, Kamala got swept lol",
         "I pray to god they don’t riot and pointlessly destroy small businesses and storefronts",
         "Post that to r/pics for a laugh!",
         "Love that clip, first think I thought of when I read the news this morning",
         "I just spit out my coffee!!!",
         "I can’t wait",
         "no you didn't.",
         "Caught me",
         "Caught you hoping for updoots."
      ]
   },
   "1gl24sv": {
      "title": "R.I.P. Hollywood Celebrity Presidential Endorsements: Taylor Swift, George Clooney, Robert De Niro, Beyonce Fail to Secure Victory for Kamala",
      "text": "Trump does not need celebs. He has the overwhelming support of everyday Americans.",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Nothing is making me happier than knowing these arrogant celebs cannot influence elections.",
         "Oh God, I bet the De Niro breakdown is absolutely epic.",
         "The Diddy's Party Attendees",
         "Most satisfying is the B&M Obama failure...",
         "Let them all leave America and never come back",
         "The ones claiming to leave the country if orange man bad is elected should be forced to leave the country or all income taxed at 100%.",
         "You mean the people that act like other people for a living were not able to sway the American people to follow their endorsements?? Get outta here.",
         "The pedo party reps never made a difference in the first place.",
         "Imagine voting because a pedo celeb told you to.",
         "Taylor Swift's stupid looking face is making me happy.",
         "They can all jump ship to Canada. Or cartel ridden Mexico. We don’t need them.",
         "How many are now exiting the USA now please?  I know Cher and Barbra Streisand have said this.",
         "Coincidentally, most of these people have probably attended a Diddy party.",
         "I'm sure they're all packing up to move about now",
         "I bet it was. I would pay for a movie ticket to see that on the big screen.",
         "And they thought that crowd was going to inspire people to support them?",
         "Yeah that surprised me too. Kind of Brazen of them to do that. Nobody in their right mind is going to vote for someone endorsed by people affiliated with credible child abusers. ",
         "But to the crowd that their biggest issue is being able to kill their unborn babies I can see them admiring these child abusers."
      ]
   },
   "1gkymxr": {
      "title": "Just got bad from a subreddit for a very mild comment",
      "text": "I felt this was very mild of me to say but I should have know how fragile the libs are today 😂",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "So typical. You stated a fact, exactly what they don’t want to hear.",
         "The only people that didn't support Trump through this were illogical and dilusional, their opinions don't matter. And hopefully they can gain some common sense over the next 4 years.",
         "There alot of angry mods out there and they are lashing out with these bans.",
         "Exerting the only control they have left. Tantrums are all they have now. \n\nAlso, expect every conservative on wikipedia to suddenly be described as a nazi sympathizer.",
         "They just lost an election they thought was in the bag, give them some time to mourn🙏🙏",
         "Oh hey! It's their famous inclusivity and tolerance in action! :D",
         "Lmao. The absolute state of Reddit mods",
         "Lol!",
         "I have not been holding back. I mean, I haven’t been mean or disrespectful in any of my comments, but I have been very loud on Reddit for the last few days and surprisingly haven’t been banned anywhere yet. Though, I expect it sometime today. They’re gonna retaliate and start banning for any right wing views cause they’re mad",
         "There have been so many cases of women getting raped and killed by illegals. Women were never safe under Biden-Harris.",
         "Brah I got banned from the AEW subreddit for a trump post lol 😂 they mad",
         "I am Scottish and literally got my visa and moved to the US when Trump was president back in 2019, I started the application in 2017 and it was not made harder because I did it legally. I am baffled how people are coming up with this fear driven nonsense about him making legal immigration harder or more difficult, there is nothing to suggest that.",
         "Now you know who the fascists are.",
         "I honestly enjoy their mental deteriorations way more than I should lol",
         "You can't tell them anything when they are going on about imaginary scenarios about bad orange man.",
         "I just got banned from one sub simply for my belonging to another sub they object to. WTH?",
         "You said nothing wrong.",
         "I was quietly banned from /pics . Someone didn't like my post I guess. I'm poignant but usually pretty milk toast.",
         "You stated a fact, they call it sarcasm.",
         "Honestly I’m surprised I’m not permanently banned. Reddit is a very liberal LGBTQ+ supporting media. I’ve said some wild shit and not been banned, but I’ve also said some not so bad shit and been temporarily banned",
         "Liberals are nazis",
         "I think Redditors are just getting tired of seeing politics leaking into non-political subreddits.\nGoodness know I am...",
         "They want to wallow in their sadness.",
         "How do I find my own comments?  I got permanently banned from r/pics for some reason but I don’t remember the comment.",
         "They cannot handle the truth, that’s why they hide in their subreddit echo chambers.",
         "I got ban in liberal subreddits too lol, i guess they really believe in \"free\" speech and \"tolerance\"🤣",
         "It’s weird their delusional beliefs about visiting and working in the country. We just want people to enter the country legally, just as millions of others already do.",
         "Remember we are the fascists",
         "With jokes like that, you could give Bill Burr a run for his money 😁",
         "What else do they have? What else have they had? None of that is accomplishing a damn thing. Have at it.",
         "Speaking of wikipedia, I've just compared Trumps page to Kamala's, yep...toatlly neutral 😐 🤣🤣",
         "I got 3 hours of sleep last night from anxious anticipation. I'm too excited to sleep today. \n\nWith this level of sleep deprivation, if I see someone crying over this today, I'm not going to be able to control my laughter 🤣",
         "I like being called a fascist, it's my favorite \"ist\" of them all",
         "Lukewarm IQ comment.",
         "Fair."
      ]
   },
   "1gkt074": {
      "title": "USA",
      "text": "",
      "comments": [
         "Drink Yuengling, celebrate with PA",
         "Heineken?! PABST BLUE RIBBON!",
         "Get a Bud instead brother😂🍾",
         "🇺🇸 Home of the brave. Home of the free.",
         "Hulk Hogan's beer is the way to celebrate this election",
         "Man. You’re right 😂",
         "Don't listen to him 🤣 Heinekens are my go-to.",
         "Did the pbd podcast get better. I left bc the audio sucked, they didn’t have the guests the claimed they would. And the crowd there was tiny. Granted I did stop watching early so I hope it got better, I love pbd"
      ]
   },
   "1gl1k6b": {
      "title": "Trump wins three times in a row.",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "<--- Marked safe from the Cackling Cackler.",
         "You might get to see that revealed to the sleepers very soon 👍🏻"
      ]
   },
   "1gkm92n": {
      "title": "My liberal dad",
      "text": "My liberal, Korean immigrant dad has never voted Republican in his life. \n\nHe hated Trump - believed all the media said about him stating he’s “racist”. \n\nHim and I have had many arguments over our views. \n\nThis year that changed!! I could cry! ",
      "comments": [
         "“Economics”\n\nBiggest topic I pray voters remember at the poll!",
         "Awe yay dad!!",
         "Wish I could get my mom to!",
         "Love your dad, he looked at what was best for the country! Thank him!",
         "Good job Dad!",
         "My parents still buy into that liberal bs even though everything I have tried to prove to them you’re lucky",
         "God bless your dad!",
         "My family voted all red for the first time!",
         "Same with me\n\nI’m a registered dem and voted for Trump this election.\n\nKamala and the Democratic party has nothing to offer",
         "Go Dad!",
         "Mom, dad, wife all voting for Trump! My brother wants Kamala for some reason bit he's not voting so woohooo",
         "Your dad woke up!! 👏",
         "Immigration issues is the MAIN reason why I’m no longer considering myself a Lefty",
         "Many people have come to see the truth. The media can’t fool everybody.",
         "LETS GO CO DAD (from a co native.)",
         "Go Dad! I wish this was mine dad!",
         "Families will reconcile holiday season ‘24!!!",
         "He sees the light and isn’t a traditional lefty",
         "The great lakes states is what I'm worried about",
         "WE DID IT!  TRUMP WON AND ITS HISTORIC!",
         "I think this happened a lot more than people think. Common sense flipped a lot of staunch democrats.",
         "Hmm 🤔 Hello from Vietnamese (to Korean)- I thoughts Viets going split. Can’t say",
         "😂",
         "It’s getting closer tho.",
         "Bad democratic Economics and border policies are backfiring.",
         "Good man",
         "And the springs looks to be red. Good on them!",
         "Almost every first/second generation immigrant I have spoken to is super upset with the current open door policy. \n\nAs someone who naturalized recently, I share this view. Legal immigration is good for our country, this open door jump border BS isn’t. \n\nRemind me how many millions have walked through the Southern border? Is this the message we send to the world?",
         "W for dad 🫡",
         "That’s awesome!! Happy for you :D",
         "Your Dad is so proud of you!",
         "Awe that's awesome",
         "WE DID IT!  TRUMP WON AND ITS HISTORIC!",
         "Thanks dad!",
         "We fucking won and I’m not going to edit this bc I know the mods here know we defeated evil and will hopefully give me a pass before the democrats try to not certify this. I still don’t trust them.",
         "Are the reasonings for other people that don't vote republican the same as ops dad",
         "W dad!",
         "Dems really underestimated immigration and the economy.",
         "Like literally every American with a brain last night voting",
         "The immigration issue is out of control. There are way too many Mexicans in my state (Tennessee)",
         "Now that’s a Dad that knows how to use his brain",
         "Tell your dad I said I love him",
         "Hope your dads happy he won",
         "What metric/factor is used to determine if an economy was better under a former administration than the current? \n\nPlease don't say stock market or gas prices.",
         "Yes! If nothing else, please remember that. That was what I tried to get my friend to remember. She’s a democrat, hates Trump and always has. This time she also hates Kamala, so I’m hoping that bringing up the economy pushed her for Trump this time.",
         "\"It's the economy, stupid\" - Jim Carville",
         "Good Dad indeed. \n\nIt's sad though that the far left 8 year disinformation campaign has essentially intimidated people into not openly stating they're for Trump.\n\nThe left Progressive disinformation campaign was successful enough to prevent a conversation between a Father/Daughter from being open about it with each other until election day. \n\nThat's not a knock at all on the OP. That has become \"normal\" for millions, including myself. A lot of people were manipulated into feeling ashamed for supporting Trump 8 years ago.\n\nI'm happy that the conversation was eventually had with OP and Dad.\n\nWe can't let the mainstream media dictate our conversations with FAMILY!!! Or for that matter.... friends and family, or anyone else.\n\nIt's a Liberal tactic to scare people into not using their 1st amendment rights!\n\nAs a 40 year old, I bought my MAGA hat 9 months ago. I was initially afraid to wear it in my incredibly liberal state. I was afraid to wear a fucking hat! Eventually,  I said fuck this. I'm not going to be silenced. Oddly enough, the response by people was far more positive than negative.",
         "me too, as someone living there!!!! so anxious",
         "Good for you. I am a Republican woman, but it's funny that over half the country has voted for him (so far), yet I didn't seem to run across a single Trump supporter online anywhere the last few months (particularlyin female groups). I, too, stayed mostly silent (especially on Reddit). Dems seem SHOCKED now; they no doubt assumed that their seemingly unopposed voice was the only one.",
         "Same. I learned to shut my mouth and just vote about a decade ago."
      ]
   },
   "1gkssdx": {
      "title": "TRUMP WON!!",
      "text": "Congratulations brothers and sisters, we have achieved victory and it couldn’t have been done without all of us getting out and voting like our lives depended on it. Amazing job!!!",
      "comments": [
         "Who’s gonna tell Mark Hamill?",
         "Senate too and prob house. Finally, normalcy.",
         "Trump 2024 YAY 🇺🇲🇺🇲🌟🌟",
         "Fuck yeah! Fuck the establishment!",
         "God bless America!",
         "The greatest GOP ground game in my 71 years on Earth.",
         "Obi- Wan's ghost keeps him up to date on politics",
         "Yes, house too. Democrats were decimated this election."
      ]
   },
   "1gksrj8": {
      "title": "WE DID IT! ",
      "text": "",
      "comments": [
         "Proud to be part of the red wave",
         "🇺🇸",
         "I like this.",
         "We did it!!!\nGreat day for normal Americans.",
         "What a freaking demolition.  Even George W released a statement of support for Trump just now.  A mandate for the people BY the people.  Incredible.",
         "And Kamalalablah without even so much as a life-jacket.",
         "AMEN, PRAISE GOD!!\nOur precious nation may now see a true return to common sense and patriotism. \nOur prayers must now shift to President Trumps safety and the decline of hatred.\n(On ALL sides, parties, genders, and races.)\nWe need PEACE!! God Bless the USA",
         "You are going to ruin her nice pants suit."
      ]
   },
   "1gl1uvl": {
      "title": "Red wave and your vote ",
      "text": " Nothing better than walking up to a notification on your phone saying Trump the 47th President. ",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "That's our president!"
      ]
   },
   "1gke537": {
      "title": "White, college educated, women for Trump (because there are so few of us, according to the left)",
      "text": "",
      "comments": [
         "Not as rare as you would think, but media narrative would certainly make you feel like a unicorn",
         "Same here 🙋🏼‍♀️",
         "Lol. Thank you. Felt a bit lonely for a minute.\n\nEdit: Are you now feeling much less lonely and walking with some pep in your step?",
         "Same here! 👋",
         "Count me in! The propaganda would have us believe otherwise, but we’re out here!",
         "I am a woman, white and college educated. I voted for Trump!!",
         "I am a lesbian woman and I voted for Trump",
         "White cat lady here! Voted Trump because I don't believe the propaganda.",
         "Gay guy here, voted for Trump. We exist!",
         "Also according to Reddit. I isn’t realize this was a liberal hot pot",
         "[deleted]",
         "My Masters Degree white wife has never voted for president before, but voted for Trump. Side note, I’m a blue collar union guy and voted Trump.",
         "Take that, Mark Cuban!",
         "Me tooooo!",
         "Same here!! 👋🏻",
         "Me toooo! 🇺🇸🙏🏻",
         "Yep. We are all fascist, racist and uneducated garbage according to the left.",
         "Same here. I am a late 40s, suburban mom. So much I don't like about him. An imperfect choice, but far better. Beyond the policies and general concerns I'll also be upset if she gets to be the first female President.",
         "Bisexual, college educated, nurse for trump in a blue state 🇺🇸",
         "Yep, me too!",
         "We need more of you ladies!",
         "Same here!",
         "hell yaaa!!!! me too!!!  lets go Trump!!",
         "Saaaammmmeeee",
         "My wife just voted for Trump -who has 2 college bachelor degrees, and isn't white.",
         "Same here! 26 year old White, college educated women who voted for Trump. I wish more people my age were able to think on their own instead of being indoctrinated by the left.",
         "Same here!! There are many **Strong** and **Intelligent** women who voted Red! ❤️🤍💙",
         "Also a white, college educated woman who voted for Trump. 🙋🏻‍♀️",
         "SAME!",
         "They call it “manifesting”",
         "Me too.... voted red straight across! 🇺🇸❤️🤍💙🇺🇸",
         "God bless you!",
         "Yes!! ❤️❤️",
         "Thankyou my fellow Republican.",
         "+1 white college educated woman for Trump here in PA",
         "Wait.  You’re an intelligent, educated woman and the left allowed you to think for yourself?  Stunned the thought police are not knocking on your door.",
         "My mom voted for Trump yesterday in CA.",
         "LFG!!!",
         "We are vast in quiet numbers and we are wise.",
         "My wife is also white and college educated and voted Trump. Although when we were voting she and the other white lady in the booth next to her gave a knowing look…\n\nKidding of course.  She was going RFK but decided to go Trump after he picked Vance; we had watched Hillbilly Elegy ages ago and didn’t realize it was about him until he got tapped for the VP spot.\n\n\nThe dems would have you believe all the white women “secretly voted Harris” because they don’t want their stereotypical abusive husbands to find out.  But unlike the Left, we know that women are more than their gender, can think for themselves, and make their voices heard.",
         "They do exist!",
         "Count me in!",
         "I am a white, college educated mom who voted for Trump!",
         "Good on you!\n\nDon't believe the hype.",
         "There will be women that will vote Trump. Women have jobs and need to pay bills too. Money talks and so rationally the economy is in shambles. We just have to wait and see.",
         "Southeast asian, college educated, SAHM and for Trump. Most of my white and Asian friends thought I’m a Kamala Voter because of my minority☠️",
         "Same",
         "We have very educated women on this side of the aisle",
         "Me too! 🙋🏻‍♀️",
         "Let's gooooo 👏🇺🇸",
         "Thank you for your support! We will get this done!",
         "Thank you!!",
         "I just voted to allow abortion access in the state I live in. I believe women should decide what should happen to their bodies. I will not impose my personal believes on anyone else.  I also voted for trump, because I see no future for my kids with democrats in charge. I see my money being wasted in forever wars and getting sent to illegals. ",
         "Me too. I’m not a racist. I’m not a nazi. I am actually a very nice person that just sees through the Democrats bullcrap and lies.",
         "Considering the dems lie about dam near ecerything else, this is just another one.",
         "Veterans For TRUMP",
         "Let’s pray for America’s return as a proper democracy! TRUMP 2024",
         "I also voted today.",
         "Mexican/German college educated woman here, just dropped off my ballot!",
         "Very concerned about Pennsylvania right now. Get everyone you know to vote!",
         "I sent my fiance a deep cleavage pic with my sticker on. He replied \"Yay! Boobies for Trump!\". Lol!\n\nComing from one of the most important swing states, Trump got my vote.",
         "SAME!! LETS GO TRUMP",
         "My Gen-Z girlfriend (first time voting; also white, college-educated) voted for Trump with me yesterday in Colorado! More common than you think. We're sick of the woke shit and Democrats ruining our state here in CO.",
         "Thank you",
         "Cuban women for anti communism!!!!!!! 🇺🇸🇺🇸",
         "Mexican American women veteran with 2 degrees and a software engineering certification voted Trump",
         "💪 me, me, me 🇺🇸👊🇺🇸👊🇺🇸👊🇺🇸",
         "Thank you for doing the right thing and not keeping it a secret xD (god what a stupid ad)",
         "Good for you I voted for trump too",
         "Same here 🖐",
         "There are lots of us!!",
         "Ladies join the Cuteservatives Facebook group \nIt’s a big group of conservative women",
         "I'm (44f) on my third educational endevour for career change. Voted Trump 🤞🏻🇱🇷",
         "Same here",
         "Same here!! ✋🏻",
         "black lesbian for trump let’s all UNITE!",
         "The silent majority 🫀",
         "Another woman with the felon here!",
         "Same!! Did my civil duty this morning and voted for President Trump. 🫡",
         "Checking in from a blue state! White, female college educated.",
         "Me too! In Southern California 🤘🏻",
         "I’m a white male who identifies as a white college educated woman just for tonight 😂. LFG Trump!",
         "As a lifelong democrat. I voted for Trump this year. Let’s go!!!",
         "#Fucking right! Latina woman with a Master’s degree for Trump!",
         "Also, a white woman with a college degree.  Trump. 🙋🏼‍♀️🇺🇸",
         "God bless America. New Republican Party has arrived…",
         "YES! Doctorate, 42F here. GO TRUMP, GO!",
         "There's one right here!",
         "Bless you",
         "Here!!! 🙋🏼‍♀️🙋🏼‍♀️🙋🏼‍♀️",
         "I am a white, professional degree holder that voted for Trump! 🇺🇸",
         "Lefties control social media so ofc they’d want that kind of mindset for their consumers",
         "They kept referring to it on various news channels also. Such a crock \n\nSigned, a white college educated woman.",
         "SO HAPPY I CAN GO ON LIBERAL SUBREDDITS AND SAY DONALD TRUMP IS YOUR PRESIDENT",
         "You’re in the majority! Thank you for voting with your mind!",
         "Much love to all the rational, informed, intelligent ladies in this thread who can think for themselves. 💕",
         "Proud of you",
         "White, college educated, third Time voter of my President!🇱🇷❤️🤍💙",
         "Going back to 2016 the New York based newsmedia said Trump voters where poorly educated white racists. They were wrong then and wrong in 2024.",
         "I'm not even college educated and was smart enough to vote for Trump!",
         "Well said",
         "I am with you!! Two degrees and a masters!",
         "I've been paying union dues for 25 years, and once again,  I voted for Trump!  As did many union brothers and sisters.",
         "More of you than the media cares to admit or announce.",
         "Me too! I confuse the hell out of them. Masters degree, really into musical theater, board games, and dungeons and dragons.  Conservative my whole life.",
         "Her entire campaign headquarters is a bunch of 20 somethings… the squeaky wheel types… the safe space kids… the snowflakes… 😳",
         "According to the media, you mean…",
         "im genuinely happy you did your own homework, research and did not let the mainstream media decide your way of thinking.",
         "Let's goooo🫡",
         "Same !",
         "Has anyone on here seen the punk page? Literally all you see is swastikas and Trump and \"his voters nazi's\". I asked them aren't you guys supposed to be anarchists? If you vote, you're involved in government, they confused.",
         "With ya.",
         "Hey yo\nMe too",
         "My wife and I both voted for Trump today",
         "\"Ahh, you voted for Trump that automatically makes you uneducated and a racist\" --Some Democrat Somewhere, Probably.",
         "I used to think people like you were quite rare but the more I talk to other college educated women, the more I realize it's not really as rare as one might think. A lot of them just keep quiet about their political views to try and avoid conflict but there are more of them that support Trump than I ever would have thought.",
         "Hell yeah",
         "Me too!",
         "Hey, hey 👋",
         "Also one 💃",
         "Also college educated with 2 degrees, Summa cum Laude.... voted for Trump and no man or woman told me EVER who I had to vote for.\n\nThey claim conservative women are controlled by the men in our families, except I have 3 sisters voting for Trump and no father alive to control me, while the soy-boys on the left are made to bow down to their women at all times. \n\nI guess I must have used my own mind to decide for myself. Go figure.",
         "Right! There are none according them… I just don’t get them. Why do they think insulting women is the way to bring the Country together… seems to me, they aren’t very diverse, inclusive or equal at all… God Bless America! 🇺🇸💕",
         "Im also a white college educated women!",
         "I was #1207 in a small Alabama town. I’m also a smart, educated woman that also voted for Trump! Let’s win this!",
         "Trump 2024🇺🇸",
         "Same!",
         "Same here!! 🙋🏼‍♀️",
         "Native American,  college educated,  Woman for Trump. \n\nBecause I have more than 2 working brain cells.",
         "28f, white, for trump!!!!! I know tons my age for Trump",
         "Same here.  Woman for TRUMP",
         "Same here 💗",
         "My wife too!",
         "I’m a white woman in college and i voted trump",
         "Stand tall your in good company here . I just tryed to post in r / pics got banned because I’m a conservative as jack said they can’t handle the truth",
         "Well, statistically, college educated women, at least in recent years, tend to vote democrat. I wouldn’t say there are so few of you all though. There are a lot of college educated women who don’t vote democrat. I think the left, in the least politically correct way possible, is trying to say that it’s statistically less likely. Glad you’re thinking for yourself! Do what you think is right!",
         "All but one of the white, college educated women I know through business or personally are conservative both economically and socially.",
         "Same here!",
         "Same here. I cast my vote in person on 10/28, and it felt great to be among the early red birds.",
         "Same here!!",
         " Same here.",
         "Hi! Same! 🥰",
         "Same here! 🇺🇸",
         "👋👋👋",
         "Same and same.",
         "💖💖💖",
         "Same 💕",
         "Here too. I know hardly any fellow college-educated, white women IRL who voted for Trump. All the friends who live near me vote blue.",
         "White, educated, trump voting woman here🙋🏼‍♀️",
         "👏👏👏",
         "Wife is in the same boat",
         "Another white, MBA, woman trump voter!",
         "A white, college educated, cat lady for Trump here! I just couldn’t take the lies and propaganda from the left. Plus the economy under Trump was prosperous!",
         "Thank you for doing your civic duty.",
         "Same here! My mom also ❤️ We are here. I would've hated for Kamala to be our first female president.",
         "Same here from Jersey!! Trump 2024!!!",
         "Sis you are not alone. I know multiple in CA.",
         "you're not alone! college educated, advanced degrees, mother, living in a blue state - voting for trump!!",
         "I voted for Trump in my blue state that never goes red. Almost felt like a waste of a vote Knowing my state will be blue regardless, but it felt good to exercise my right to vote. Maybe my blue state will have a stronger red margin than normal!",
         "Christian, white, educated woman with a husband, stepson, and baby on the way! We took our son with us to the polls and tried to explain as clearly as possible to a 5 year old what the importance of voting is. \n\nNaturally, red across the board.",
         "Did you ask your husband first?",
         "It’s so weird seeing posts like this on Reddit. I’m used to seeing the brainwashed libtards complaining about Donald trumps criminal record that has NOTHING to do with how his presidency will turn out. They just say that to have SOMETHING against Trump. Now I’m not saying Trump is the best president in history, but he’s definitely the better of the 2 poisons for sure",
         "What abortion rights and access to birth control for all. I love creampies and using plan b is painful asf but I also want Trump to win.",
         "Same here. I am Chinese and 21 yr old in college and 100% for Trump",
         "Well apparently Trump is a misogynist and will create a country where hating women is the norm.",
         "Off-topic/ Trivial post: \n\nWhat’s up with the color choices of the women anchors? I’m watching all the cable/networks and it’s like the spice girls or candy crush. I get that they need to avoid red and blue, but yellow? orange? purple?",
         "At first I thought this was r/Pics and was super surprised a red team vote was posted",
         "Election is proving that the swamp is a loud one",
         "Wow",
         "My wife has her doctorate in nursing (meanwhile I just have my bachelor's in engineering), she was rocking a Make American Great Again hat while the first polls closed and we were watching the news. \n\nHer first ever time voting. She was more pumped to vote for Trump than I was 😂 and I've voted for him three times now haha",
         "Woah! All 4 of you are in this thread?",
         "Going to college doesn’t make you smart. I don’t understand why the left thinks that. You literally pay for a piece of paper that proves you sat in a class and learned from an outdated book.",
         "Sheep voting for the wolves",
         "/S Are you sure you aren't just some slave woman that got your stove chains loosened just enough to go and obediently vote? /S",
         "I’m laughing a little - no one believes that there is a dearth of WHITE women voting republican. Maybe not the flex you thought it was? College education is also not an indicator of intelligence…as is easily seen by some of the comments on this thread.",
         "I'm sure there are many of us despite the media! Thank you for doing your part too!",
         "Here too.",
         "Same here! Wore a beautiful red outfit yesterday with some red lipstick. It is an honor to vote for Trump.",
         "Yes. It's felt that way for the past forever, it seems.",
         "I'm starting to despise the statistical data breakdown that they spew as far as voters: \"Women who are slim and attractive and own two cars and have a puppy will always vote Democrat.\"",
         "Welcome to the side of REAL tolerance and acceptance 🇺🇸",
         "Came here to say the same. \n\nThis must be shocking to the left… A woman can be gay, educated and very Republican.",
         "My sister is gay & all of her lesbian friends are voting for Trump too (IN). For her the most important issue is the non vetting of the illegals let in. She’s in law enforcement.",
         "You’re awesome!",
         "My two good gal pals… Vivian and Sylvia…. Cuban lesbian republicans! 😀😀🇺🇸🇺🇸🇺🇸",
         "I literally thought I was the only one! I’m not somebody who needs to see myself represented everywhere, but good lord sometimes it really sucks thinking you’re literally the only one out there in the entire country.",
         "Although most conservatives don’t believe you should have equal rights, whatever…thanks for the vote!",
         "May the lord help you. But thank you for the vote, especially from the young conservatives who can’t yet! ❤️🇺🇸",
         "White dog lady and same 😬❤️‍🔥",
         "Indeed, I listen to Dave Rubin and Guy Benson sometimes ",
         "I’ve gotten attacked in here so many times by libs 😅",
         "They left X, when they realized Elon Musk wasn't going to be bullied into censoring Conservative voices, and came scurrying over here where they *do* censor us. \n\nDaily. \n\nOh, and he doesn't care about getting \"canceled\".",
         "There’s so many libbies on Reddit,glad I finally found this page 😭",
         "Love to see it!! 👏🏻",
         "I didn’t think those existed!",
         "You forgot deplorable. 😉",
         "Changing gears, I believe and support in Christian Universalism (CU) aka UR (Ultimate or Universal Reconciliation) and she doesn't (yet),  though we're both devout believers in God and Christ Jesus.\n https://www.hopebeyondhell.net/articles/further-study/eternity/ \n\n\n And https://salvationforall.org/ \n\n\n And with a great homepage https://tentmaker.org/books/Restitution%20of%20All%20Things/restitutionindex.htm",
         "Looks like Dem messaging may have backfired.",
         "they call it \"pick me\"",
         "whats PA looking like on the for yall",
         "I wish I could give this extra upvotes.",
         "Thank you! And yet the right is the party the media says are the racists? It's sickening how the left group people and pre judge everybody!",
         "Similar views here. Voted Trump. Done with wasting our money. I’m not a fan of abortions, but I do believe everyone has a right to say what happens with their bodies. ❤️",
         "Love this!!! I'm in PA, very happy to vote for Trump!",
         "🤣🤣",
         "👏🏻👏🏻👏🏻",
         "I'm 3 courses away from my masters!",
         "My husband's a union member - LIUNA!",
         "I'm 3 courses away from my masters in library science and most people who find this out assume I would vote Democrat 🤦🏻‍♀️ crazy how people can have various interests that are not simply Republican or Democrat interests lol",
         "I love board games too!!! 😊",
         "Double here!\n\nMBA and in ChemE!",
         "Yes for some reason the punk sub kept showing on my feed!!",
         "And my daughter did too",
         "They definitely do say that.",
         "🤣",
         "Wait, we're allowed to think for ourselves??? But Kamala said....",
         "Funny enough he is only here in the US as a legal permanent resident and cannot vote but he can work, support our family and pay taxes that support illegals  🤷🏻‍♀️ make it make sense",
         "Colleges indoctrinate students to have leftist views so the Democrats probably think that those who go to college all think like them because we were taught to think that way and we couldn't possibly think for ourselves after college",
         "Thank you both.",
         "Thank you both.",
         "and now it's the following morning and we have a winner!",
         "Thank you! This is the reason why I don't identify with the LGBT community today. If you have a different opinion you are an intolerant",
         "Thank you for your words. I shocked a lot of people when I said I was a lesbian and a Republican.\n\nWhat's wrong with people?",
         "Lesbian Squad! I'm in the police too",
         "One of Us! One of Us! 🇺🇸🇺🇸🇺🇸",
         "That’s not true. Conservatives think gays are people and deserve the best. (We are not for the trans stuff with our children or women spaces - big difference) What rights do straights have that gays don’t?",
         "Extremely NOT true..anti trans is not anti gay..",
         "Wtf",
         "Not even close to true. Lol. Just wow.",
         "[removed]",
         "That's one of the most ignore things I've read and I've read transcripts of Kamalas speeches. \n\nWhat equal rights don't we believe they should have?\n\nGo ahead. Enlighten us.",
         "You’re extremely uneducated. Educate yourself before next election please ☺️ (mainstream media isn’t education)",
         "I've never met a politician who told me \"you shouldn't have rights because you're a lesbian.\"",
         "And literal nazis too, apparently. The left accuses the right of being \"hateful\" and \"evil\", but the only hate I ever see is predominantly from the \"progressive\" left.",
         "Also https://christianitywithoutinsanity.com/ \n\n\n\"...Each in their own order...\" -1 Corinthians 15:20-28",
         "And turnt out the liberal are usually the most racist one (it happened to my friends and she cut me as a friend after I gave a birth and I told her that I’m Republican). Also, they usually hate other liberal or hate everyone. I’m confused with those party😂",
         "to quote one of the fathers of a fallen soldier in the Afghanistan pull out, “They have spit in our faces for the last fucking time!”",
         "Plus punks have never been about politics, they're anarchists so I dunno why they gaf",
         "👍",
         "I got my bachelors degree through online learning because I was in the Navy and didn’t have the time for classroom. Glad I was able to skip the classroom.",
         "EXACTLY",
         "Anti making small children trans…. After they are 18? Go for it!",
         "Most leftist on here have the IQ of a rock. It’s very difficult to have a civil conversation with them. They just start name calling and think they’ve won the argument 🤷🏻‍♀️",
         "thats so accurate, ive never seen hate from the right like i do from the left, the main issue i have with a lot of left wing voters is them blindly believing the information that is said by the left without even considering checking the right, that said if someone has fully informed themselves then i have nothing to say",
         "Serious question though. Do you honestly believe that schools are taking small children and performing operations on them? Like is that truly what you think is happening?",
         "Wtf? No. But a lot of places like to put sexual books in their schools that talk about how if you feel like a boy when you're a girl, you're a boy. Kids grow up believing that. Hell, I thought I was a boy for the longest time as a kid, and then I found out I was a girl.\n\nIt is not okay to feed this type of stuff to underage kids. It has no business in schools. I've watched so many videos of parents and even kids reading pure smut that is available in their libraries to their school boards. They are straight up indoctrinating them. Kids are kids. Leave them alone. If they still want to transition when they are an adult, that is their choice and power to them.\n\nHowever, I have also seen de-transitioners talk of their experiences and how they were forced into it. It is disgusting. It is not the schools performing operations. Doctors can be easily bought for the right price.\n\nI am not anti-trans. I just want people to go about it the right way. Leave the kids out of it.",
         "Then your statement above is merely inflammatory and false. We can disagree about how things are and how we want them to be or wish they were - but when there’s political forces pushing false narratives, what you say does matter.",
         "I've known 4 people who transitioned, with each of them they were doing it to escape childhood drama.  \"Gender affirming care\" should include alot of therapy because nothing says instant regret like a M2F transition when they get hit hard with the realization of what it means to be a man."
      ]
   },
   "1gkh4c5": {
      "title": "Latinos for Trump! 🇺🇸🇵🇷🇩🇴",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Thankyou my fellow Republican",
         "Thank you fellow American",
         "We love Puerto Ricans🇵🇷❤️🇺🇸and appreciate you!",
         "I'm not latino, but I just voted for the Don. Judt turned 18 a couple months ago, so I made it in time.",
         "🇲🇽🇺🇸",
         "🇲🇽🇺🇸",
         "Thank you republican brother",
         "That shirt is loud and RAD. Love it!",
         "If bad bunny saw this he would be seething",
         "🇺🇸. Awesome.  😎.  The USA welcomes all who believe in Freedom. 🤗🤗🙏🏻🙏🏻",
         "Ws for trump! IFYKYK",
         "Let’s all work together 😎🇺🇸🙏",
         "Thank you. We need you!!",
         "🔥",
         "👏",
         "If we win I will be surprised and happy.",
         "Me too!",
         "Bless you!",
         "Let's gooooooo! LATINOO!",
         "I agree",
         "Thank you! I’m white and half of my family is Mexican and I know a lot of Latinos for Trump, you’re not alone ❤️🇺🇸",
         "Let's go!!",
         "God bless you, brothers. Patriots unite!",
         "& Latinas for Trump! 🇵🇷❤️\nWe did it!",
         "Thank you, but don’t take pictures in a b\nPublic bathroom, it’s just weird.",
         "Thank you!"
      ]
   },
   "1gkz8ew": {
      "title": "Just wanted to pop in and say hello",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "It's crazy. I was trying to be comforting to r/texas, calling them the pride of our nation, got muted, then banned.",
         "Reddit mods seriously need a talking to",
         "Only on Reddit can you label someone a Nazi for no reason and be totally fine\n\nBut make fun of that person and you're the one who gets 'punished.'\n\nThese people are sad and deserve everything they feel today from sorrow to cope to desperation.",
         " Because we just got through the great cultural revolution and that was so dreamy to live through. /s",
         "That is their famous tolerance and inclusion.",
         "As a Texas resident I'm embarrassed of that subreddit... I skimmed through it and it is just a cancerous tumor from r/politics...",
         "I unjoined r/Texas. They were getting too pissy and whiny for my taste",
         "Maybe you can answer a question, since when has Texas ever been considered Purple(mix of Red and Blue)? Texas has always voted Red. Is it because people from Cali move out of Cali to Texas and vote the same in Cali?",
         "That is most subreddits - insane you can’t even comment a single anti-Kamala thing without getting banned",
         "Californians and New Yorkers moving into Texas automatically assume they can turn Texas blue. It is a heavy mix. I, myself moved from California and was voting Democrat before and woke up and I have been voting Republican since then."
      ]
   },
   "1gkf44y": {
      "title": "3rd time able to vote and 3rd time voting for him! Trump! ♥️",
      "text": "",
      "comments": [
         "Republican girls are way hotter than Democrat girls that's for sure.",
         "This is my first time being able to vote for Trump, as I just turned 18. I did my part today.",
         "If you were Democrat you'd have been able to vote 3 or more times in this election.",
         "I’m in the same camp! My 3rd election and my 3rd Trump!",
         "I just counted how many times I’ve voted and now I feel old",
         "Beautiful & Smart",
         "✌️hell yeah!",
         "Thankyou my fellow Republican",
         "Pretty and strong🫡",
         "Thank you",
         "Wow thank you for your service",
         "My southern Belle 😁",
         "We’re going to win!",
         "Pretty girls for Trump 🇺🇸!",
         "[removed]",
         "Can't believe the DEI hire and the Old Man calling half the country garbage didn't work out.",
         "Wow and beautiful 🇺🇸 let's go 🇺🇸",
         "I've been able to vote 3 times now, all for trump 🇺🇸",
         "Same",
         "Tysm",
         "An angel is on our side boys",
         "Roll Tide, or War Eagle... God Bless.",
         "We have the best and smartest women, folks.",
         "Welcome to your 30’s! Lol.",
         "Plus we never have to worry about getting the pickle surprise!",
         "Democrat girls are just old white women.",
         "We truly areee haha",
         "And when she is dead too!",
         "Same.",
         "When you're older you might understand why that is a bad idea.",
         "It's a win win bro!!!!",
         "\"Pickle Surprise\"..... LOL.  I'm going to be using this for sure."
      ]
   },
   "1gl0l2j": {
      "title": "Well Well Well 😂",
      "text": "Within 1 min I was banned 😂",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Lebron jerseys with trump head on it is amazing. Hahahahahah"
      ]
   },
   "1gkxfjb": {
      "title": "World Leaders Extend Congratulations to Trump on Stunning Comeback Victory",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Love seeing so many people around the world who were cheering for Trump win. Shows what his victory means for the world too. Things were better under him the first time."
      ]
   },
   "1gksx0s": {
      "title": "The best part about all this is that as the VP, Kamala will have to certify her own L!",
      "text": "",
      "comments": [
         "The view tomorrow should be good",
         "Same reason I’m watching MSNBC. To see Rachel Maddow call it for President Trump!",
         "Ahahahaha\n\nHa\n\nHahahahahahahah\n\nHaha\n\nHAHAAHAHAHAHAHAHAHAHAHAHAHAHAH",
         "Love it!",
         "Unburdened by what has been",
         "L oh L oh LLLLLL",
         "Guys I love winning so much",
         "I’m so glad that a middle-income raised VP is certifying in on January 6th.",
         "I doubt it. \n\nBiden will step down, Kamala will be the first female black/Indian president (*unelected), Mike Johnson will be vice president and do the certification, dems will say it's cheating, Trump will make new hats that say 48.",
         "# Did Kamala even attend her Howard University Election Night Party?",
         "She may do it. Kicking and screaming and dragging any official or lawyer with as she goes. Don’t expect them to give up yet. They have proved they will use legal warfare to win if they have to. The fight is not over yet.",
         "That’s a show I vowed never to watch…but may make an exception today.  So when are all the celebs going to leave America?",
         "You mean mark cuban?",
         "She already started in last night on he is a dictator and how every other country will not share intelligence any longer because Trump will have cabinet members that won’t be background checked. \n\nShe won’t stop with stupidity ever. She lied during Covid. She is a lier in service of those pushing lies.",
         "Good thing she has aspirations, ambitions and dreams.",
         "I hope soon 😂",
         "Might be Keith Olbermann, you can never tell."
      ]
   },
   "1gkk9yw": {
      "title": "*repost with all names covered!* My Instagram story triggered an example of the very tolerant left. Happy Election Day 🇺🇸",
      "text": "I posted this picture on my Instagram story today. This girl I used to work with immediately posted her story (pictured) so I called her out. She faked a marriage to gain citizenship as an immigrant from Croatia. Imagine not being able to have a coherent conversation and resorting to belittling someone with opposing views. I blocked her before she could continue insulting me. ",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "They all have that same condescending passive aggressive way of avoiding accountability for their actions. Just like the media they follow.",
         "It's so sad the amount of hate these people have. Can't have a rational discussion at all.",
         "Thank you",
         "Ya because Cardi B seemed so smart when she endorsed Kamala she couldn't even speak from the heart when the teleprompter didn't work or think on her feet and say something half smart. Meghan thee Stallion was so intelligent at the DNC when she had to edit everything out of her songs because they are so ratchet all she could say was body ody ody ody...and let's not forget sexy red who said \"I voted for Kamala don't let them tell us what to do with our coochies\" they all seem so intelligent",
         "I cant stand these type of women. I cannot. My love you are stunning, gorgeous, and overall the ultimate standard in a woman. This is ridiculous at this point.",
         "Triggered as fuck. Trump save us.",
         "That's what the left does.  We live in a world so good and safe that they had to invent problems so they could have something to cry about, and when that fails, they find ways to inject themselves into situations so they can cry anyway.\n\nI'm yet to meet a Conservative who hasn't lost a Liberal friend in which the Conservative was the one who ended the friendship.  These people are hateful, intolerant, and sad.\n\nKeep your chin up, you'll know quickly if not already that nothing of value was lost!",
         "Dang, she was passive aggressive from the beginning.",
         "She will never forget this moment! 😂 She shriveled! Good stuff, OP! Killed it with Class!! 🇺🇸",
         "It's the JOYFUL party!!! Full of tolerance and affirmation and JOY!! JOY, I say, JOY!!! 😂😂😂",
         "Liberals are an angry bunch",
         "Love it! The left are always triggered by something! 🇺🇸🇺🇸🇺🇸",
         "At least she called herself out for being butt ugly",
         "I love that shirt and need one!😍",
         "Always so condescending",
         "Ha, you can hear the envy in her words.",
         "You handled that super maturely",
         "Pretty and smart women vote republican. Only dumb ones vote Democrat",
         "The passive aggressiveness is wild",
         "lol brah she got triggered. Bet you she got hit with the ugly shovel a few times jk jk",
         "All the worlds a stage.\nBe in the world not of the world",
         "I wish I could say I’m surprised! 🙄",
         "Now is the time to GLOAT",
         "The tolerant left lol",
         "“Anyways be respectful to one another haha”\nYeah after passive-aggressively calling you stupid? Yeah okay Suzy",
         "Seems to be true in my estimation!",
         "How’s that convo evolved given the current climate?",
         "Hello . I am curious why you voted this way . Most women are voting for Dems due to abortion rights",
         "Awe how cute a political quarrel on another social media platform. Lol.",
         "This is exactly why everyone is so divided.",
         "He's going to victory baby!",
         "It absolutely blows my mind the number of dems that have cut off family over politics!    My sister is pretty hard left, and we get along great.  We don't talk politics, but we never really have.   Family.   It's crazy.",
         "Etsy!!",
         "I’m voting for a better economy, cost of living, and secure borders.",
         "Thanks . I hope you undertand that my original question was asked out of curiosity , not a partisan take . I did vote straight R this time",
         "To go a little further, as a woman, the abortion rights don’t matter if you take care of yourself & have some decency. So I don’t really care for that. Like she said, better economy, cost of living & secure borders. I’d also like to throw in better food quality if he successfully gets these harmful pesticides out of our food!",
         "Same here. I've never needed to worry about abortions because I'm not a giant idiot and understand that my actions have consequences and that life begins at conception. If I can do it, anyone can. \n\nAnd I'm sick of Americans always coming last. Our economy sucks and the border is insane. Im sick of the war mongering, of the gender bull shit brain washing out children. Im sick and tired of being sick and tired, and something had to change. I couldn't handle another 4 years of the same bull shit."
      ]
   },
   "1gkhd2p": {
      "title": "I voted Republican for the first time in my life! ",
      "text": "After years of voting Democrat, I finally woke up and came to my senses. It feels good to share my political home with you all! I’ll be rooting for Trump tonight! ",
      "comments": [
         "Good for you. You made the right decision.",
         "Welcome, we all accept you!",
         "Thank you guys!! I’m in Georgia too! I’m holding my breath that we can flip the state!",
         "Thank you!!",
         "Welcome! Glad to have you",
         "Always my favorite posts!",
         "Welcome!!",
         "Welcome aboard 🚂",
         "Thank you!",
         "I’m so proud of you!",
         "It’s a good day to be a republican!",
         "Same here! First time voting Republican! Happy to help Trump win!",
         "me too! been a democrat my whole life but they have lost the plot entirely. so i was happy to vote republican for the first time",
         "Good on you friend, so far, so good.",
         "Welcome friend",
         "👏🏻👏🏻🎉🎊💪😀🙌🏻🤙",
         "Welcome! I'm looking forward to being able to vote next time around",
         "You are on the right side of history",
         "God bless you, Honey!  Welcome!🍰☕",
         "Welcome!",
         "Welcome aboard !",
         "Welcome, friend! We’re glad to have you here! ❤️",
         "Welcome!!",
         "Way to go!",
         "You are always welcome! We are the *truly* tolerant ones.",
         "Me too. I’m still a registered Democrat but voted red all the way across the board. Our country is not in a great position as it is without throwing in weak leaders.",
         "Thankyou my fellow Republican",
         "I also did the same. I can’t vote for a person who claims to be inclusive when she doesnt believe middle class people are equally valuable. ",
         "Same I also voted for a rapist and convicted felon. Go Trump!",
         "He has been charged with rape?",
         "No evidence for rape. And a convicted felon in the eyes of the corrupt establishment? Hell yeah I’m in.",
         "Oh, he was claimed to have raped someone, but thats obv false, the lady says she doesnt even remember what year it was and that it was in a public area.\n\n\nThe rape claims so so bogus",
         "Oh so allegations with no evidence decades after.  Yeah and they call us conspiracy theorists.",
         "Leftists overdose on msnbc and become idiots!"
      ]
   },
   "1gku1m4": {
      "title": "America Unburdens Itself From What Has Been",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Fuck Kamala 🤣🤣🤣",
         "Cackles not cackling now.",
         "We just dodged her fucking us.  I'll take that as a win."
      ]
   },
   "1gknt9y": {
      "title": "Tim Stanley: It's beginning to look like Donald Trump is going to win",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Trying to comment on texas page and they won’t let me 😂",
         "I’m not saying nothing until I see 270 by Trumps name.",
         "Donald Trump might pull this off. It’s too early to say; we might not know till the middle of next year, or whenever some [antediluvian state finishes counting by hand](https://www.telegraph.co.uk/us/politics/2024/11/05/us-presidential-election-2024-when-dates-candidates-voting/). Plus Electoral College madness means that Trump could surge in the popular vote yet still lose via Pennsylvania, Wisconsin and Michigan (the reverse Hillary). But consider the following:\n\nFirst, he took [Florida easily, including Miami-Dade](https://www.telegraph.co.uk/us/politics/2024/11/05/us-election-latest-news-polling-trump-kamala/). Joe Biden won that county in 2020; Hillary Clinton swept it by nearly 30 points in 2016. What’s made the difference? Trump’s doing well among Latino voters, presumably men.\n\nSecond, there are hints he’s gained ground among the affluent in Virginia, which is supposed to be a lock for Kamala; Wasps with degrees are her people.\n\nThird, he seems to be scooping Georgia, which might have been competitive and certainly suggests the sun-belt is safe (Texas is also not in play). Fourth, an NBC exit poll gives him a six point advantage among independents in the critical state of Pennsylvania.\n\nExit polls generally indicate that [“the future of democracy” is a leading issue,](https://www.telegraph.co.uk/us/comment/2024/11/06/americans-voting-out-of-resentment-and-fear/) which breathless TV commentators assumed was a good sign for Harris. But lots of Republicans think the Democrats stole the election in 2020, so they might be recording concern for that issue as well.\n\nThe other major matter is the economy, and Trump polls stronger than Kamala on that one for obvious reasons (ie inflation). No wonder election betting seems to slightly favour Republicans, along with the *New York Times* and Decision Desk HQ.\n\nBut, yes, there’s a long night ahead, and none of us knows anything for sure. It’s a delight to watch British TV presenters disclose the latest thing they read on CNN as if it were a personal insight (”I’m predicting now that Harris will take Vermont and the Pope will carry the Vatican”).\n\nBut what we can decisively say at this juncture is that of the four options – Trump easy win, narrow win; Harris narrow win, easy win – the Harris easy win is off the table. Despite January 6, a rape trial, “eating the pets” and a comedian calling Puerto Rico a “floating island of garbage”. I wonder if Joe Biden might have done better?\n\n**Read more from The Telegraph:** [https://www.telegraph.co.uk/us/comment/2024/11/06/its-beginning-to-look-like-donald-trump-is-going-to-win/](https://www.telegraph.co.uk/us/comment/2024/11/06/its-beginning-to-look-like-donald-trump-is-going-to-win/)",
         "Really hoping this man wins. The US needs him now more than ever.",
         "I'm predicting Trumps 2024!\n\nIt's gotten really quiet on the front page of Reddit not a mention of Kamala 🤣",
         "Absolute victory. Absolute victory. Absolute victory. \n\nPresident Donald J. Trump is clearly on track to win not just the electoral college but the popular vote - the first Republican to do so since 2004 - which shows not just how popular President Trump is but how effective voting reform across the country has been at stopping illegal voting.\n\nThe Senate is guaranteed to be Republican, the House is a certainty,  and of course we have the Supreme Court.\n\nThe numbers haven't all been counted, but we're on a path to *absolute federal power*.",
         "Betting odds are 85-15 trump. I have no idea how they calculate this. I'm just saying",
         "Adios, Embarrass Harris.",
         "PRAY",
         "And he won the popular vote. This victory is even sweeter than 2016",
         "Vote! Oh wait ..",
         "The Dems will find just enough votes to install their puppet.",
         "Praise the lord",
         "Beginning? Bro it’s literally almost guaranteed IMO",
         "Too early to call! But I hope",
         "Idk it's really close trumps ahead by 25 right now",
         "Already got banned from my home state of Delaware",
         "lol…they are busy booking their flights to Canada",
         "I'm not saying nothing until the electoral votes are actually certified by the Senate.",
         "He’s at 267 and ahead 16% in Alaska. 93% of the vote is counted in Nevada and he’s up almost 5% there. Interestingly, Las Vegas is almost 50/50 this time.",
         "Hes got 270 rn",
         "Great analysis. Thx!",
         "I’m really proud that Americans saw past the media bias & lies.",
         "Nah they don't have massive amounts of COVID mail in ballots to save them this time",
         "Wisconsin checking in.  Been banned for 3 years",
         "Will this stop once the Harris staffers are fired?",
         "Can’t wait to see the celebrity meltdowns",
         "this man votes",
         "Now we can be happy and going back to a good life for all Americans.",
         "I hope you are correct. We shall see....."
      ]
   },
   "1gl1cd9": {
      "title": "Watch Trump declare victory in Palm Beach: ‘We are going to turn our country around’ ",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "[https://babylonbee.com/news/trump-wins-3rd-election-in-a-row](https://babylonbee.com/news/trump-wins-3rd-election-in-a-row)"
      ]
   },
   "1gl2nfo": {
      "title": "How can they still not make the connection?",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Because they got rid of all the dead people voting and the cheat votes by the dems.",
         "Obama 12 61m votes\n\nClinton 16 62m votes\n\nBiden 20 82m votes \n\nHarris 24 66m votes\n\nIf you look at this picture and think “how did Harris miss that many votes” you literally don’t have a high school level understanding of statistics lol",
         "Guys - we just may never know the answer to this. For context, it is important to remember Joe was considered to be super mysterious and cool due to his basement strategy in 2020, so that's why he got 80 bazillion votes. Kamala made the mistake of appearing in public during her campaign, and so people were a little less excited after her thrilling whirlwind 90 day campaign adventure.\n\nThat's what we should take away from this and not at all get sucked into a vortex of lies about voter fraud, undemocratic actions to bypass the nominated candidate or her lack of popularity. Those are almost certainly dead ends, pushed by the minions of orange man.",
         "I'm sure some still made it through, and we will have to watch for more, but yeah. 2024 was a much cleaner election than 2020.",
         "Kamala didn't lose because she was in public lol. Hell half the time she hid from the public. She lost because she was a terrible candidate with abhorrently low popularity ratings. There's a reason she didn't make it past the primaries in 2020. \n\nNot to mention she was essentially a ghost who wouldn't tell the people her policies. And when she did, they were horrendous or she copied trump's policies and flip flopped constantly. No one knew who she was or what she stood for.",
         "I'm sure that losing the 17% of voting applications that were fraudulent in a swing state did not help."
      ]
   },
   "1gks3jn": {
      "title": "No words are needed to describe this",
      "text": "Hahahahahahaha ",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "I've been scrolling through Reddit and it's quiet as fuck in regards to the usual liberal hating on trump and spreading misinformation posts.  I fuckin love it and I feel like I can breathe a sigh of relief!",
         "I'm posting a screen shot on r pics of fox calling it",
         "I got one for ya: awesome.",
         "Garrison! NOOOO!!!\n\nMember berries will make their return! XD",
         "OMG this meme is hilarious",
         "Self-idemtifying as Cartman is a... choice.",
         "The bot farms got unplugged, bye bye",
         "The President Garrison episodes incoming are gonna be fire",
         "Fox called it,  Trump elected as 47th president!!!!!",
         "I always thought South Park to be liberal but they make fun of both sides just as hard as the other lol. I can't wait for a new special XD",
         "They call out bullshit and don't pander"
      ]
   },
   "1gknh5e": {
      "title": "healthcare worker for trump! ",
      "text": "nurse practitioner from wisconsin voted for trump! any other healthcare workers vote for trump?? ",
      "comments": [
         "RN here for trump in Arkansas!",
         "Yep, third time voting for Trump.",
         "Me too! 💗💗",
         "RN in Los Angeles!!!🇺🇸❤️🦅",
         "Thankyou my fellow Republican",
         "Thank you! As someone facing major spinal surgery, I'm grateful to learn that there are people in healthcare who actually think for themselves. Freedom of thought rests on freedom of speech.",
         "My husband is an RN and we both voted for Trump. We're in a blue state but many of his residents are elderly Veterans and my husband is a Veteran as well. They're throwing a party for the Veterans on November 11th and I'm sure it will be quite lively. My husband works that day as well 😂"
      ]
   },
   "1gks0dj": {
      "title": "Can I go to bed yet?",
      "text": "",
      "comments": [
         "I can’t im jacked up.  heading to the gym.\nWe did it everybody!!!!!!",
         "Fox just called it he won!!",
         "Give it another 20-30 mins!!",
         "Once Alaska comes in, yeah, it's over.  That's the last 3 he needs.",
         "No,you have to celebrate first.leesssss goooo",
         "Sweet dreams!",
         "trump has won, you may sleep now.",
         "Someone has to watch out for 3am Georgia, that guy knocked the heck outa us last time",
         "You deserved it buddy! Go and hit the gym 💪",
         "They just waiting for Alaska, I saw Kayley deleted her X tweet lol"
      ]
   },
   "1gl33oc": {
      "title": "It's okay Peanut. You may rest easy now. We won.",
      "text": "Image source: https://www.instagram.com/peanut_the_squirrel12?igsh=MTEwNXA1NzgxZGVqNQ==\n\nRest in peace to Peanut and Fred.",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "I still can't believe what the criminals did! Out of all the disasters the world and specifically NY are facing, these innocent animals were what they concerned themselves with? There are people out there much more rabid than these pets, who truly are a danger to society! They are all deranged, everyone involved in this atrocity. May they somehow pay for what they did!"
      ]
   },
   "1gkpd5n": {
      "title": "I love Ohio. Got that red W",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Is the majority of Reddit losing their minds yet?",
         "I left that sub. Too toxic and it doesn't matter if you agree with them, they still find a reason to berate you... Screw the libs!",
         "Pennsylvania has been looking positive, Georgia shocked me a bit…. Was not expecting Trump to take a huge lead like he has right now.",
         "Yeah Ohio!!!",
         "We’re doing it people! Can’t wait to post it to r/pics 😭",
         "Issue 1 needs to lose. Full stop.",
         "Don't get your hopes up. The Dems will find just enough votes to install their puppet.",
         "It’s a fucking Boat Race!",
         "I put my TV on CNN for 10 minutes…. They can’t talk! Cotton Mouth!",
         "Yes it’s hilarious",
         "Long ago. So very long ago.",
         "They already did now it’s just a outbreak 😂",
         "I’m just going through and telling them “you’re welcome for your freedom”.",
         "Yep, all my liberal friends have an issue with critical thinking.",
         "👍❤️",
         "I stay around to get them fired up and pissed 😂",
         "👍"
      ]
   },
   "1gkc56k": {
      "title": "Trump 2024! 🇺🇸",
      "text": "",
      "comments": [
         "Put this man in a room with Putin and Jinping, and he's commanding attention and leading the conversation.\n\nPut Tampon Tim in a room with Putin and Jinping, and he's leaving crying calling his mom.",
         "Damn right he's a legend",
         "Loving these images! This is the candidate I voted for!",
         "Some epic campaign shots this season. Crazy.",
         "Yes sir. Did my part, even if Iowa is red I don’t want to chance it!",
         "Donald Trump day🫡",
         "FUCK YEAH!! 💯",
         "Red fucking WAVE",
         "God be with him!",
         "#47 🇺🇸😎",
         "Through thick and thin, this man pulled through all the 💩 he was put through to get here. When he could just go and enjoy his life with all the money in the world",
         "2016: A New Hope\n\n2020: The Empire Strikes Back\n\n2024: Return of the Jedi",
         "Brilliant ……. Never gave up 😎🇺🇸",
         "I'm a European. May I ask why you love the image of him being arrested? In the Netherlands, a politician with 34 charges wouldnt have any support anymore.",
         "Thank you.",
         "Imagine that you had a popular politician that you supported in your elections, and corrupt national and local governments that colluded to bring spurious charges against your candidate in order to influence the election, and that the charges were brought in a place where the electorate voted 94% against him in the past, and the judge was corrupt and gave the jury illegal instructions.\n\nWould it still prevent you from supporting him?\n\nIt didn't prevent us from supporting ours, either.",
         "The prosecutor promised that if elected she would get him for something.\n\nAnd the 'crime' he committed was something never charged before.. basically they bent the law and found a jurisdiction filled with people who hate him.\n\nA lot of legal experts expect it will be reversed on appeal.\n\nBasically a political witch-hunt so people like you can read the headline and think he's some criminal masteind",
         "Because the charges are bogus and throwing him in jail was supposed to be a way to get him out of the way.  His mugshot was supposed to make him look weak and the left salivated for it to come out, only for it to be released and instead say \"not today\".\n\n\nIt was just another victory of his.",
         "It’s the defiance in his face. His support is stronger than ever due to the left side weaponizing the government against him.",
         "If there is evidence of him doing what was described, which there is, then yeah, I wouldn't vote for him anymore.",
         "\\>A lot of legal experts expect it will be reversed on appeal. \n\n  \nI watched the oral arguments and think the appeals court will try to split the baby. Probably lower the fine amount. Only one of the judges seemed to truly question the charges brought and the whole structure of the prosecution's case.",
         "There is evidence of him doing things. None of the things were illegal however, when you peel away all the layers of contrivance the corrupt Democratic machine has tried to stick onto all these fake indictments.\n\nThat's why all these cases are faltering like a house of cards.",
         "There is absolutely evidence!  ...of course, what was done wasn't illegal, was done by his lawyer, if it *had* been illegal it was misdemeanors they couldn't have charged him with because the statute of limitations had expired, and the three \"possible underlying crimes\" they gave the jury as a multiple choice are \"crimes\" that not only weren't crimes, but were crimes he wasn't charged with and couldn't be charged with because the statute of limitations had expired on those also.  That means the presumption of innocence applies, so there were no underlying crimes, which means the misdemeanors couldn't be elevated to felonies.  That's before we get to the star witness being someone who had already been caught, tried, and convicted of perjuring himself against Trump on three prior occasions (and got caught doing it again during this trial), or the judge's illegal jury instructions.",
         "If you watched the oral arguments on the appeal, then you know that the appeals court judges were talking about censuring the prosecutors because the case was so bad.  That's not a \"split the baby\" ruling in the offing."
      ]
   },
   "1gkt84l": {
      "title": "Future looks bright. ",
      "text": "",
      "comments": [
         "Yes it does. 😁"
      ]
   },
   "1gklgr0": {
      "title": "My parents are first time voters and…",
      "text": "I got them to vote for Donald J. Trump. I would have voted how ever I am 16 and unable to. I am glad I was still able to help even if just by 2 votes. Let’s go America #Maga2024",
      "comments": [
         "Awesome! Love it.",
         "Look at you! Great job!",
         "Good for you, OP. I look forward to the calm, agreeable transfer of power.  Even more, I look forward to everyone respecting the vote and not trying to change the results with endless, subversive legal maneuvers.",
         "It was a lot of people like you that carried water. Also I have newfound respect for our patriot Latino brothers who really, really were astonishing. \n\nJust amazing.",
         "You’re all morons. And I don’t vote. I’m not voting for Trump and I CERTAINLY wouldn’t vote for Kamala. But yall dumb.",
         "Thank you! 🙏🏻 🇺🇸",
         "You already know they will now say “he’s a felon” blah blah blah. They will do everything to make his presidency a living hell for him and Americans. Either way he won, we made it to big to rig and I’m so dang happy rn!",
         "Ok?",
         "Chose the better of the 2 poisons, how’s that dumb?",
         "If you don't vote, you're giving up your right as an American and letting others control your life. Sounds pretty dumb to me.",
         "It's okay not to vote, but don't name call others for doing so. That's what freedom is. We all made choices and they shouldn't be scrutinized by others.",
         "So then it makes sense to vote for the lesser of two evils, no?",
         "🤝",
         "Can’t you see?",
         "Oh, they can see, but you cant hear"
      ]
   },
   "1gkvju5": {
      "title": "Fox News projects Donald Trump defeats Kamala Harris to become 47th president of the United States",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "I think they were trying to make up for 2020 for being the first then too....",
         "r/politics will overheat and explode. MMW",
         "Remember remember the MAGA November.",
         "Y'all suck but congrats.\n\n\nYou beat an unlikeable San Francisco liberal lawyer in the presidential election.\n\n\nWho knew running a candidate like that was a recipe for disaster? (I did.)\n\n\nGOD BLESS AMERICA. 🦅🇺🇸"
      ]
   },
   "1gktrcd": {
      "title": "Looking pretty damn good!!",
      "text": "",
      "comments": [
         "The fact he won the popular vote as well",
         "Is it really that surprising?",
         "I’m more excited about it then surprised"
      ]
   },
   "1gkrl1g": {
      "title": "Republicans Win Majority in U.S. Senate, Reshaping Congressional Power",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "I mean we have a 1 vote majority right now.",
         "Not really with all the ring senatora there is including collins in Maine not much thay cow won't do to kiss dem ass.",
         "Red wave",
         "I’m nervous about the house.",
         "Don't be. It's guaranteed."
      ]
   },
   "1gkzm04": {
      "title": "Hmmm",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Not commenting on this map, since I don't think it means anything other than no id is a left wing policy,\n\nHOWEVER\n\nI have yet to hear a single compelling argument for why ID shouldn't be mandatory",
         "Because if they ID you the illegals, they let in wouldn't be able to vote. Can't have ID if you're not a citizen. this election would have been a blowout had they required ID from everyone and only allowed legal citizen to vote.",
         "I have heard only one. It's that voting is a right so requiring I'd, something you have to pay for, is technically a polling tax, which are illegal.",
         "holy shit did a 4th grader write this comment",
         "No autocorrect I just didn't reread before posting"
      ]
   },
   "1gk7mji": {
      "title": "Blacks for Trump!",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "A black woman said she’s voting for Trump in r/pics and got called a bot. Thank you for not being told you have to vote blue because you’re black. It’s dangerous to be told what you HAVE to do. Are you long term republican or first timer?",
         "Great! What state?",
         "\"If you have a problem figuring out whether you're for me or Trump, then you ain't black.\" - Biden",
         "As a minority I find it racist when democrats expect me to vote blue. Always voting Red. Use your common sense, republicans have policies that are better across the board. Democrats just love their propaganda",
         "MAGA!",
         "wtf is this man 😂 this isn’t tinder bud don’t make us other black republicans look bad.",
         "I'm jealous of your body...lol - I'm old and pudgy. Keep up the gym membership!",
         "Hey bro, this is a no flex zone. 🤣🤣 (kidding)",
         "Brother 🫡",
         "On behalf of the hillbilles, WELCOME! Glad to have you on the team. Best wishes!",
         "Welcome to the club that takes charge and goes to get that money baaby. Start a business. Start trading stocks. Get that money.",
         "MAGA!",
         "Mate I don’t want to make this about race but if Harris was white this would already be over and we all know it. Big up you though man! Wish I could vote from England 😭",
         "Let’s go!!!!! Thank you for not listening to the Dems redoric!!!!!!!!!",
         "Laundry day?",
         "I feel like it's the safest option right now to pick Trump. Kamala Harris is just a weirdo.",
         "Why did u post a shirtless pic 😭😭😭",
         "Yea!!!!!",
         "Oh, and my GOODNESS, mercy me!  You are a beautiful man!",
         "When trump wins I hope we do it with class. Fuck what the blue does. Fuck what they turn to. We must be better. We must turn the cheek and commit to holding our president accountable for what he promised.",
         "🥰🥰🥰🥰",
         "Hell yeah brother !! Good for you king !",
         "Thankyou my fellow Republican. It's about time I get off my lazy ass and walk down to the voting booth.",
         "Now just get a few friends to vote also, preferably wearing shirts.",
         "BIGGGG!!!!",
         "You’re a hero bro",
         "I like this guy. Be your own man and cast your own vote. It's about your decision, no one else's.",
         "LETS GOOOOOOO!",
         "Another common W",
         "Hell yeah",
         "Amen!",
         "He is definitely for Trump",
         "Sorry all I see is a fellow American.",
         "I personally haven’t met a black guy here yet in Louisiana who isn’t voting for Trump. Anyone who is in their right mind will vote for Trump. Regardless of color/race. Whether you’re born rich or born into poverty. You always have to stand for what’s right, and always stand on your beliefs. I went to prison for a long time at a young age, I was unable to vote once I got out due to parole. I am able to vote now and I am proud to say that I cast my first ever vote to Donald Trump.",
         "I just fucking wish it would quit with the blacks or whites or gays or furries or what the fuck ever. It needs to be America for freedom. That’s what matters. I get it. My mom is the same way only for Harris. I won’t talk to her for a week after today I’m sure lol. Good job doing the part",
         "What happened to your face?",
         "Great!",
         "Amen!",
         "The man..🫡",
         "You are amazing",
         "Brown 👩🏽‍⚖️ here, for Trump! 3rd time voting for him!",
         "Regardless of Race, if you care for your country you want Trump to win!",
         "I'm glad your learned to think for yourself!",
         "Awesome!",
         "Everyone for trump !!!!",
         "Thank you for your vote.",
         "The only color I see is RED WHITE AND BLUE BABY!!!!!",
         "yessir brotherrr 💪🏻🇺🇸",
         "You’re the future of America. Thank you friend",
         " Bravo 👏",
         "Bless you brother",
         "That's awesome my man 🤟🤟🤟",
         "Trump all day. Fucc Cumala",
         "Woohoo!",
         "I'm as white as bleached snow, but welcome aboard friend. Freedom is for all people who will defend it. I hope we are celebrating in a few hours.",
         "This is great and all.  But whats with the faceless shirtless selfie?",
         "You don't have to be for Trump. You can vote for policies.  Personally I vote for policies, If I voted for the morales of a politicians I probably would never cast a vote Republican or Democrat .",
         "Put on a shirt, hippie.",
         "🤝",
         "Hell yes .",
         "Thanks for the vote. Put on a shirt please.",
         "Everyone for Trump!",
         "Minority here voted Trump too, so sick of racist white liberals expecting my people to vote Blue no matter who.",
         " Not sure why your shirt is off but that’s ok. Thanks for fighting the good fight.",
         "Thats bro right there real fuckin american",
         "the thirst trap was definitely not needed 😂",
         "....whyd you take your shirt off?",
         "I saw a  black woman go before a county council in Detroit who was wearing red Trump T-shirt. She stated \"no more blue no matter who!\" That was very bold for that woman to do. Black America can vote for who they want to - not for who they are told to vote for.",
         "Thank you!!",
         "Wow, welcome!",
         "Lmaooo come on man. Smh",
         "Not goin to lie, I was kind of scared to scroll to the second pic.",
         "brother put on a shirt 🤣🤣🤣 we have kid friendly spaces .",
         "The shirtless pic wasn’t it, bro bro.",
         "First time!\n\nI voted 3rd party in the last two election cycles. I believed that Trump was just a standard, rich, entrenched politician.\n\nBut the establishment wants him GONE. Which gives me all the information I need",
         "r/pics is crazy I saw someone getting thousands of upvotes from posting Kamala eating Doritos",
         "The people calling us racist believe black people cant and shouldnt think for themselves, and should be reliant on welfare and government help. Imagine that.",
         "The ridiculousness of saying black Americans need to be democrats is crazy as the dem wanted to keep ppl down. Republicans are the ones who ended slavery and alot of other unfair regulations against all ppl.",
         "Ohio :)",
         "Damn. Guess I'm not black anymore 🙃",
         "But you are \"garbage\" - also Biden",
         "I know you’re not saying this with that username lol",
         "Gotta show off the six pack;)",
         "Congratulations guys, can’t wait to reap the benefits of this election. Historic moment for all of us 🇺🇸❤️ together we are all family and we all BLEED RED inside",
         "This individual understands the assignment. I'm so fucking sick and tired of color X Y Z. We're Americans. We're humans. We aren't any color. But the far left has made our color significant again apparently.\n\nI legitimately look at individuals as \"kinda of a jerk\" or \"good people.\" I'm done with \"their skin color is X.\"\n\nThe far left is making skin color significant when it should not be. They're racist.\n\nI don't care if someone is black, brown, orange, yellow or white. Can we judge people by their character and not the pigment in their skin? MLK had it right in 1963!\n\n61 years later, and we are still talking about color. Let's not full into the Progressive mindset.",
         "I worked my ass off for six pack!\n\nI'll be damned if I don't show it off 🤣",
         "Show the six pack ;)",
         "“But the establishment wants him GONE. Which gives me all the information I need”\n\n👆🏻100%",
         "Welcome! Thank you for your vote! One thing I cannot stand about our communities (I also am a minority) is that we want to be seen for our individuality yet they insist we vote as a monolith.",
         "They want him gone so bad that NY changed laws just so they could chage him but told all other business owners doing the same stuff not to worry you'll be fine. They just wanted to get Trump out and failed. Then the attempts on his life. How many ppl would go thru all that and still continue to fight for the ppl, not many.",
         "Happy to have you! Can't stand the stereotype about all conservatives being racist, so very glad to not see any of that here!",
         "R/pics is a breeding ground for idiots",
         "Ohio is really close rn. If he wins we'll say you were the deciding vote 😂",
         "Nice!",
         "This is probably a stupid question, but is the stuff in Springfield true?",
         "I was just going to say, according to Biden, you're not black. 🙄\n\nShit us yellow folk aren't even mentioned by the libs. They really don't want our vote. Good thing too because we're super conservative. They aren't going to guilt trip me into voting Blue ever.",
         "To a bunch of dudes? r/gay",
         "Can’t blame you for that!",
         "I'm a millennial. It's just how we were raised.",
         "Fair enough!",
         "Thank you for saying this the way you did - it’s stated very powerfully. As a white male, I don’t think I could have said it as elegantly as you did. Very interesting and empowering to state it this way, in my opinion.",
         "Literally no one would except DJT",
         "They just called Ohio!!!! GO TRUMP 2024",
         "Yes. It's an hour away from me, but im.so sorry for the people who live there",
         "Homosexuality is a sin, brother.",
         "Same here, brother. I'm a millennial, too. Granted, I'm on the older end. I just see the guy as an American, not a \"black\" American.",
         "You did it! 😂",
         "Whoah. All my blue voter friends think it's all fake, even the statements given by witnesses in Springfield. Stay safe out there, and keep your pets indoors!",
         "I am sure he’s telling the truth I trust everyone on Reddit"
      ]
   },
   "1gkrxo8": {
      "title": "Democrats leaving a mess after Kamala said she wouldn’t show up.",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "She really should address her fans. That is disrespectful to them but I expect no less from someone like her. Those who support her were just pawns. She trashed them quick.",
         "It is shameful that she won’t address her voters but then again she’s hidden most of her campaign.\n\nIt’s funny the ones always screaming about the environment have no 2nd thought about dumping their trash & walking away. Just like the border where the illegals are sitting, they leave behind all their garbage on the ground.",
         "They'll be ~~looting~~ shopping soon...",
         "She's a coward. Probably taking a mental health day."
      ]
   },
   "1gki7xn": {
      "title": "This may be the funniest interaction to come out of this election cycle",
      "text": "",
      "comments": [
         "Oh shit.  She hit him with the classic southern belle dickpunch",
         "I don’t get the joke?",
         "I fucking love this. I always knew they were chill.",
         "Wow. The hypocrisy is off the charts 😂",
         "I don't get it.",
         "The Left praised him/her when she transitioned. They are supposedly the party of acceptance and inclusion however as soon as he/she showed support for someone other than their ideal candidate they hate on someone who was at one point an icon for their ideals.",
         "I don't think it was a \"joke\".  The guy was taking a jab at Jenner for being transgender....which is ironic funny I guess, but not \"ha ha\" funny.",
         "The Left praised him/her when she transitioned. They are supposedly the party of acceptance and inclusion however as soon as he/she showed support for someone other than their ideal candidate they hate on someone who was at one point an icon for their ideals.",
         "I never cared about reality TV stars either way, but if she supports a rapist for president I don't like her.",
         "She doesn't, but nice try! Trump has never been convicted of rape. Kamala has welcomed actual rapists in by the hundreds with open arms. Maybe worry about reality instead of your weird fabtasies.",
         "So sorry you support the open flow of monsters like this into the US. This 12YO was raped for hours strangled to death and dumped in the river. Brought here to you by Kamala Harris. Notice how the news doesn't say a word. I hope you never have a child to go through this horrible way to die.\nYou voted for that?\n\nhttps://nypost.com/2024/09/10/us-news/jocelyn-nungarays-mother-tells-congress-12-year-old-was-raped-strangled-by-migrant-monsters/",
         "Why didn't Trump fix our immigration laws?",
         "I support fixing our broken immigration laws.",
         "He did. Biden reversed nearly everything he did. Nice deflection though lol.",
         "Harris broke those laws she was in charge of the border that was the only Job President Biden gave her.",
         "Letting illegal border crossers in by the millions and not even trying to slow it down has been the policy for the last 4 years. It is very broken and it will continue under Harris...\n\nNo matter who is let in. No matter how much sex trafficking of children is going on. As long as the Dems end up with a future voting advantage.\n\nThey count on legacy votes to make it a one party system in the future... Also the census body count in these blue cities will help give the Dems more electoral votes. The amount of suffering doesn't matter to them."
      ]
   },
   "1gk7my0": {
      "title": "Voting FOR My Interests",
      "text": "I’ve been quiet this election, not wanting to rock the boat. But since it’s Election Day. I’m gonna ask you - if you’re voting for a candidate who didn’t even have a primary election because you have a gay or transgender friend of family member, and you “care about their interests,” as a gay man diagnosed with gender dysphoria here are my interests:\n\n-A secure border\n- An end to funding wars \n-The protection of human life at all stages from from conception to natural death\n- The protection of children from a billion dollar industry that wants to mutilate their bodies before they turn 18\n- The protection of femboys and Tom boys who would grow up in any other age to just be gay or gender non conforming\n- The right to 100% free speech - freedom of speech IS freedom from consequences from the government \n- The right to have the first female  president win because she is better than any man in power - not because she is a DEI\n- The protection of women from men invading their spaces\n- The protection from the state forcing a sh0t onto me\n- The protection of my religion (Christianity) from an atheist death cult \n- The protection of illégal migrant children and innocent refugees (make them citizens, not slaves)\n- The continued criminalization of mind altering drugs \n- The protection from sterilizing children who aren’t trusted to drink or vote or get a tattoo, but for some reason can destroy their bodies \n- The right to “just be gay” \n- The protection from erasure of the homosexual and lesbian communities by the alphabet mafia who seek to redefine what gay is \n- The protection from transgender people from military service \n\nTrump didn’t get rid of gay marriage back in 2016, when he had a Republican super majority. He does not endorse Pr0ject 2025. He did not ban transitioning for consenting adults. He did not not ban gay people from adopting. So if you’re voting today (which I beg you to do) because you “care about the interests” of your gay friends and family? Well I’m gay, and here’s my interests.\n",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "I know several gay conservatives. I think it's pretty insulting for one side to believe they \"own\" a demographic. Freedom, security, and a good economy benefit everyone regardless of their combination of skin color and genitalia.",
         "My best friend who is gay and his partner both voted for Trump in AZ!",
         "I don’t want no gays in my party\n\n\nJk welcome in just wanted to do a bit of trolling with the top of this comment \n\nBut seriously we need more people like you to stand up and admit that Trump ain’t the evil guy the left thinks he is especially people of the communities they claim he hates",
         "Right on Welcome!!! Dems pray on LGBTQ+ communities!!! And they do nothing for them. Ignore some of these comments",
         "Go you brother, you seem well informed on the issues important to you.  Honestly, however people vote, this is what we should hope for.\n\nAgree with who you are and your stance.  We are thrilled to stand with and by you.",
         "My son is gay, he’s not at the point where he voted for Trump, but he did NOT vote Harris!",
         "Gay Trump voter in VA!",
         "YES! Future elections are going to depend on voters like you who are brave enough to stand up for who you are and what you believe. This is not your Dad's/GrandDad's Republican party anymore and if we're to normalize the virtues of smaller, more limited government, we need more brave souls who can champion the message from all walks of life. I salute you.",
         "Lesbian Trump supporter here from TX",
         "Let’s goooo!  This new Republican Party is the TRUE Party of acceptance.",
         "This is great! Make sure you try to get everyone you know to do the same.",
         "Welcome! The left will continuously tell you we hate you. I am a conservative Christian woman and I welcome you and literally anyone else who wants to join ranks. \n\nTHANK you for thinking independently and clearly and not falling in line with every other gay person just because they tell you to.",
         " My sister is gay and wants a better future for all. She is voting Trump. Welcome aboard friend",
         "Welcome to sanity! Live your life, love your spouse, and for the love of PB&J sammiches, never forget the lessons of the Biden-Harris tyranny.",
         "Both me and my partner voted Trump!! NM",
         "Preach. 👏",
         "Yay!!!",
         "Welcome ❤️",
         "Did you know that Trump was the first person elected that ran on support for the gay people and gay marriage? Crazy how people forget that.",
         "Hell yeah brother",
         "#TRUMP",
         "Let's go ! 🇺🇸❤️",
         "Heck yeah! Welcome to the Resistance friend!!! 🇺🇸🫶🏻",
         "You don’t look gay. Always laugh at that Trump video",
         "Welcome to the party of real love and acceptance! ❤️",
         "It's not a choice to be gay, but it is a choice to be a liberal.\n\nEdit: I 100% stand by this comment, not sure why I'm getting downvoted, unless you think it IS a choice to be gay.",
         "Glad you’re voting for the right side. Can’t wait to vote next election",
         "Let's go ! 🇺🇸❤️",
         "I think it's possible that the Republican party is going to see an increase in participation from the gay community over the coming years. I think the GOP has largely abandoned any notion of trying to overturn issues that have largely been settled at the national level like marriage. Fas as I can tell that was the only thing democrats had that could be targeted specifically to them. Gay men and women are not indebted to vote Democrat forever based on issues that have become increasingly non relevant to them. They'll have to actually earn their votes with better policy just like Republicans have to.",
         "fuck kamalism and bidenomics",
         "Love it!",
         "I understand there is a \"traditional\" view of who is a conservative, but polls show gay marriage doesn't bother most conservatives. A lot of small businesses are owned by gay couples, and it would make sense they would align would Republican policies.",
         "Wow! Welcome to the intelligent side",
         "Turkeys for Christmas.",
         "I have a gay cousin, and another trans cousin. Both great people. It's not up to me to approve their lifestyle or not. We all live our own lives. And that's the difference between the left and right. The right wants to let you be, and expect the same courtesy in return. Live and let live. The left however, does not. They want everyone to capitulate to their way. I don't care that you're gay - you live your life. Just let me live mine as well. And we can live together just fine. \n\nAlso, I don't vote emotion, I vote issues. I'm not voting for a buddy I'm voting for a political leader I expect to lead, and lead us to better things. Things like what you mentioned. Too many get wrapped up in their personal emotion and cannot separate that from their choices. I actually don't care a lot for Trump as a person, I find him narcassistic and petty. But he gets the job done and his policies are on point and that's what matters.",
         "Yeah… the left quadrupled down on the whole abortion thing… \n\nI am not sure how much of the gay population really cares too much about aborting children tbh…",
         "Go girl",
         "While I may not support gays,I appreciate that yall are smart enough to support someone who knows who to run a country,thanks.",
         "I like the sentiment, but isn’t this rainbow upside down?",
         "[removed]",
         "[deleted]",
         "Just don't forget, sodomy is deadly sin.",
         "There's a great film called \"Elephant in the room\" which discusses the difficulties of those in the gay community who support Republicans.   Let's just say that most are not tolerant of someone fishing from a different pond.",
         "They for sure think they own certain groups and it should be infuriating.  When Biden told black Americans that if they didn’t know who to vote for then they weren’t black, was the most telling statement he could have made.  It’s obvious that this is where their heads are at on this.  They indeed think they “own” the black vote…..just like LBJ predicted.",
         "Let us prey",
         "Democrats are better on LGBT specific issues, but none of that matters if I can’t afford a roof over my head or food on the table, if I can’t arm myself to protect myself, etc…",
         "It is not a choice to be gay",
         "Exactly. Gays are not automatically liberals, you said it well. I just wish prosperity for Trump and people who voted him",
         "It is a mental disorder that can be treated, if a person wants to.",
         "This ^\n\nI’m gay and a former Obama supporter. Back then Republican rhetoric around gay marriage really turned me off. After Obama, have been supporting Trump.",
         "So? It’s a rainbow 😂",
         "Oh? You’d rather be vote for Kamala?",
         "It’s really not wise to shit on people agreeing with you",
         "Dude, what the fuck? Why ostracize people who are supporting the same cause as you? You can disagree about religion some other time, right now we need to all pull together.",
         "Excuse me? Glad I’m voting for a guy who likes gays. I’d vote for Kamala over you",
         "Oh absolutely!! They Race bait and Box people in!! Trust me. I’m 2 hours North of San Francisco!!! It just not safe anymore!! Welcome To MAGA my fellow American",
         "Have you met any gay people???",
         "Separation of church and state",
         "It ain’t the gay rainbow though",
         "Curious as to what this MF had to say.",
         "[removed]",
         "I don't know why you think it is \"shiting\", Christians should be guided by: love the sinner, hate the sin.\n\n\"If a man lies with a man as with a woman, both of them have committed an abomination; they shall surely be put to death; their blood is upon them.\" Leviticus 20, 13",
         "So you are saying we can ship the gay guy off to a camp later, but we want his vote now.",
         "Not separation of Christianity and Christian morality from the state.",
         "What the fuck?",
         "Who are you to label or judge how the gay rainbow is?",
         "Worry bout you Weak Ass Country… ENGLAND",
         "I’m just gonna recommend you shut up and sit down.",
         "Read the room. You’re not doing anyone or any favors. \n\nThe Venn diagram of Republicans and conservative Christians is not a circle. \n\nWhat are you hoping to accomplish here? Whatever it is has been about as effective as people blocking traffic for hours for *(insert cause here)*.",
         "Troll",
         "I didn’t decide it, it’s just the way light bends. Red is on top.",
         "Read the room. You’re not doing anyone any favors. \n\nThe Venn diagram of Republicans and conservative Christians is not a circle. \n\nWhat are you hoping to accomplish here? Whatever it is has been about as effective as people blocking traffic for hours for *(insert cause here)*."
      ]
   },
   "1gk98rq": {
      "title": "I have done my civic duty! Have you?",
      "text": "Just got back from voting to save the country! Prayers that we beat that witch Kamala and her little troll henchman!",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Voted in North Carolina when early voting happened. Third time aboard the Trump Train.",
         "Fill in your bubble all the way! This makes me nervous (though I’m just super nervous today anyway)",
         "This is THE ONLY sub that allows pro trump shit and I’m here for it. Hell yeah",
         "Damn dude fill in your bubble completely. Don’t give them a chance to throw out your ballot. They will do everything they can to disenfranchise you.",
         "Me too! Hot moms in Pennsylvania vote trump! Cmon girls!",
         "+1 more in NC",
         "I voted! A gay guy here for trump \n\nHilary 2016, Biden 2020 and now Trump 2024. Took me long enough haha",
         "Hey folks, I'm not American, I wanted to ask are these counted by hand ? Or are these electoral ballots scanned to get a digital count?",
         "Just got home from doing it idk if it will make a difference where I live but hey I tried",
         "YES I DID ON MONDAY!!! TRUMP!!!!!",
         "yep! voted in MO \nTRUMP2024!!!",
         "Me and the wife voted here in Michigan. Hopefully it will be enough 😂",
         "👍❤️",
         "Hell yea!",
         "On my way now!",
         "Thankyou my fellow Republican. I'm a first time voter. And yes I voted for Trump.",
         "My entire family has confirmed they've voted. My niece, who lives in Georgia but attends Ole Miss, never received her absentee ballot. \nHer sister who attends U. of Georgia voted weeks ago, but my sister was too scared to ask her who she voted for 😬",
         "I never call out sick, but I was genuinely sick a few weeks back and decided to see if I could early vote. Took 5 mins to walk in and out here in Middle TN. No excuses!",
         "The white voids in your bubble triggers my ocd.",
         "I did... Trump Vance and Red straight across!",
         "My 3rd time voting for him in PA.",
         "Californian here.  No chance for Trump but hopefully we can get prop 36 passed and get rid of the horrendous prop 47.   Thanks Kamala.   I just returned  from voting and mentioned to the gal handing out the ballots that it is our civic duty to vote.  She had a glazed look in her eye and I said, \"the average person under 55 doesn't even know what civics nor civic duty means\".  Her continued glazed look and grin told me I was right.  Doubtful she could have even named the 3 branches of government.  We're pretty much doomed her in CA.",
         "Absolutely! My husband and I voted a few days ago! 🇺🇸 Keep Jezebel out of office!",
         "Post this in Pics",
         "Voted and was out the door of the polling station by 8:20. Glad I went early because you could barely get through all the people waiting in line to get back out!",
         "State?",
         "What state do you live in? It’s illegal out here in TX to have phones 100’ within a voting stations.",
         "There's a working families party?",
         "Yep! Red across the line.",
         "Fill that in a bit more they’ll probably pull some bullshit",
         "Thank you but that dot though 😧",
         "No I'm jamaican",
         "Ter Matt for president?\n\n\n/s",
         "Voted Trump first time voting Republican after only voting democrat but I live in Colorado in Denver so it’s a very small minority tho I saw a woman with trump hat today at Costco",
         "Thank you",
         "Wish I could have, I’m 16",
         "Heck yeah I did !",
         "👍🏼",
         "And may I just say you done good.",
         "I just got back from voting and have never seen a line outside waiting to vote, a lot of senior citizens. I hope that’s a good sign, I’m nervous as hell.",
         "My wife and I went an hour ago.",
         "Outstanding and YES I HAVE! TRUMP/VANCE",
         "Voted this morning! ❤️",
         "Yes! Trump all the way baby!",
         "Did it last week 🇺🇸 MAGA",
         "I’m very close to retiring after the last 5 years. It’s time for a vacation.",
         "We voted last week during the week. It was a short time VS the Saturday we went early in 2020 and 2016.I'm not sure why I let the dates get by me as we have voted early many times during the week before.",
         "Voted for Trump for the second time in Commiefornia 🫡",
         "Another vote against fascism. Trump 24!",
         "I'll be going after work!",
         "Voting to end democracy. Good move.",
         "Same! Third times a charm!",
         "Same!",
         "Bro you’re missing out on r/conservative",
         "Feel like im a part of a few here that do that.",
         "R/Conservative exists. But glad to have you here",
         "Don’t forget r/trump",
         "I'm not a mom yet, but someday I'll be in the hot mom club!",
         "Can I vote for the Hot Moms as well?!?",
         "Same lfg",
         "Welcome! My best friend of 30 years is a gay man who just voted for TRUMP for the first time too!",
         "Good for you, man! Welcome to the Trump train, my friend!",
         "I had to slide mine into a scanner that was mounted on top of a locked plastic bin. There used to be voting machines/booths with switches, but this is the new digital way",
         "My thought exactly my friend, all we can do is try",
         "Giving a damn will always matter. Thanks for dropping a little cure where you’re at, even if it doesn’t fix the disease.",
         "I hope my family doesn't vote at this point! They're all for the opposition, no matter how much sense I try to talk into them -_-",
         "Good idea! Haven't gotten banned from there yet!",
         "I wish I took a picture of my vote for Trump to get banned from some of these subs and before they ban me call me every name in the book which IDC",
         "I just posted mine to see if if will get me banned they just deleted it",
         "I was in and out in under 5 minutes. There was absolutely no line. I was surprised. But I'm sure it'll be busier when people get out of work and stuff.",
         "I did mine at 7:40 and was out at 7:45 ish I already had everything I was going to be voting for",
         "Ct",
         "Ct",
         "Yeah but I think it consists of like 2 people lol",
         "This is the way!",
         "Yeah a few people have said that :/ too late now\n\nThe machine took it no problem so all I can do is hope for the best I guess",
         "He didn’t vote for the Cackling, DEI Candidate who with Joe (BTW where has he been) and destroyed this country. He voted to Make America Great Again!! Yeah I know she and you want America Last but that WONT be happening!!",
         "I’m voting trump specifically to make you 🫵 upset. Enjoy",
         "Trump isn't gonna be a dictator just because he wants to keep drugs out of the country bro",
         "You do realize we're a constitutional republic, right? NOT a democracy. But good try, buddy.",
         "Oooo I'm gonna go post over there, too. I should have guessed there was one for conservatives. There's a reddit for everything lol",
         "They're heavily infiltrated.",
         "Just please don’t get confused and vote for the “mamala!” 🤮",
         "Hot Pennsylvania moms for the win! Eff yes! Yall are welcome! 💅",
         "Same here, LFG",
         "Thanks and granted I’m not a republican. But I just don’t like the direction Biden had our country in. Trump is really the only option to save our economy",
         "Yeah mine got scanned too",
         "Okay thanks!",
         "Yeah I'm I very blue state ppl are shock when they find out I'm not a dem.",
         "Your screen name reminds me of Scott Jennings' description of Kamala Harris, \"she's a Duck-billed Platitude.\" 🤣",
         "First person in line was 90 something years old. Couldn't start anything til she verified the ballot boxes were empty and fill out the paperwork. They had to keep moving a chair from the registration table to the opened ballot boxes, help her slowly cross the room. then back to fill out the forms. After that it was moving pretty fast.",
         "Nice! Speaking of which, do you think Republicans really could win the fifth district? \n\n(I think it's the 5th district... The one next to New York State)",
         "Exactly! (And I'm a woman- not that it matters much lol)",
         "Be sure to request flair over there from the mods or you’ll get locked out of many threads today.",
         "I feel like a lot of people are in the same boat as you. They just feel enough is enough, and somethings gotta give. The economy is trash right now, and people of all backgrounds are struggling. My big concern is the single issue voters that only care about social issues like abortion and whatnot. Like that's the most important thing happening in our country right now. It's just crazy.",
         "Same here, but I've been noticing a lot of Trump signs in my neighborhood, so that gives me at least a little hope!",
         "Ohhhhhhh nooooo! That's awful! Haha \n\nIt was one of those auto generated ones and I just went with it lol",
         "I really wish I could say yes, but Ct is pretty hard-core blue and even more so down by New york. Im hoping and praying, but in all honesty, I don't think so. I live in central ct, and we have a pretty decent mix here. I'm just hoping that enough people are fed up with how things are going, and there'll be a much needed change. But humans are creatures of habit and don't like admitting when they're wrong so...",
         "But he has to have about two weeks' worth of generally conservative viewpoints and comments to get a flair",
         "*Every thread ever",
         "Ah yes.  Good clarification!",
         "Oh thanks for the heads up guys.  Guess I'm not posting over there lol",
         "You can post there and comment on threads with no flair required but one is required for about 95% of the time"
      ]
   },
   "1gkzjzq": {
      "title": "Free Block List of Celebrities",
      "text": "It’s a real shame people can’t keep their opinions to themselves anymore. Honestly, outwardly I could care less who you’re voting for, as long as you’re not shoving it in my face. But these celebrities (musicians, actors, etc) act like they know what’s best and want to tell YOU what to think and do. Most of these people are loaded so these policies do not have an effect on them. They are not struggling to buy groceries and pay taxes when they’re jetting across the world to their multiple houses. Also, now we can point and laugh that despite so many people backing her, she STILL lost.",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Oh oh is this the list of celebrities who did they would leave the country!!!!!!"
      ]
   }
}