{
   "1gke537": {
      "title": "White, college educated, women for Trump (because there are so few of us, according to the left)",
      "text": "",
      "comments": [
         "Not as rare as you would think, but media narrative would certainly make you feel like a unicorn",
         "Same here! 26 year old White, college educated women who voted for Trump. I wish more people my age were able to think on their own instead of being indoctrinated by the left.",
         "Count me in! The propaganda would have us believe otherwise, but we’re out here!",
         "I am a lesbian woman and I voted for Trump",
         "Same",
         "Same here! 👋",
         "Same here 🙋🏼‍♀️",
         "Gay guy here, voted for Trump. We exist!",
         "Also a white, college educated woman who voted for Trump. 🙋🏻‍♀️",
         "Take that, Mark Cuban!",
         "I am a woman, white and college educated. I voted for Trump!!",
         "God bless you!",
         "Yes!! ❤️❤️",
         "Me too.... voted red straight across! 🇺🇸❤️🤍💙🇺🇸",
         "Also according to Reddit. I isn’t realize this was a liberal hot pot",
         "[deleted]",
         "Me toooo! 🇺🇸🙏🏻",
         "Yep. We are all fascist, racist and uneducated garbage according to the left.",
         "White cat lady here! Voted Trump because I don't believe the propaganda.",
         "+1 white college educated woman for Trump here in PA",
         "LFG!!!",
         "Saaaammmmeeee",
         "Considering the dems lie about dam near ecerything else, this is just another one.",
         "Lol. Thank you. Felt a bit lonely for a minute.",
         "My Masters Degree white wife has never voted for president before, but voted for Trump.",
         "Well said",
         "We are vast in quiet numbers and we are wise.",
         "My wife is also white and college educated and voted Trump. Although when we were voting she and the other white lady in the booth next to her gave a knowing look…\n\nKidding of course.  She was going RFK but decided to go Trump after he picked Vance; we had watched Hillbilly Elegy ages ago and didn’t realize it was about him until he got tapped for the VP spot.\n\n\nThe dems would have you believe all the white women “secretly voted Harris” because they don’t want their stereotypical abusive husbands to find out.  But unlike the Left, we know that women are more than their gender, can think for themselves, and make their voices heard.",
         "Me too. I’m not a racist. I’m not a nazi. I am actually a very nice person that just sees through the Democrats bullcrap and lies.",
         "I am with you!! Two degrees and a masters!",
         "My wife just voted for Trump -who has 2 college bachelor degrees, and isn't white.",
         "Thankyou my fellow Republican.",
         "My mom voted for Trump yesterday in CA.",
         "Same here!! There are many **Strong** and **Intelligent** women who voted Red! ❤️🤍💙",
         "Yep, me too!",
         "More of you than the media cares to admit or announce.",
         "Thank you!!",
         "We have very educated women on this side of the aisle",
         "I just voted to allow abortion access in the state I live in. I believe women should decide what should happen to their bodies. I will not impose my personal believes on anyone else.  I also voted for trump, because I see no future for my kids with democrats in charge. I see my money being wasted in forever wars and getting sent to illegals. ",
         "They call it “manifesting”",
         "Me too! 🙋🏻‍♀️",
         "Let's gooooo 👏🇺🇸",
         "Thank you for your support! We will get this done!",
         "Wait.  You’re an intelligent, educated woman and the left allowed you to think for yourself?  Stunned the thought police are not knocking on your door.",
         "hell yaaa!!!! me too!!!  lets go Trump!!",
         "Same here from Jersey!! Trump 2024!!!",
         "Me tooooo!",
         "Sis you are not alone. I know multiple in CA.",
         "Same here!! 👋🏻",
         "Me too! I confuse the hell out of them. Masters degree, really into musical theater, board games, and dungeons and dragons.  Conservative my whole life.",
         "you're not alone! college educated, advanced degrees, mother, living in a blue state - voting for trump!!",
         "I'm not even college educated and was smart enough to vote for Trump!",
         "SAME!",
         "We need more of you ladies!",
         "Same here!",
         "I've been paying union dues for 25 years, and once again,  I voted for Trump!  As did many union brothers and sisters.",
         "They do exist!",
         "Count me in!",
         "I also voted today.",
         "Mexican/German college educated woman here, just dropped off my ballot!",
         "Very concerned about Pennsylvania right now. Get everyone you know to vote!",
         "Let's goooo🫡",
         "I voted for Trump in my blue state that never goes red. Almost felt like a waste of a vote Knowing my state will be blue regardless, but it felt good to exercise my right to vote. Maybe my blue state will have a stronger red margin than normal!",
         "Did you ask your husband first?",
         "Same !",
         "With ya.",
         "Hey yo\nMe too",
         "My wife and I both voted for Trump today",
         "\"Ahh, you voted for Trump that automatically makes you uneducated and a racist\" --Some Democrat Somewhere, Probably.",
         "I used to think people like you were quite rare but the more I talk to other college educated women, the more I realize it's not really as rare as one might think. A lot of them just keep quiet about their political views to try and avoid conflict but there are more of them that support Trump than I ever would have thought.",
         "Hell yeah",
         "Me too!",
         "Going to college doesn’t make you smart. I don’t understand why the left thinks that. You literally pay for a piece of paper that proves you sat in a class and learned from an outdated book.",
         "Woah! All 4 of you are in this thread?",
         "You’re awesome!",
         "Although most conservatives don’t believe you should have equal rights, whatever…thanks for the vote!",
         "I'm sure there are many of us despite the media! Thank you for doing your part too!",
         "Indeed, I listen to Dave Rubin and Guy Benson sometimes ",
         "Love to see it!! 👏🏻",
         "I didn’t think those existed!",
         "You forgot deplorable. 😉",
         "I'm 3 courses away from my masters!",
         "Changing gears, I believe and support in Christian Universalism (CU) aka UR (Ultimate or Universal Reconciliation) and she doesn't (yet),  though we're both devout believers in God and Christ Jesus.\n https://www.hopebeyondhell.net/articles/further-study/eternity/ \n\n\n And https://salvationforall.org/ \n\n\n And with a great homepage https://tentmaker.org/books/Restitution%20of%20All%20Things/restitutionindex.htm",
         "Looks like Dem messaging may have backfired.",
         "I'm 3 courses away from my masters in library science and most people who find this out assume I would vote Democrat 🤦🏻‍♀️ crazy how people can have various interests that are not simply Republican or Democrat interests lol",
         "My husband's a union member - LIUNA!",
         "Funny enough he is only here in the US as a legal permanent resident and cannot vote but he can work, support our family and pay taxes that support illegals  🤷🏻‍♀️ make it make sense",
         "That’s not true. Conservatives think gays are people and deserve the best. (We are not for the trans stuff with our children or women spaces - big difference) What rights do straights have that gays don’t?",
         "Extremely NOT true..anti trans is not anti gay..",
         "Wtf",
         "Not even close to true. Lol. Just wow.",
         "Most of my conservative friends are pro gay AND trans. They just are against sharing bathrooms and sports mainly to ensure the safety of others. \n\n\nI don't know why this would bother anyone. At least they're willing to have a conversation without yelling or attacking anyone.",
         "Thank you both.",
         "Thank you both.",
         "And literal nazis too, apparently. The left accuses the right of being \"hateful\" and \"evil\", but the only hate I ever see is predominantly from the \"progressive\" left.",
         "Also https://christianitywithoutinsanity.com/ \n\n\n\"...Each in their own order...\" -1 Corinthians 15:20-28",
         "👍"
      ]
   },
   "1gk7mji": {
      "title": "Blacks for Trump!",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "A black woman said she’s voting for Trump in r/pics and got called a bot. Thank you for not being told you have to vote blue because you’re black. It’s dangerous to be told what you HAVE to do. Are you long term republican or first timer?",
         "Great! What state?",
         "I'm jealous of your body...lol - I'm old and pudgy. Keep up the gym membership!",
         "As a minority I find it racist when democrats expect me to vote blue. Always voting Red. Use your common sense, republicans have policies that are better across the board. Democrats just love their propaganda",
         "MAGA!",
         "Hey bro, this is a no flex zone. 🤣🤣 (kidding)",
         "\"If you have a problem figuring out whether you're for me or Trump, then you ain't black.\" - Biden",
         "wtf is this man 😂 this isn’t tinder bud don’t make us other black republicans look bad.",
         "Let’s go!!!!! Thank you for not listening to the Dems redoric!!!!!!!!!",
         "Mate I don’t want to make this about race but if Harris was white this would already be over and we all know it. Big up you though man! Wish I could vote from England 😭",
         "Laundry day?",
         "LETS GOOOOOOO!",
         "Another common W",
         "Hell yeah",
         "Amen!",
         "He is definitely for Trump",
         "BIGGGG!!!!",
         "You’re a hero bro",
         "I like this guy. Be your own man and cast your own vote. It's about your decision, no one else's.",
         "Thankyou my fellow Republican. It's about time I get off my lazy ass and walk down to the voting booth.",
         "Now just get a few friends to vote also, preferably wearing shirts.",
         "The only color I see is RED WHITE AND BLUE BABY!!!!!",
         "yessir brotherrr 💪🏻🇺🇸",
         "You’re the future of America. Thank you friend",
         " Bravo 👏",
         "Bless you brother",
         "That's awesome my man 🤟🤟🤟",
         "Trump all day. Fucc Cumala",
         "Woohoo!",
         "I'm as white as bleached snow, but welcome aboard friend. Freedom is for all people who will defend it. I hope we are celebrating in a few hours.",
         "This is great and all.  But whats with the faceless shirtless selfie?",
         "You don't have to be for Trump. You can vote for policies.  Personally I vote for policies, If I voted for the morales of a politicians I probably would never cast a vote Republican or Democrat .",
         "Put on a shirt, hippie.",
         "🤝",
         "Hell yes .",
         "Thanks for the vote. Put on a shirt please.",
         "Everyone for Trump!",
         "Minority here voted Trump too, so sick of racist white liberals expecting my people to vote Blue no matter who.",
         " Not sure why your shirt is off but that’s ok. Thanks for fighting the good fight.",
         "the thirst trap was definitely not needed 😂",
         "....whyd you take your shirt off?",
         "What happened to your face?",
         "Amen!",
         "The man..🫡",
         "I just fucking wish it would quit with the blacks or whites or gays or furries or what the fuck ever. It needs to be America for freedom. That’s what matters. I get it. My mom is the same way only for Harris. I won’t talk to her for a week after today I’m sure lol. Good job doing the part",
         "Sorry all I see is a fellow American.",
         "I personally haven’t met a black guy here yet in Louisiana who isn’t voting for Trump. Anyone who is in their right mind will vote for Trump. Regardless of color/race. Whether you’re born rich or born into poverty. You always have to stand for what’s right, and always stand on your beliefs. I went to prison for a long time at a young age, I was unable to vote once I got out due to parole. I am able to vote now and I am proud to say that I cast my first ever vote to Donald Trump.",
         "I'm glad your learned to think for yourself!",
         "Awesome!",
         "Wow, welcome!",
         "Everyone for trump !!!!",
         "Thank you for your vote.",
         "Lmaooo come on man. Smh",
         "Not goin to lie, I was kind of scared to scroll to the second pic.",
         "brother put on a shirt 🤣🤣🤣 we have kid friendly spaces .",
         "The shirtless pic wasn’t it, bro bro.",
         "First time!\n\nI voted 3rd party in the last two election cycles. I believed that Trump was just a standard, rich, entrenched politician.\n\nBut the establishment wants him GONE. Which gives me all the information I need",
         "The people calling us racist believe black people cant and shouldnt think for themselves, and should be reliant on welfare and government help. Imagine that.",
         "r/pics is crazy I saw someone getting thousands of upvotes from posting Kamala eating Doritos",
         "The ridiculousness of saying black Americans need to be democrats is crazy as the dem wanted to keep ppl down. Republicans are the ones who ended slavery and alot of other unfair regulations against all ppl.",
         "Ohio :)",
         "Damn. Guess I'm not black anymore 🙃",
         "But you are \"garbage\" - also Biden",
         "I know you’re not saying this with that username lol",
         "Gotta show off the six pack;)",
         "I worked my ass off for six pack!\n\nI'll be damned if I don't show it off 🤣",
         "Show the six pack ;)",
         "“But the establishment wants him GONE. Which gives me all the information I need”\n\n👆🏻100%",
         "Welcome! Thank you for your vote! One thing I cannot stand about our communities (I also am a minority) is that we want to be seen for our individuality yet they insist we vote as a monolith.",
         "They want him gone so bad that NY changed laws just so they could chage him but told all other business owners doing the same stuff not to worry you'll be fine. They just wanted to get Trump out and failed. Then the attempts on his life. How many ppl would go thru all that and still continue to fight for the ppl, not many.",
         "R/pics is a breeding ground for idiots",
         "Nice!",
         "This is probably a stupid question, but is the stuff in Springfield true?",
         "To a bunch of dudes? r/gay",
         "Can’t blame you for that!",
         "Fair enough!",
         "Literally no one would except DJT",
         "Yes. It's an hour away from me, but im.so sorry for the people who live there",
         "Homosexuality is a sin, brother.",
         "Whoah. All my blue voter friends think it's all fake, even the statements given by witnesses in Springfield. Stay safe out there, and keep your pets indoors!",
         "I am sure he’s telling the truth I trust everyone on Reddit"
      ]
   },
   "1gk98rq": {
      "title": "I have done my civic duty! Have you?",
      "text": "Just got back from voting to save the country! Prayers that we beat that witch Kamala and her little troll henchman!",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Fill in your bubble all the way! This makes me nervous (though I’m just super nervous today anyway)",
         "Voted in North Carolina when early voting happened. Third time aboard the Trump Train.",
         "This is THE ONLY sub that allows pro trump shit and I’m here for it. Hell yeah",
         "Damn dude fill in your bubble completely. Don’t give them a chance to throw out your ballot. They will do everything they can to disenfranchise you.",
         "+1 more in NC",
         "Me too! Hot moms in Pennsylvania vote trump! Cmon girls!",
         "Hey folks, I'm not American, I wanted to ask are these counted by hand ? Or are these electoral ballots scanned to get a digital count?",
         "I voted! A gay guy here for trump \n\nHilary 2016, Biden 2020 and now Trump 2024. Took me long enough haha",
         "YES I DID ON MONDAY!!! TRUMP!!!!!",
         "Just got home from doing it idk if it will make a difference where I live but hey I tried",
         "yep! voted in MO \nTRUMP2024!!!",
         "Hell yea!",
         "On my way now!",
         "My entire family has confirmed they've voted. My niece, who lives in Georgia but attends Ole Miss, never received her absentee ballot. \nHer sister who attends U. of Georgia voted weeks ago, but my sister was too scared to ask her who she voted for 😬",
         "Thankyou my fellow Republican. I'm a first time voter. And yes I voted for Trump.",
         "Heck yeah I did !",
         "👍🏼",
         "And may I just say you done good.",
         "I never call out sick, but I was genuinely sick a few weeks back and decided to see if I could early vote. Took 5 mins to walk in and out here in Middle TN. No excuses!",
         "I just got back from voting and have never seen a line outside waiting to vote, a lot of senior citizens. I hope that’s a good sign, I’m nervous as hell.",
         "The white voids in your bubble triggers my ocd.",
         "I did... Trump Vance and Red straight across!",
         "My wife and I went an hour ago.",
         "My 3rd time voting for him in PA.",
         "Outstanding and YES I HAVE! TRUMP/VANCE",
         "Voted this morning! ❤️",
         "Yes! Trump all the way baby!",
         "Did it last week 🇺🇸 MAGA",
         "I’m very close to retiring after the last 5 years. It’s time for a vacation.",
         "We voted last week during the week. It was a short time VS the Saturday we went early in 2020 and 2016.I'm not sure why I let the dates get by me as we have voted early many times during the week before.",
         "Californian here.  No chance for Trump but hopefully we can get prop 36 passed and get rid of the horrendous prop 47.   Thanks Kamala.   I just returned  from voting and mentioned to the gal handing out the ballots that it is our civic duty to vote.  She had a glazed look in her eye and I said, \"the average person under 55 doesn't even know what civics nor civic duty means\".  Her continued glazed look and grin told me I was right.  Doubtful she could have even named the 3 branches of government.  We're pretty much doomed her in CA.",
         "Voted for Trump for the second time in Commiefornia 🫡",
         "Another vote against fascism. Trump 24!",
         "I'll be going after work!",
         "Absolutely! My husband and I voted a few days ago! 🇺🇸 Keep Jezebel out of office!",
         "Post this in Pics",
         "Voted and was out the door of the polling station by 8:20. Glad I went early because you could barely get through all the people waiting in line to get back out!",
         "State?",
         "What state do you live in? It’s illegal out here in TX to have phones 100’ within a voting stations.",
         "There's a working families party?",
         "Voting to end democracy. Good move.",
         "Same! Third times a charm!",
         "Same!",
         "Bro you’re missing out on r/conservative",
         "Don’t forget r/trump",
         "Feel like im a part of a few here that do that.",
         "R/Conservative exists. But glad to have you here",
         "Same lfg",
         "Can I vote for the Hot Moms as well?!?",
         "I'm not a mom yet, but someday I'll be in the hot mom club!",
         "I had to slide mine into a scanner that was mounted on top of a locked plastic bin. There used to be voting machines/booths with switches, but this is the new digital way",
         "Welcome! My best friend of 30 years is a gay man who just voted for TRUMP for the first time too!",
         "Good for you, man! Welcome to the Trump train, my friend!",
         "Giving a damn will always matter. Thanks for dropping a little cure where you’re at, even if it doesn’t fix the disease.",
         "My thought exactly my friend, all we can do is try",
         "I hope my family doesn't vote at this point! They're all for the opposition, no matter how much sense I try to talk into them -_-",
         "Good idea! Haven't gotten banned from there yet!",
         "I wish I took a picture of my vote for Trump to get banned from some of these subs and before they ban me call me every name in the book which IDC",
         "I was in and out in under 5 minutes. There was absolutely no line. I was surprised. But I'm sure it'll be busier when people get out of work and stuff.",
         "Ct",
         "Ct",
         "Yeah but I think it consists of like 2 people lol",
         "He didn’t vote for the Cackling, DEI Candidate who with Joe (BTW where has he been) and destroyed this country. He voted to Make America Great Again!! Yeah I know she and you want America Last but that WONT be happening!!",
         "I’m voting trump specifically to make you 🫵 upset. Enjoy",
         "Trump isn't gonna be a dictator just because he wants to keep drugs out of the country bro",
         "You do realize we're a constitutional republic, right? NOT a democracy. But good try, buddy.",
         "I also voted in North Carolina - October 17th. My ballot was ‼️FULLY RED‼️ 🫦",
         "Oooo I'm gonna go post over there, too. I should have guessed there was one for conservatives. There's a reddit for everything lol",
         "Same here, LFG",
         "Just please don’t get confused and vote for the “mamala!” 🤮",
         "Yeah mine got scanned too",
         "Okay thanks!",
         "Thanks and granted I’m not a republican. But I just don’t like the direction Biden had our country in. Trump is really the only option to save our economy",
         "Yeah I'm I very blue state ppl are shock when they find out I'm not a dem.",
         "Your screen name reminds me of Scott Jennings' description of Kamala Harris, \"she's a Duck-billed Platitude.\" 🤣",
         "First person in line was 90 something years old. Couldn't start anything til she verified the ballot boxes were empty and fill out the paperwork. They had to keep moving a chair from the registration table to the opened ballot boxes, help her slowly cross the room. then back to fill out the forms. After that it was moving pretty fast.",
         "Nice! Speaking of which, do you think Republicans really could win the fifth district? \n\n(I think it's the 5th district... The one next to New York State)",
         "Exactly! (And I'm a woman- not that it matters much lol)",
         "Be sure to request flair over there from the mods or you’ll get locked out of many threads today.",
         "I feel like a lot of people are in the same boat as you. They just feel enough is enough, and somethings gotta give. The economy is trash right now, and people of all backgrounds are struggling. My big concern is the single issue voters that only care about social issues like abortion and whatnot. Like that's the most important thing happening in our country right now. It's just crazy.",
         "Same here, but I've been noticing a lot of Trump signs in my neighborhood, so that gives me at least a little hope!",
         "Ohhhhhhh nooooo! That's awful! Haha \n\nIt was one of those auto generated ones and I just went with it lol",
         "I really wish I could say yes, but Ct is pretty hard-core blue and even more so down by New york. Im hoping and praying, but in all honesty, I don't think so. I live in central ct, and we have a pretty decent mix here. I'm just hoping that enough people are fed up with how things are going, and there'll be a much needed change. But humans are creatures of habit and don't like admitting when they're wrong so...",
         "But he has to have about two weeks' worth of generally conservative viewpoints and comments to get a flair",
         "*Every thread ever",
         "Ah yes.  Good clarification!",
         "Oh thanks for the heads up guys.  Guess I'm not posting over there lol",
         "You can post there and comment on threads with no flair required but one is required for about 95% of the time"
      ]
   },
   "1gk7my0": {
      "title": "Voting FOR My Interests",
      "text": "I’ve been quiet this election, not wanting to rock the boat. But since it’s Election Day. I’m gonna ask you - if you’re voting for a candidate who didn’t even have a primary election because you have a gay or transgender friend of family member, and you “care about their interests,” as a gay man diagnosed with gender dysphoria here are my interests:\n\n-A secure border\n- An end to funding wars \n-The protection of human life at all stages from from conception to natural death\n- The protection of children from a billion dollar industry that wants to mutilate their bodies before they turn 18\n- The protection of femboys and Tom boys who would grow up in any other age to just be gay or gender non conforming\n- The right to 100% free speech - freedom of speech IS freedom from consequences from the government \n- The right to have the first female  president win because she is better than any man in power - not because she is a DEI\n- The protection of women from men invading their spaces\n- The protection from the state forcing a sh0t onto me\n- The protection of my religion (Christianity) from an atheist death cult \n- The protection of illégal migrant children and innocent refugees (make them citizens, not slaves)\n- The continued criminalization of mind altering drugs \n- The protection from sterilizing children who aren’t trusted to drink or vote or get a tattoo, but for some reason can destroy their bodies \n- The right to “just be gay” \n- The protection from erasure of the homosexual and lesbian communities by the alphabet mafia who seek to redefine what gay is \n- The protection from transgender people from military service \n\nTrump didn’t get rid of gay marriage back in 2016, when he had a Republican super majority. He does not endorse Pr0ject 2025. He did not ban transitioning for consenting adults. He did not not ban gay people from adopting. So if you’re voting today (which I beg you to do) because you “care about the interests” of your gay friends and family? Well I’m gay, and here’s my interests.\n",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Right on Welcome!!! Dems pray on LGBTQ+ communities!!! And they do nothing for them. Ignore some of these comments",
         "My best friend who is gay and his partner both voted for Trump in AZ!",
         "YES! Future elections are going to depend on voters like you who are brave enough to stand up for who you are and what you believe. This is not your Dad's/GrandDad's Republican party anymore and if we're to normalize the virtues of smaller, more limited government, we need more brave souls who can champion the message from all walks of life. I salute you.",
         "I know several gay conservatives. I think it's pretty insulting for one side to believe they \"own\" a demographic. Freedom, security, and a good economy benefit everyone regardless of their combination of skin color and genitalia.",
         "Welcome to sanity! Live your life, love your spouse, and for the love of PB&J sammiches, never forget the lessons of the Biden-Harris tyranny.",
         "Both me and my partner voted Trump!! NM",
         "This is great! Make sure you try to get everyone you know to do the same.",
         "Welcome! The left will continuously tell you we hate you. I am a conservative Christian woman and I welcome you and literally anyone else who wants to join ranks. \n\nTHANK you for thinking independently and clearly and not falling in line with every other gay person just because they tell you to.",
         " My sister is gay and wants a better future for all. She is voting Trump. Welcome aboard friend",
         "Let’s goooo!  This new Republican Party is the TRUE Party of acceptance.",
         "Did you know that Trump was the first person elected that ran on support for the gay people and gay marriage? Crazy how people forget that.",
         "Hell yeah brother",
         "Gay Trump voter in VA!",
         "Go you brother, you seem well informed on the issues important to you.  Honestly, however people vote, this is what we should hope for.\n\nAgree with who you are and your stance.  We are thrilled to stand with and by you.",
         "Preach. 👏",
         "I don’t want no gays in my party\n\n\nJk welcome in just wanted to do a bit of trolling with the top of this comment \n\nBut seriously we need more people like you to stand up and admit that Trump ain’t the evil guy the left thinks he is especially people of the communities they claim he hates",
         "#TRUMP",
         "Heck yeah! Welcome to the Resistance friend!!! 🇺🇸🫶🏻",
         "Welcome to the party of real love and acceptance! ❤️",
         "You don’t look gay. Always laugh at that Trump video",
         "It's not a choice to be gay, but it is a choice to be a liberal.\n\nEdit: I 100% stand by this comment, not sure why I'm getting downvoted, unless you think it IS a choice to be gay.",
         "Glad you’re voting for the right side. Can’t wait to vote next election",
         "Let's go ! 🇺🇸❤️",
         "Go girl",
         "Let's go ! 🇺🇸❤️",
         "I like the sentiment, but isn’t this rainbow upside down?",
         "Nah fuck off",
         "Just don't forget, sodomy is deadly sin.",
         "Democrats are better on LGBT specific issues, but none of that matters if I can’t afford a roof over my head or food on the table, if I can’t arm myself to protect myself, etc…",
         "There's a great film called \"Elephant in the room\" which discusses the difficulties of those in the gay community who support Republicans.   Let's just say that most are not tolerant of someone fishing from a different pond.",
         "It is not a choice to be gay",
         "It is a mental disorder that can be treated, if a person wants to.",
         "So? It’s a rainbow 😂",
         "Oh? You’d rather be vote for Kamala?",
         "It’s really not wise to shit on people agreeing with you",
         "Dude, what the fuck? Why ostracize people who are supporting the same cause as you? You can disagree about religion some other time, right now we need to all pull together.",
         "Excuse me? Glad I’m voting for a guy who likes gays. I’d vote for Kamala over you",
         "Oh absolutely!! They Race bait and Box people in!! Trust me. I’m 2 hours North of San Francisco!!! It just not safe anymore!! Welcome To MAGA my fellow American",
         "Separation of church and state",
         "Have you met any gay people???",
         "It ain’t the gay rainbow though",
         "Nah Trump all day just pissing off Americans on the day",
         "I don't know why you think it is \"shiting\", Christians should be guided by: love the sinner, hate the sin.\n\n\"If a man lies with a man as with a woman, both of them have committed an abomination; they shall surely be put to death; their blood is upon them.\" Leviticus 20, 13",
         "So you are saying we can ship the gay guy off to a camp later, but we want his vote now.",
         "What the fuck?",
         "I’m just gonna recommend you shut up and sit down.",
         "Read the room. You’re not doing anyone or any favors. \n\nThe Venn diagram of Republicans and conservative Christians is not a circle. \n\nWhat are you hoping to accomplish here? Whatever it is has been about as effective as people blocking traffic for hours for *(insert cause here)*.",
         "Read the room. You’re not doing anyone any favors. \n\nThe Venn diagram of Republicans and conservative Christians is not a circle. \n\nWhat are you hoping to accomplish here? Whatever it is has been about as effective as people blocking traffic for hours for *(insert cause here)*."
      ]
   },
   "1gkbgiz": {
      "title": "I did my part",
      "text": "Got downvoted to oblivion in /pics lol maybe I can get some karma here to balance it out. ",
      "comments": [
         "Same but my site did not allow cameras",
         "Thankyou my fellow Republican.",
         "In line right now in L.A. County...Red shirt, Santa's image, and \"BELIEVE\" on it.",
         "🔥",
         "I’m in California, I didn’t even need to show an ID.. vote probably won’t matter but with thoughts like that, change won’t happen. I would love to see CA turn red and be part of it.",
         "Kern county for me, line was short this morning. Stay strong in those long lines!",
         "It helps with the popular vote! If he wins both the popular and the electoral, it gives the Dems less leverage to try to make his presidency a reason to get rid of the electoral college.",
         "California was in the past. Could change.\nAt least you are muddying the waters\nIm in Tn and they checked my id and made me sign legal documents",
         "Pipe dream, California has fallen decades ago",
         "Voted for DJT, and for Garvey twice, but really it was against Schiffless twice. Garver seems to be RINO-leaning.",
         "I agree it’s a pipe dream, next election I plan on being in Georgia so my vote will mean more."
      ]
   },
   "1gkh4c5": {
      "title": "Latinos for Trump! 🇺🇸🇵🇷🇩🇴",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Thankyou my fellow Republican",
         "Me too!",
         "Thank you republican brother",
         "🔥",
         "👏",
         "Thank you fellow American",
         "I'm not latino, but I just voted for the Don. Judt turned 18 a couple months ago, so I made it in time."
      ]
   },
   "1gkc56k": {
      "title": "Trump 2024! 🇺🇸",
      "text": "",
      "comments": [
         "Loving these images! This is the candidate I voted for!",
         "Yes sir. Did my part, even if Iowa is red I don’t want to chance it!",
         "I'm a European. May I ask why you love the image of him being arrested? In the Netherlands, a politician with 34 charges wouldnt have any support anymore.",
         "The prosecutor promised that if elected she would get him for something.\n\nAnd the 'crime' he committed was something never charged before.. basically they bent the law and found a jurisdiction filled with people who hate him.\n\nA lot of legal experts expect it will be reversed on appeal.\n\nBasically a political witch-hunt so people like you can read the headline and think he's some criminal masteind",
         "Imagine that you had a popular politician that you supported in your elections, and corrupt national and local governments that colluded to bring spurious charges against your candidate in order to influence the election, and that the charges were brought in a place where the electorate voted 94% against him in the past, and the judge was corrupt and gave the jury illegal instructions.\n\nWould it still prevent you from supporting him?\n\nIt didn't prevent us from supporting ours, either.",
         "It’s the defiance in his face. His support is stronger than ever due to the left side weaponizing the government against him."
      ]
   },
   "1gkbesl": {
      "title": "VOTE VOTE VOTE🇺🇸🇺🇸🇺🇸",
      "text": "",
      "comments": []
   },
   "1gk718w": {
      "title": "Trump Jr retweet.",
      "text": "PENNSYLVANIA ELECTION INTEGRITY:\n\nEarly this morning we learned that Republican poll watchers in Philadelphia, York, Westmoreland, Allegheny, Lehigh, Cambria, Wyoming, and Lackawanna Counties were being turned away.\n\nWe deployed our roving attorneys, engaged with local officials, and can now report that all Republican poll watchers have been let into the building. \n\nWe will keep fighting, keep winning, and keep sharing updates.",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "I know I’m naive, but it still shocks me the way the left wants to cheat. As an American first, I want election integrity. It’s really appalling.",
         "Election integrity should never be considered controversial.  The fact to the left it is a controversy tells you everything you need to know.",
         "While it's great this has been rectified, the fact they were brazen enough to do this in the first place is extremely unsettling. \n\nUntil attempted voting interference is prosecuted effectively, people will continue their attempts to cheat.",
         "Still after the election is over the offenders need to be charged with Election Interference, Civil Rights and Voting rights violations. Prosecute and Penalize or it'll just keep happening.",
         "And are the people who refused to let them in being dragged off by the cops? Or are they allowed to remain with an ongoing agenda to effectuate cheating in the election? (I’m sure I know the answer).",
         "What was the reason given to not allow them in?",
         "Philly DA on election fraud: F around and find out",
         "This time feels different. Seems like the RNC is prepared for the attempts to deny election integrity",
         "Jail time for those will stop others.",
         "Them having to do this is honestly so fucking stupid.\n\nWhy is it people always try to bullshit until there's sudden threat of legal action in this country",
         "Isn't it amazing that we never hear of Democratic poll watchers being turned away. Wonder why that is? ❓🤨",
         "This is such BS.  If you’re not doing anything nefarious why would you try to keep ANY poll watchers out?",
         "\"When they can't cheat, they can't win\". - Hugh Hewitt (who is RINO-leaning)",
         "I’m not even the least bit shocked that the communist democrats are so brazen in trying to cheat and steal elections. They got away with it in 2020 and 2022 with no consequences or accountability. They will keep cheating and stealing elections until they are all put in prison.",
         "How dare these ppl just ignore the laws.",
         "And yet Texas has barred them from watching and you don't complain about that?\n\nVery hypocritical.",
         "Evidence?",
         "Saddest reality is all there dumb followers walk around chatting \"free\" this and \"free\" that meanwhile the democrats is a war for profit mongering machine , their own values literally go agaaint the party and they cheer for thr death the pay for everyday they protest supporting this corrupt party. I know there are tons of good democrats but they can't speak up or be outcasts for sure.",
         "They will try every conceivable way to help rig the outcome.",
         "Exactly, it’s disgusting. I’d rather have a free and fair election and have my candidate lose than to have an election where we had to cheat to win.",
         "It surprises me less considering how evil they are. But it still manages to shock me a bit. \n\n\nLike, this country desperately needs a winner called tonight. It would be so beneficial. But of course it won't happen because the six swing states suddenly need a week to count ballots. ",
         "Without integrity, we will have chaos.",
         "But they aren't American first.",
         "And then they’ll have the gall to say this election or 2016 was stolen.",
         "I am 100% the left could NEVER win a clean, fully informed election.. ever.  And they know this also.",
         "Absolutely. There should be someone in charge of every polling location. If there are verifiable claims (which should be easy to obtain with mobile phone video) of any Republican (or other) poll watcher having been turned away whoever is in charge of the polling locations at which that occurred should be immediately arrested for election interference and civil rights violations and hauled off to jail.\n\nEnough of this already. It's time to treat Election integrity with the seriousness it deserves. I really hope thar some figurative heads will roll over this fuckery. ",
         "Sentence hard enough to deter others in the future. They showed their hand last election, so we know what to look for. They don't care that we know they're doing it. We knew it last time and it didn't go anywhere, so that just made them bolder this time to double down. Make offenders on either side have consequences no one else wants to chance. Criminals know how soft the justice system has become. They interviewed a guy in Spokane Washington a year or 2 ago that had his 100th arrest and asked him if he'd learned his lesson or if he'd do it again and his reply was if I got arrested 100 times, how many times do you think I got away with it. No cash bonds, catch and release laws, sanctuary cities, loopholes in the system and lack of serious consequences for offenders are what's ruining our great country. People start seeing either a getting away with it, so they decide to do it too.",
         "Probably because they think (D)ifferently.",
         "And not a short sentence in a cushy country club prison. Spend time in gen pop and I can about guarantee they'll never break any laws that'll risk any chance of going back ever again. Keyboard warriors and the entitled don't fare very well in jail/prison. No soy lattes or vegan  curries or mommies to save them",
         "It shocks me how blatantly they do it",
         "I just hope they have hundreds of attorneys and poll watchers in these swing states too! I'm in AZ and I hear/ see nothing here to indicate this!",
         "It should send them to federal prisons, it is a federal crime. If they knew it carried a long jail sentence in one, hopefully it will deter them from cheating.",
         "No proof of election fraud in 2020. Zero. None. Provide one link to an article citing actual proof and not conjecture. You can’t. \n\nI’ve voted Republican all my life until this election. What Trump did in 2020 is disgraceful. If McConnell had any balls, the country wouldn’t be in this position of electing this traitor.",
         "No one said shit about 2020 but this time they’re admitting they ain’t gonna let Trump win or in"
      ]
   },
   "1gkaloq": {
      "title": "18, just voted in my first election in Michigan",
      "text": "",
      "comments": [
         "Look at you. Already wise beyond your age at 18. \n\nMost are idiots at 18 thinking government is going to save them and blindly pinch in Democratic candidate. \n\nI salute you young man/woman! 🫡",
         "First of many I hope!",
         "Thank you",
         "Thankyou my fellow Republican",
         "Thank god you turned 18 need all the votes we can get",
         "THANK YOu from your neighbors in wisconsin"
      ]
   },
   "1gkf44y": {
      "title": "3rd time able to vote and 3rd time voting for him! Trump! ♥️",
      "text": "",
      "comments": [
         "✌️hell yeah!",
         "Thankyou my fellow Republican",
         "If you were Democrat you'd have been able to vote 3 or more times in this election.",
         "Pretty girls for Trump 🇺🇸!",
         "Thank you"
      ]
   },
   "1gk75dl": {
      "title": "Oprah says that if Trump wins, \" we will never have the opportunity to cast a ballot again\"",
      "text": "",
      "comments": [
         "Oprah is an asshole.",
         "Translation:  “If Trump wins there is a much higher likelihood that I get exposed for child trafficking”",
         "Because nuking the filibuster, opening voting to non citizens and packing the Supreme Court will save democracy",
         "Oprah says that if Trump wins, \"it is entirely possible that we will never have the opportunity to cast a ballot again\"  \n  \nFriendly reminder that no one voted to make Kamala Harris the democrat party's nominee. Every accusation is a confession.",
         "She should leave the country if Trump wins",
         "Sue her.\n\n1 billion defamation lawsuit.\n\nEnough of this bullshit propaganda lies",
         "Projection. The only person who would do that is  Kamala, or maybe Walz.",
         "If Trump wins, we will never have an opportunity to cast a ballot for Trump again.\n\nThat is a little sad",
         "they've already implemented fascism. That's why they are so furious with Elon. He's the only tech guy that truly told them no.",
         "Ah yes the party that nominated their candidate without a single vote cast for her 🤣",
         "Another Diddy freak… very strange string of coincidences with these celebrities who are endorsing",
         "Hopefully the illegal aliens won't - and whoever voted 29 times in Michigan won't.",
         "Says a billionaire witch.",
         "I don’t understand how the left and it’s media has just blatantly lied this whole election and got away with it.",
         "Newsflash he’s been president before",
         "They are desperate.",
         "🤣",
         "The best result for the country is Trump wins electoral and popular vote. Lower intelligence people will see how they all lied on the left about Trump. None of thier BS will happen.",
         "That’s funny he was president for four years already and I can still cast my vote for him today",
         "What evidence do they have for this? I mean, Republicans have the evidence of the Dems opening the border and the verified fact of the majority of illegal immigrants being shipped to swing states. They also have the evidence of the weaponization of the Justice System against their political opponent. So what evidence do they have that this would happen if Trump wins?",
         "Oprah is such a moron",
         "She’s just like harris. So inspiring. Inspiring me to never be dumb as rocks like them.",
         "Pure projection.",
         "Then Oprah is either an idiot or a liar ",
         "These celebrities need to bed held accountable for their blatant lies and misinformation. She should not be allowed to get away with straight up fucking making shit up and lying to people to try to swing an election. It's infuriating knowing it's a complete lie and these assholes are pushing it as truth.",
         "He was already president and we're still casting ballots....",
         "She's obviously on the Diddy list.",
         "Does she not realize that if Trump wins that this will be his last term?",
         "SHE won’t be able to vote, because she’ll be a felon.",
         "He already won once and lo and behold Oprah continues to vote.",
         "I wish I could make hella money and a career out of just walking up and lying out my ass too",
         "Such crazy talk. Mind blowing that she is allowed to spew lies.",
         "[removed]",
         "If only that were true.",
         "Accuse those to which you are guilty. That's the Democrat way.",
         "Says the person who actively supports the democrats that actively attacks our first and second amendment. I have been censored and banned from speaking in places simply because of my religious l/political beliefs and new gun laws are becoming more and more strict. They are part of an aristocracy group that grows in power and actively seeks to suppress the opposition by using hate speech/misinformation as a weapon to censor us and any one that doesn’t agree with them. The freedom of speech is to protect everyone’s rights to express their opinions and not be attacked for saying it. The freedom to have arms is to protect the first amendment and our selves from tyranny. Once a government suppresses its people’s ability to freely speak their minds is when the government has become authoritarian Oprah is part of this aristocracy group just look up her property in Maui after that horrible fire, look at it today and look at the working people’s property and you’ll see how separate she actually is from the average American. I didn’t leave The Democratic Party, the Democratic Party left me and I found a new home! In The Republican Party 🎉",
         "I hear this sentiment a lot, but I've never heard what basis anyone has for making this type of statement. I realize it's really just ridiculous propoganda/fear tactics, but what is it that Trump has done/said that would make them feel like they can get people to buy into this fear?",
         "I don’t listen to celebrities",
         "She was his original vp pick in 2000. Smh",
         "I hope if Trump wins he drops that list and she gets raped as many times as she did to all the little children",
         "It’s the other way around!! Dems put illegals in swing states!! Will be a one party system !!! Oprah can fuck off with her Diddy parties",
         "She also claimed Obama was the smartest man in the room.",
         "they are such liars. Technically it is the opposite way around. They will continue putting illegals in swing states and giving them amnesty/right to vote so we can cast our ballots all we want but it wont really matter",
         "\"Accuse your opponent of that which you are doing to create confusion\".",
         "Oprah comes out of the woodwork for special events after today she’ll go back into her closet.",
         "Says the party allowing illegals and just about anyone and everyone to vote in our elections. Other countries don’t allow it, why should we? I actually have never seen hypocrisy this bad, everything they accuse the right of is exactly what they’re doing.",
         "Yeah he will take away your right to vote just like last time he was president! Oh wait, last time he protected and strengthened rights while giving freedoms back that Obama took away and he helped us have the best economy in the world 🤦🏻‍♂️",
         "UTTER NONSENSE!!! The lies that people saying is disgusting!!",
         "Can we just stop the insanity already?!?  This fear-mongering nonsense is too old. They’re so scared and it’s showing.",
         "We know that's what you want to do Oprah, you don't have to tell us.",
         "Bitch used to think he hung the moon. Encouraged him to run in the first place.\n\nhttps://youtu.be/SEPs17_AkTI?si=g1nwyTTWoGkwEXF4",
         "They said that in 2016 too.",
         "Where do these maniacs get this crap. They act like Trump wasn’t in office for 4 years and left office peacefully. Crazy.",
         "These idiots seem to forget we already went through a Trump presidency, and the world didn't catch on fire. Im so sick of the lies and fear mongering. It's just insane at this point.",
         "This is the equivalent of slave drivers telling their slaves that Abraham Lincoln is coming after them with an army to kill them, not free them lol",
         "Oprah is a moron.",
         "Is America really going to listen to this liar who tried funneling our funds to Maui and not providing any semblance of her ridiculous wealth to make a game changing contribution?",
         "Oh for eff sake. Go back to giving out cars not scare tactics",
         "That's fear mongering. It's also incredibly dumb.",
         "Yeah just like the last time he was presid- oh wait",
         "Everything they say is a confession of what they are doing/ planning to do in the near future",
         "She was best friends with Trump before he ran for office in 2016 🤣",
         "All they can do is resort to lies and fear. \n\nThat's like me saying if you kiss a pigeon the sky will turn purple. \"What ifs\" are a stupid use of scare tactic.\n\nPlus he was already president and didn't even win a second term. If he was going to be corrupt, the first term would have been the chance!",
         "Sad comment from someone who used to call Trump a friend. These people need to get a life and just stop with their lies.",
         "WTF is wrong with these out of touch slobs.",
         " Projection on what they do, it's so open now its horrible.",
         "Says the side who tried to remove the their opposition from the ballot",
         "I hate when people make such obtuse statements on either side. That’s so ridiculously false lol",
         "Wonder how close to P. Diddy she is? Anyway, no coincides in politics …",
         "Fuck Oprah!",
         "She also said she was going to leave USA in 2016. Still waiting for that one",
         "Tell Oprah I said go 🤬 yourself",
         "They always blame Trump for what they plan on doing",
         "Good lord these people….",
         "This stuff pisses me off",
         "She's not a stupid woman. I don't know why she would say such a stupid thing.",
         "She is so dumb.",
         "More fear mongering by the lady that lit Hawaii on fire so she could buy up the land. Not to mention Weinsteins BFF.",
         "Those are the lies that all these simpletons believe! They think they will be put in jail by the military!!! They’re idiots and it shows!",
         "Same with every accusation by democrats. Exactly the opposite.",
         "I wish Oprah would just keep her mouth shut. She’s disgusting",
         "The same Oprah that is involved in human trafficking and worries about being found out?",
         "Yes, because it happened when he was president before. They’re such idiots",
         "But he already Won once and I cast my Ballot twice since then. What is even That !",
         "That is the dumbest thing ever. Omg.",
         "I hear that Maui is nice this time of year.",
         "She is part of the problem the elites are afraid of losing power so their projecting",
         "What a dumb b. She was partying with Trump back in the day before he ran for President.",
         "Oh look another diddy list suspect trying to sway us to vote Kamala",
         "I did hate it how last time he was President he ended elections.\n\nOh wait shit...",
         "Another diddy list crying false made up narratives. Keep reaching. I don’t think the hate tactics are working. I actually think they’re backfiring on the Democrats.",
         "Oprah can duck a bag of sicks.",
         "Oprah has been to the island and freakoffs so",
         "Remind me in 4 years to vote.",
         "maybe she is talking about herself only in relation to the pizza gate",
         "lol",
         "But he won already before.",
         "And they call us fear mongers.",
         "I don’t remember Democrats voting on their current representation president? Or did Oprah forget about that one?",
         "Neither of those claims are proven.",
         "Says the one backing a candidate that wasn't democratically nominated as the candidate.",
         "I’m done with the craziness of these insane lefties! I can’t wait for Trump to win and expose just how absurd their ideas and baseless claims really are!",
         "She can kiss my Rep ass",
         "Dems are trying to fly in as many illegals as possible to swing states, followed by path to citizenship asap. That and no voter ID, what do you think? There won't be any more 2 party system is Kamala wins.",
         "She’s an absolute delusional maniac, who spews horses..t every time she speaks.",
         "Dumb take",
         "I like how they are just copying everything we are saying 😂",
         "what an idiot",
         "Hahahahaa who is Oprah? Or Whoopie? Or Joy?",
         "Well if Kamala wins, we won’t need to cast ballots again because when they grant amnesty to all of these illegals, the Dem’s have bought votes for the future elections.",
         "That’s how normal people feel for if Kamala gets in",
         "Oprah is also a moron. Along with anyone else who is stupid enough to not understand the fact how our government works and why such a thing can’t happen.",
         "Oh I think I’ve heard this one before around 2016…",
         "Kind of doesn't mean much when the same thing was said in 2016 and yet here we are, casting ballots again",
         "Good, I hope that’s true, too, Oprah. That’s EXACTLY what the plan is. 😉🙏🏻",
         "When Trump wins, and ABSOLUTELY NONE of the ridiculous things the Dems are claiming actually comes to pass, I wonder how many people will wake up and realize they've been lying the whole time just so they can stay in power.",
         "She’s an idiot too.",
         "No, not Oprah. You mean the person who profiteered off the Hawaiian fires? She donated a whole 5 million before asking for our money.  Then buys 870 acres for 6.6 million. Not that Oprah. MAH PEARLS!",
         "Crazily enough, just 24 years ago trump wanted her to be his running mate.",
         "I love how much you say with so few words.\n\nBrevity truly is the soul of wit.",
         "She’s afraid she’s gonna get exposed for something awful.",
         "Lets make this top comment",
         "💯",
         "Oprah said the same thing in 2016.",
         "First I've heard about this, is it a well known thing?",
         "Bingo",
         "Yep, and she’ll be incarcerated as a convicted felon and be ineligible to vote.",
         "YEP",
         "How?",
         "How did you get to that translation? She says “we” not “I” because she’s talking to a crowd.  Am I watching a different video maybe?",
         "Don't forget inserting a presidential candidate when no one voted for her",
         "The only way to save democracy is to take U.S. citizens out of the decision making process entirely!",
         "Exactly, they’re simply telling us what they’re going to do and projecting it on Trump. Truly immoral pieces of shit.",
         "Oh right! She was installed by the virtue signaling posse.",
         "Why is that not a point that is brought up more often?",
         "So a man who has openly supported the constitution, wants to trash that constitution to get rid of elections. Yeah, fear mongering.",
         "Absolute projection.",
         "Very sad!",
         "Yet definitely a wealthy aging cat lady",
         "I like option c.) both an idiot and a liar",
         "Diddy, Weinstein, Epstein?  Damn, is Oprah a billionaire child trafficking czar?",
         "Also, what diddy party did she attend?",
         "And I absolutely guarantee you that in four years, when Vance is running against Kamala, Oprah's going to say the EXACT SAME THING about _that_ election.",
         "OK, so answer me this. How many times has Trump been right?? it seems that these conspiracy theories keep coming true why is that? I’m thinking that the Democrats are hiding a lot of shit.",
         "Not really, but she has no morals. She'll lie with the ease your fingernails grow, she is part of the swamp, and she was the \"Madam\" for Harvey Weinstein, she literally brought young girls to his casting couch. Sex with any form of coercion on the lady is just wrong.",
         "I'm usually toxically verbose. My dad used to call me \"Motor mouth\". God I miss that old man.",
         "Diddy list. Hello???",
         "Like she's ever been \"oppressed\"?",
         "Indeed, also c for Harrison and how he disappointed me when seeing him on YouTube this morning: \nhttps://m.youtube.com/watch?v=-QjVIJd9NbA",
         "Found the diddy party pics: https://x.com/mtgrepp/status/1853662472240341472?s=46",
         "It won’t be Vance vs Kamala. Kamala will be a pundit on ABC if DJT is elected.",
         "Considering we are voting for trump, we cannot exactly be the ones talking about morals.",
         "She was in the color purple…\nOnly time i can recall",
         "Han Solo has finally moved to the dark side. So sad 😞",
         "Sure we can. He hasn't stolen money from us. \"Morals\" is a huge subject, that he has had sex with multiple women is meaningless, that he hasn't stolen from the U.S. Taxpayers is huge.",
         "Considering the darling of the left, bill clinton jammed a cigar into someone other than his wife....🤷‍♂️\n\nAnd let's not forget the foibles of heels up..\n...",
         "Sad to see Indiana Jones got castrated and fully selling out and simping :/",
         "But, he did steal money by not paying others.   He did steal from taxpayers when he lied about corporate tax cuts benefiting wage workers.",
         "Tell me I know fuck-all about commerce and opex without telling us I know fuck-all about commerce and opex.\n\n[It benefits wage workers by making more available jobs.](https://www.nber.org/reporter/2023number3/how-do-corporate-taxes-affect-economic-activity). More importantly, the cuts helped traditionally underrepresented demographics in the US manufacturing space.\n\nBut keep getting your economic policy analysis from NPR."
      ]
   },
   "1gkdf11": {
      "title": "It's Election Day. The fight is only beginning. ",
      "text": "",
      "comments": [
         "We have a few hours left in some states. GET TO THE POLLS. VOTE TRUMP."
      ]
   },
   "1gkb3af": {
      "title": "This BLM Leader Is Voting for Donald Trump “We’re not stupid\" ",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*"
      ]
   },
   "1gkdpxy": {
      "title": "Americans: “let’s pick the same person who’s been there 4 years and hope for a different result” oh and “orange man hurt my feelings”",
      "text": "I do hope that we win (FOR ALL AMERICA) not just saying RED when I say we.\n\nThis country is getting in flux of illegal migrations, many people who do not assimilate to American culture and morals and ideals. For example even the drug and sex trafficking is rising in my county (San Bernardino California).\n\nIncident of crime has almost doubled since 2018, can’t imagine what it is now.\n\nHope this prediction turns out to be true so we can focus on the country.",
      "comments": [
         "That whole upper corner is blue why are people in those states so goofy",
         "Where did you find this map? I have no idea what to look up to see live updates. I keep finding maps that aren't filled in yet.",
         "Well, let's hope Polymarket is correct. Four more years of this BS is too much.",
         "Because the big cities and crowds are filled with misinformation.\n\nThink of old Rome. They distracted and controlled the population through games and entertainment. (Coliseum) meanwhile the empire was falling apart and they kept voting for the same people over and over.\n\nIt’s what majority of the people voting democrat do. Interestingly I rarely meet anyone who can have a candid conversation without spouting talking points that were lies or disproven.\n\nAnd that’s why we have so much insanity going on today. Trick people into thinking rich are stealing from the poor, promise them money and services disguised as helping the common man, and trick everyone into thinking that being prideful and nationalistic for your country means you are a racist.",
         "Polymarket",
         "Polymarket app"
      ]
   },
   "1gkas3d": {
      "title": "R/ClosetedTrumpvoter",
      "text": "Okay…. \n\nSo I have just voted in my first ever presidential election. By the title of this, you know who I voted for. Let’s also say that I’m a minority in almost every (common sensual) way. I befriended a lot of left leaning people before the election, and I love them dearly. I truly and genuinely hope that whoever becomes president will do right by this country. I know that’s a lot of faith for very corrupt people, however I’m sick of the mindset of hating your neighbor/friend/family for voting on opposing views. I used to be the very opposite of what I’m preaching, so I’m very familiar with that mindset. If I told myself even a year ago that I was voting for Trump, I’d probably cuss myself out or think I was delusional… like for real. I was very anti Trump, anti Republican Party, and anti anyone who supported anything to do with Republican/libertarian views. I do not agree with every point that Trump has made, so let’s be clear about that. I 100% do not agree on how he wants to handle the wars having to do with Gaza/Palestine and Ukraine. The one thing I will say though is we do NOT need to be funding other wars and genocides while our nations people continue to suffer unemployment, a housing crisis, and inflation. Additionally, however, I have been very fond of taking care of American citizens and an economic boom. This would mean creating mass job opportunities, allowing for energy in the US, and allowing those who want to be legal citizens in the country. I also want to see more done about crime, mass sh00tings, and policing which I feel like Trump and Kamala have been silent and/or have not really spoken on. I did a lot of research and watch both candidates speak in interviews, rallies, and more. I made an informed decision, but it sucks that I can’t tell anyone who I voted for. No advice needed here, but I thought I’d just share a perspective that some could relate to. \n\nAlso a swing state voter lol.",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Good for you. You made the right decision.",
         "You seem to have a good mind set. Welcome aboard.",
         "I live in the bluest of blue areas. When people ask who I vote for I tell them. If they launch into a tirade I tell them to talk about something else. Don’t take the bait",
         "Join the club of minorities who act like they voted Kamala but actually voted for Trump. Not sure how big this group is though.",
         "I know how you feel.\n\nIf my college freshman self met me today, he’d be horrified. But that’s how life is.\n\nYou’ll know who your true friends are by if they treat you the same way regardless of how you voted.",
         "I’m a bit closeted, too. This was also my first election.",
         "I'm with you been an independent for yrs but the way the dem has fucked shit up so bad these past 4yrs I voted straight red. I'm with you on Trump I don't agree with him 100% but we had alot better when he was in office and other than the racist coming out of the closet while he was in office it wasn't bad. I know he won't be able to fix everything they did wrong be hopefully he can fix a good chunk of it. Cause I'm sick of being ck to ck and everytime raising every 6mo. When Trump was in office last time my car insurance went down twice since bidens been there it's raised 4xs and now is double what I was paying. Food has tripled my rent went up 45% over the past 2.5yr and I was at the same rent price for 6yrs. Everything is getting out of control and we need it fix or this country is going to see it's ppl turn on the government and start wars here.",
         "Me too totally blue where I am and I proudly voted red and didn't even go I to a both for it as they were all full. I filed mine out right on the counter and then put it into the machine",
         "Yah I definently think we are a pretty big group... just no one talking. I just refuse to vote for selfish reasons and identity politics."
      ]
   },
   "1gk749n": {
      "title": "Trump ends 2024 campaign with historic midnight rally, ready for single greatest victory in our country's history ",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "I know the optimism is there for a Trump Blowout, but please don't kid yourself - this will be close",
         "Let’s go 🇺🇸",
         "People are so confident in his win. I wish I was as confident. I’m nervous as heck that we get Jezebel in the house next.",
         "Dad always said \"one point or a hundred, a win is a win.\""
      ]
   },
   "1gkb1zn": {
      "title": "Voted Red up and down today",
      "text": "Voted red up and down the ballot here in TX, besides keeping Texas, Texas, let’s make this country great and amazing once again! ",
      "comments": []
   },
   "1gk9z10": {
      "title": "Teflon Don has my vote!",
      "text": "",
      "comments": [
         "Thankyou my fellow Republican"
      ]
   },
   "1gk5z23": {
      "title": "Kamala got caught telling a family in Pennsylvania to go back inside their house so she could stage a door knock 😂",
      "text": "",
      "comments": [
         "Can't make this up! Fake Kamala Harris caught red-handed trying to stage a door knock for the cameras. This is what happens when you have a VP with no authentic connection to the people.   \n  \n:| Does anyone really think she's got the country's best interests at heart?   \n  \n: And what's with the 'go back inside' comment? Who does she think she is, royalty?",
         "Everything about her is disqualifying.",
         "Remember nobody actually voted for her to be the candidate.",
         "TBH, Not really a big deal in the grand scheme of things.",
         "I’d tell her to fuck off to her face.",
         "Imagine if this was Trump tho. Sad and weird af how one sided this country is",
         "I mean, I saw the video and knew immediately that it was staged. I hardly think something like staging a door knock is going to shock them into voting right, so it’s pointless to even bother with this.",
         "So she can go to one house twice but still hasn't really been at the border long enough to understand the problems she has caused?",
         "If she came up to my house, I'd close and lock the door so quickly. That is, if I even answer it in the first place.",
         "As fake as you can be",
         "Her hideous laugh",
         "Another Photo op - how fake. It's intended purpose was to 'look real' a falsehood.  I hope the Campaign Finance folks dive into her stuff. No way that much money was spent and rules weren't broken.  There's a super huge money pile you guys! Get some heavy duty fines and penalties going! Rake in the cash, make your Dept Heros!",
         "It's like an episode of MTV Pimp My Ride where they would set up a fake door knock and reshoot multiple times until they got the proper reaction. Everything about her is FAKE!",
         "It's not like they're going to let her just walk up to a door without doing a security check lol",
         "We just had this, His working at mcdonalds was fake as the secret service had to set up safety procedures.",
         "Her laugh alone makes me want to fucking die"
      ]
   },
   "1gka0sj": {
      "title": "For peanut and Fred. ",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "What's the deal with the doubled up choices on that ballot, I've never seen one like that",
         "Thankyou my fellow Republican",
         "lol if a squirrel helped decide 2024",
         "New York ballots have multiple options. DJT will be under republican and conservative, KH will be in working families and democrat"
      ]
   },
   "1gk7mtr": {
      "title": "Michael Cohen announces he is leaving the United States and that he’s already working on getting a foreign passport with a new name if Donald Trump gets elected President.",
      "text": "",
      "comments": [
         "Maybe they can all charter one huge airplane and leave together. Con Air.",
         "Reasonable on his part.\n\nHe perjured himself on four separate occasions, claiming Trump had committed crimes, and so far he has been prosecuted for three of those.",
         "Byeeeeeee",
         "Good. Best wishes. Bon Voyage\n\nNow that's one less idiot we need to hear about. Never liked him anyway. Bye Felicia 👋",
         "This shows exactly how irrational they are. I have not seen one Trump supporter says s/he will leave the US if Kamala wins. Mind-boggling !",
         "Best go where there is no extradition treaty, Mikey, because your ass is facing criminal charges for violating client-attorney privilege, several charges for your many perjurious statements, and for acting under color of authority.",
         "I bet. With the number of uncharged crimes with your name on them...You better be picking country with no extradition.",
         "Bye Felicia",
         "Adios!",
         "Yet another pretentious asshole who I hope lives up to his word. Eat shit, we want our country back!",
         "They all said this in 2016, I don’t think a single person who said it actually followed through to my knowledge.",
         "Cohen is a sack of shit!",
         "The guy makes more money trashing Trump than he did working for Trump. \n\nHe went to prison Democrats say?\n\nThis guy went to club Fed briefly and decided to make up nonsense. After books, media appearances, talk show circuits he’s made incredible sums. He’s not going to leave because he wants to stay in the U.S. making money trashing Trump.",
         "I’ll fund it one way, no return!!",
         "👋",
         "Buh bye",
         "Buh bye",
         "Don’t let the doer hit you where the good lord split ya",
         "He needs go pay back the 30 grand he admitted under oath that he stole from Trump first",
         "Good.",
         "What other country will take that P.O.S.  Hope he finds one and he stays wherever that may be.",
         "They never actually leave. It’s all bluster.",
         "Bye",
         "Too bad these fools aren't held accountable for the words they say.  Tons of them did this the first time Trump won, no one left.",
         "Con Man Air"
      ]
   },
   "1gk50v8": {
      "title": "So True ",
      "text": "",
      "comments": []
   },
   "1gju7cn": {
      "title": "This is John Heisen. This man is dying from terminal cancer. One of the last things he wanted to do is vote. Every vote counts. Thankyou John.",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Prayers for John ❤️🙏🇺🇸",
         "I'm going to make sure I don't forget you, John. I saved this picture on my desktop and I will thank you every day.",
         "This man is an American Hero! Hats off to him!",
         "May he wake on Wednesday to see a victory!",
         "Fuck cancer.",
         "A true patriot!",
         "God bless! 🙏",
         "Prayers for him 🙏 and I’m happy to see he had the opportunity to make a difference ❤️",
         "Im sorry everyone I wasn't sure how to title this. I could only take snap shots. You can't share videos on this subreddit. I'm not sure how long John has but let's all vote for Trump in his honor.",
         "🙏🙏🙏",
         "Thank you, Mr. Heisen! 💙",
         "Thank you",
         "God bless you, John.\n\nAnd FIGHT FIGHT FIGHT.",
         "My grandma died today. She made sure to early vote too 💕",
         "This is beautiful Thank you John.",
         "Thank you John",
         "My friends mom just died of super aggressive cancer. Didn’t know she had it, went from not feeling well to passing in 2 weeks. One of last things she did before coma was fill out her ballot.",
         "My uncle died shortly before early voting began ☹️",
         "Thank you, John! you’re in our prayers!!",
         "When my dad was terminal he voted Trump in 2016 for his very last federal election. It was brain cancer, go figure.",
         "But why he should even be allowed to vote?? I mean if he will be long dead before election results announced, then why this person should have the right to decide the fate of the future of the country in which he won't be living. I mean he should be there to experience it becomes hell or heaven because of his choice. It's like brushing off his decision on the face of others.",
         "Thank you, John. Praying for you!",
         "I voted for Trump",
         "Hopefully he can Make it to the After Election see the Elective President",
         "Amen",
         "Good idea you can also look his name up and watch the video if you're interested. Im still learning how to provide links. I as well will honor John tomorrow",
         "Amen",
         "I'm sorry about your grandma. I wasn't sure how to respond. In my opinion i really don't care who she voted for. That's still a very brave and honorable thing to do. God bless your grandmother and I hope you do well.",
         "Your welcome",
         "I'm sorry.",
         "I will certainly do that. Thank you for posting. \n\n\nIn his last days, he cares more about the future of his fellow man than his own comfort. So rare these days.\n\n\nHit me right in the feels."
      ]
   },
   "1gjtc8b": {
      "title": "Can't wait until tomorrow ",
      "text": "The meltdowns will be epic. Get your popcorn ready...🍿 🍿 ",
      "comments": [
         "Let’s not get ahead of ourselves…",
         "Please post that on r/pics. I'd do it but they banned me after posting one photo.",
         "I work in one of these crazy liberal cities and they’ve already started boarding up the businesses. I think I’m calling out lol",
         "I’ve never been this nervous for an election, I’m very antsy awaiting the results.",
         "[removed]",
         "Don’t count your eggs before they catch",
         "Remindme! 1 day",
         "Imagine being her golden retriever and seeing her reflection in the Subaru rear view mirror every day. Painful.",
         "Go out and vote Republican. Tell 10 friends vote.",
         "Crazy eyes and cloud yelling in T-24 hrs.",
         "While seeing college kids flip out is funny let’s not forget the damage Antifa etc did in the summer of 2020. The left crows about Jan 6 but far more died and billions more in damages occurred during the George Floyd riots. I hope for a peaceful transfer of power. If they get too riled up there may be more assassinations or attempts.",
         "I do think Trump will win this one. But I do not believe an epic meltdown will occur. Remember: NOBODY, and I mean NOBODY, expected Trump to beat Killary in 2016. The lamestream media had convinced every sheep in the flock that Killary was a \"can't possibly lose\" candidate. Every poll had her winning by a large margin. Only a few bucked the trend.\n\nSo, Trump winning wasn't just the shock that started Meltdown 1.0. It was the fact that Killary lost. Combine that with Trump's win, and the screaming started. I don't think that happens tomorrow. I do not believe that women are in love with Kamala like they were with Killary Clinton. I just get the vibe that women will vote for her because of policy reasons, not because there's some great love for Kommila. Maybe I'm wrong, but I just don't see the adoration.\n\nWhat I do expect is another \"not my President\" movement. I also firmly believe that the lamestream media will announce that the country has entered a recession 48-hours after Trump wins. The country has been in one for awhile already, but don't expect the lamestream types to put that into print. Absolutely not. Not until it's needed. Finally, even the far left privately admits that the lamestream media is no longer trustworthy. Therefore, every poll is taken with a grain on salt. On all sides.\n\nMyself? I'm hoping for an epic blowout. We'll see. I will pop popcorn.",
         "I’m still really worried about it.",
         "😎",
         "SWAMP THE VOTE!",
         "Don't count your chickens just yet. Men have to get out and vote.",
         "they're face says it all",
         "Where did her eyelids go?",
         "I doubt it. Both AZ and NV are saying it can take a week to announce the results",
         "I voted today. Republican across the board. Let's keep as many Dems out of office for the next 30 years, that might help a little. Tell the Dems we're tired of their BS.",
         "I can't wait to see them lose their shit. Pass the popcorn!!",
         "Republicans should not go out in the streets no matter what happens. Let the crazies do their thing.",
         "What's the move if Trump loses/ gets cheated? Are we storming the capital again?",
         "I can’t wait to see my woke teachers freak out tomorrow 😂 ",
         "[deleted]",
         "“Save the kids! Gun Control!! Abort Baby, Abort! It’s my right!!” 😒",
         "This is what I picture every angry leftist looks like in here. But worse",
         "If Kamala ~~wins~~ becomes president then America will no longer be relevant.  China, Russia, and Iran will be free to do as they please.  They'll have no respect for Kamala and will walk all over her like a doormat.  The wars in Eastern Europe and the Middle East will escalate into global conflicts.  Trump will be too old to return in 2028 and anyway the Democrats will \"win\" that too if they're able to successfully push first Biden and then Kamala into the White House.  Please vote.  And vote for Trump.",
         "I wish I had the concession on crying towels, crayons, and security blankets. Also Valium.\n\nQuote from the famous Larry Flynt- \n\n\" Just take a Lithium tablet, and everything will be ok in the morning\"",
         "Seriously, it’s too close to call.",
         "They banned me after I called a Hamas supporter a terrorist sympathizer lol They were completely fine with people calling the other side “genocide supporters” though! Go figure",
         "The partisanship is truly frightening over there",
         "Hopefully that is a good sign and they are worried about a Trump victory followed by a Category 6 Hurricane Harris total meltdown.",
         "January 6th?  Nah. Every election dems lose.  Yeah.",
         "amen to that",
         "[deleted]",
         "I firmly believe they will riot in the streets. Blue cities in red states and many of the ultra blue cities in blue states. These people are crazy and it’s going to show.",
         "[removed]",
         "I do think there will be an epic meltdown. There’s been 2 assassination attempts already, for God’s sake. They are unhinged.",
         "Hey, there are some normal childless cat ladies around here. Lmao 🤣",
         "Don’t ask them about the million abortions that happen ever year 😂",
         "I’m hoping so too. But honestly, I think no matter who wins, portlands gonna burn down 🤣🤣",
         "The meme is around the 3:10 mark in this video.",
         "You could be right. But I just don't see it. It was so different in 2016. Killary wasn't just going to be elected, she was going to be annointed as QUEEN of America. Every single poll had her winning. Nobody thought it would be close. Look at the 2016 repeats of the Young Turks on YouTube for proof. They were so very smug. Until the vote counting actually began. That's when everything changed.\n\nAmericans of all shapes and sizes have been subjected to the highest gasoline prices anyone has ever seen in our lifetimes. It has driven up the cost for everything. From groceries to basic necessities. I really do believe people are tired of this. They know that four more years of Kamala means four more years of cancelled family vacations.",
         "You're probably right about the riots. The left is so unhinged right now, they can't handle losing-especially after they've convinced themselves they're entitled to power. Blue cities will absolutely erupt, and it's going to be a mess. They think they can just burn it all down if they don't get their way. But it's going to backfire - no one wants their chaos and violence. I wouldn't be surprised if it results in more support for Trump. The left’s tantrums only make them look worse.",
         "> This obviously all projection. Where were the riots?\n\nIn DC in 2016, after Trump won.\n\n> When did liberals storm the capitol?\n\nSeveral times.  They even bombed it a couple of times.",
         "“ThEy’Re NoT pEoPlE yEt”",
         "Don’t forget Minneapolis!  It’s due for another bonfire!",
         "I think the meltdown will be of biblical proportions, putting 2016 to shame. The division in the country right now is insane, and the amount of hate the left has for Trump is at least 100x worse than back then. Truly unhinged individuals. I think Trump wins and it will be an electoral landslide, and I can't WAIT to see the crying on reddit in the aftermath."
      ]
   },
   "1gk6izc": {
      "title": "🚨 BREAKING: A security fence is being installed outside of the White House, US Capitol",
      "text": "",
      "comments": [
         "Kamala has no problem with building walls to protect herself, she just doesn’t want a wall protecting US!!!",
         "Walls are racist.... Apparently, So the democrats are being openly racist by their own standards on election day. Who can vote for that?",
         "National Guard is also on standby, what of it?  Welcome to current US Elections.  If Harris wins, then people go to work the next day, if Trump wins, DC will be on fire for a month.",
         "Gotta protect from irate BLM and Antifa insurrectionists",
         "I thought fences didn't do anything 🤔",
         "Hypocrites!!",
         "Fair",
         "They barricaded in 2020 as well. This does not by itself mean republicans are winning.",
         "Is this considered a \"medieval vanity project\"?",
         "Walls for Me but not for Thee! Eff off you Peasants!",
         "Is it because they're hoping for civil unrest, or is this so the criminals can't escape",
         "They're spinning it as possibly needed for protesters.  When in fact it's definitely needed 'cause Biden keeps wandering off.",
         "But ladders /s",
         "The left are like a goose the squawking, pooping all over, follow the Heard blindly no matter wherever it leads.",
         "Far from the first display of hypocrisy and far from the last but roughly half the nation refuses to acknowledge it",
         "Because Republicans have jobs they have to go back too.",
         "You mean like after the George Floyd trial.  How “peaceful” democrats were.",
         "I feel like only Trump supporters have engaged in an insurrection on the US Capitol after their preferred candidate lost tho\n\nSo I don’t really get where your coming from",
         "Because that's definitely what happened last time!",
         "Feels like they know they’ve been stirring the pot enough to incite outrage regardless of the outcome.",
         "Coming from the experience of having molotovs and fireworks thrown at me in 2017 and 2020 by people who would rather jump off a bridge than be associated with Trump in any way.",
         "Dawg it is 😭"
      ]
   },
   "1gka0qv": {
      "title": "Looks Like Kamala Even Fakes Her ‘Door Knocks’ in Pennsylvania ",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*"
      ]
   },
   "1gkbjjz": {
      "title": "🇬🇧 🤝 🇺🇸 ",
      "text": "I’m from England so I have no stake in this election but as an observer I see trump being the best guy for the job, especially over his opponent she is so bad. Good luck. 🍻 Here’s to democracy 🍻 ",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "We’ll agree to keep Megzit on this side of the Atlantic if you’ll take Kamala and keep her over there? ✌️",
         "The Democrats are flooding our swing-states with immigrants in exchange for their votes. Similar to what the Mayor of London did...",
         "Yeah I’ve been hearing this a lot about the illegal immigrants being moved in to certain states to vote, is that true?  It sounds like the democrats are having to play dirty again.  I just watched the latest Joe Rogan and Elon Musk podcast and they spoke about the dirty tactics they’re trying. It’s scary stuff.\nIt’s not just London that’s been flooded over here it’s the whole country. We are in an awful state right now. Our government has just released thousands of rapists, drug dealers, murderers, kid touchers and fraudsters and then arrested 100 people that posted things on Facebook.   That story is a long story but basically the child of an immigrant killed 3 young girls ages 3-8 and stabbed a dozen other people.  There were riots, British people were told by our government to shut up or we’re racist and then were arrested for voicing concerns.  The UK is in big trouble",
         "Elon mentions it in the conversation. His information source is a US Government website. [https://youtu.be/DWVev5-2Db0?feature=shared&t=314](https://youtu.be/DWVev5-2Db0?feature=shared&t=314)",
         "The situation in the UK is shameful. My father was born in London and I have extended family there."
      ]
   },
   "1gkg9fh": {
      "title": "WIFE AND I WORE ORANGE! Supported Trump and didn't get bounced from the polling location.",
      "text": "The GOP table outside figured it out right off. ",
      "comments": [
         "I wore red nothing happened",
         "I wore a RED shirt, someone yelled at me to see my shirt, so I turned and looked around, showing my red shirt with Santa's image and the word, \"BELIEVE\"."
      ]
   },
   "1gkc1nn": {
      "title": "I'm doing my part",
      "text": "Here's to freedom boys!",
      "comments": [
         "Hello, local poll counter here. As you can see, there is indeed some pen marked OUTSIDE the Republican box. Naturally, this does mean that this is a spoiled ballot and cannot be counted. Have a nice evening.",
         "I don't know if you know this but here in Idaho they scan the ballot right in front of us and it counted if there's any issues they have you take it again so GTFO"
      ]
   },
   "1gjynbx": {
      "title": "Joe Rogan endorses Donald J Trump!",
      "text": "Joe Rogan, one of the larger podcasters in the country, endorsed DJT on X the night before the election.\n\n“The great and powerful @elonmusk.\nIf it wasn't for him we'd be fucked.  He makes what I think is the most compelling case for Trump you'll hear, and I agree with him every step of the way.\nFor the record, yes, that's an endorsement of Trump.\nEnjoy the podcast”",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Let's make him the new press secretary! Dream team!",
         "I thought Rogan did an excellent job of interviewing Mr. Trump.",
         "If that doesn’t boom the independent votes for the Don idk what will",
         "I’ll take it but why so late in the game though?",
         "We can use em all",
         "About time - he really dragged that out"
      ]
   },
   "1gkdh9f": {
      "title": "I'm doing my part. Would you like to know more?",
      "text": "Lol sorry I couldn't resist the Starship Troopers Reference ",
      "comments": []
   },
   "1gkdv8b": {
      "title": "election anxiety",
      "text": "22 F here voting for Trump. I obviously want Trump to win this election because I'm genuinely scared of what will happen if Kamala wins. Practically having open borders for prisoners and murderers to continue to flood in, inflation will rise even more, etc... \n\nMy problem here is, if trump wins, the left will just burn our cities down again and riots will ensue. it will just be another reason for ransacking stores and an opportunity to loot again instead of working hard and getting a job to afford these things. I live close to a major city and I'm just seriously scared!! I hope I'm not the only one who feels this way... I just feel like we are going to have unrest until the next election no matter the winner.",
      "comments": [
         "Harris stands no chance against Trump in a fair election. He beat her long ago. He just has to beat fraudulent votes now",
         "Trump will be the better one to manage the potential unrest for sure. Kamala is nothing but a puppet for the deep state, and if they cheat enough to get her in the white house, America is doomed.",
         "Tbh it will be fine either way. You/we will all adapt to the new norms and figure out how to make the best of it. Don’t get too caught up in all this",
         "You have good reason to be concerned. More is riding on this Election than people are aware. Elon Musk's conversation on yesterday's Joe Rogan Experience Podcast was a bit alarming. Rogan, a Liberal, and former Libertarian,  publicly endorsed the Republican Party for the first time shortly after the enlightening discussion.",
         "I've mentioned this to my family.\n\nLet's assume Harris squeaks out a win over Trump\n\nThe House is projected to have a Republican majority, and the Senate is projected to have a Republican majority. Harris really can't do much with either and pass alot of \"her\" agenda. Furthermore, if she wants to rule throught Executive Orders, the Supreme Court is still 6-3 majority for Conservatives. Essentially she would be a lame duck POTUs for the first two years. There are silver linings to look forward to in the event that Trump doesn't win tonight.",
         "Harris wouldn't have survived a 2024 DNC Primary. She was one of the first to drop out in 2020. Then Joe chose her as his DEI VP running mate.",
         "Wasn't really anxious in past months but for some reason really anxious today, thanks for your words. My friends and family are all radicalized and are acting like today is the decider if we have communism or WW3.",
         "For sure. She would have been tossed aside immediately in a primary. The only reason they kept her was because the campaign money could be transferred to her but not a third party.",
         "Haha yea this kinda thing happens every election, and then life goes on. WW3 has been right around the corner since the start of the Cold War, and we’re all still here.",
         "It actually is a decider. Watch this clip from yesterday's JRE podcast - [https://youtu.be/DWVev5-2Db0?feature=shared&t=314](https://youtu.be/DWVev5-2Db0?feature=shared&t=314) Flooding swing states with immigrants for their votes, which will eliminate swing states, and destroy a true two party system.",
         "Elon stands to gain A LOT business wise from Trump being the president.  I don't fully trust his talking points.",
         "Can you dispute what he's saying about the Democrats flooding swing states with immigrants for their votes? No, you can't."
      ]
   },
   "1gkgmge": {
      "title": "Power outage in Pennsylvania. Stay In Line.",
      "text": "Totally normal election.",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Dear Lord!!!"
      ]
   },
   "1gjrb1d": {
      "title": "We Defeated Communism Once in 1991. And We Can Do That Again Tomorrow!!!! VOTE!!! MAGA 🇺🇸🗳️ ",
      "text": "",
      "comments": [
         "American liberals by and large are not communists.",
         "Bro, what’s up with that pic of Tulsi?",
         "JD should be represented. He crushed the VP debate and the Rogan and Theo Von podcast episodes.",
         "Trump has a better team now than ever.",
         "Communism fell on its own",
         "Everybody remember, RFK is not conservative by any means. He's a plant in a third party to try and take votes off from Trump.\n\nDo not vote for him.",
         "American liberals are very right of communists",
         "It didn't fall.  It migrated.  If Harris wins, 1950s-era Communist Party members would be very comfortable in the US.",
         "Pretty sure he backed out",
         "He withdrew from the election months ago and endorsed Trump.  Tulsi is also not conservative, or at least hasn’t been in the past.",
         "He’s still on the ballot in many states, including mine. But yeah, he suspended his campaign. Neither Kennedy nor Gabbard are that conservative, they’re just conservative for modern Democrats."
      ]
   },
   "1gk5288": {
      "title": "Remember the last time Trump was president and now democracy and America are dead and gone and everything in the last four years was awesome by comparison?",
      "text": "Me neither. Vote Trump!",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "The 1st amendment is a hindrance to good governance - john kerry\n\nStupid people believing what they want and getting info from unapproved sources",
         "Pepridge Farms remembers ... LOL sorry had to do it.",
         "https://babylonbee.com/news/democrats-warn-that-if-trump-is-elected-it-will-be-an-end-to-bureaucracy-as-we-know-it"
      ]
   },
   "1gkbe7o": {
      "title": "A day for the history books!",
      "text": "",
      "comments": []
   },
   "1gkfyeh": {
      "title": "First time voter at 25",
      "text": "Hopefully he wins!",
      "comments": []
   },
   "1gkf4vj": {
      "title": "Can't do it from the couch ",
      "text": "",
      "comments": []
   },
   "1gkeykk": {
      "title": "Elon Musk Pleads \"Vote Like Your Life Depends on It!\" Yesterday's conversation that compelled Joe Rogan (Libertarian) to vote Republican for the 1st time in his life. Forward to 5:14 into the clip.",
      "text": "",
      "comments": []
   },
   "1gkig9b": {
      "title": "Another Vote for Trump!",
      "text": "Did my duty in the Ocean State!",
      "comments": []
   },
   "1gkif0y": {
      "title": "LET'S GO!!! 🇺🇸",
      "text": "TAKE AMERICA BACK!!!",
      "comments": []
   },
   "1gkf4wh": {
      "title": "Kamala Harris does NOT have the power to certify or not certify the election",
      "text": "",
      "comments": [
         "Kamala Harris does NOT have the power to certify or not certify the election.  \n  \nThanks to a quiet rider that was added on to the 2022 end of year spending bill, which democrats pushed because of J6   \n  \nI completely missed this because we were all focused on other things in that bill.",
         "This is correct.  Been saying this in response to the lefties saying Harris could simply refuse to certify.\n\nPence had that power.  Harris does not."
      ]
   },
   "1gjp3qe": {
      "title": "Prediction for Trump and Harris victory tomorrow. (I don't believe it will be close) ",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "I think it will be 312 but 329 would be incredible.",
         "Let the unburdening begin!",
         "What’s up with everyone saying Kamala is leading in Iowa? I find that hard to believe",
         "I doubt it’ll be a landslide like this. If you believe in prayer, just keep praying.",
         "i really hope so, harris would be even worse than biden, which was already a disaster for this country.\n\nim not eligable to vote but i donated $18.48 to the campain",
         "I am willing to wait in line for hours and pray my vote gets accounted for Trump’s victory. If Kamala wins, we are legitimately doomed",
         "Arizona is so red, more red like a dark red wine. Greetings from Phoenix.",
         "I don't have the words to convey how badly I want Trump to decimate Harris's campaign tomorrow, whether it be by a little or a lot.",
         "I think he has it.\n\nHe won't take Virginia, Michigan, or Nevada though.",
         "I'm from south GA and it's gonna break my heart if we stay blue",
         "Praying for it",
         "If demorats win im just going to stop paying taxes like everyone else thats moving here.",
         "Keep praying, guys. God is with us 🙏",
         "So if Trump wins one of WI or MI can he lose PA",
         "Trump leads earlt voting in all of the sun belt and nevada. I don't see how he loses them considering republicans have electikn day advantage already",
         "What’s the most likely blue non swing state trump could take?",
         "Honestly I think at best it’ll be in the 280s for Trump",
         "Nevada, Arizona, Georgia, and North Carolina are goin to go Trump.\n\nVirginia is going to go to Kamala.\n\nPennsylvania, Wisconsin, and Michigan are the true tossups.",
         "No way NC or AZ goes for Harris. They're not really as close as the media says.\n\n\nThe fix is in again in Georgia thanks to a meddling court.",
         "There is a lot of hoping in this video.",
         "My father voted for Chase Oliver because he said Trump couldn’t admit that he lost 2020 and it caused too much bullshit. He wants Trump to win over Harris still. I voted Trump.",
         "I'm from Canada and I acknowledge although Trump may not be perfect (no one is) he's the best person for the job because he will prevent WW3 and make the streets safer so Godspeed Trump and MAGA!",
         "Optimistic",
         "Virginia?",
         "I can’t believe anyone would vote for Harris. Even a feminist because you would want HER to be the first female president? She’s going to fuck it up so badly it’ll take another 200 years to get a female in this position.",
         "I think that it will be the closest election of our lifetimes. I think we’re about to have ourselves a repeat of 2000 bush/gore",
         "Paint it red!",
         "That's pretty bold to make NH red, although I think he's within the margin of error there. I'd keep NH blue and I think Michigan is almost too close to call, but they don't tend to break from how Wisconsin and PA votes.",
         "If VA, NJ, or NH flip early in the night it’ll be an absolute bloodbath and we can go to bed early",
         "I don't think it's gonna be the blowout some expect.   Never underestimate the stupidity of the average human.",
         "Unfortunately I think they're taking Wisconsin and either Florida or Georgia,",
         "Bruh what are these maps… you  basically put all swing states going red in one and all swing states going blue in the other as if either of those situations are likely. \n\nBy best guess/ prediction is that Wisconsin, Georgia, Nevada, and Virginia will go blue while Georgia, North Carolina, and Arizona will go Red. I think Pennsylvania will be super close, i couldn’t say either way. I guess well just have to wait and see!",
         "I just have a strong feeling the Dems are going to cheat….",
         "I too believe it will be a landslide. It's going to be a #redwave !! \n\n  That said, the Dems have a plan in place to prevent the inauguration if and when he does win. They plan on using the 14th amendment to stop him from taking office. The 14th amendment specifically says that a person who has been found guilty of insurrection, shall not be lawfully allowed to become president. That's why the Dems have been pushing the Jan 6 insurrection narrative plus instigated the events on Jan 6th so hard..it's been their plan for years. It's been their plan since his first term.\n\n\n  Mark my words! You will see this play out when Trump wins! \n\n Get ready for the next civil war!!",
         "Someone mentioned it on X last night:  \n\n- Some states will not have their results the first night.  \n- There will be numerous instances of foul-play, legitimacy inquiries.  \n- Major investigations and lawfare underway thru the remainder of the year.  \n- Trump ends up winning, but we don’t find out until sometime in January.  \n\n(Summarized)",
         "Are we talking actual vote? Or the ballet box stuffed one? Asking for a friend 😋",
         "Thank you my neighbor from the north , I hope you guys get rid of Trudeau soon",
         "Why do we think Virginia is flipping?",
         "That’s because liberals cheat",
         "I don’t think all swing states are going one way or the other, but who knows",
         "+NY",
         "As much as I'd love for VA to go red, I just don't see it happening. The state is basically run by Northern Virginia. It's seen a TON of influx of migrants and people moving from the Northeast/California over the past 20 years.",
         "Take nothing for granted. Get out and vote!",
         "This is pretty close to what I have on my prediction map",
         "Only need NC, GA, & PA. AZ & NV are bonuses",
         "Trump wins Nevada, Iowa, Georgia, North Carolina, Harris could win by a slim margin",
         "wasn’t new york light blue?",
         "VA is never going to flip red again. Unfortunately NoVA area has been taken over by Dems",
         "I'm sorry, but Trump's not winning Virginia or New Hampshire. I don't believe we're 10+ points to the right of 2020.",
         "I agree with you. I don’t think it will be close. Not a landslide either.",
         "My prediction is 291-247 Trump, but any of those rust belt states could go either way. I don’t believe Arizona or the southern swing states have a shot of going blue, and Nevada is iffy but a more likely win for Trump. Either way, I think Trump is going to take this one",
         "Call me a pessimist, but I just don't see how Trump suddenly flips Nevada and Virginia.  Or how he wins back Arizona, Georgia, or Pennsylvania.  We live in a dumb country that votes in bad politicians.",
         "I think … Harris will win. Only because there are more stupid people than normal  common sense .",
         "329 is too much. I'm really hoping it's not close. There's no reason why it should be. We all know or should where each person stands and there's enough info out there for people to learn about their positions given the tech we have.",
         "Oh god this is terrifying. When did this it whole country become so dumb?",
         "Now that’s a beautiful map!",
         "Bro I hope so I’m getting anxious",
         "You guys, I'm so worried.",
         "I’m dying on this hill: Maine is going to flip red",
         "I don't see NC or GA going blue",
         "This is solid but VA will probably be blue",
         "I’d be shocked if Virginia and NH went for Trump. We also won’t know AX result on Election Day.",
         "Hope you’re right, but fear New Hampshire, Wisconsin, Michigan, Virginia , Nevada and Pennsylvania will go blue.",
         "Ambitious\nThink he wins, but he won’t win Michigan",
         "An N.C. gal here! I really think it’ll be closer than this, but I think people are tired of Kamala and all the lies and hate the left has been spewing the last 4 years.",
         "I like in VA and I’ll be surprised if it goes red",
         "Virginia and Iowa are not flipping lol",
         "I don’t think we will win GA, NC, and PA. I can see us winning 2/3 but I think it would be crazy to win all three",
         "Itd be sick if ny flipped red. Im tired of being held hostage by Democrats in NYC",
         "I'm terrified he may lose, all the other polls say it's neck and neck. I just know they're going to keep cheating, I've just been in a bad spot about it.",
         "I hope you're right, but I've yet to hear a substantial argument for why MI, PA, and AZ will be different than they were in 2020.",
         "I love that a hand full of states have the power to make it close….  Oh well it will end the way it ends. I just hope it is t in violence.",
         "I think NY goes red honestly",
         "I think New Mexico is going to surprise us this year!",
         "I’m predicting Trump with 316. Only difference between our maps is VA.",
         "I can’t take this stress. My plan tonight is to clean out all of my aquariums and watch the election. It’s so fun and so scary at the same time. Please God, help us….Godspeed everyone. Here we go!",
         "I’ll give him 4 swing states. But i agree with new hampshire",
         "I really wish Virginia would go red and most importantly get rid of our senator Tim Kaine. Can’t stand that guy. And I think Trump is getting Nevada and either PA or Michigan and probably Wisconsin too.",
         "Trump has had so much support this election. Majority of the people I know are or have voted for trump already. I only personally know 2 people voting for her- which says something because I have a large, diverse family & friend group. I work with mostly all females, and the only male in the group is voting for Harris. \n\nKeep in mind that the demographic most likely to answer polls- are liberal women. Not very representative of the entire nation. Older folks and men aren’t really going to be answering polls, they want to be left alone OR simply are not able to access internet (or don’t want to) due to age- yes, even in this day and age- there’s still a lot of older folk who don’t have internet or cell phones. Obviously that’s not everyone, but still a large group of people we forget about.\n\nHarris has had her campaign blown up on social media & has paid lots of high profile celebrities to speak at her rallys/endorse her as president. I mean, what, Beyoncé was paid $10 mil to speak at her rally. These things really give the illusion that she’s more favorable than she is, which is the goal of her campaign. Talk less, smile more, make others do the talking. I just cannot see how someone so… well, unqualified could make it this far. Am I saying she’s not qualified experience wise? No not necessarily, I mean, we’re voting for trump, who hadnt been involved in politics much at all until elected. BUT it’s her intelligence and communication skills that are SEVERELY lacking in this aspect. It’s embarrassing to watch. I can’t imagine her speaking to any other important leaders of other nations, or giving presidential addresses, etc. it’s the feeling you get when you see the really drunk girl at the bar trying to dance on the table. You know, “should we really let her do this?”, “someone should maybe stop her before this gets worse”, etc. \n\nGuys. If she gets in, I think we know what happened.",
         "Soooo who’s winning you think? From a non biased perspective, who do you guys think it’s going to win?",
         "It won’t be then they’ll stop the count like 2020. If it’s legit he wins and it’s not even close",
         "I pray this is right, we can’t take four more of Obama and his team.",
         "I live in Illinois and I don’t know a single person that’s voting for Kamala….. just saying",
         "Can't speak for much, but where I am in MA, the farthest left leaning liberal family I know took down their Harris/Walz sign weeks ago. Still see a few being in MA but the trump signs far outnumber them.",
         "What is wrong with the American people, when a person like Harris can run for president and get millions of votes? Is the Democratic Party so broken that there is no better one, a more normal member to participate in the race?",
         "1. Literally no way she wins Iowa. That one poll was garbage.\n\n2. What's up with red VA but blue MN?",
         "I hope you’re correct with my state being in red 🙏",
         "From your lips to God’s ears",
         "Let’s go!!!  If you have not cast your early vote, crawl over broken glass and/or some spilled Lego bricks tomorrow if you have to.  Make it happen!!!!\nAt least when Trump and the rest of the country hands Kamala a pink slip tomorrow, you can know that you played an important role in making that blue wave of liberal tears flow!!",
         "This would be great if it did turn out like this.  But I feel like this will only happen if we don't allow the demoncrats to cheat and steal votes and burn ballots and \"keep counting until the candidiot is ahead",
         "I strongly believe it will be rigged and Harris will seemingly win it.",
         "looks like 2020 with a bit more red.",
         "I’m gonna troll on you if he loses tomorrow. But I hope he doesn’t.",
         "Watch today’s episode of Stu Does America",
         "Unless they cheat again",
         "CURRENT MAP https://www.270towin.com",
         "CA is worth way too many electoral votes",
         "No chance lol",
         "If this comes true.. it calls for a party 🎊",
         "That’s the closest map I’ve seen so far",
         "I’m thinking New Mexico to",
         "If both va and nh flip, so will ny, loose va and nh and that's our election",
         "MSNBC-\n\n“Why are so many Americans fascists?”",
         "According to CNN just a bit ago in battleground states republicans have 1.7 million more that have voted in URBAN locations. Republicans have 300,000 more rural votes than democrats, and republican women voters have 1.3 million more votes than democrat women. \n\nThe problem for democrats? Democrats are the ones that vote early, not republicans. It's playing the exact way I predicted. The people just don't give a crap about Harris. At all. Not enough to get off their butts and vote. If the trend continues then tonight when Trump voters also vote heavily (like republicans do on the day of the election) we will simply squash her. I wouldn't be surprised when I get home from work to see Trump winning in Virginia, Minnesota, New Hampshire, and even Maine. We're taking more than just battleground states. We're taking most of it!",
         "She's not. I live here. Polk, Story, and Johnson counties are liberal, the other 96 want Trump.",
         "Largely (or solely) a recent poll from a highly regarded pollster. That said, it was only 800 people.",
         "A poll came out that stated she was ahead, while 10+ other polls say elsewise.",
         "And 808 people were polled out 3.2 million Iowans.",
         "Kalshi shows Trump favored to win. 80%",
         "I am praying for this 🙏 🇺🇸",
         "Selzer has been very accurate in her polling of Iowa. Her latest poll is Harris +3. ",
         "He's up by 10 from the poll two days ago",
         "It was some outlier. Everyone called bullshit on it.",
         "Maybe all the people who silently will vote for her. I could see that.",
         "Selzer poll",
         "Well, I heard she has a great comeback story.",
         "Another Iowan here. Nobody that lives here actually believes that news story and \"polling\" if the results did in fact show that. Even the most liberal city slickers in Des Moines know that Kamala isn't leading IA.",
         "Dude, she is not. Trump will carry Iowa by at least 7%.",
         "It was an outlier poll, Trump will win Iowa by 8-10 points.",
         "Fake news",
         "[deleted]",
         "amen!",
         "I think domestically we'll be fine.  I'm worried about what will happen overseas.  I don't see Russia or Iran being afraid of a Harris White House at all.  I imagine the conflict there will get much worse.",
         "Let's be real, if Biden were on the ticket and won, we'd have ended up with Harris within a month anyway",
         "How'd you settle on that amount?",
         "PSA; As long as you're standing in line when voting closes you still get to vote so don't leave",
         "I might get down voted but I don’t think we’re doomed in a WWIII sense",
         "Saw the signs while in vacation - you have a beautiful state.",
         "I have tons of family in AZ & in Phoenix. Love it every time I get to visit. Gorgeous state.",
         "Is it true that Maricopa county has already planted the seed of delayed results for several days? Much like the last 2 elections.",
         "Out of those three, I think Nevada is the most likely.",
         "He may get Va… those of us south are red everywhere. Also, we flipped last election to a red governor…. Fingers crossed!!!!",
         "I don't think he will take VA but I will say- I'm in Northern VA (very blue) and see an overwhelming support for Red in comparison to previous years. Very interesting to see, especially in my neighborhood!",
         "Virginian here, there's a wave of energy in the air I've not really felt in any of the 30 years I've been around on this rock.  Neighborhoods that flew Kerry, Kaine, and Obama signs proudly are not flying the Kamala flag, and when you see the local Democrats placing their signs out, it's in front of unsold houses, undeveloped lots, and public land.  On my own street, three of my neighbors removed their signs one by one as she continued to bumble and stumble her way through her teleprompted campaign, it's not that they aren't still voting for her, but they're damn sure not as proud of it.\n\nAt work I spent seven years in a position as the lone white person on my crew, before my promotion in September, and slowly but surely over the last two years I've watched all but two of them turn from heavily negative on Trump and become vocal supporters and voters for him.\n\nA lot of people in Virginia are sick of the rhetoric without results that the Dems have slung over our state for years and years.  Youngkin showed a lot of Virginia that the Governor's chair isn't just a free paycheck for some scumbag to do nothing in, and the events of London County still ring through the schools across the state.\n\nI will personally be surprised if we go full red, but I don't think we're going to be as blue as people seem to think.  Our polls were tainted by the fact that the Virginia native is the minority of the states population because of so many interstate migrants (New Jersey, New York, etc.). and initially many of them packed their politics with their pants, but I think finally some are waking up to what ruined their home states, and I hope they can course correct before they ruin mine.",
         "Detroit absentee returns are half of what they were in 2020 and the far less people voted early in person.  Republicans always dominate on election day voting here. I don't see a Harris path to victory unless they find 90,000 mail in ballots tomorrow.",
         "Nevadan here. He’s taking it.",
         "Nevada is his best swing state right now. Michigan will likely vote with Wisconsin and Pennsylvania. ",
         "I think there are big automotive implications in Michigan.  If he wins that, it's a wrap.  \n\nI don't think Michigan wants to stop building ICE.  Just my personal opinion.",
         "I personally think he takes Nevada, loses MI and WI narrowly.",
         "It’s 90 percent people who treat Atlanta like every over city with any music industry. I would never live there I’m from NC and we hate it all the way over here.",
         "Just stating from lived experience but most undocumented immigrants get false identification to be able to work while they wait for actual residency paperwork from the fed. They still get a paycheck like everyone else. they still pay taxes like everybody else.\n\nBut they get no vote. So all the taxation with no representation. They’re paying into Medicare and social security but not getting the reward at the end of the rat race. \n\nTo make matters worse, they’re taking all the shitty, high labor, low pay jobs that most white Americans don’t want to do. It’s almost always back breaking uneducated labor jobs. \n\nMight be a better argument to say that we should catch and fine/charge all the employers that are hiring and exploiting undocumented labor. \n\nIf there are enough Americans willing to work, we wouldn’t need undocumented labor. Without jobs, illegals wouldn’t come here.",
         "He’s closing out in Pittsburgh of all places. It’s fucking WILD that he’s down the road from Butler—and me. In crazy blue Pittsburgh.",
         "If he wins the other swing states, yes, he only needs one of those 3.",
         "True , but the early votes maybe taking away from the votes from Election Day",
         "MN, NH, VA",
         "I’m in Georgia and he’s not winning here.",
         "If he wanted Trump to win over Harris, then he would've voted for Trump. 2020 was four years ago, and Trump admitted he lost it.",
         "There have been a couple of tie polls for Virginia. Turnout can make it happen",
         "This is so crazy to me. What do people see in her?",
         "I hope we go red. All of our \"bigger\" cities are honestly just hell holes. Grand Rapids has been steadily declining. The majority of Democrats I know are from bigger cities. Rural MI has Trump and Vance signs everywhere though.",
         "Wisconsin is 50/50 IMO and will be decided by last second voters and turnout. Georgia I think will be Red. Florida is absolutely going to stay Red or Trump is cooked.",
         "I don't think it will be close.",
         "But the presidency would just go to Vance then. It doesn’t just give the election to the dems, it just defaults trump if that’s their play. Vance is just as good as Trump.",
         "LOL. Democrats won NY by 2 million votes last election.",
         "I moved to Virginia when Kaine was governor.  What an asshole.",
         "Trump is going to win, Kamala is not doing as well as Biden was in 2020 trump is doing better now then he was in 2020 however I believe this is going to be close very close",
         "I think Donald Trump will win. I don't prefer either candidate.",
         "I’m independent; voted for Trump in 2016, voted for Biden in 2020 (I know, bad mistake lol) and voted early for Trump in 2024. I really really do think Trump v Biden would’ve been a complete landslide & Trump would’ve won. When Kamala was first announced to succeed Biden, I thought for sure without a doubt that she’d win. Now, I’m not sure at all. There’s millions of people that love her, but there’s millions that don’t. Same with Trump. I do think Trump could win, but it’ll be painstakingly close and we probably won’t have anything official for a few days, if that ends up being the case. If he won, they’ll find ways to count and recount every single vote and take their sweet ass time doing it. If Kamala wins, it’ll be announced Wednesday morning.",
         "I'm independent and I think is going to win. I think by a landslide too.",
         "Anywhere outside of Chicago will not vote for her. Chicago loves their violence, though.",
         "As a Minnesotan we have always been blue unfortunately.",
         "Who’s burning ballot boxes?",
         "the state is california is like an alternate dimension where everyone lost their minds. I cant count how many actors/actresses i lost respect for when finding out they live in CA and they are hard liberals. Guess it makes sense when liberals are actually running hollywood. My biggest heartbreak was zoe saldana who actively advocates for mexican migrants while she lives in montecito far away in her little palace. why doesnt she live in downtown LA among all the tents with the people she loves",
         "Man they need to be dismantled after this. Serious defamation charges need to be filed, something.",
         "I can't wait to witness the meltdown of libtards on Reddit tonight.",
         "Johnson County Republican here….I want Trump 🙋‍♂️🙋‍♂️",
         "Probably right on all the counties, but are there a ton of people in those counties?",
         "Seriously you guys need to divide some county in half so you have a nice clean 100. The 99 thing is driving me nuts.",
         "The reason it was troubling is because there really *weren't* 10+ polls saying otherwise - not much polling had been conducted in IA at all this cycle, its status as a fully-developed red state was simply assumed due to its voting patterns.\n\nThat poll was and is an obvious outlier, but it's not the craziest thing in the world to ponder for a moment whether the former swing state was being taken for granted by the GOP.",
         "It’s an outlier, what you need to look at is RCP per-state and national poll averages, they show Trump ahead, way better than he was doing even in 2016.\n\nLast time I checked his national avg was +0.1 while in 2016 it was Clinton +2.",
         "her two biggest polls this year were Trump +20 to help the Dems oust Biden, then Kamala +3 to help keep Republicans at home. she's a joke.",
         "I wouldn't worry. I could poll 800 people from Polk, Johnson, or story county and get a harris plus 3, while ignoring the other 96 counties too.",
         "One poll isn’t enough to predict the outcome of an election. Just because there’s one poll from Iowa, possibly focused on voters in Des Moines, doesn’t mean it reflects the entire state’s preferences. There are many other votes from counties across Iowa, including Des Moines itself. Trump has consistently led in Iowa, and a single poll with a sample of 800 people doesn’t necessarily represent the hundreds of thousands of voters across the state. Polls aren’t a definitive or objective method to forecast election results. Let the votes come in, and you’ll see—Trump will likely win Iowa by around 10 points. So, let’s hold off on relying too heavily on speculative polls.",
         "If I remember correctly I had read somewhere that first time voter registration was +19R and they weren’t counting that.",
         "I know, this is terrifying.",
         "I don’t think Russia/Putin is afraid of anyone, and now that they’ve pulled North Korea in to assist against Ukraine, agree that it’s only going to get messier. \n\nI feel a bit more optimistic about Iran now that so many rugs have been pulled from under them. The proxies they’ve relied on have taken major blows, and if pushed, they know that the US will help Israel knock out their nuclear facilities.",
         "Revolutions of 1848",
         "From peace throughout the world in January 2021 to wars in Ukraine and the Middle East and possibly another one in Asia (Korea or Taiwan), I don’t think it is a stretch of the imagination that WWIII could be around the corner. And 1% chance of WWIII is 1% too much.",
         "You are most likely correct, the overreaction around elections tend to be insane. I knew people who had convinced themselves Obama was the antichrist and we were all doomed. This is a big election and things could definitely get worse but people get wrapped up in the political propaganda and lose their mind sometimes.",
         "Nevada has a very good Union operation. On polling day they're get out the Vote is excellent, even if Trump is ahead in the polls.",
         "Side question from a curious Midwesterner... Seeing that many southern states are in fact traditionally very red, why is VA typically blue? It's something I've wondered but haven't looked into the reason.",
         "Which is highly likely if they think they're in trouble",
         "Robert Cahaly, the Trafalgar pollster who's very well respected, thinks it's very close but the Union operation in Nevada is amazing so the Dem's will just pip it.",
         "The union workers in Michigan and other states in the auto industry are worried about their future.   Worried about possible future mandates, but also the trade deals.  Trump was right when he said if China succeeds in being able to build and ship their EVs here from Mexico, it would be an economic blood bath for our auto industry.   Regardless of union, this weighs heavily on the minds of workers whose livelihood could just disappear.   There are always worries and fears in the manufacturing sector. This is different, this time.  It's more real than it ever has been.   Fingers crossed for a repeat of 2016 with Michigan.",
         "He's been significant;y ahead in Pennsalvania for a while. Michigan and Wisconsin are closer.",
         "It’s really is easy to think that when you make it up entirely in your own head",
         "If only there was a way to enter a country AND get these benefits, they are not “undocumented” that would mean someone isn’t doing their job. They’re illegal. They aren’t refugees either. They are criminals who live here and most illegal workers are not criminals and id like a program for papers if they showed they weren’t criminals (the bare minimum) but no more illegal immigrants. Most immigrants I know are not paying any taxes.",
         "I'm sure you don't mean any offence. But manual labour is far from uneducated. People seem to think their skills are any different to a computer programmer. It's not.",
         "What do you mean he's closing out?",
         "So Georgia NC & Arizona",
         "I'd assume a lot of them are low propensity voters. Republicans worked very hard to go after them this cycle.",
         "& if Trump flips one & wins AZ,GA,NC he will win & lose the other swing states",
         "What makes you say that? Looks like he’s about a 67% betting favorite in Georgia.",
         "I mean he didn’t vote for Harris though. He is annoyed with trumps behavior. And tbh I see his point. Trump is the better choice for the country but he says too much stupid shit that makes it easy to defame him. We need someone like Italy has as their prime minister. She is a right winger but she’s no nonsense no bullshit she doesn’t fuck around and she verbally pulverizes the left with facts. Everyone forgot about Trump and his Mexican remark back in 2016 and he probably almost got their vote but now that stupid comedian he had probably cost him the Hispanic vote again or a large portion of it. I think Trump is better than Harris but we need someone more serious and my father has always voted unpredictably.",
         "Abortion rights and TDS",
         "Well yes you said that already but to think all the swing states are going to go the same way in either direction is kinda wild.",
         "Yea me neither tbh. I’m not a “LETS GOOO TRUMPPP” type of person but I’ve done my own extensive research and after making my own judgment, from an initially non bias standpoint, I would say trump gives us the most hope for our already failing society.",
         "Are there really millions of people that love her? This election is mostly Trump vs anti-Trump. I have yet to hear compelling arguments in favor of her. Most of the people voting for her are just voting against Trump",
         "BEEN. \n\nI'm not on the ground there, but if it's anything like Virginia, and if my assessment of the polls is accurate, I really do think it flips this year.",
         "Can we all just do a class action suit for all the besmirching we've had to endure?",
         "That's what they want you to think. It was a bogus poll and the other polls earlier were more accurate 7-10%.",
         "Clinton was +3.2, even",
         "He's now -0.1 today ",
         "Polls can be manipulated easily. I agree",
         "Is that how she conducted the poll?",
         "NOVA (Northern VA just outside of DC) has a huge population and all Dem. Norfolk has massive military presence and they often vote blue in that area. Richmond city has a super liberal college population. Every other area is deep red.",
         "NOVA, i.e., Northern Virginia, the area around Arlington & Fairfax, are solid D. They're the swamp.",
         "This is the 270-268 scenario for certain.",
         "Then again polls always underestimate him there, ESPECIALLY Wisconsin.",
         "The problem is that no more illegals is just fantasy. As long as America is great, and anywhere else is worse off, people will come here. Expand access to jobs, and expedite access to visas and this wouldn’t be a problem. Instead of every corporation moving their jobs overseas, let’s get those jobs to stay here.\n\nEdit: also, refugee status needs to be trimmed down. Too many bad people use this loop hole to stay in the country.",
         "He didn't say \"manual labor\".  Unskilled labor jobs are jobs that anyone can do regardless of education, skills, or experience.\n\nChanging sheets in a hotel, for example, requires no skill.",
         "My apologies he’s finishing up in Grand Rapids. Like the last 2 campaigns. But he’s in Pittsburgh at 6:30 where the Pens play.",
         "Last campaign stop",
         "Yes",
         "Atlanta finds a way to help the D.",
         "Fair enough, but Trump's actions speak louder than words. Next ticket I can guarantee you it'll be amazing now that Trump reformed the GOP. We'll have JD Vance, Tulsi Gabbard, Vivek Ramaswamy (hopefully), and I pray Candace Owens 😭",
         "its sad. They don't even need a primary. Their candidate does not matter it is all run by the deep state.",
         "Me too but it’s usually democrat",
         "Class action for literal propaganda",
         "Class action lawsuit for slandering half the country a racist? Too bad slander in definition of law is very specific.",
         "Mind linking those earlier polls here then? There are 0 listed on RCP and only 1 from early September listed on 538",
         "Yeah seriously, I want to know. I find it hard to believe a state that had a Red Sweep in 2022, more republican registrations than dems in the last 2 years, and went for trump by over 100k votes last election would suddenly be +3 for Harris. She’s a widely regarded pollster so I doubt she would make that careless of a mistake.",
         "No, it is not how she conducted the poll.  Selzer it is a very highly regarded pollster. She might be wrong here, and she is an outlier, but she is very highly regarded.",
         "We need to reform the way we talk about immigration. The race and nationality of the people who are coming in may be a factor for some of us, but as I’ve noticed from the woman who runs Italy she never talks about race, she just refuses to be called racist and says the country needs to be protected. She doesn’t let herself get baited into leftist talking points. It’s better we have someone that can outsmart all of the defamation from them.",
         "Bingo, they are playing off the ignorance of social media",
         "Slander is a type of defamation, which is the act of communicating a false statement that harms a person’s reputation:\n\n- Defamation: A false statement that damages a person’s reputation, whether it’s written or spoken.\n\n- Slander: A type of defamation that involves communicating a false statement orally.\n\n- Libel: A type of defamation that involves communicating a false statement in writing or through a picture.\n\nTo prove defamation, a plaintiff must show that:\n\n- A false statement was made\n- The statement was communicated to a third party\n- The statement was presented as fact, not opinion\n- The statement harmed the reputation of the victim\n- The victim suffered some form of damages",
         "People keep saying she's highly regarded, i don't see how you can take a pollster seriously who moves their prediction by 15%+ within like 3 weeks",
         "I know. I just wanted the previous poster to examine what they said. Really sounds like they just wanted ti smear.",
         "and the regular media and the scare tactics \"Trump will have an abortion ban\"- even though abortion is left up to the states. And \"Trump is a nazi\" with no evidence or even \"trump is a dictator\" even though we had four years of him as president..."
      ]
   },
   "1gkgosv": {
      "title": "\"Ink Issues\" in Maricopa County.",
      "text": "",
      "comments": [
         "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
         "Effing Maricopa!! 🤬",
         "WTF??!!",
         "We need to get the lawyers and alert officials. As always record and photograph what you can."
      ]
   },
   "1gjtba5": {
      "title": "Trump voters are garbage?!?",
      "text": "Make America great again! And then annex Canada and do the same here please.",
      "comments": [
         "You know what they say one man’s trash is another man’s treasure",
         "This piece of garbage voted for that man",
         "Early voted! Already done sir!",
         "No amount of upvotes can describe how good this comment is."
      ]
   },
   "1gkict8": {
      "title": "Get Out And Vote Regardless ",
      "text": "We need every vote even if you live in a heavily red or blue area. Every vote counts.  Give a few moments to complete your civic duty.   Go team red!  ",
      "comments": []
   },
   "1gjpb0c": {
      "title": "Just voted for Donald Trump.",
      "text": "This is the first time I've ever early voted. There's quite a few people there at the courthouse today...\n\n I don't know, man, I just... I'm really nervous, and anxious.. the vitriol of the Biden/Harris administration is abominable, and Kamala Harris is nothing but a puppet for the military industrial complex and the New World Order.\n\nAs a follower of Jesus Christ, in our faith, we do believe that no matter what happens, Jesus is still King of kings and Lord of lords, He will still rescue his church, and punish the wicked..\n\nBut even then, Christians still have doubts and worries.",
      "comments": [
         "Yea he is. Too bad this post wouldn't see the light of day elsewhere on reddit *cough*r/Christianity*cough*",
         "I’m anxious too. All we can do is pray 🙏🏻",
         "And just for the record, I have no anger towards anyone here, and I'm not replying in anger towards anyone here either I don't know why I'm being accused of being angry, frothing at the mouth, giving myself an aneurysm because I'm allegedly angry LOL, \n\nI'm not angry. Just concerned, and hoping that Donald Trump wins tomorrow",
         "This is the only place in Reddit that this post would stay",
         "I’m nervous as heck. Pray pray pray. It’s in God’s hands now",
         "It's scary the lies people are believing. I don't know what I'm more afraid of...4 more years of this economy and having traditional family values destroyed or what would become of America in the next 4 years with the amount of extreme hatred and diabolical lies coming from the left. Tomorrow is one of the most important days in American history.",
         "Trump 2024 ❤️🇺🇸",
         "Amen! 🙏",
         "thanks! you made the right decision!",
         "Totally- so relate",
         "I’m terrified",
         "What is the New World Order you’re speaking to? My mom said the same thing to me but didn’t explain.",
         "Can anyone shed some light on this congressman that he wouldn't finalize the election results of Trump wins. Does he have the power to do this if Trump isn't an enemy of the US?",
         "Having met Harris in 1993, I had no desire to ever speak to her or run into her again. She is an authentic phony and that's where the authenticity begins and ends with her.",
         "As an atheist and a republican, if you didn't act like your religion was better than every other religion, people would take you more seriously.",
         "Thanks",
         "That's what's up brother! 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸",
         "[deleted]",
         "Sometimes you don't have to say who you voted for. \nYou can just drop hints like. \n\n( I know who I'm not voting for. She is to coconut tree for me )  I also did not vote for her/She/they.\nBecause she looks  She\" He\" . \n\nI Did not vote for She    😁.",
         "It's weird I'm also a Christian and a Republican and this will be my first election not voting. I just don't want to face God when I die and admit to him I voted for someone that does not actively follow him.",
         "i will never go there. I've talked with other Christians on r/TrueChristian Who have had some of the worst experiences from alleged \"Christians... the only reason I posted this was because I have concerns...   \n  \ni'm human, just like all the rest of you, and I'm worried this will be a repeat of 2020",
         "I haven’t checked it out. Do the folks on there actually contend that republicans no longer support Christian values?",
         "I don't know if I can do another 4 years of Democrats",
         "You don't wanna know how scared we are in east europe.",
         "The New World Order is a term used to describe a future form of government that is run more like an authoritarian, or totalitarian, or a dictatorship.. the Bible speaks about a governmental system run by one individual having complete control over the world, and he controls the religion, any controls finances by implementing the mark of the beast. There are many different interpretations about what the mark of the beast is, but what we do know is that it's not the Antichrist who implements it, it's the false prophet, and this Mark will also be connected to a financial system, because no one will be able to buy or sell.. \n\n that's a quick overview of how the Bible describes this new world order",
         "LOL.  Says the atheist.  You guys act like you're the smartest person in every room.  The atheism sub is literally a 24/7 bash session on how stupid Christians are.",
         "I'm not afraid to say I voted for Donald Trump.",
         "I didn't vote for Trump to be my pastor, I voted for him to be the president.   \nI highly doubt he's a Christian, And in 2016 it was because of that reason that I did not vote...  \n  \n yet afterwards, I started to see what he wanted to do, I started to see the policies that he enacted, I started to see the freedoms that people of faith were able to freely exercise...   \n  \nAnd then, when Joe Biden was president, I saw what he wanted to do with this country... I saw how he ended the energy deal that Trump made, which resulted in the price of gas skyrocketing at day one, I saw how weak and fragile our nation became, I saw the rights and freedoms of Christians be trampled upon...  \n  \nand when you put up his policies with that of Kamala Harris, such as her desire to murder the unborn all the way up to birth, to mutilate young children, To oversexualize children without the consent of the parents, to let men into woman's bathrooms, and to completely upend The Judeo Christian principles that this country was founded upon...  \n  \nI will gladly vote for Trump every single day over Kamala Harris.  \nBecause, as Romans 132 says, those who approve of such things will suffer the wrath of God.  \nIt's extremely apparent that Kamala openly defends and supports the unrighteousness of sinners, and Trump, while he is no perfect person himself, and he has faults, at least he's willing to say that they are wrong, and that basic Christian principles should be upheld  \n  \nProverbs 4:27  \nDo not turn to the right or to the left; turn your foot from evil.\n\nAs a Christian myself, I highly highly recommend that you go out and vote for Donald Trump, not because he's the Republican choice, but because voting for him is turning our foot away from the evil that Kamala Harris wants to impose on every single American.",
         "Since you possess this rare insight into other's faith,  could you share with me who you voted for in the past, so I'll know if I've angered God with past votes. /s. Lol",
         "Essentially when Kamala called Trump \"Hitler\" she was literally giving every Democrat within earshot permission to cheat, and why she did it.",
         "It's turned into the religious version of r/politics. All TDS 24/7 as if other problems don't exist in the world like the increasing possibility of Putin talking himself into using a nuke.",
         "What did Biden do for us the last 4 years?? He showed us how he would punish his political enemies and reveal just how scary of a narcissist he really is with this [narcissist smile.](https://youtu.be/hIt_5Q24BSQ?si=0f4-omKQhbUufHFk)",
         "You've lived under Communism before.  You know what its return would be like, and want nothing of it.\n\nLefties in the US only know the lies they've been told by their Marxist college professors.",
         "Gotcha. Thank you for clarifying",
         "You voted for the guy.... .... I like that guy too",
         "My pastor says the same thing.  We are voting to elect a president not a pastor!",
         "Dude it's the night before the election. If you think you, a stranger on the internet, are going to change my or anyone else's mind with quotes from Paul and long winded anger, then you aren't being honest with yourself about your debate skills.",
         "All he did was make our lives miserable and maybe some funny memes but 99% miserable",
         "Who said anything about me being angry? I'm just talking about the policies that she stands for... I never said I was foaming at the mouth in rage, no, that's not what the Bible tells us to do. Now, if you have a problem with Trump, that's on you, not me... \n\nFrom the way you responded to me from what I said, it's very apparent that there's something deeper going on here in you and, to be honest, I have no desire to poke that wound, because it looks like it's a very fresh wound...  \n  \n I was not trying to get into a debate with you, I was giving you the reason as to why I am voting for Trump, and I was trying to encourage you to do the same, because the policies that Donald Trump stands for are more in line with our faith than that of Kamala Harris.",
         "Another angry reply. This one you went with a personal attack towards me having a mythical deeper problem. Even though I too am a Republican and I too am a Christian.\n\nHere is the reply you obviously so desperately need....\n\nIt isn't about Kamala or Trump for me. It's about the Lamb of God. God calls on Christian's alone to be ambassadors for God. Representatives on this earth. As there are zero Christian's running there are zero people for me to vote for. You can look at corrinthians for that little Token of knowledge.\n\nTrump is ok with abortion, an adulterer (this is not because of him being a sexual offender but instead due to him being divorced), doesn't believe in Christ being King, and defiled the book of God by putting man's laws in it. \n\nKamala is also straight disgusting for her own reasons I don't need to go down to.\n\nSome people say that voting for Trump is voting for the lesser of two evils. News flash, you don't have to vote for anything evil. You can stay home. I'm not trying to be on the \"right side of history\" on earth. I'm aiming to be on the right side of the Lord our God. And I will absolutely not be voting for anyone in this election. I will be staying home. And there is absolutely nothing you or anyone else can do to change that for myself and millions of other objective Christian's in this nation that have chosen to stay home.",
         "So in other words, you're willing to potentially damn our entire nation because the objectively better candidate isn't a saint?\n\nI assume this means you never vote then, right?\n\nI really don't understand this logic. Option A is massively flawed but tries to do right by the nation. Option B is evil and stands for the opposite of everything in your faith. So your decision is to role the dice on evil and do nothing?"
      ]
   }
}