{
   "1gl0ur8": {
      "title": "The Libertarian Party candidate is losing to the Green Party and a guy who dropped out of the race and begged people not to vote for him. This is what happens when you nominate weak candidates",
      "text": "",
      "comments": [
         "A very large chunk of libertarians voted for Trump.",
         "He was just a bad candidate.  Honestly, the LP is such a joke.  There really needs to be something better.",
         "Nobody is going to take the Libertarian Party seriously until the Libertarian Party takes themselves seriously.",
         "Chase Oliver was a weak candidate.  It also didnt help Chase Trump was actively courting libertarians in a way a Republican hasn’t since Calvin Coolidge.\n\nThe Ron Paul being floated as someone to work with Elon also gave us some tingles in the week before the election.",
         "It wouldn't matter if Ron Paul himself had run with 80's Ross Perot on the same ticket.\n\nI honestly don't think the US can go back from this two-party system at this point.  I put my vote to him, even if he is a clown, just to say \"I reject this D/R bullshit\", and no one gives a shit.\n\nFight local, ignore the big offices - for now.",
         "Unfortunately the Libertarian Party has a history of sabotaging itself. Just look at [Dancing Underwear Man](https://www.youtube.com/watch?v=7BAOiGTizU4) or Nick [\"I got physically assaulted\"](https://www.youtube.com/watch?v=63AgZqwk4Sg) Sarwark",
         "Good. Chase Oliver was a terrible candidate. The Libertarian Party needs to realize that we're tired of them nominating clowns",
         "The entire party needs a reboot. I've seen more organization in a stampede.",
         "Libertarian Party had a fair bit going for it once upon a time, Johnson/Weld was a ticket that I was proud to have voted for. Shame it’s devolved into a complete joke and is now going to end up fifth nationally",
         "We should give up on presidential races and put the money in targeted local elections. Chase's result is embarrassing.",
         "LP is not ready for Primetime. \n\nLocally, they don't even support state legislation that they believe in. If a L did not propose the bill they won't discuss it.\n\nSo short sited.",
         "The LP cannot move forward without serious candidates. They should be focusing more on local elections. Revenue and membership is at an all time low, even the Mises Caucus is feeling the strain.",
         "Chase Oliver is an idiot and a joke. Got what you deserved. Liberty is not the same as Anarchy",
         "It's impossible for the third party to perform tolerable on the national level with ANY candidate. First, it should try to win or at least make a name for itself on the local level. And use gained authority to climb higher.\n\nAny results below 5% are statistically insignificant and should not be compared to each other.",
         "Yep. This party sure knows how to get me excited and then nominate some middle of the road candidate that has no change of moving the needle. \n\nLet’s all be real nice to Dave Smith. I believe he has a shot to make an impact in the near future",
         "I still voted for him, but yeah, he was a weak candidate.\n\nAt the very minimum, he could have tried getting on Joe Rogan and Tim Pool.",
         "Now would be a good time to choose and focus on preparing the next candidate.",
         "Libertarians did themselves a favor this election by nominating a weak candidate. Because of this many libertarians ended up voting for Trump which helped him get his win especially in those rustbelt states. If they nominated a better candidate, perhaps Kamala Harris would be our next president…",
         "i’m an independent and it was stein vs oliver for me, she won me over with her stance on agriculture and water supply and oliver won me over with his stance on education. essentially i chose health over education with this one but there shouldn’t be any animosity of any 3rd party groups, just civil disagreements and we should do a better job of that general support of one another to make the 3rd parties option more visible and impactful in future elections. this 2 party system needs to be splintered immediately.",
         "Turns out, most people aren't ok with transitioning kids or paying for the transitions of prisoners. \n\nAnd if you don't make the effort to give them anything else to talk about they just aren't going to have much reason to show up. \n\nAnd that's without going into how for once we had one major party candidate who at least _wasn't_ backed by the warmonger neocons.",
         "I was undecided up until a few days ago but was probably going to vote for Oliver. It may have been done just as a stunt but getting Ron Paul on board to help eliminate government waste sold me.",
         "Bring back Gary Johnson",
         "Predictable.  I’m a registered and Lifetime member of the LP and I didn’t vote for the ticket.  Give me better than this.",
         "Quite a few libertarians voted Trump \n\nFuck Chase Oliver though",
         "Yeah Oliver was a turnoff. A libertarian who held views contrary to libertarianism. What could go wrong?",
         "Dave smith 2028, gonna hit 10% choke. But hopefully it’s enough to scare the republicans into doing something about the federal reserve",
         "If the libertarian party was smarter we would run candidates as republicans",
         "This was the first time I had to write in the libertarian candidate, what a clown show",
         "I had no idea who was even running until 2 weeks ago",
         "There were no libertarians on my ticket at all. I only had 4 choices for President/VP.",
         "I am so surprised the Dems didn’t attempt a primary and just threw support behind Harris.",
         "Yeah... why DID he get the nomination?  I didn't think they could do worse than Jo Jorgensen, but boy did they manage to prove me wrong.",
         "I found it weird that the guy I would vote for was publicly supporting Trump already.",
         "The Libertarian party might as well cease to exist and reform as a PAC for libertarian-leaning Republican candidates in the future if they have no interest in actually supporting their candidates for office. The two party system is a corrupt shackle on our representation, but the current state of our third parties is an embarrassment as well.",
         "The LP is infamous for putting the dumbest candidates up for President. The LP would be better off sticking with local and state govt positions for right now.",
         "I'm literally subscribed to this sub and barely knew a thing about him. 3rd party is a waste of time and energy. Best option is to get libertarian minded candidates into one of the dominant parties. Last real effort was Rand Paul in 16, but he was just a shadow of his father, and got steamrolled by Trump 🤷🏻",
         "Neither party ever had a candidate",
         "...or maybe we swayed to vote for Red or even the Blue?",
         "It was definitely a combination of Oliver being dreadful and Ron Paul potentially working with Trump to clean things up.",
         "I voted for Jo last election and Gary the election before that, but Chase was an incredibly weak candidate and I simply do not like him. I wrote in Ron Paul.",
         "Al the 3rd parties need to try and combine into a single party, then maybe they can garner enough votes to get attention. Possibly on the debate stage like Perot",
         "Chase Oliver wants taxpayer funded gender conforming surgeries for illegal aliens and prisoners",
         "If you look at direct spend and indirect spend/effort, it really comes down to insane levels of marketing effort.  Whether it's the green party or libertarian party, it will take billions of dollars of marketing to lift the awareness and buy-in.  Just my 2 cents.",
         "I voted Libertarian all the way down the ticket... below Pres/VP. There's no way I was going to risk handing the country over to Kobamala and the Commies.",
         "Wheres Gary Johnson at!!",
         "Yes, because Chase Oliver is a bad candidate who did absolutely no real campaigning. I think I saw maybe 1 or 2 instances of any news or public appearances out of him between nomination & election day. Unlike Joe Biden in 2020 he doesn't have an entire media apparatus assisting him.",
         "I thought it was obvious that the LP went with Oliver to keep from nominating a candidate who would take voters from Trump.",
         "Chase Oliver wasn’t a serious candidate",
         "Yes, I was involved in the national LP leadership in 1996. After the grotesque corruption around the National Convention, I quit.\n\nThey hand-pick some candidate they like for BS reasons, and quietly help him get nominated, every election.\n\nSo they pretty much never have anyone who can take advantage of the disdain that most people have for the Uniparty duopoly.\n\nAnd they get what they deserve.",
         "I bet a lot of money on Jill Stein to win even though I support this party. I’ll take it",
         "Trump was right, they like losing because they refuse to compromise on anything, and now they have pie on their faces. They deserve it.",
         "LP had no chance even then, plus Ron Paul wants to be on Elon's team.",
         "The absolute state of American libertarianism. Sigh.",
         "LP candidate wasn’t even on my ballot this year (illinois)",
         "This also is what happens when the party itself refuses to support the candidate chosen at the convention. Is the schism in the LP foreshadowing what we’ll see in the major parties ten years from now? Would we be better off with right or none smaller parties?",
         "He was a weak candidate who ran a weak campaign. He made zero noise. All his twitter posts were generic LP talking points. I had a feeling Jill Stein was going to get more votes simply due to name recognition (her third time running for president) and that people who want the war with Israel/Gaza to end were all moving towards her or even Trump. Any other LP candidate should have been able to pick up former rfk voters and staunch antiwar libertarians but he couldn't do it because he just sucked... And Trump was just making the right moves getting tulsi, rfk, Elon, Vivek, and others to support him. Any LP candidate would have struggled but I think still could have performed better than Oliver.",
         "The Republicans have actually tried to reach out to Libertarians. The Democrats apparently didn’t think it was necessary to appeal to us at all. \n\nTrump promised to put a Libertarian in his cabinet, it was a better bet to have *some* influence with a party with a shot at winning vs. voting for Oliver and getting no concessions from whatever party actually won. \n\nFreeing Ross, crypto friendly regulations, free speech are all things Libertarians would value that we very well might get from Trump. Harris was going to be far worse on nearly every topic libertarians care about.",
         "Realistically it wouldn’t matter who we ran. Especially in the context of the lnc - because around that time our opponents were two former presidents and a *Kennedy*. Yeah good luck idc who you are. Even Dave Smith who would have been an amazing candidate would have got rocked this year. Smith/Russell 2028!",
         "No puberty blockers to kids.",
         "You're a weak party, candidates are the least of your worries",
         "I’m sorry who is this demo voting for Jill’s t3in?",
         "Why don’t all minor parities unite for voting reforms? ranked a choice voting is a popular option. Not saying it’s the best. approval voting is another option. There needs to be a better way to break the duopoly.",
         "We could’ve done what the dems did and pretended we were excited about a bad candidate until we became so fake we convinced ourselves it was real excitement.",
         "We’re never going to get anywhere until we begin winning elections at the local and state level. I voted for a libertarian county commissioner in 2020, and voted for him again this year. Setting our sights immediately on the White House is doing nothing but setting ourselves up for failure especially when the candidates suck. I was proud to vote for Jorgensen in 2020 and Johnson in 2016 but a libertarian did not get my presidential vote this time around.",
         "Chase was worse than Gary Johnson round 2. Still confused about the pick.",
         "I was gonna write in Ron Paul but he is suppose to be on the trump transition team. I liked a lot of what his coalition is about. I don't trust he will keep his word on much. But if it gets people like Massie and rand Paul incharge. I can stomach it",
         "Voted for Jo last election. Idk how you all feel about her, but I’m all down for being a giant Switzerland.",
         "No, this is what happens when you have incompetent leadership",
         "It's currently 223 291...",
         "The choice here was easy, and I voted for him for a few reasons:\n\n1.) He’s the candidate closest to my values as a Libertarian.\n\n2.) The two-party duopoly needs to be challenged.\n\n3.) He’s the youngest candidate running by a landslide.\n\n4.) He’s not running on a platform of hate/stupidity like Trump or on a platform of anti-Trump like Harris.\n\nYes, he’s not the “most perfectest” libertarian that could have been nominated, but to act as if any of the other candidates better embody libertarian values at all is ridiculous.",
         "Libertarians never win the election ever, I don't know why it's even an option on the list for people to vote, it's always either red or blue. Either way, I'm just glad we get a break from all the woke nonsense for the next 4 years.",
         "I cannot believe RFK still got over half a million votes after dropping out and explicitly telling people to not vote for him. \n\nLike that is as wasteful of a vote as you could get",
         "I've said this and got downvoted for it",
         "I cringed every time an edgy teenager posted they voter for Oliver",
         "I think bigger than anticipated at the end, with Ron Paul being responsive.",
         "Because Oliver was a shit show to start and can go F himself.",
         "I really think Ron Paul’s comments on working with Elon in the days working up to the election really helped tip the scale here",
         "I am one of those. Because Oliver was a worse candidate than Jo Jorgensen and I predicted he wouldn't even get one percent of the vote I didn't think it would be this bad where RFK Jr beat him. The LNP needs to take a long look in the mirror how do you not even get 1 percent of the vote with so much anti-war energy.",
         "Yeah, to stop shit like this from democrats.\n\nhttps://en.wikipedia.org/wiki/Disinformation_Governance_Board",
         "Yes, i did. The angry left wing LP got their big primary victory and nominated the third place guy nobody liked outside of far left LGBT activists. This is what they wanted.",
         "Or Kennedy",
         "Because slapping huge tariffs on everything is more libertarian friendly than believing in COVID (no, not suggesting steps a government should take in that kind of situation, just believing in COVID).",
         "Yea I decided to as well",
         "jo jorgensen was decent in my opinion. she’s what lead me to find out about libertarian",
         "the ideology is there but the charismatic public figure is lacking, in due time that person will come.",
         "They weren't even on the ballot in New York (although to be fair neither were the greens) - I had to write someone in.",
         "Nobody is going to take the libertarian party until the libertarian party starts actually wanting to grow as well",
         "I often wonder if they're full to the brim with agents provocateur.\n\nEither that, or they're mind-blowingly stupid.\n\nBrave doesn't think blowingly is a word. Brave is mind-glowingly stupid.",
         "We deserve every bit of this.",
         "Chase Oliver also went out of his way to alienate half of his own party. He bashed Ron Paul, he called the great Lew Rockwell a \"racist\", and he seemed more interested in starting drama with other libertarians than actually campaigning.",
         "Yeah I remember reddit making a big deal about how Trump got booed at the Libertarian Nation Convention - well at least he bothered to show and make his case. Biden and Kamala wouldn't do something like that.",
         "I think it would take someone like Ron Paul, but maybe even more traction, getting a deep primary run then running as an independent. And even that might not be enough.",
         ">I honestly don't think the US can go back from this two-party system at this point. \n\nI wish we more like Canada or the UK where they have multiple parties and they're far more left than the United States.",
         "I had to unfollow him on everything. I used to turn to his page as a voice of reason until about 2 years ago. I have no idea what happened.",
         "If the LP wants me to care, they'll nominate a libertarian.",
         "Chase Oliver is about as libertarian as Trotsky",
         "Genuine question: How is Chase Oliver an Anarchist?",
         "The last statement is false. Chase is not an anarchist",
         "Chase never claimed to be an Anarchist, at best he was more Minarchist.",
         "With the utter lack of a campaign he ran, I'm not sure he realized he was running.",
         "Oliver was on my ticket in MN and I was surprised to see a libertarian running for one of our senate seats (Rebecca Whiting). She ended up getting 1.7% of the vote to Oliver’s 0.5% which shows his weakness.",
         "Jo was based AF, I would love to have her back",
         "You seem like a real libertarian, you are for limited choice? 🙄",
         "Dude, if you don't like wokeness, get ready. It's going to be front and center for the next four years. Trump baits people and pours gasoline on any fire he can. You're about to hear from more angry woke people than ever.",
         "I not a trump supporter but him coming to the LPC and telling libertarians he would free ross...was a pretty nice olive branch we dont normally get.",
         "I voted for chase, but not because I cared about chase. My state was going Trump for sure so I used my vote to help draw attention to 3rd parties and maybe (but apparently nowhere near this time) get that 5%.\n\nTrump certainly has my attention with Ron Paul though. If I was in a swing state that probably would have been enough to earn my vote.",
         "If I were registered, I'd've voted for Ron Paul, ergo for Trump, because of that last bit about Paul being part of the coming Trump administration.\n\nThey should've done that months ago. A LOT of libertarians don't normally bother to register. The national LP has tended to do more harm than good to the cause of liberty.",
         "I think it's because the Democrats and their cheer-leading media is just that bad and people's conscience told them they can't just vote their conscience.  Their tone and their policies would further gut the middle class while telling them all they are crazy/racist/ignorant.  At least with Trump you don't have to worry about the media gaslighting and lying about how great he is.  The fourth estate eviscerated the last decent and possibly electable people to run: Gary Johnson, Ron Paul.  President Donald Trump, brought to you by the lying media and terrible leftist policies.",
         "It was what did it for me. Himming and hawing, then Ron Paul possibly working with Elon to cut waste? Deal.",
         "It's not like the LP has had a good candidate in, like, thirty years.",
         "*5th place. Also yeah I agree.",
         "what does covid have to do with this?",
         "Yes, I spent a bunch of time with her when she was the VP candidate in 1996. She's great, the closest they've had to a good, principled candidate in decades.",
         "She was a great candidate.  I really liked her.",
         "She was definitely one of the best ones we have had running in the last couple decades",
         "She was one of the best Libertarian candidates of the 2000s+",
         "Same, I always thought that after the whole Gary Johnson debacle the LP was a joke, until I heard about Jo and her policies.",
         "Nah she was pretty bad not as bad as Oliver. The Anti-racist stuff was a joke and alienated a lot of Libertarians.",
         "No she wasn't we were facing the biggest affront to liberty with lockdowns and covid crap and she gave like no pushback was very lackluster and didn't attract much attention.  We need someone who can talk a big game spread the message and be able to kick ass and take names, she was no where near that.",
         "She really was. I even donated to her campaign.",
         "she is for sure",
         "Same in Illinois",
         "Same in Tennessee",
         "If reading this sub frequently is any indicator, libertarians love bashing other Libertarians. ",
         "What does it say about your party when that's all it takes to get your votes?",
         "What are Chase’s unlibertarian opinions",
         "She was just virtually unknown outside the party and wasn't really that exciting. She was maybe too based lol",
         "Jo was as exciting as stale Triscuit crackers.",
         "No, I'm just saying that's all there ever is.",
         "This might actually be the best a main party candidate has ever done at courting libertarians. It's not much, and I bet it amounts to even less, but hey, it's something I guess.",
         "Definitely was respectable at least. I didn’t vote tho",
         "Ross was ordering HITMEN… dude deserves some jail time for felony conspiracy. But the drug shit… the whole drug war. Hopefully it’s a sign that he’ll end that… or at least solely focus on opiates and open up the asylums… but idk",
         "Even if it's a small chance, it's worth the bet to me, because ain't no way anything libertarian is coming from the other side.",
         "I actually liked Gary Johnson in 2016. He definitely wasn’t perfect but definitely better than Jorgensen and far better than Oliver.",
         "What?  You didn't like Bob Barr?  \nLP nominations seem to usually be selected to troll libertarians.  We dare you to vote for this guy.",
         "I mean, people don't like him mainly because they think he's a COVID-lockdown-supporting-basically-a-commie-democrat type of guy, when his policy platform is literally standard libertarianism.\n\nIt was really just an example to contrast with a VERY non-libertarian Trump policy that people will turn the blindest eye to just because he pretends to sympathize with libertarians sometimes.",
         "The infamous tweet heard round the party",
         "And the the excuses afterwards saying that she just wasn't familiar with what \"anti-racist\" implied.  She's an academic and a presidential nominee. I don't buy for a minute she was unfamiliar with the term. She put it in a tweet, FFS!",
         "i didn’t claim she was the best.",
         "That’s the party’s fault not hers.",
         "It’s so annoying- they’re so afraid to give people a choice ",
         "Damn libertarians; They ruined libertarianism!",
         "It is Chase’s most libertarian quality",
         "Touche 😆",
         "Someone showing up and trying to earn your votes? That can mean a lot to a lot of people. ",
         "3rd parties in the US don't really exist to \"win\". They exist to get candidates from the two other major parties to steal our ideas and implement them. The socialists and progressive parties at the turn of the previous century got a lot of what they wanted (8 hour workday, end to child labor, etc.) without getting a single presidential electoral vote. It's possible the LP essentially dies now that the Republicans have finally stolen all of our ideas, and at this point maybe it's a good thing. \n\nI've run as an LP candidate, voted big-L Libertarian now in 7 presidential elections, and I, of course, voted for Chase Oliver, but that's only really because I don't trust Trump to actually put someone like Ron Paul and Elon Musk in charge of a department of government efficiency. If they actually follow through with it, I don't know what else the LP will exist for.\n\nThere's a possibility the LP continues to exist in some form because I don't think a Trump presidency is going to actually make significant changes to the level of control the military industrial complex has, but if the GOP actually becomes the party of smaller government, actually defends the first and second amendments, then what will be the point of the LP?",
         "Tbh I voted for him because I liked his ideals best out of everyone. I wasn’t going to vote for Trump again and I wasn’t happy to vote Harris. So I looked elsewhere. I read up on him and watched the Third Party debate. I assume most people hate him because he’s anti-war. Imo, his policies were mostly what I was looking for, so he got my vote. Simple as that.",
         "There were 5 choices on my ballot. Was yours different?",
         "Yeah, the diehard LPs were shitting on it at the time, but this was the most consideration I've ever been paid by a major party.  He actually noticed us and took the time to address us as a bloc and discuss issues we cared about on our terms instead of pretending we don't exist.  Obviously he didn't pledge to become a libertarian but I feel like him reaching out to libertarians was a small but important step to a lot of the small ls out there.",
         "Was there anything that even came close? I remember 2016 and 2020 (the first only ones I voted in) and it don't even remember any lip service to libratarians",
         "no he wasnt and you know it.",
         "Never convicted on that and never even made it to court.",
         "Bob Barr, the guy the LP bragged that they helped REMOVE FROM OFFICE because he was a neocon drug warrior...and then made their own nominee?\n\nI don't see how that could be trolling...\n\nWait, wait, how about Johnson, who refused to commit to legalizing drugs, and they gave him the nomination twice.\n\nOr in 1996, when Harry Browne told me personally that they FORCED him to change his platform, in return for help getting the nomination, and then they FORCED other libertarians to endorse him.",
         "She controls her messaging, wearing a mask outside saying how you are following all the rules come on.",
         "So what is better about Trump, compared to Harris, when it comes to Libertarian values?",
         "And the LP is still pretending to be an actual party?",
         "Yes, but tell me when the last time was we had a libertarian president?",
         "And if it actually does lead to a change in governance, it's about as good of an outcome you can really hope for right now. I'm (very) cautiously optimistic.",
         "Reagan in 1980 I suppose.",
         "Barr worked with libertarians after his removal from office and helped make medical marijuana real for four years. As much as you might despise Bob Barr, he was one of the major reasons why we have legalized recreational marijuana in the US today. I really think libertarians underestimate just how big of a deal flipping him was.",
         "Yeah come on wtf why would a person running for office follow the laws smh",
         "Not gaslighting citizens with all the media they own and calling them uneducated/racist/greedy when you disagree with them. Calling Trump a threat to democracy when they appointed their own nominees. They support genocide and endless foreign aid to the point inflation is at a record high. Harris and Biden both have track records of incarcerating low income people of color for victimless crimes like selling drugs to truancy. Trump pardoned all those people and did something no candidate has done in my lifetime, and that’s acknowledge third party candidates and asking libertarians for their help. Add Ron Paul into the mix and we feel we’ve been heard.",
         "Lower taxes? ",
         "I mean it’s a minor party just like the Greens - they shouldn’t pretend to be a major party.",
         "Me too. Trump announced during his campaign he was putting together a group to investigate government waste.  For as much as people bag on Musk, Trump declaring he was going to work on this problem and going so far as to name a person who has had success at shaping up waste in the past who would be put on the case is FAR more than the vague suggestions of maybe taking a look at it someday that we usually get.\nI don't expect a revolution but I am hoping for an improvement at least.",
         "It is called taking a stand for freedom, John McAfee wouldn't have been wearing a mask.  Furthermore as a leader you have to stand up and well lead.  The example being set was be little bitches and just blindly follow the authoritarian hellscape under covid.",
         "Trump didn’t pardon a swath of random low level drug offenders. Most people of the 200 something he pardoned happened to have outspokenly good opinions on him. \n\nGaslighting? Be specific here. \n\nThe just letting Harris take the nomination I can kinda get. This was kinda her job though. Biden responded to the sentiment that his time is done, too old, needs to retire. So the VP took over. A more unique situation but it’s not like the President actually needs to Primary in this day in age. They have them but not really, same goes for 2020, 2012, and 2004. \n\nIgnore what I typed above this. So policy wasn’t on the ballot at all? You just wanted to feel heard? That can mean so many things but all of them seem unserious.",
         "Trump campaigned on Tariffs. So no, he didn’t campaign on lower taxes. \n\nThe last time federal income taxes were adjusted were under his presidency. They lowered them at first. Now though they have been creeping up. He scheduled it to increase a bit every year for a while up until a certain tax bracket.",
         "With this attitude they'll never be one either.",
         "If it wasn’t apparent enough already, Ron Paul’s goals have come to fruition. He changed the Republican Party’s platform to get rid of the Neo-Cons and influence the party to more libertarian ideals. JD Vance is bringing up Ron Paul’s views on ending the federal reserve. Thomas Massie just got appointed to the Secretary of Agriculture. We finally are making progress and being heard.",
         "You kinda just doubled down on “being heard” as your main influencer. \n\nShifted to libertarian goals how? I thought the main goals were personal freedom and taxes bad. Trump really didn’t advocate for those things. \n\nEnding the Federal Reserve can be a thing as  long as “ending the federal reserve.” isn’t the end of the thought.  Get rid of it and then we do..? US currency is the world standard as is. It would be good to be assured changes in our currency regulations don’t change that.",
         "Ending the federal reserve’s monopoly on currency, ending the income tax and lots of other taxes that hurt lower and middle classes and encouraging competition with currencies such as crypto or gold/silver."
      ]
   },
   "1gl60k5": {
      "title": "If the government had less power, it wouldn’t matter who was in office.",
      "text": "",
      "comments": [
         "The top picture is my family, they are SO convinced that Trump will destroy our democracy, even though he spent a lot of his first term at Mar a Lago, but I'm definitely the Libertarian below, because this definitely ISNT my first time being ruled (milked for my money) by the Uniparty...",
         "I love this. Perfectly resonates with how I get vilified for not falling for the scam that is bipartisanship.",
         "Facts",
         ">Trump will destroy our democracy,\n\nCan't destroy something that doesn't exist",
         "The great illusion. Trying to convince these people that more than two choices exist is like trying to describe colors blind people.",
         "At least a blind person would probably try to hear you out"
      ]
   },
   "1gl2q25": {
      "title": "We made the presidency too powerful ",
      "text": "The fact that every four years, we end up in a situation where one of the sides is this scared or angry - just goes to show that the presidency has too much power. \n\nWith the ruling about official actions from the Supreme Court, it’s truer now than ever.\n\nThere’s a reason why the founders wanted checks and balances, instead of resorting to executive actions. \n\nWe were already screwed because of political parties and coordination across branches, but since the overuse of EA since the Bush era by both parties and continued outsized influence of the executive, we are not in a good place.\n\nTo make it worse, it boggles my mind that we have notions of conservative and liberal judges. They shouldn’t be political. \n\nNow, there’s no way to turn back the clock on the Overton window on any of it.",
      "comments": [
         "Yes, yes, yes!  EOs should be heavily limited.  The presidency is not a fucking monarchy.",
         "That is what the Supreme Court and Congress is for, balance of power. Sadly Presidents have usurping the power of Congress for decades. Congress has literally just handed over authority to the Executive.",
         "Preach it.",
         "Well said",
         "Oh totally.  If you need any better example of how overpowered the executive branch is, look at how bummed out the liberals are today.\n\nIt really shouldn't matter that much who wins because Presidents shouldn't be THIS important.  \n\nOf course, it would be nice if Congress would do something besides spending bills and then leaving everything up to executive orders and edits from the agencies.\n\nI will be sorta curious how the SCOTUS deals with Trumps executive orders.  I have a feeling/hope that the SCOTUS isn't really \"conservative\"........they just are focusing the US to function the way we were all taught in civics class.  I'd be in favor of that. \n\nIf you look at the Dobbs decision, they weren't really ruling on abortion.....just saying the Roe was flawed.",
         "Destroy it!  Cast it into the fire!",
         "> To make it worse, it boggles my mind that we have notions of conservative and liberal judges. They shouldn’t be political.\n\nIt's SO GROTESQUE",
         "1000% couldn’t have said it better myself",
         "Very nicely worded",
         "I agree with your sentiment especially regarding the overuse of executive actions by the past four administrations (although, in fairness, many of Trump's EAs were simply undoing Obama's), and if any Supreme Court were willing to rein in this practice I think the current Court is it. I'm not making a prediction, but I think we're closer than we've ever been to a victory in this area.\n\nI disagree with your view on Presidential immunity, however. It is the job of Congress and the courts to keep Presidents in line and this has always been a political matter; if Presidents feared criminal prosecution by the next administration (which, given the wide ideological swings we have experienced over the past few election cycles, isn't too far-fetched) they would be effectively paralyzed. Perhaps you think that is a good thing, but the President does have certain legitimate powers that he needs to be able to exercise.\n\nThe Supreme Court did not rule that Presidents are above the law, only that actions taken in the course of their \"core constitutional powers\" have absolute criminal immunity and that other acts taken as part of a President's official duties carry a presumption of immunity. The specifics of what this all means will need to be decided in future cases, but I hardly think the Court's ruling represents a sea change at least in practice.",
         "The president should have so LITTLE power it wouldn't matter who wins.",
         "I've been saying this for years.",
         "The Supreme Court hold the most unconstitutional power in the federal government, followed by the executive",
         "This was a great conversation to have last decade or the decade before that or even 4-6 decades ago or more. but doing the day a president gets elected that 72 million people voted for and 67 million voted against seems a little mis-motivated. \n\nOf course the founders didnt want a president that was a king or monarch.  There is a reason the house only has a 2 year term and the president has a 4 year term.  The house was supposed to have the most power.   We have slowly eroded away the checks and balances over the last 200 years.  \n\nWe need to abolosh the 435 member house cap and get back to 1 representative per 200-250k people.  Undo the 17th amendment and restore the appointment of senators by the states to represent the states, abolish the 16th amendment allowing the federal government to directly tax the people and require all bills that need  funding to be originated in the house.  And let the 1300+ members of the house vote who is president .  then the only person you have to worry about electing is your local house member.  we could revolutionize how election day works.",
         "Absolutely agree. But I’m also happy with the turnout.",
         "We keep figuring out the issue is gridlock in congress and keep finding worse solutions like EA/EOs. Making the situation much worse",
         "I think it would be more fair to say Congress abandoned their obligations. This also caused the problem with appointed departments creating rules out of thin air using the Chevron ruling. It was never supposed to be that way.",
         "Short sighted, but that’s what we get with the same political parties across branches and institutions, federally and across state lines. This is the true duopoly",
         "Yep.  Congressional laziness is a big part of the problem. ",
         "And honestly, they barely do the spending bills. They leave it up to the last possible second, make up some bullshit, and then go on vacation for the Holidays.",
         "I would completely agree with you in a vacuum, but unfortunately, I do not think SOCTUS is apolitical, on either side. With the conservative majority in this case, they will continue to favor in Trump - which has not been limited government but limited accountability for him.\n\nI do think it’s elevated risk to not disseminate what constitutes as official actions on such a landmark case. It could be argued that wasn’t the scope of the case, but it could also be argued - it was to provide Trump with more protections since the case was about this overreach. \n\nWe shouldn’t be in a place where we need another case in the lower courts and for it to finally be back with SCOTUS to get clarification. Because more damage could be caused by then due to the lack of clarification now.\n\nHappy to hear a rebuttal",
         "This is what happens when Congress refuses to do its part and defer to both the executive and judicial, because they want to take no accountability for legislation and continue getting re-elected",
         "Unfortunately its explicitly constitutional, they just forgot to add checks and balances.",
         "I’m a heterodox, so the projection isn’t appreciated.\n\nAbout the rest of the content, though - this is a constant conversation we should have been having, but sometimes, it’s hard for most of the public to see through the trees. Since the Bush era, the polarization has certainly made the overreach of the executive more pronounced in its illustration.\n\nThe wrong solutions keep getting deployed by both sides: let’s get our person in there. Instead: let’s limit the overreach and ensure congress does it roles in legislation and is more directive in its representation.\n\nWe need to find a way to incentivize congress to do its job, instead of delegating to the executive and judiciary.\n\nRelegating the congress to choose the president is simply a recreation of the parliamentary system across the pond, introduces more biases, and erodes more checks and balances. We need the executive to be independent like the founders intended and more in check, just like other branches.",
         "This 100%.  Congress abdicated their responsibilities to the Executive because they can either blame the President if it goes wrong or claim part of the alcolades if it goes right but never have to be responsible when their elections come around.  No vote record no fault.",
         "All because everyone in congress just cares about getting re-elected. We need term limits, so they actually are somewhat incentivized to do their job",
         "I'm not sure what term limits would do towards that goal, but opening elections up to many parties via improved voting processes would probably light a fire.",
         "I think right now, everyone in congress defers their power to the executive and judiciary. This way, they never have to be accountable for any controversial legislation and can ensure a higher likelihood of getting re-elected. And, that can go on forever because there’s no term limits, so that’s their incentive.\n\nWe need them to do their job. Maybe if we place term limits, it may actually lend to them doing some of it because they can’t rely on cashing their checks with the government for most of their lives.\n\nIt still may not incentivize them, but the current rules certainly don’t.\n\nAbout your last point, I wish we had way more parties like parliamentary systems, but instead we have two bloated parties. It was the response to curb checks and balance within congress and government as a whole. It’s a big middle finger to the founders, unfortunately, and we’ve all gone along with it for generations and hard to stop it now"
      ]
   },
   "1gl6pfe": {
      "title": "Thomas Massie for Sec of Ag",
      "text": "Conservative with a libertarian track record for the Secretary of Agriculture? I'll take that deal",
      "comments": [
         "I see a Thomas Massie bump and I upvote, simple as",
         "Agriculture has tons of subsidies.  You know, taxing ordinary people to give their money to a few rich people with thousands or acres who make political donations.  I’m very, very skeptical those subsidies will go away.  My guess is they increase.",
         "Massie is the polar opposite of a boot-licker. If he's really the pick it would be a massively encouraging sign that Trump's only concern isn't loyalty.",
         "I wonder if there will new information on the SHUSH act in the next few days since its looking like Republicans will hold a majority in the house and senate.",
         "Won't he be greatly missed in the House?",
         "This is a massive win. Massie is the man",
         "I'm more intrigued by Joel Salatin. Hot dayum. He's a hippie organic farmer isn't he?",
         "\"Lesser of two evils\" Libertarian purists in shambles right now 😂😂😂",
         "Let's fucking GO",
         "Massie should have a bigger job.  Make him Secretary of State and cut all foreign aid.",
         "GETTIN SASSY WITH MASSIE",
         "True.\n\n But I'd like to see Massie's PRIME act pass. Cut the red tape so local farmers can have more power.",
         "That means he’ll probably get canned a few months in. Trump had huge turnover in his cabinet first term because of individuals not falling in line.",
         "Especially after trump lambasted him for delaying the covid relief bill",
         "He would indeed. But I think it's a position where he can do more good.",
         "You are correct. Big in the regenerative agriculture world.",
         "I think he's featured in the doc Food Inc. Which is an absolutely gut wrenching look at US food systems.",
         "Salatin is far from what I would consider a hippie farmer.  His family has been raising animals and crops on land since the 60's and he does it in such a way that is sustainable and doesn't require inputs from big ag.  He mimics natural cycles on his land in the way he moves his cattle from pasture section to pasture section on a daily basis like bison move daily in their herd.  He follows the cattle with chickens which spread the manure and and eat pests just like flocks of birds would have followed the bison.  This leads to incredible grasses growing on his land and major soil restoration.  He grazes his pigs in the wooded areas which manages undergrowth and promotes the health of the large timber.\n\nHis big push is to work with the land the way it has worked for millenia, not stripping it every season and dumping 1000's of lbs of chemical on it to make Monsanto's latest creation grow.  Its a good method and he provides realistic frameworks for individuals or small families to make it work in their area too.\n\nExcited to see him involved with advising at the federal level.",
         "I believe he’s been on the Rogan podcast a couple of times as well",
         "Well... it's just one spot. But still a bright one! Haha",
         "It’s not that they weren’t falling in line, they were actively working against him and his agenda. They were deep staters who had fealty to the bureaucracy over everything else.",
         "My brother talks about him and chicken tractors a lot. \n\nHonestly, I'd love to see some breaths of fresh air in DC from actual farmers.",
         "That's amazing. I'm game. Especially if it brings some of my organic farming hippie friends closer to libertarianism :)\n\nAnd, frankly, the algae blooms from fertilizer runoff are yucky.",
         "If he frees Ross I’ll buy a MAGA hat, fuck it"
      ]
   },
   "1gl2csl": {
      "title": "If you have friends/family breaking down over the election, they may be receptive to the only logical conclusion to draw from this election: No president should be powerful enough to have such a large impact on your life that a single election could ruin your life. ",
      "text": "As the title says, they shouldn't be focused on how they can dominate the other side next election. They should instead be focused on changing the system so that no single president or no single election can \"ruin their life\". \n\nThe  takeaway from this election is not that the republicans or democrats are the enemy... The enemy is the power of the federal government to get involved in our every day lives. \n\nArgentina elected milei to destroy the power of the government from within. With enough enlightenment, we can do the same here. ",
      "comments": [
         "They also forget that USA president isnt as powerful compared to some of the other countries",
         "Eh, I learned a while ago that trying to be rational with anyone who is acting like this is the end of times, is generally not worth the time and effort.\n\nNot to say I disagree with your point, but I always end up frustrated when I try to calm these people down.",
         "The conservatives have the presidency, the house, the senate, and the Supreme Court. So yeah get ready for far-right super authoritarian policy making.\n\nThe checks and balances are unbalanced.",
         "Yeah dude, best argument to get a lefty to disapprove of public healthcare is \"So you want Trump in-charge of your healthcare?\"",
         "I commented something similar on a post in another sub a few days ago and got downvoted and told I clearly didn't understand how government works. \n\nThe propaganda and indoctrination is just too strong with some people"
      ]
   },
   "1gkykwu": {
      "title": "California doesn’t make sense",
      "text": "“Prohibits the California Department\nof Corrections and Rehabilitation\nfrom punishing incarcerated persons\nfor refusing a work assignment.\nAllows incarcerated persons to\nvoluntarily accept work assignments\nin exchange for credit to reduce their\nsentences.” \n\nBut they’ll virtue signal online, don’t pay attention to the fact that these votes against rent control (I’m against) are all from LA and the bay. Rich posers that don’t even believe the shit they preach. If you gave a fuck about minorities let’s just acknowledge the fucking elephant dude. More PEOPLE are on the street than ever, and are incarcerated more than ever. At least they voted for stronger sentences for drug offenses(mentioned fent in the prop specifically) and theft, but they’ll never admit they did. No, the leftists in California are holier than thou. They’re actually decent human beings… yeah fucking right. They’ll protect their shit over your life and point the finger at GOP for being the worst thing since satan. Be up front about what you want. ",
      "comments": [
         "They did the same thing here in louisiana they won't pass the law to abolish slavery because then they can't work the inmates and get free labor or basically free labor",
         "Californian here. They have played funny games with the wording on propositions for so long now, most people have trained themselves to just vote no on everything down the line.",
         "Never has",
         "I always wonder about the wording on the ballot for some of these. The summary on the chart certainly seems a lot more inflammatory. I know in my state we've had wording come across with double or triple negative to try and confuse people into voting one way.",
         "The more I think of this, especially in the context of it being California, the more messed up this is. Just... wow",
         "Almost everyone in California has been a victim of a crime.  We're tired of it and sympathy for criminals is at an all-time low.  All it takes is for someone to steel your catalytic converter, and you too will be pro slavery.",
         "Who is going to prison in California? Harris is not top cop anymore.",
         "“So you sue him and he has to become your butler?”",
         "Does it have any connection to banning companies that benefit from slave labor? I ask because of Apple and cobalt. I could probably look this up, but I admit, I’m being lazy.",
         "So working in jails is wrong now? 54% say its OK...",
         "I voted against the theft one",
         "California loves prison labor. Their former AG turned VP, turned failed POTUS candidate used to lock people up to use as slave labor, even keeping them beyond their sentences.",
         "Apparently they listened to Kanye and decided to get rid of involuntary servitude as a  punishment for crime",
         "Now, do they throw people in jail or give community service.\n\nGuess it's Jail and fines for people now",
         "Will be ironic if people are thrown in jail for stealing then have to make what they stole in prison…",
         "Can we just cut them loose or take over?? Waiting for the other show to drop with California’s ridiculousness is exhausting.",
         "They need their free fire fighting.",
         "Would have helped when Kamala was the state ag",
         "What about this doesn't make sense? What, you really think the Dems changed sides since they lost the civil war?",
         "inmates should serve on the front lines",
         "While I don't agree with involuntary servitude, how does that work with the 13th amendment that specifically calls out it can be for punishment for a crime? If the proposition passed, could it be declared unconstitutional in court?",
         "I vote in CA and I was blown away how out of step the results were.\n\nWe won't raise the minimum wage and we want slavery...",
         "this was mainly around involuntary servitude in prisons.  seems a bit of a stretch to call that slavery.  That'd be liking saying your were kidnapped instead of imprisoned.",
         "Did they somehow relate this to M/s relationships?",
         "How many rich people have maids, nanny, and servant working for nothing live over there?",
         "Commies gonna commie.",
         "This, lots of states do this. Usually you can labor when sentenced and get time taken off.",
         "I developed a strategy several years ago, \"No unless there's a good reason\" and voting on propositions I don't understand is much easier now.",
         "Yeah, trying to decipher what anything means through so many double negatives was exhausting. What was the affordable housing one this time? \"Vote to repeal the law that blocked the government from passing law to expand their ability to enact rent control.\"",
         "I was gonna say the wording for this is really weird. I wouldn't be surprised if a lot of people were just confused on which one meant they were for the proposition.",
         "I get that you were being a bit tongue-in-cheek and I laughed. Thanks!",
         "Agree to disagree pal",
         "We did pass Prop 36 and it undid a bad Prop 47 in 2014. That was basically our anything stolen under $950 was a slap on the wrist. 36 basically says if you have 2 other similar charges in the past, it’s a felony. It was a good correction. The only opposition they put on the ballet were fiscal cost and “increased state court workload” lmaoo\n\nCan’t buy anyone is worried about fiscal cost of fucking anything in California. We passed Prop 35 that states “make permanent an existing tax on managed health care insurance plans that provides funding for the state's Medi-Cal health care program.” So our plan is to just keep printing money apparently..",
         "Working? Absolutely not. You volunteer to work, you don’t force chained men to fight wildfires though.",
         "Why did they put \"theft or drug crimes\" in the same vote.  Those are two vastly different issues that people are likely to have different opinions about.",
         "To be fair I’d be stereotyping but yeah. Landlords in the “nice and urban” areas. Tech bros and university 20 somethings. Always gonna be the most fake people lol",
         "\"Working for nothing\"?\n\nDo you mean literally or figuratively? All those service providers definitely charge for their services.  There is a demand for this labor, and it seems hard to be deported just for working illegally.",
         "My issue is when it’s involuntary",
         "That was my intent.  It went over some peoples heads.  This issue is very complex.",
         "They're being sarcastic",
         "I saw that, and was not surprised to hear that Ca had a ~70B deficit last year. Who knew things cost money???",
         "did what could in my state to make my voice heard on these issues. all you can do really, i think prisoners can be rehabilitated better than a chain gang program.",
         "Wouldn’t this also include sentences like community service? That’s forced free labor. Too vaguely worded for me.",
         "I thought the firefighters were 100% voluntary. But yes, I get not having forced labor.",
         "Interesting point of view... I thought they should pay for their own spending one way or another. Instead of relying on taxpayers pockets.",
         "Have you ever worked with fire crews?",
         "That actually happened? And they voted for it to CONTINUE? Wow...  TIL",
         "EXACTLY.",
         "I am talking about modern slavery where people work for boarding and food rations only.  I remember stories of the past where people will bring their Nanny on a Nanny Visa to the states and when they were interviewed on how much they got paid, they were confused.",
         "I don’t have an issue with putting criminals to work. I work everyday. Lounging about a cell isn’t good mentally or physically. So long as the conditions are humane, I have no issues with involuntary labor - with one caveat. The state should not make $$ from it. Can’t incentive the state to grow inmate population. But you can ensure those who are incarcerated are being productive members of society even if it isn’t by choice - it’s a punishment.",
         "![gif](giphy|lXu72d4iKwqek)",
         "I guess giving someone options of community services vs jail would make it not involuntary.",
         "They should have the option to work for wages, which goes straight to paying off their expenses. Anything they make on top of that they can keep when they are released. ",
         "They should have the option to work for wages, which goes straight to paying off their expenses. Anything they make on top of that they can keep when they are released. ",
         "I don’t have an issue with putting inmates who want to work, to work. What I have an issue with is involuntary labor being punishment. Punishment and involuntary are the key words for me.",
         "What about saving money? California, for instance, uses prisoners for fire fighting efforts and saves an incredible amount of money by effectively not paying them",
         "This is how you end up forcing prisoners to move couriers from one side of the yard to the other all day",
         "I can dig it. Maybe I’m overthinking it but I feel like community service should have been mentioned specifically to avoid confusion.",
         "Should they be given food if they don't work? What about the guards wages?",
         "Can you explain how it's involuntary? What do they do to them if they refuse to do the work?",
         "Yes. Let’s let convicted felons decide what they want to do everyday.\n\nDude, it’s work and paying off a debt to society. Just send them to a country club next time with your line of thinking",
         "How does involuntary labor work in prisons? I’m curious. Do people get beat if they don’t meet rock breaking quotas or something? Or is it work in exchange of something?",
         "Let’s also be real. If you did a crime worthy of requiring work to reduce sentence you probably were not just arrested for a DUI",
         "They agree to it and they are paid by the reduction in their debt to society",
         "Legislators have to be the laziest group of human refuse imaginable. They have to write all these shitty vague laws on purpose because they always seem to go out of their way to make laws inefficient and terrible.",
         "Involuntary servitude as a punishment for crime. If you consent to community service that’s preferable. But if you don’t, we just sentence you to jail for the original crime. What this would actually do, is make it unconstitutional to punish an existing inmate for not consenting to work in the kitchen, for example.",
         "What a straw man 😂",
         "You can elect to work and get time taken off your sentence in return. If you don’t want to work no one makes you. If you like being in prison and just want to hang out with the boys no one is going to force you to work.",
         "In Georgia you work an assigned detail. Refusal results in segregation and transfer to a higher security facility. Usually a real shitty one because administration is spiteful. Work does not decrease sentence",
         "It's California though, your crime could be murder or it could just be growing fungi. It's a slippery slope when the state is the arbiter of what's \"bad enough\" to warrant involuntary work",
         "[deleted]",
         "That's for voluntary labor though. By definition, involuntary labor is not inherently agreed to",
         "You’re not wrong. Intentionally vague describes most of our nation’s laws.",
         "Which is ridiculous. And why it will hopefully never pass.\n\nTo a certain extent, you have relinquished your rights when you decided to violate the rights of someone else (the victim)…which is why you are in prison \n\nSo I don’t follow you here",
         "How? Lol. It’s directly addressing your point.\n\nDo you know what a Strawman is?",
         "In Louisiana they have a work release program that basically allows inmates to work outside in the real world with everyone else. Granted it's usually factory work. I worked with a few of them at a Chicken processing plant for a few years and I'll be completely honest that job sucked so bad my hands killed me every day worst job ever. However these guys didn't get time off of there sentences the only perk was they got paid and didn't spend their entire day in lockup.  They only received $2 an hour of their pay. The company pays minimum wage but the Parish  takes all but the $2 an hour to cover room and board at the jail. Now I actually agree with this mostly. The problem is if your prisoner is working then you shouldn't be getting the same amount of tax dollars to cover that inmate from the state. But they do so they try and have as many inmates as possible on work release so they can take in the extra money from their wages.",
         "Gotcha. Makes sense.",
         "Funny how you use a crime as wide as one day in jail to murder in your argument. You came in here spewing a stat way off the context of the conversation. Leave troll",
         "exapmle: \nyou have an ounce of weed on you for personal use\n\nsituation: \nyou smell like it and a cop searches you, arrests you, and takes your weed\n\nconsequence: slave for the state for 5 years\n\nnot all crimes especially in this shitty country have a victim",
         "You over simplified the fuck out of what I said haha",
         "Sounds rough. But they also worked for their wages",
         "[deleted]",
         "Uhhh…that’s a 6 month sentence, and a fine, AT WORST.\n\nNobody does prison time for “just weed” anymore. I hate to break it to you.\n\nAnd the majority of people in prison, are violent. (Just facts)\n\nSo while I totally appreciate where you are trying to go here, it just isn’t reality and not the kind of situation that frequently happens anymore.",
         "Well, yeah. Simple is better.\n\nBut that’s not a strawman, bro.",
         "Let’s complicate things then. When my dad worked for the prison system the cost per inmate to the taxpayers was about 35k per year depending on the security level of the prison. It’s a little higher now but that’s the last definitive number I have. Correctional Industries uses inmate labor to offset some of those costs. They are literally paying a debt to society. There are definitely problems with how our prison system operates but forcing inmates to work isn’t one of them. Especially since it goes directly towards the burden of keeping them incarcerated. They have a debt to pay and giving them free room and board with tons of free time shouldn’t solely rest on my tax dollars",
         "I'm glad they have the opportunity to do that. My complaint is the parish is double dipping. If an inmate is able and willing to work and generate cash flow to pay for their \"room & board\" typically these guys work 10 hours shifts 6 days a week that's around 430 a week before taxes so the parish keeps about 300 a week of their wages so 1200 a month seems to be plenty of money to cover one person.why must the taxpayers also pay for that person as well.",
         "The fuk? It was used as an example to the argument. You are 100% trolling",
         "obviously my comment was an exaggeration but there are hundreds of crimes that are victimless and carry huge sentences \npossessing “illegal” firearms\nrunning a gambling business \ndrug trafficking",
         "You can be forced to work in a county jail too. \n\nAnd source on most prisoners being violent?"
      ]
   },
   "1gklzpw": {
      "title": "Ladies and gentlemen, Edward Snowden. ",
      "text": "",
      "comments": [
         "Cats are a horrible analogy for the libertarian party. My cat is a dick.",
         "Is this a real libertarian group? I was just banned from another for defending my 3rd party vote",
         "Someone help me understand this",
         "People don't fear libertarians.  They hate them.  Because most people have a religious faith in government to protect them and take care of them.  And the Libertarian stance calls that faith into question, causing cognitive dissonance, which is painful.   And hatred is the result.",
         "Being left alone is their fear along with the fear of what their neighbors will do with freedom.",
         "Something something selfish ideology something something",
         "Libertarian party leaving you alone sometimes equates to getting rid of the police force to hire private contractors, there are terrible ideas on this side too",
         "That's easy the dems (and Rs) have committed a significant effort in destroying this country and indoctrinating people.",
         "The fear comes from people’s own insecurities about self reliance and responsibility",
         "Porcupine is a better animal comparison",
         "People equate Mcarthyism to Libertarianism and look no further than that.",
         "They either love you or hate you and you never know which one it is and can flip sides at any moment.",
         "They're afraid because instead of siding on an issue, we want to take away their right to make those issues exist.",
         "🤣",
         "I almost got banned from this sub by making a cat reference one time:/. Libertarians DO NOT LIKE HOUSE CAT JOKES.",
         "had me until \"cats.\"  big cats will stalk you and kill you with no relent and no remorse.",
         "Imagine thinking your singular vote will impact the outcome of any election. It's like saying not to pass in the ocean because it could change ph balance and kill the fish.",
         "I think Democrats WANT to be governed. And the handouts. They loooove their handouts.",
         "Cats? Like the ones who annihilate local bird and rodent populations, piss nearly pure ammonia to destroy plants (and thus pollinator populations), breed with wild abandon, and become incredibly territorial and violent at random?\n\nIf the libertarian party wants to stop funding animal control, then yes, I am afraid. I was a libertarian once when I was young. As I've gotten older, I just want a libertarian voice in the conversation of people who ensure my comfort.",
         "There are some REALLY big cats out there...just say'n",
         "yea until the oligarchy comes and replaces the libertarians. I'm sure unrestricted capitalism will go wonderfully. Korea definitely doesn't have a problem like that :)",
         "Yeah, but organizing libertarians is like herding cats.",
         "I don't kill 200 small mammals every year if I'm left outside.",
         "Yeah while they may like to nap they do not follow the NAP",
         "Yeah my cat ass-Sprays me while I’m working on the car.",
         "Is more like being scared of a gecko",
         "A lot of non-libertarian traffic here. Which sub banned you for defending your vote? I'm vociferous about not voting for Kamala or Donald.",
         "This sub is sort of libertarian but a lot of republicans and anarchists seem to be members",
         "I mean, I got banned from the meme one because I dared to defend bodily autonomy for women in the same way everyone was up in arms about vaccines. \n\nI get the argument against abortion, and morally I agree with it. Apparently applying the same logic to bodily autonomy to both abortion and vaccines was too much for them. \n\nAnd I know they’re different, I just don’t believe the State has a right to tell people what they can’t do with their body.",
         "I'm not libertarian, but I agree with some ideas. The group here is at least open to reasonable discussion, and even when they internally disagree the conversation seems to be respectful form what I've seen.\n\nIt's not like a \"100% libertarian ideas or you can go die\" group.",
         "I'm not a libertarian and I get along just fine around here.",
         "I got banned from there like 3 weeks ago for commenting on a pro trump meme and saying that the people posting all the pro trump stuff are just republicans too afraid to admit they are. I tried to message and ask why I was banned and never got a response.",
         "He doesn’t understand why a political philosophy based on leaving people free to do as they please is a hard sell. \n\nBut it makes sense if you think about it. Most people don’t want to be left alone, they want to be taken care of. And they don’t want to leave other people alone, they want to control them. Because most people are not self sufficient, responsible, or tolerant people. If they were, libertarianism would be a much easier sell.",
         "I Agree",
         "Short of an overwhelming supermajority of incredibly ideologically consistent libertarians at all 3 levels of government, it’d be impossible to get the society you’re worried about\n\nA strong libertarian minority playing “kingmaker” in exchange for concessions from more traditional establishment parties would basically just be a moderating force leading to fewer people rather than more being ground up under the boot of the State each year",
         "I've never heard of anyone conflating McCarthyism and Libertarianism.",
         "Never heard of that comparison.\n\nWhat is a problem is how both parties agree on one item and that’s keeping libertarians off of ballots.\n\nBallot access has been an issue for years for the libertarian party and both Rs and Ds have gone to great lengths to refuse ballot access",
         "So really, everyone *else* is the cat",
         "That's because everyone else isn't a *real* libertarian like me!",
         "That's a feature, not a bug.",
         "Cats suck ass.\n\nNo wonder the movement isn’t catching on\n\nIf bet if we were herding dogs? 5X world election champs, THE LIBERTARIAN PARTTYYYYYYYY",
         "Damn hunting seasons.",
         "r/libertarianmeme \n Someone shared something calling a 3rd party votes a waste. I simply stated it was a weird sub to choose for being against 3rd party voters.",
         "I like to make that comparison too. But I also add in infant male circumcision and conscription (Selective Service). Bodily autonomy for me, but not for thee...",
         "A better way, is to just enjoy the meme. Yaaaassss",
         "![gif](giphy|f4IlrIxdBqw7kamU5T)",
         "I told them I was emailing Spike and that he would then tell his wife. I think I have them on the ropes.",
         "And also because a lot of people actively want to tell others what to do.",
         "Thanks. Misinterpreted “fear of libertarians”. Makes sense now",
         "For some reason its pretty common.",
         "*an indoor cat",
         "Ask four Libertarians their opinion and you will get five diferent  replies.",
         "Sure thing, Pinko.",
         "Right to jail.  That language is totally verboten.  How dare you criticize a criticizer.  /s",
         "Libertarianmeme is basically republicanechochamber now. This sub has been a lot better recently.\n\nI got permabanned for posting a \"meta meme\" because apparently a libertarian meme subreddit has a bunch of rules? Doesn't make sense to me",
         "I don't live in a swing state so I would say not voting 3rd party is a waste of a vote.  Won't happen this time either but hitting 5% would be awesome.",
         "Ha! Welcome to the club. Banned from there as well for saying conservative memes are annoying.",
         "I unsubbed from there months ago. It was always more right-leaning, but it was nonstop trumpism in the past 4 or 5 months.",
         "I thought not being sheep is a good thing.",
         "They're red af right now. A bunch of disaffected left-leaning independents will decide they are Libertarian soon and flock to any Libertarian sub and this sub will swing blue, while the meme sub balances out.\n\nThis sub has been comfortably balanced lately but I'll need to find a new home once the Trump hate moves in."
      ]
   },
   "1gkqer8": {
      "title": "how is everyone NOT excited about RON FREAKIN PAUL being called into the admin",
      "text": "AUDIT THE FED PLEASE !!\n\nI LOVE RON PAUL .. i canvassed for him and supported the hell out of him .. he had TRUE grass roots following AND HE IS POTENTIALLY GOING TO BE A PART OF THE ADMIN!\n\nARE YOU KIDDING ME!?!?!?!?!?!",
      "comments": [
         "I’ll say this as a 2014-2019 Marine when General Mattis was brought on as SecDef.\n\nI guarantee it’ll be short lived when the person you (rightfully) worship doesn’t get along with the Trump admin. But I’ll take any amount of Ron Paul at any level with the Federal Government",
         "Do you actually think trump will follow through? Even if he does he will probably just fire him over some stupid thibg",
         "I’m skeptical anything is going to happen. I think it was a ploy by Trump to get independents to vote for him. I don’t think Trump has much desire to slash the government.",
         "For me, it's the lack of consistency that the Trump administration has. I fear he is just using Ron Paul as a way to get the Libertarians to vote for him and nothing more.",
         "Bc he's 89 years old. It's clearly a gimmick",
         "Because I don't trust Trump for shit. I'll believe it when I actually see it, and not a second before. Trump is a fucking scumbag who isn't fit to shine Ron's shoes.",
         "Lol trump isn’t cutting the size of government.  He is a big believer in big government and big government spending as shown when he actually governed and grew government more than anyone before him.",
         "Ron Paul is at the age where he could drop dead any day. What makes you think he will have any influence at all and this isn’t just Trump/Elon just pandering for more votes?",
         "Because it's still the Republicans in office and they're still beholden to their own masters. We got some candy, not dinner. ",
         "We will get excited when he actually gets the axe in his hand and chops something. Libertarians are a skeptical bunch, for good reason.",
         "Can he have Javier Milei move to the US for a cabinet position? How about he takes his advice... that would be frigging awesome!!",
         "Ron Paul involved to any degree with the federal government is a win",
         "End the fed! Ron Paul 2012!",
         "Well he hasn't yet or did I miss something",
         "Got Ron Paul on people's radar again. That's a huge plus for our party!",
         "How is Ron Paul doing these days?\n\nI remember him having a stroke on a live TV or livestream or something 4 or 5 years ago.\n\nHopefully he's well and could be effective.",
         "He is 89 years old, and Trump can either be lying or he's going to choose him and then change him after 1 year or so",
         "It won’t happen. Empty promise that they don’t intend to keep.",
         "Chase Oliver getting 400,000 votes really showing the system who is boss 😂😂😂",
         "Excited about a politicians promise? I’ll hold the excitement for now.",
         "It's not that we don't want Ron Paul, it's that we don't trust Trump to actually do anything he says",
         "I kinda doubt this will happen plus to be fair Paul is getting a little long in the tooth \n\nAmazing guy but still we all have our time",
         "It's the only positive thing I've seen in politics for decades",
         "Trump will audit the fed in the same manner he released those Kennedy docs.",
         "It's the only thing that got me to vote the way I did. Better some influence than none at all.",
         "I’ll believe it when I see it. There are always a lot of promises made during a campaign that don’t actually happen. \n\nHe’ll get shelved. Trump is a liar.",
         "Love me some Ron Paul, but the man is almost 90 and I haven't really heard much from him in 10 years.",
         "We will see if he does the same thing he did to Jeff Sessions",
         "no way! he was amazing back in the 90’s",
         "I really hope that happens! Like would be incredibly excited if it does! I can imagine he'll be an advisor to the president, of some sort, so I don't think he'll be touching any military things.",
         "Oh, we ARE FUCKING EXCITED, BABY!\n\nBeen waiting many years for something like this to finally happen.",
         "Orange man can go piss himself in a corner somewhere. \n\nSuper excited to think about ron paul being part of the admin tho. If irangey can hire him to start shutting down fed agencies and audit the fed it will be an amazing thing to watch.",
         "Excited??? I just popped!!!!!!!!!!!!!!!!!!!",
         "I'll believe it when I see it.",
         "Elon and Ron Paul cleaning house!!!!! \n\n\nI'm practically foaming at the mouth for it!",
         "Simply put as everyone has already stated,  IF it happens - great. Chances he utilizes him even then, very little.",
         "Super excited!",
         "Because it hasnt happened yet. It's only words at this point. Once its action i will get excited.",
         "…this didn’t age well 😆 \n\n“I reject Ron Paul and I am #sorrynotsorry about it.”",
         "Trump is Trump. Everything is about him and loyalty to him. I don’t think Ron Paul will have much room to maneuver in that environment.",
         "Because Trump and Elon are attached? Not a hard concept to grasp.",
         "Sorry Chase but this was the right decision.",
         "Anybody remember the revolving door of his last cabinet? Some of them like Gen Mattis didn't have time for his chair to get warm before he was out of it.",
         "I have a bridge I’d like to sell you.",
         "Ron Paul (and his supporters) deserve every bit of it. Absolute legends",
         "quiet hand raise...I am excited.",
         "I’m with you.  Having watched him get screwed on the primary stage. This is amazing.  Every one who is contrary is too immature to grasp what is going on or a kamala supporter.  No in between.  Those who choose to remain skeptical are fine, but have to be willing to admit that if even 10% of what we’ve been promised is delivered, it will be the most libertarian administration in US history.",
         "I’m excited that Kennedy will be able to have cart Blanche and can make some real health changes that will help a lot of people.",
         "you guys are all very very bitter lol",
         "Yeah this only came out a couple of days before the election to drum up libertarian support it might not even happen",
         "I think Doge-man will be running interference...",
         "As a fellow autist from 2008-2013 I feel your pain.",
         "Hopefully it is Ron Paul, talking to Elon Musk.  Trump seems to be very influenced and will listen to someone like musk.",
         "You are right\n\nBut even a week of Ron on the job will do us all much greater good, let alone imagine a month, a year",
         "Mattis was absolutely terrible, he resigned because he was upset that Trump wasn't enough of a warmonger, specifically that he wanted to withdraw from Syria",
         "Let's see how he treats angela.",
         "Exactly this",
         "It wasn’t even Trump that said it, it was Elon riffing in a tweet.",
         "Ron Paul is anti establishment we good",
         "Trump already had a term and I don't know why people keep thinking its gonna be any different...",
         "Elon did it bud",
         "That's the oldest trick in the book but I have some hope it doesn't happen",
         "Trump is a business man, and can be convinced if it's either profitable or good for the American people. I'm sure Ron can influence him, when he has his ear.",
         "That first term. However shi don’t happen over night. Look at Vivek he literally very libertarian. So much better then most republican. And trump like him. Trump also endorsed Javier millei in Argentina and Javier is definitely different then him when it comes to to policy",
         "So is trump",
         "That's my thought as well. I love Ron Paul as much as anyone, but who I really want is some forensic accountant who is just old enough to have the experience to know what to do, while being young enough to work the 15 hour days for months on end tracing every transaction.",
         "Well said",
         "The Machine is gonna Machine. \n\nThat said, the absolute meltdown on Federal employees subreddits is kinda intriguing. They're worried.",
         "the tree remembers what the axe forgets \n\n\n..... give ron paul that government axe !",
         "trump isn't president yet buddy",
         "I saw a lot of libertarian reps on the ballot this election. Compared to my last 5 elections I'd say there's solid growth. We might get a seat on senate in the near future, relatively speaking.",
         "He still does his show to this day and seems to have better mental acuity than people half his age, to be honest.",
         "Omg really? I was looking for how much votes he got. Where did you find that?",
         "I hope he’s in the equation. Normalize a divine hatred for waste.",
         "This. Trump famously runs off at the mouth every chance he gets. As soon as Ron wants to cut one of Trump's buddies sacred cows it'll blow up into a shit storm. The good news is Ron will absolutely not back down and say what he thinks, and it will all be very public. So I do have just the tiniest sliver of cautious optimism if it happens.",
         "It will not happen. Elon Musk (not even Trump) mentioned it in a tweet… so not even a campaign promise, and we all know how believable campaign promises are.",
         "You're probably right. Best to hope though.",
         "I hate that you might be right.  Although Trump generally did what he said he would do last go-round.",
         "Shit was euphoric at the time when it was the three headed monster of General Kelly, Mattis, and Dunford. And that quickly petered out lol",
         "I’ll always have a soft spot in my heart for Mattis strictly from a Marine perspective.\n\nI don’t hate him because he always advocated for a military solution to questions, it’s literally his entire MO and background as an infantry Officer turned General turned SecDef. He’s not some career politician like Lindsey Graham, the Cheneys, or Hillary who are bought and paid for by the Defense Industry.",
         "Yeah one has got to wonder why republicans don't cut government spending when they actually have the power to do so (the governors, too, benefit from big government and high taxes).",
         "Not just a full term, but he also had a trifecta for 2 years. He could have passed spending cuts if he wanted to. Instead he passed 1 tax cut and increased spending. Anyone thinking that 89 year old Ron Paul would actually do anything is deluded.",
         "I ask the same of people who thought Kamala Harris would do anything different. She even said she wouldn't. We were kind of doomed no matter who won.",
         "Not saying anything for or against the guy, but typically, a President's second term accomplishes more, because they don't have to worry about a re-election. Here's hoping this is true again.",
         "The only thing I wonder is that this time around it'll be a lame duck. He doesn't have to worry about reelection and could therefore be a lot more direct with some of his policies.",
         "Maybe the lawsuits and the assassinations attempts might make things be different?",
         "I would not be surprised to see a fallout between the two of them. Just look at how things turned out with his last administration. Could absolutely see Trump turning on Elon and blaming him for something",
         "!remindme 3 months",
         "Most people would not like the idea of appealing the civil right act. They just don’t. So I won’t be surprise if someone can if most people couldn’t vote",
         "It not that. Trump have to appealed to massive so if most people couldn’t vote Trump would probably have more libertarian policy",
         "Trump is 89 years old? News to me.",
         "Now he is",
         "And in 500 short years, maybe 2!",
         "Look at the google election results. It’s like 500k now. Less than RFK who isn’t even running.",
         "repealing the Civil rights act? what? did he say that?",
         "One doesn’t need to be 89 to be at an age where they are more likely to drop dead at any moment",
         "Oh dang I see 560,000. Oh shit lol",
         "In 2020 the libs got 34,000",
         "yes Ron Paul has said that he doesn't believe the civil rights act was necessary and was an unnecessary intrusion into the private world:  https://www.lewrockwell.com/2004/07/ron-paul/the-trouble-with-the-64-civil-rights-act/",
         "> One doesn’t need to be 89 to be at an age where they are more likely to drop dead at any moment\n\nthis is correct .. Coolio died while taking a shit at the age of 52 because he pushed too hard and had an aneurysm ... or something like that \n\ndrink your fiber gents!",
         "An 89 yr old can expect 4 years. A 78 year old can expect 9 years. It gets more likely as you age.",
         "I’m just asking, did you read what his message was? His points weren’t wrong, and he’s always been about removing from and not adding to the government. The smaller the the fed the better, and freedoms granted to us in the constitution are more important than virtue signaling. Because that’s what laws like these are. They restrict liberty and promote more hate than they quell. Real change doesn’t come from a law, it comes from the combined effort of the people to change a opinion and shift societial views for the better.",
         "Yes I've read it, but at this point I don't care about idealistic virtues.  We haven't tried to be a better society in 60 years.  Our democracy is being eroded and the majority of people seem okay with ceding it to aristocrats and oligarchs.  The only direction views have shifted is towards despotism and away from liberty.  A bunch of 'do nothing' congresses have only made the situation worse.  \n\nMy ideals still align with a lot of Paul's, but I don't think anything other than extraordinary efforts towards education, limitations of capital in politics, and congress doing its job will slow the decay in the short term.   I also don't think going straight to idealistic anarchy is going to fix the massive wealth gap either, but only intensify the disparity in power.\n\nP.S. Rights are not granted.  Rights are inherent."
      ]
   },
   "1gkorz9": {
      "title": "In honor of 🥜 the 🐿️ ",
      "text": "",
      "comments": [
         "#JusticeForPeanut",
         "Context?",
         "Im also OoTL, from my understanding this has always been the law when it comes to exotic animals kept as pets. \n\nI remember reading about a lady in Georgia who kept pet raccoons, one of them bit someone and they had to come euthanize the animal and remove it's head to verify it didn't have rabies.",
         "🙏",
         "P'nut, a squirrel pet that a guy rehabilitated and took in as his pet. He made frequent tiktoks with the squirrel that earned hundreds of thousands of views and followers. The police ransacked his apartment, confiscated P'nut and euthanized it because he didn't have a permit to rehabilitate wildlife.\n\nEdit: I may be wrong here, but I don't think it was NYPD. Pretty sure the guy lived upstate somewhere.",
         "Raccoons are extremely likely to have rabies.  The incubation period is typically 2-3 months, but it can be up to 2 years for Raccoons in rare cases. \n \nSo if you take in wild raccoons they can seem perfectly healthy, but can turn on you surprisingly fast and with little warning.  So it is something you need to be aware of when you are around them.\n\nIt isn't true for all animals though.  For example Opossums they are very resistant to rabies because of their low metabolism.  The virus that causes rabies has a very hard time growing in them.  They can get the disease from a infection, but it is very rare. \n\n\nAlso cutting-off-the-head to check for rabies is something they do for any susceptible animal that bites a human.  Squirrel, bat, cat, dog, etc.  That is normal procedure.\n\nNone of that is really a issue here.\n\n------------------------------------------------------\n\nThe problem is that this was a case of blind and violent bureaucracy failing to use judgement and treat other people like humans.  They have rules, they apply the rules sans judgement, and are quite proud of themselves for doing it. \n\nAny sort of \"Zero tolerance\" approach to government results in this sort of brutish unfeeling illogical behavior.  At that point the people in charge are less human and more android.  They are just acting as automatons carrying out hard coded instructions without feeling, remorse, or reason.  \n\nKeeping squirrels as pets are actually pretty common.  It isn't a \"exotic\" pet in the same way that a tiger or cobra is.  It wasn't a threat to anybody. \n\nThe destruction of the man's home and family is just a result of a busybody neighbor complaining to a unfeeling unthinking state bureaucracy.",
         "I don't agree with the destruction of his home and the killing of his pets but the fact he was running a wildlife rescue illegally and posting for the world to see.... he kind of opened himself up to this happening.",
         "He had the pets for 7 years I heard though"
      ]
   },
   "1gl0nex": {
      "title": "Dave Smith calls out Netanyahu for propping up Hamas",
      "text": "",
      "comments": [
         "Link to original?"
      ]
   },
   "1gkhvqu": {
      "title": "Smaller government = happy life",
      "text": "",
      "comments": [
         "I want a government so small I don't care who wins.",
         "![gif](giphy|z3HFoEzXCMykr4L0TB|downsized)",
         "I want a truly small government. Not this state government bullshit the statist pseudo Libertarians are peddling. If it's bigger than the famously authoritarian Singaporean government, it's not a small government.",
         "So.  Defund the police ?",
         "0 government= happy life",
         "What our tax dollars are going to btw",
         "Be nice if they shrunk govt and the spending enough to start paying down the debt every year",
         "The USA should be 50 tiny governments. The only large part should be a military budget that could fight God.",
         "That's actually a huge point. Part of the reason the partisan divide is getting more and more fervent is that government intrudes too much, so the elections matter too much. We won't heal until the size of government is checked, and unfortunately I don't see that happening until a major crisis. ",
         "beautifully put",
         "If they change some laws along with it, sure to a decent degree. If people are allowed to actually defend themselves and their property with little to no oversight, or fear of prosecution. There are more good people than bad, no holds barred, I think society will figure itself out with a much smaller police force. \n\nBy no means am I suggesting abolishing police, but to be so utterly dependent on them is pretty ridiculous. If someone is stealing something from my private property in my state (Washington) I'm not legally allowed to do anything physically. That's just dumb. We've swung too far in that direction."
      ]
   },
   "1gksy2s": {
      "title": "It took one of the worst libertarian performances to get ron Paul into the white house",
      "text": "Congratulations to Oliver, he's helped get a true libertarian into what's hopefully a position to cut this bloated government ",
      "comments": [
         "Do you guys really believe Ron Paul is going to be able to do anything in the Trump administration? I’ll believe it when I see it, but some of you are acting like Ron Paul was elected president because of a tweet between Ron Paul and Elon Musk.",
         "I can't believe I am in a timeline where I get to see Ron Paul AUDIT THE F UCKING FEDERAL RESERVE\n\n![gif](giphy|vv41HlvfogHAY|downsized)",
         "I’m surprised at how sure everyone is about this happening. These are politicians we’re talking about here.",
         "Not gonna get my hopes up. Now hing is confirmed. But this is definitely the closest we have ever been to an overhaul of the financial system as Ron Paul taught us about.\n\nI am actually excited to see how this presidency goes.",
         "chase oliver, the reverse spoiler hero",
         "This will not happen and Trump will install a new fed chair that will go back to buying up MBS and UST, I guarantee it",
         "Oliver was so bad that Rfk still got more votes then him even though Rfk is off most ballots",
         "Trump actively courted Libertarians this time around. 1-3% of the vote matters. \n\nI am not going to hold my breath though. The guy is a fraud.",
         "People are so dumb, I'm sorry. Ron Paul will not be part of the administration, and even if he was he's not the yes guy that Trump wants so he would never listen to anything he says.",
         "Yeah, weird times",
         "I'd be surprised if he ever even sets foot inside white house for even a photo op",
         "They got conned. Maybe I will be wrong but if any of these people are over 30 they should know better. Since Trump can't have another term, they will push the con to another guy and everyone will fall for it again",
         "No he’s not lmao people are gullible here",
         "No, he is just too old and he declined any official position already. I am very sure he would act as an 'advisor'—like you call him up and he will answer some questions—but that's about it. It is a sham that he would be more than that, and he also stated his positions on things are already well known.",
         "Likely not. It's wishful thinking. All Ron said was that he was willing to chat with Elon about his idea. I'm sure that is true. It isn't a promise of a cabinet position. \n\nI hope that Ron does manage to get his ideas in the ear of folks willing to run with them, but the guy's up there in age. He deserves his retirement.",
         "I hope so",
         "For me, this is honestly the best part of the whole election.",
         "Not gonna happen. Hope I’m wrong.",
         "Assuming any of this actually happens, let’s hope Ron Paul can talk some sense into Trump and educate him on tariffs too.",
         "The hero nobody wanted… and possibly the one nobody deserved. 😂",
         "Surprised the good doctor even replied. I know he still massively disagrees with Trump and much of what Trump has done.\n\nI also know he has always been open to coalitions for progress wherever he can take it, but responding to a tweet days before election seems so political and calculated.\n\nAlas, if Ron taught me anything, it's to never trust a politician. Even him.\n\nBuild decentralized systems that don't rely on CEOs. Empower your local governments over state and federal. Find solutions that don't require electing a good-actor or subscribing to a good CEO. These things exist and people of this sub should be champions of them.",
         "It’s the only important part of this election",
         "I have high doubts it happens. The man is 89 years old. He deserves to retire.\n\nHe's already denied an official position. But one can dream :)",
         "No way. You don't teach an 78 year old like Trump new tricks. His platform is tariffs and always will be.",
         "Never gonna happen. Trump is only going to get the biggest sycophants and yes men humanly possible.",
         "It's an important one, but hard disagree on the only important part. Freedom-loving appointees throughout government, libertarian-leaning policies, federal judges, etc. all portend well for liberty in the U.S.",
         "Only if DJT keeps his word... so we shall see."
      ]
   },
   "1gl23p8": {
      "title": "Which country are we telling our grieving socialist friends to move to so they can set up the Un-Free State Project and live in a workers paradise?",
      "text": "Cuba? Venezuela? People's Democratic Republic of Algeria?   Where will their demands for more government not be ignored?",
      "comments": [
         "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "China, Venezuela, North Korea. \n\nIn all seriousness Spain is probably good.  \n\nAlthough most American ultra-lefts are going to have a hard time dealing with majority white country that speaks Spanish.  That level of nuance and understanding to cope with something other then American race-based politics is beyond most of them. It is essentially a religion and being around other people who don't look at everything through the same lens will cause them extreme discomfort.",
         "Cuba, hands down.",
         "Always Canada.",
         "I think Bono said he would drive his car off a cliff if trump won... where can I live stream it?",
         "North Korea",
         "I don't allow their kind of negativity in my life to begin with 🤣😂",
         "Ukraine or Palestine would be perfect.",
         "Liberia",
         "Somewhere without squirrels 🐿️",
         "Gaza. Fight the evil Zionists.",
         "I hear Yemen is lovely this time of year.",
         "Put them in a time machine and send them back to the USSR.",
         "South Africa sounds like a good fit.",
         "Haiti. I'm sure they'll be able to solve civil war and set up utopia",
         "Straight to Brazil.\n\nDo not pass \"Go\".\n\nDo not collect $200.",
         "I'm willing to trade citizenship. I have a nice place for trade in shithole quebec. You get twice the tax rate, amongst the worst housing crisis in the world, extreme immigration problem from india and non-existent healthcare.",
         "I headed North Korea’s a good pick",
         "Wait until they find out other countries are more strict with immigration lol",
         "When they are in a country that speaks Spanish but isn't Latino: \"What place is this?\"",
         "Spain has a pretty yucky racism problem, like actual hateful behavior towards darker skinned people. Look at how they treat some of the black soccer players in LaLiga",
         "Please, no. We're at capacity.",
         "My vote is Iran or China. \n\nUkrainian people are actually very nice. It’s not their fault they were invaded. Their leader is looking out for them by grifting any money he can get from the Warhawk’s in our country (plus a little tucked away for himself).\n\nIn any case no need to inflict them with our problems",
         "And ACTUALLY racist"
      ]
   },
   "1gl0qxk": {
      "title": "US foreign policy be like",
      "text": "",
      "comments": []
   },
   "1gky5dm": {
      "title": "We did not do well this year. ",
      "text": "As of right now, Jill Stein and RFK Jr. have more votes than Chase Oliver. We need to put out better candidates. My first election was Gary Johnson, he was a great candidate and that year it felt like we had a chance to get on the stage and debate. We have to do better next election cycle. ",
      "comments": [
         "If Paul actually gets a role in cabinet that is a huge success.",
         "More of us need to get involved in nominating the Libertarian candidate. I honestly don't know how Chase made it as far as he did.",
         "Dave Smith is the only runnable candidate I've seen since Ron Paul, and he announced he would not pursue the libertarian nomination for personal family reasons. So we got an incredibly weak candidate instead. Perhaps in 2028 he could be convinced?",
         "Just means if you voted libertarian you’re part of an even more exclusive club 👍",
         "Don Kissick outperformed Trump massively in Ohio. Still only 3.4%, but that's a bit telling since that senate race was critical for both parties whereas Trump was more or less a lock from the get-go. I can't imagine there are that many libertarians who genuinely think Trump is better than Moreno, and that means a lot of people won't even lodge a protest vote with Oliver.",
         "They didn't even make the ballot in my state. Hard to get votes if you have to write in.",
         "We'll do better once the party doesn't elect Democrats posing as Libertarians.",
         "On a plus side Ron Paul hopefully gets his shot with musk.\n\n![gif](giphy|5mBE2MiMVFITS)",
         "The LP is a massive joke.  They roll out this failed Democrat.  I voted for him only for the final tally.",
         "You had better candidates, you voted for a woke liberal instead of a libertarian.",
         "Couldn't even vote Chase Oliver in Illinois.",
         ">campaign a candidate who deserves a 6th place finish\n\n>candidate finishes in 6th place\n\nOr 5th.  Or 7th.  Idk, idc.",
         "Dude, Libertarians are able to influence the nation more than ever with Trump in office. RFK Jr will be unleashed on the FDA, and Ron Paul may have a significant role in DOGE!",
         "Think he will. Libertarians voted for Trump. It’s on Trump and his team to honor their word.",
         "💯",
         "I love Dave Smith and think he has a lot of qualities that would make him a great candidate. I am however worried that if he starts gaining any traction, he'd be way too easy to attack in a way that makes him a complete non-starter for a lot of people. Like imagine the headlines of, \"Libertarian Party runs candidate who heald a 'Bill Cosby rape victim beauty pageant' on his podcast.\"",
         "![gif](giphy|6uGhT1O4sxpi8|downsized)\n\nMe after voting libertarian and seeing the abysmal numbers",
         "This ⬆️ 💯",
         "That’s why I left the party. I’m a strong believer in libertarian values, but the party itself is just a disaster. Remember when they nominated Bill Weld for VP, which was already bizarre given he was in no way libertarian, and then the dumbass literally endorsed Clinton on national television. They’re just a bunch of clowns.",
         "No, there wasn't. You can look at the vote—the other one was Rectenwald which is who Mises leadership wanted. Weeks later, he says Jews run the country, the world, and are the biggest threat to freedom, he wants them exterminated etc several anti Judaism posts. If he had been our nominee, it is doubtful Trump 'works with us' as the LP would be shunned nationally as a racial-focused party. It would have somehow actually been worse.",
         "Yep, how the whole tariff and government spending situation plays out in the next 4 years is going to determine whether or not the next GOP candidate gets the same type of libertarian support in 2028.",
         "Yes, Trump and his team noted for keeping their word and paying their debts",
         "Dozens of us!"
      ]
   },
   "1gl2fyr": {
      "title": "Reminder from the people to the jesters",
      "text": "This election outcome should be a great reminder to so called celebrities that they are entertainers (at best) and not political advisors. They are merely court jesters to me and I couldn’t possibly care any less about who they think I should cast my ballot for. When the people follow the advice of the jesters the whole country is made a fool. ",
      "comments": [
         "Now release the Diddy tapes lol",
         "Are you sure? They make a lot of money which must mean they are very intelligent and capable and stuff. Their jobs are very important.",
         "In times like this I love to go jesting around Reddit and poke at insecurities. Raises peoples self awareness once they let their rage out on me.",
         "I view celebrities the same way they were viewed through most of history. I put them in the same area as prostitutes. Actors, comedians, writers, musicians ect is not important and does not make someone smart. They often tend to be really dumb people in fact.",
         "Duct tape, duck tape, masking tape and probably some scotch tape."
      ]
   },
   "1gkmtu4": {
      "title": "My favorite part watching the election results... ",
      "text": "When states get called with no or virtually no votes reported ",
      "comments": [
         "Tennesseean here, they did the same for Trump",
         "I'm not insulting your intelligence OP, but I think a lot of people watching the news don't realize that everything being reported is merely a prediction and that no state officially certifies its election results on election night.",
         "I’m willing to call Alabama for Trump with no exit polling data.   It’s not that damn hard  to know which way certain states will vote.   Bonus.  Utah will be Trump.    California Harris.   It’s why everyone says there are 7 states that will decide the election",
         "I’d call it too? It’s Maryland. It’ll be 65/35 Harris.",
         "WY and Utah were called immediately after polls closed, with 0% votes reported. Tbh seems fine, it’s obvious who’s going to win those states.",
         "Yeah, Maryland is...blue AF. It's dumb, but probably not wrong.",
         "Check Reuters election map, it’s a tad better than AP.",
         "I don't know why they don't call the race on the west coast",
         "That's the same way she got the nomination",
         "You ever hear of exit polling?",
         "jerking my shit to harris rn",
         "What makes it even better is right now Trump is up but none of this is official until it’s called",
         "She's just THAT good.... 🙄🙃",
         "But like...",
         "It's fun when it all ends in one night, and everyone thought it wouldn't.",
         "Such is life in California lmao. Wait hold up I just checked Young Kim won our district 😅 damn",
         "Yeah same in Washington",
         "That was a freebie, though. Even the Tennessee subreddit is right leaning, lol.",
         "Oh I know, I just enjoy watching states get called before reports come in, and then spend my night watching in case it flips lol",
         "I used to live in MDs 4th. It was between 80-90% D every time.",
         "I deliberately lie to those people. Just did today. ",
         "I mean with exit polling I would understand a lead, but this is supposed to be news.... 0 percent reporting should mean you can't call anything. A lead would make sense based on the exit polls. And in most cases the state will go that way.\n\nStill fun to see if any of those early calls flip",
         "Bro what?",
         "Comparing current map, he will have 264ish and she should have 274ish. If it follows 2020.",
         "Maryland isn’t a freebie either for the left? Doesn’t matter anymore regardless.",
         "If the state subreddit leans red, that's impressive.",
         "I'm in illinois and I called it to be democratic 20 years ago",
         "Some states the exit polling is so far in one direction the result is a certainty. Same this has happened with Utah, which has been called for Ttump with no results in, and California will be certainly called for Kamala the second polls close there.",
         "And how often has it flipped? I can’t recall any occurrence from a major news organization in the last several decades.",
         "I’m in Utah and it looked like this but for Trump",
         "Can confirm",
         "That's why they ask more than one person.",
         "free speech",
         "I think it was one of 5 that did. Someone made a map, lol.",
         "Google had it (briefly) red and I laughed out loud.",
         "Florida in gore vs bush",
         "Wincinsin 2012",
         "Fair enough, but I am sure there is a better person to jack it to",
         "had texas blue too",
         "It’s just how they get reported.  PA and Ohio were blue at first because the big cities report their votes first.  Happens all the time.",
         "So once in over 30 years? Hardly seems worth paying attention to.",
         "imma keep going now",
         "A case like Maryland obviously not, but Fox calling Arizona for Biden in 2020 waaay too early (in hindsight) was a pretty big deal",
         "You should check out AOC",
         "And that ended up being the result, right? No flip after the call. My point is these orgs have, historically, actually worked quite hard to vet these calls before publishing.",
         "Or Bernie, if you are into old dudes.  It's cool if you are.",
         "As a women who likes women but not politicians: AOC is beautiful... for a representative, I mean."
      ]
   },
   "1gkwqa8": {
      "title": "It was nice to see my vote count.",
      "text": "I know this probably isn't popular for a libertarian,, but I live in Pennsylvania and had voted for Johnson and Jorgensen in 2016 and 2020. \n\nHowever after seeing the Biden administration did the last four years and the utter shit candidate they were shoving down the country's throat in Kamala, I decided to vote for Trump. He is obviously far from perfect, but I am cautiously optimistic some of the more radical left policies will fade. \n\nI see it as a voting win as well, knowing that I had a small part in helping a crucial swing state flip back red.",
      "comments": [
         "I hope you’re right. I’m not looking forward to the tariff proposals. Trump is very anti free market.",
         "Fuck Donald Trump.  \n\nI got banned permanently from this sub for this comment.  ",
         "You literally voted for a guy who violated 1st and 2nd amendment rights, tried to violate state's rights by sending in the National Guard to Oregon, said we should repeal the Constitution when he lost, organized a coup, had a hand in repealing our right to privacy and women's autonomy over their own bodies, tanked the economy, and enacts authoritarian policies over and over again through EO. \n\nI thought libertarianism was the opposite of authoritarianism. I thought  libertarians loved small government, the free market, and the Bill of Rights. \n\nThe country just gave the authoritarians control of the executive, senate, (soon to be) house, and they already own the SC. \n\nThe next 4 years are going to be a shit show.",
         "Yeah, there was really no decent Libertarian candidate. I stayed home and didn't vote. Trump may be better than Harris, but he isn't good enough for me to make anh effort for him. But I can see why some would vote for him, so I'm not judging.",
         "A vote for Trump was a vote to resurrect Ron Paul.",
         "Same. PA resident. Voted Gary Johnson x2 and then Jo Jorgensen. Voted for trump this election. \n\nI guess we will see what happens.",
         "I'm pretty sure your vote counted a lot more because they blamed 3rd party voters in both those elections.   \n\nThey're having a hard time blaming voters this time around, but rest assured it's never going to be the fault of the candidate or the system that installed a candidate",
         "Good lad",
         "I feel the same, now we need to hold the new administration to account for what they will do for our country.  Same as any other.  Good job!",
         "Awesome job man",
         "To have the whole world looking at your swing state, county by county can definitely make you critically think what’s best for you. Don’t envy the stress swing states usually get during elections. I feel you still voted with a libertarian mindset.",
         "Same. Libertarian in WI. Voted Jo last time and decided to back up MAGA this year.  \n\nNow I just want to see action towards an overhaul.",
         "He’s using tariffs as a negotiation tool. Look at how other countries place tariffs on US goods, we are getting absolutely *screwed*. Then there’s the issue of companies moving their manufacturing outside the US and still expecting to benefit from being an American company. All the while, gutting our manufacturing sectors. That in itself is a national security nightmare, when our country can’t even manufacture our own crucial goods. Hell, we don’t even make our own pharmaceuticals. That’s insane.",
         "Hopefully anyone inside the Party would be cool enough to speak against it.",
         "Well not the like the other side would be better with wanting the government to take over whole industries (i.e., healthcare).\n\nIdeally we need more libertarian ideals, maybe if they hold true to the government efficiency and getting Ron Paul involved we could see small changes.",
         "Fuck Kamala Harris.",
         "Don't even bother trying... This sub is laughable. Prioritizing small government while ignoring the authoritarian leaning elephant in the room and then circle jerking themselves on how good they did.",
         "Tell me how Kamala would have been better on small gov, free markets and the bill of rights?",
         "We can hope. It's a least getting his name back into mix.",
         "I really don’t understand how anyone claiming to be a libertarian could vote for Trump. \n\nI get that Kamala is not a great candidate, but Trump doesn’t even believe in democracy and literally tried to install himself as president in the last election.\n\nJust about everything he has done is the opposite of libertarian values.",
         "At some point you have to vote with a \"me first mindset\". I'll repeat I know Trump isn't an ideal option but I know some of policy will help me and family more than Kamala, and that's not hypothetical, we were way better off 2016-2020 even with COVID than the past four years",
         "There are other ways to incentivize US companies to produce here other than manipulating the market and hurting consumers. It’s right up there with price fixing.\nI’m just surprised to see people in a libertarian sub being in support of tariffs.",
         "Agreed the other side would have issues as well, especially around price fixing. I am just pessimistic that this whole gov efficiency thing will actually happen, I’ll believe it when I see it.",
         "I agree.  ",
         "And seeing as how so many cast votes for Trump: statist bootlicking.\n\nWhat a joke.",
         "Back into the mix? I love me some Ron Paul but he’s 89 man lol",
         "Most people are illiterate on economics and ethics.",
         "It doesnt hurt the consumers. It forces companies to manufacture in US, bringing millions of jobs and pushing cost DOWN",
         "Maybe just as a name younger people can see and do some research and learn more about principles of liberty and libertarianism."
      ]
   },
   "1gkpnmi": {
      "title": "Chase Oliver Polling",
      "text": "I knew it was gonna be bad, figured under .5%, but holy shit Jill Stein is beating him in many states. What a loss of momentum. Not that it would have trabslated at the national stage, but normies did notice Gary Johnson and Jo Jorgenson polling \"very good\" for 3rd parties, and I think that matters.",
      "comments": [
         "I was so excited 4 years ago when someone would randomly ask \"who the hell is this jo jorgensen lady\". \n\nNever heard anyone ask who chase oliver is this year",
         "RFK Jr was beating Oliver in one state and he dropped out.",
         "I mean, if you tweet that you're \"not a Ron Paul libertarian,\" that's pretty damning.",
         "Maybe next election cycle we nominate someone we actually like? I was proud to vote for Mama Jo 4 years ago. The thought of voting for Chase just makes me feel like I'm actually wasting my vote.",
         "What momentum? He had less going for him than the Johnson race in 16.",
         "When you nearly lose to \"no one\", what do you expect to happen.",
         "The party does worse in close elections because it is much easier to vote 3rd party when your vote matters less",
         "I think this election cycle the press was so anti-Trump they weren't going to let anyone be heard about that might take a single vote from Kamala.  They were a LOT quieter about 3rd parties this year than I remember them ever being.",
         "Dude, he did worse than RFK, who dropped out. What a fucking clown.",
         "we didnt vote for him. try to keep up, terrible candidate and the party sabotaged itself",
         "Yes, but an understandable reason might be that there were a lot more libertarians this year who felt they were in a position to affect the election of either Trump or Harris, and felt that was a better use of their vote.",
         "I voted Chase.  But i know he has no shot.  If I was in a swing state i would not vote Chase.  If i knew Stein would lead Chase I would have voted her.  For me there's more to it than picking a party. That's what got us into this inflection point.",
         "I voted Republican for the first time since 2008. And I defended Gary Johnson until I was blue in the face after “Aleppo.” Our party has to do better in 2028.",
         "I'm a fairly attentive libertarian and I didn't even know he was our candidate until a month after he was selected lol.",
         "Nominating Oliver was a catastrophic mistake that torpedoed the party.",
         "Chase Oliver sucks, be more disappointed that he was the one chosen",
         "I didn’t see a single add or piece on Oliver, at all. Nothing… that had to be a choice made by the LP, right?",
         "Kinda what happens when you say Ron Paul is stupid",
         "Chase Oliver was a poor candidate. The days of a Ron Paul are sadly behind us.",
         "The LP did this to themselves by allowing that worthless candidate to slip in as our representative. Good riddance, if you ask me.\n\n![gif](giphy|lZhymdRsuFDmU|downsized)",
         "1) Trump put together a better coalition with libertarians than 2016/2020.\n\n\n2) Kamala absolutely failed to build a coalition with anything resembling principled leftists; i.e. Jill Stein got a lot of the anti-Zionist votes.",
         "The party did a terrible job promoting him.",
         "His own party sold him out for trump, so that was a major blow to his campaign",
         "The LP's viability as a political movement is inversely proportional to the Mises Caucus' involvement in it... \n\nJust saying...",
         "He losing to RFK he not even running for the election 🤣",
         "RFK is beating him and he's not even running.",
         "I felt like Jo was all over my feeds last election and basically saw nothing for Chase at all this year. Voted Johnson in 2016 and Jo in 2020. Was actually planning on voting for RFK Jr. this year but the Dems blocked his candidacy in several key states. Once he came out in support of Trump, I ended up voting for him.",
         "I disliked him more than I dislike Trump. So this election, at least at the presidential level, was voting for the person I dislike the least. Maybe in 4 years the party will select someone palatable.",
         "Bring back Gary Johnson!!!!!!",
         "Shocker. A democrat who rebrands himself doesn’t get many votes from people who can’t differentiate the libertarian from the democrat from the republican. Give it up. The libertarians need a libertarian candidate.",
         "“We did so much for liberty by voting for Chase tonight!”",
         "Man if we come in 5th in this election it’s over",
         "I am shocked too… I didn’t expect great but better… I still voted for him",
         "Oliver is a joke.",
         "On the bright side, the LP candidate in the Ohio Senate race broke 3%",
         "Hahahahhaha\n\nChase who??",
         "He was the single worst candidate that the libertarian party has ever run. Which is fine, trump didn’t need anyone possibly spoiling it anyway. ",
         "He was not someone who anybody who take seriously. If Libertarians are serious about bringing the philosophy to governance they will need to start offering serious candidates.",
         "No one cared about Chase, just like Kamila.",
         "My choices for president were:\n\nA) a New York Democrat who violates just laws.\n\nB) a California Democrat who prosecutes unjust laws\n\nC) Chase fuckin Oliver \n\nD) Wetsack O'Catshit\n\nVoting for Oliver just because of an (L) is no better than voting for Harris just because of a (D). If you want my vote , then nominate a real Libertarian. Otherwise I have to rock this ridiculous \"Wetsack O'Catshit\" sticker for another 7 years.",
         "He's just a Democrat who ran with an L next to his name",
         "I did my part!  I voted for him, even though he seems crazier than the other two, but I wanted to do my part to get him to 5%.",
         "Trump owes Libertarians!",
         "He got less votes than RFK Jr. this was an important election to move the liberty football one way or another. The fetish of libertarians to throw their vote away is troubling. I’ve proudly done it in several elections as a protest vote, but this wasn’t the election to do it.",
         "I have said it on this sub before and people got mad. I do not like chase. I voted trump but would LOVE to vote libertarian. Next election I'd be surprised if I didnt. I just really do not like chase. I think most of the party agrees... based on the lowest turnout in 12 years...",
         "Didn’t even hear him mention last night unfortunately",
         "I voted for him just to promote the party. I was indifferent to him until he wanted to fund trans operations...",
         "Here in NY, both Stein and Oliver were only write-in candidates due to changes that the Democratic Party made that make far more difficult for 3rd parties to exist in this state. While I'll never denigrate someone for doing a write-in, I truly believe that they aren't officially counted so I don't do write-ins.",
         "That's just what happens when a leftist infiltrator gets nominated.",
         "A lot of us voted Trump. I’m glad we did.",
         "https://preview.redd.it/0u3w1w3eebzd1.jpeg?width=1170&format=pjpg&auto=webp&s=49c28f9347edf4b5508876c2006126f7ff5268e0\n\nSay what you will, but this guy ahead some amazing results for a libertarian candidate…",
         "Next time go Mises or get out",
         "Very little funding, LP national leadership told everyone to vote Trump, no national support in advertising / campaigning (maybe some X posts at the very end), wasn't on all 50 states, states like TN threw fits the candidate wasn't Dave Smith and refused to support getting him on the ballot, supposedly a tight race that third parties do generally poor in, etc\n\nThere was basically nothing going right. This is what you get when LP internal politics implode and what basically Oliver got by himself plus some LP name recognition. I would recommend Mises and the chair not endorsing another candidate if they wanted more votes.",
         "I mean if you’ve been paying attention the LP leadership/MC basically abandoned him and made a deal with the devil to campaign hard for Trump",
         "It baffled me that a party controlled by the mises caucus could nominate a liberal candidate, until I thought they probably used him as a red herring, and actually want trump to win.",
         "While you can criticize elements of Jo's campaign, she did do a markedly better campaign from a messaging perspective. I became a libertarian because of her showing me that I was wrong about the war on drugs.",
         "Same",
         "yea probably bcs some of those video jo put out were fucking awesome.",
         "He was a clown.",
         "Currently RFK is beating him in the National popular vote.  🤣",
         "Meh, I still voted for him. Surely someone who thinks they’re a libertarian is better than someone who knows they’re a R or D.",
         "The problem with the party is that we fundamentally hate centralized power which prevents us from organizing and getting our shit together long enough to actually run a campaign.",
         "Yeah, I mean, I threw my vote to him (lesser of the evils) but I loved Mama Jo. I had shirts, signs, stickers. I brought her up all the time. I honestly forgot about Chase. I was hoping Justin would have represented our party if we wanted to get some serious momentum.",
         "Same. I felt good to vote for Jo and Spike. This year I said \"fuck it\" and voted NOTA.",
         "I didn’t care for Jo, but she was miles ahead of Oliver.",
         "I would hope a JoJo and Carly ticket would erupt.  If we can roll out Weld, we should certainly be able to ask Mitch to come and play",
         "Justin Amash?",
         "[removed]",
         "It also does worse with awful candidates like Chase Oliver.",
         "It is difficult to argue that this election is closer than 2020.",
         "Good point. Unlike Johnson and RFK, Chase would've taken votes from the Democrats, which explains his absence in media coverage.",
         "Makes sense, I still voted lib though because that’s what I believe in, even if I know they will probably lose for the foreseeable future lol",
         "Bro stein is literally the complete opposite of chase",
         "\"How do you disappoint libertarians with just one leppo?\n\nWhat is a leppo? 🤦‍♂️\"\n\n--Reason",
         "5D chess by Angela to get the president who will welcome libertarians into his inner circle",
         "To be fair, he won the nomination because of a super shady, back room deal with Ter Maat. Rectenwald was on a path to win easily.",
         "The LP doesn't run their campaign. That was a choice made by the Oliver campaign. The dude sleepwalked through the whole thing. And I'm being pretty generous on the \"walk\" part of it.",
         "It was. I mean, the LP chair 'endorsed' him wearing a clown nose only to later endorse Trump. Fundamentally unserious.",
         "No. Campaigns run their advertising. \n\nThe LP gets people registered, fights as many ballot access fights in advance as possible, etc. This is all stuff that Chase did benefit from by getting the nomination. \n\nChase simply sucked at fundraising and advertising. One of his big advertising pushes was so that he could take a helicopter ride.",
         "That's literally his job as candidate, not the party's job. \n\nYou don't just show up and wait for the party to elect you, that's not how politics works.",
         "Chase did not perform better in non-Mises states.\n\nIn fact, reporting so far indicates that he did worse.",
         "Cope",
         "Lol no thanks",
         "I'm optimistic he'll follow through on his promises to us.\n\nRoss pardon and a libertarian in the cabinet!\n\nAnd if Ron Paul is involved in the administration in any way, then it's an enormous blessing in disguise that Chase the Disgrace was the nominee!",
         "To me, he's no different from a Democrat. I would barely prefer him over Kamala.",
         "In TN, Chase hired canvassers that were not people known to be reliable, as experienced party members recommended. \n\nThe outsiders he hired turned in names with a ridiculously high failure rate, and failed to meet the insanely low standard. Fewer than 300 names were required. \n\nTN was a Chase failure, open and shut.",
         "I was a delegate at convention, and I assure you, Mises tried their best to stop Chase from getting the nomination.\n\nMany shenanigans were in play.",
         "Yup. While imperfect, her campaign was light years ahead of Chase's. \n\nShe even went up against Trump, and Jill Stein's back again too, so it's a pretty fair comparison.",
         "I take back everything I said about Jojo and Gary Johnson. We have someone who’s actually a lot worse",
         "*Is*",
         ">Chase Oliver and Mike ter Maat are on a mission to remove government barriers that stand in the way of your dreams. Be part of the movement—help us break down these obstacles and make your aspirations a reality!\n\n![gif](giphy|6kC6MdAALf6Pm)",
         "When someone made a joke about it. I couldn’t stop laughing 😭",
         "This 100%. I’ll vote libertarian every single time as a recorded fuck you",
         "I wrote in another post. I'm registered LP, I'll vote LP. I'm not going to put a chase oliver yard sign out, but he'll get my vote. Dave Smith would get a yard sign, I still have a Ron Paul yard sign in my garage. \n\nMostly I just want more choices so I'll continue to support LP candidates when I don't think there's a better alternative.",
         "I was one of 52 people in my county that voted for em. lol",
         "The age old 'nobody is the libertarian party's biggest rival than libertarians' or something like that",
         "I've voted Libertarian for pres since 2004 when I was 19. First year writing in NOTA. \n\n\nHoping for Trump but wanting a clean conscience when he does something dumb.",
         "Your comment has been removed. Petitions, Surveys, and Polls are not allowed here.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "Fiscally, yes. Culturally, no.",
         "Bylaw number 2 is the purpose of the party:  \n\n> 2. electing Libertarians to public office to move public policy in a libertarian direction;\n\n> 3. chartering affiliate parties throughout the United States and promoting their growth and activities;\n\n> 4. nominating candidates for President and Vice-President of the United States, and supporting\nParty and affiliate party candidates for political office;\n\nThey always fail at the actual electing part. This year, they totally failed at the promoting and support part, too.",
         "Tried to give him the benefit of the doubt. …when you make deals with a potential VP pick to stab people in the back to get votes, the party should frown on it. Once you go down that route… I could see the party taking a hands off position.",
         "I'm more of a \"let's get shit done\" kind of a guy than a just cope with it kind...\n\nWas heavily involved in leadership of a different caucus, decided to drop party affiliation and just be a happy libertarian instead of a Libertarian... \n\nThe LP as a party is entirely too encompassing leading to fracture of the organization which contributes to its inability to build any consensus and move forward as a political philosophy... Mostly because the Mises Caucus is too busy calling everyone else a statist... (Joking...ok not really joking)\n\nBreaking the duopoly will take a concerted effort that the current LP isn't capable of performing...",
         "In most states, the party chapter works with the campaign to get them ballot access. TN and others did not. Chase did have to do it on his own, and yes, failed. However, every TN LP member could have helped in the effort to get LP ballot access. It is due to both of them that TN citizens did not get it. I can only hope states care about Libertarian ballot access next cycle and go out and get it.",
         "That surprises me. It's the only theory that made any sense to me.",
         "How's that working out for them?",
         "Okay? None of that disproves what I said that campaign decisions are made by the candidate, not the party.",
         "You will note that promoting is for affiliate parties. \n\nGotta read the whole sentence. \n\nThe LP didn't fund Gary or JoJo. They did great compared to Chase. This is just coping.",
         "I guarantee if the mises candidate would've been nominated rather than the all the back room dealing to skirt it, the libertarian party would be an enormous part of the national conversation. Joe rogan probably doesn't endorse trump and the republican party would be bending over backwards to get libertarian support away from mises caucus. Chase oliver is a joke. He might finish behind green party and a guy who said don't vote for me.",
         "I mean, it makes sense as a conspiracy. But the convention was, in practice, an incoherent factionalized mess of people fighting each other for every reason and none. \n\nMost of us Mises folks, a full 40% of the delegation, opted to vote NOTA instead of voting for Chase, because we were convinced he was a miserable candidate. \n\nOne hopes the rest of the party will take our warnings with more seriousness the next time they wish to nominate a broke, unemployed food service worker.",
         "The statement was about seeing ads or pieces for Oliver. You tried to separate LP from Oliver completely, which is both true and untrue. National can run ads or pieces and it is their duty to support their candidate. They have done so in past elections.They failed to do so here. That much is obvious.",
         "Supporting is for Party candidates.\n\nNo one said anything about funding the campaign directly. That is not what 'support' was for Johnson and Jo which they did not give Oliver. This is just excuses.",
         "Show me where I said they are completely separate. I don't even disagree that national should have supported him much more. That's not the point here. \n\nThe candidate has to give direction on the ads and take the lead on it. Oliver did not work with party membership very well and didn't coordinate well with members even trying to throw him fundraisers. Plus, it's not Angela telling chase to decline Dave Smith or Tim pools podcast invitations. That is 100% chases decision.\n\nEdit to add: I've been part of a few campaigns (not presidential). It's never the expectation the party will decide and run ads or promo for you. The candidate has to do or at least plan for the ads then ask for money from the party to do so, which even that is a shaky ordeal.",
         "Oh? What support, exactly, did the other two get that was withheld?"
      ]
   },
   "1gkd9pq": {
      "title": "No matter who wins, so does the war machine",
      "text": "",
      "comments": [
         "https://preview.redd.it/xgylers386zd1.jpeg?width=1077&format=pjpg&auto=webp&s=1f5a26fc517a34c2c15f77d514ef8ca5e39b8f30\n\nWrong map goy",
         "Where's Ukraine in this picture?",
         "The military industrial complex would much rather a Democrat win i'd imagine. The neocons are endorsing them en masse.",
         "One candidate was in office when shit hit the fan and has the support of Liz Cheney, Dick Cheney, and all the neocons.... the other accomplished the Abraham Accords. I know who I prefer.",
         "Considering ron paul, might join the trump administration, he could very well influence trump on that issue",
         "It's odd seeing as how current day Isreal is a product of our meddling.",
         "Baby steps are still steps",
         "I think it's pretty clear the MIC would do FAR better under a Harris regime. Trump had four years and no wars...",
         "Sad, but true.",
         "Glad to see somebody say it, didn’t think the libertarian sub would actually get red pilled about this",
         "![gif](giphy|5twCMNij5xDag|downsized)",
         "Ugh those drones scare the fuck out of me and my husband...",
         "https://preview.redd.it/mqmdvyluz7zd1.jpeg?width=1070&format=pjpg&auto=webp&s=1cf2250b56f3b54006b2bb611b6592fbc4f1795d",
         "Tulsi is on Trump’s team, there is hope",
         "They don’t like to talk about this though 😐",
         "Bodily autonomy is out the window  if Trump wins. And yes, I’m a Libertarian",
         "Hit the nail on the head, my dude.",
         "Unfortunately.",
         "![gif](giphy|tEQ8aAOh60us0)",
         "Based",
         "Isreal is covering them up so they get more money",
         "Never thought I'd see the Cheneys siding with Democrats and a Kennedy siding with Republicans. Crazy times",
         "Yea but Trump did take $100 million from Miriam Adelson…Palestinians may be fucked regardless.",
         "Especially if Ron Paul comes in with his pruning shears.",
         "That’s not necessarily true. I’m an European and in my country the debate right now is a lot about how we in Europe can protect ourselves if Trump chooses to disband NATO or pull out troops of Europe. Guess where we will buy all new military technology and weapons from… \n\nThis might benefit US weapon manufacturers more than people might think.",
         "Agreed. Also conservative Zionism is powered by religious prophecy which is has lost significant clout in the last few years.",
         "Both of them sent our taxpayer money to the Middle East, just in different ways.",
         "Your point about the Cheneys notwithstanding, the Abraham Accords are a reason to vote against Trump not for him. Libertarians oppose foreign aid and the military industrial complex",
         "I agree that the Cheneys are warmongering scum, but the Abraham Accords were not a good thing. Essentially the Abraham Accords are just the US bribing Middke Eastern countries into being friendly with Israel using taxpayer dollars (foreign aid).\n\nMy taxpayer dollars shouldn't go to Israel, and they shouldn't go to other countries so they'll be friends with Israel.",
         "[removed]",
         "No he won't.",
         "This is the lesson",
         "What Federal law interferes with body autonomy? Other than drug laws and the military draft…",
         "How? All he did was give the states a choice if they wanted it or not. He didn't ban abortion or IVF like everyone thought he was and has stated that he doesn't want to ban it but instead wants to make it easier for women to have kids because statistically most women get abortions because they can't afford to have a kid. Trump and Vance want to change that.",
         "who bans bodily autonomy? thats news. Every livin human has bodily autonomy",
         "When the Dems say that the GOP changed they always forget how much *they* changed.\n\nPro-establishment, pro-war, pro-censorship. I'll let y'all guess just how far left one has to go to find all of these acceptable.",
         "I'm very sympathetic to Palestinians, but honestly i think even they know no one's coming to save them. Sad all around.",
         "God i hope that's true. Would be a wildly popular move all around. \n\nI wonder if he'd still be up for it though. 90 is quite the age.",
         "People have to stop with the RP nonsense. I love the guy, but if you don't realize that Trump/Musk name dropping him isn't a desperate last grasp then I don't know what to tell you.\n\nIf Trump wins, he's certainly not going to be listening to Ron Paul, he doesn't listen to anyone.\n\nTrump knows how many suckers are out there and this is a classic \"hook the suckers\" push.",
         "I'd rather an expensive peace than an expensive war.",
         "One of them left billions of dollars of highly classified military equipment to terrorists while they sell it to underground terrorist organizations for years to come while getting 13 soldiers killed and leaving interpreters who we promised citizenship to behind for the Taliban to kill, the other is the most anti war president of our lifetime regardless of their views on his personal life.",
         "How is it a bad thing to encourage normalization of relations amongst the most stable powers in the region? The underlying motivation is to get Arabs and Israelis doing more business with each other, which is the best way to ensure lasting peace.",
         "No one's asking him to re-roof a house in summer.",
         "Giving the states a choice to decide for the individual isn’t any better for the individual. The government should prevent the state from deciding for the individual to protect individual liberties, not just remove themselves from the situation. \n\nSame reason that if you were having a fight with your neighbor about where property lines were, the state shouldn’t leave you to the HOA to decide, they’ll just make it worse. They have the knowledge and power to figure out who’s right, they should step in and sort it out.",
         "Honestly I feel like IVF and other fertility treatments should be banned (also tax people more per child if we're gonna have taxes) and I'm otherwise very radically supportive of medical freedom.",
         "Boy do I have news for you",
         "There are many on the left who are still anti-establishment, anti-war, and anti-censorship. It may be an unpopular opinion, but I think there are many on the left who align with libertarian principles and would gladly vote for libertarian leaning candidates. If Libertarians didn't run them off with all the anarchist doomsday talk.",
         "So, I didn't vote for Trump. (I voted \"your mama\".) But I imagine demoralizing libertarians about Ron Paul getting a say is only going to backfire on the Republicans. Demoralization loses elections.",
         "I thought taxation was theft",
         ">How is it a bad thing to encourage normalization \n\nEncouragement is fine, bribery with US taxpayer dollars is not. Israel is already a massive welfare queen with all the foreign aid we send them, now we have to pay their neighbors to be nice to them too? Screw that, end every last penny of foreign aid.",
         "This is fanfuckingtastic.",
         ">Giving the states a choice to decide for the individual isn’t any better for the individual.\n\nYes it is. If the federal government forces a state to legalize something like abortion, that doesn't say shit about how your neighbors or family members will treat you if they find out. And people DO find out. At least if it's up to the states, you might know where the average citizen stands on an issue so you know whether or not you should nope out to another state that's more accepting.\n\nObligatory \"as a woman\" disclaimer so it's not like I don't have skin in the game.\n\nOf course, in an ideal world, I'd obviously rather everyone be for bodily autonomy amd medical freedom across the board. This isn't an ideal world though. In our current shitty political system, I'd rather a state's policies not belie the sentiment of the actual people I might have to deal with.",
         "Not every human has bodily autonomy? Please share me news, where???",
         "They've been drowned out by the neo-liberals and turbo-progressives. Being a libertarian is being a far-right extremist to the liberal mind.",
         "Yes, but except for some brave people voting for Jill Stein, they all vote Blue.  \n\nThey are conformists first, principled leftists second.",
         "So…like bribing people to vote with Coddling illegals (tax dollars), Student loan repayment (tax dollars), and universal income (you guessed it…Tax dollars!)\n\nI’d rather vote for money to go directly up Benny’s ass, than put a dime into any of that shit.",
         "If your biggest concern about abortion legislation is how your neighbors and family members treat you, I don’t think we can have a meaningful discussion about this issue because we clearly care about different things. I come from an ultra conservative family, they say and do all kinds of stupid shit, and that’s what made me believe in libertarian values. I don’t care what people believe in, I care about what they can do, and anything the government does that enables people like my extended family to control people’s individual liberties is something I strongly oppose.",
         "That's because many fascists pretend to be libertarian.",
         "People like your family can, oh I don't know, physically fucking assault you if they find out you've had an abortion even if it's legal. It happens. If your family makes you feel unsafe, you should move away from them and others who are like them instead of expecting what the federal government to stop them from harming you for your choices. Easier to do that when the laws of a state at least somewhat reflect the sentiment of the people. That said, none of it is really my concern because I'm sterile anyway. Needless to say, if another aspect of medical freedom that could actually affect me (aside for setting a bad precedent; again, medical freedom across the board would be my preference in an ideal world) was up for debate, I'd be more invested. I fully support the right to abortion - especially as a misanthropist and antinatalist - but I get sick of people trying to treat women as a monolith and expecting us to all support each other simply because we're all women. As it stands, neither candidate poses any particular threat to my way of life and neither offer me anything useful.",
         "Ahh yes, the fascist ideal of wanting everyone to be free... OR ELSE!",
         "You don't understand at all. Many fascists say they are libertarian, because they don't want to come out and say they are fascist. Fascists sometimes use the words \"libertarian\" or \"centrist\" or \"moderate\" to hide their actual views.\n\nYou end up with a society where 50% of the self-described \"centrists\", \"moderates\", and \"libertarians\" are actual bootlickers and then the real libertarians, centrists, and moderates are unable to find and socialize with each other.",
         "From my personal experience I’ve def met some this meet this definition unfortunately",
         "Yes. People are pretending to be Libertarian, to hide their fascism.\n\nFor fuck fake.\n\nAnd you wonder why you got your asses plowed tonight in the elections",
         "I don’t think it’s super common, but it does occur. There are some in my hometown who say they’re libertarian but then support everything Trump does with fervor"
      ]
   },
   "1gl9k58": {
      "title": "Has any Libertarian Candidate in the US ever won a State or even a county?",
      "text": "I was wondering if any Liberterian US presidential candidate has ever one the mojority of vites in any states or county? Im not from the US but I am interested. If so when and where ?",
      "comments": [
         "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "George mf Washington and Thomas Jefferson \n\nWhile technically not a libertarian in name,\n\nLibertarian philosophy is based around John locke which is what influenced the founding fathers"
      ]
   },
   "1gl0kxx": {
      "title": "Some of Our Leaders Are Putting Other Countries First",
      "text": "",
      "comments": []
   },
   "1glaaz7": {
      "title": "The misuse of data behind 'greedflation'",
      "text": "",
      "comments": []
   },
   "1gl98pc": {
      "title": "Who do you want to lead the GOP controlled Senate? ",
      "text": "I can't emphasize enough how important this job is. McConnell was a power grabbing dick. \nMike Lee posted several great rule changes to allow more input. \nBut who would be good?\n",
      "comments": [
         "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "Thomas Massie or Rand Paul",
         "Someone who doesn't want the job.",
         "Mike Lee, Rand Paul or Thomas Massie.  Maybe Justin Amash could come out of retirement.",
         "Looks like Massie is going to be Sec. Of Agriculture. Paul would be a good choice",
         "Massie is not a senator.",
         "I find this surprising. Didn't Trump and Massie have a falling out during the first term?",
         "Maybe, but i don't think it matters to Trump as long as he can do the job."
      ]
   },
   "1gkpydl": {
      "title": "Where are the meltdowns?",
      "text": "MSNBC was just running graphics. \n\nTYT doesn't have Ana on.\n\nWhere to drink sweet leftie/tankie tears?",
      "comments": [
         "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "Chuck Todd had a minor one earlier, saying Latinos went for Trump due to their lack of education.",
         "Joy Reid has been losing her shit all night",
         "I was told my 3rd party vote was going to ruin Kamala. Is that still true? 🤣",
         "Everyone’s holding their breathes for the mythical “batches of mail-in ballots”",
         "The politics sub has a live chat and it's basically nothing but meltdowns.",
         "Maybe this time the Democrats will actually learn that running someone who isn't an orange-tinted vulgarian won't automatically win elections. Maybe we'll see some introspection instead.\n\nI mean, probably not, but maybe.",
         "The true meltdown is Kamala not coming out and giving one more RA-RA speech after that 150 emails she’s sent me in the last month.",
         "Enjoy the somber tone for now. We’ll get our meltdowns soon enough",
         "Oh they are there. Reddit is melting and several of my coworkers are claiming they will leave the US.  I love it",
         "Ana won't be on tyt much longer. She's moved to the center and I expect her to start her own thing in 2025 like everyone on that show",
         "Reddit.\n\nhttps://preview.redd.it/qs4z8fnoc8zd1.jpeg?width=1440&format=pjpg&auto=webp&s=e6f0a6b3bd07dee72e73f66c60a3d5e6dfda87b0",
         "Go to the millennials & rants groups. Probably the rant group too. Idk, they banned me for saying it's possible to dislike both Trump & Biden. Complete meltdown city in those first 2 though",
         "I switched to MSNBc for 5 min this morning. I switched back away after listening to Joe Scarborough spend 5min telling me Kamala lost because of racism. How long until they realize calling the opponent's supporters bigots and garbage is a losing strategy?",
         "I always turn on MSNBC to watch that sniffling cunt, Chris Hayes, sit with his bitch face.\n\nLol. \n\nFox had some good ones when Biden won. But the left always shows they ass in fantastic form.",
         "They're on Reddit.",
         "Poke around Reddit for a while if you’re looking for that. \n\n\nI am personally not surprised by the outcome. I think a lot of people knew this was a Hail Mary play from the left. Like switching out your decrepit candidate for an equally if not more unpopular candidate 3 months before the election? That’s desperation right there. I don’t think anyone was shocked that strategy didn’t pay off. ",
         "I don't think there's nearly the surprise that there was last time he won. Harris was probably the worst person they could have picked.  People only supported her because of their TDS. We can only hope that since it looks like Republicans will also have the House and Senate, Trump won't be spending all his time dealing with nonsense and can actually do his job. Hopefully all the rhetoric will be stopped and the government can actually focus on doing their jobs. Hopefully now we can start focusing on our country. Hopefully they will start making government smaller and spending less money. Hopefully Trump will fight to fulfill his promises. Hopefully the left and right can start seeing eachother as just People with some differences of opinion instead of enemies. Hope everyone has a great day, no matter who you voted for.",
         "I don't know - Trump was heading for certain victory last time when I went to sleep needing just one of 3 states (IIRC), and when I awoke, he had lost all 3 of them.\n\nI'll wait for the media meltdowns, but my state sub is really angry. A Democrat posted an olive branch, and almost no reply from other Democrats is positive in the slightest.",
         "CBS has been in meltdown mode for the last hour or so. Nora O'Donnell and her cohorts look like they want to die.",
         "Are we looking at the same Reddit? All I see, especially teacher subs, is “What do I do today?” “I’ve been crying all night and haven’t gotten any sleep.” “Project 2025, the world is ending, the sky is falling, blah, blah, blah”\n\nWhat do you do? You act like an adult! You put on your big boy/ big girl underwear and you go to work and do your job. You go to your kid’s fall play. You do all the things you’d do in a normal day because that’s all today is.",
         "Reddit is having quite a few meltdowns.\n\nVery frightened people. And some nasty ones.",
         "All the paid shills aren’t  under new contract yet",
         "Checked the big subs at all? Lmao",
         "It went about like I thought. Americans upset with economy, minority groups taken for granted. I can deal with moderates on both sides but maybe now the progressives will realize that just because you force your policies down our throats doesn't mean we won't go the opposite way. Unfortunately the far right will be insufferable for a while. \n\nI wonder if antifa will riot again? Blm? Any other fringe groups burning cities now?",
         "I've seen people on discord litterally sobbing and trying to encourage each other from \"the darkest age\".\n\nLike goddamn how effective was the lefts fear mongering?",
         "We’re not really gonna freak out. Cause we aren’t insane.",
         "It’s so glorious to see the legacy media implode and be in denial!!!",
         "They'll be here in two hours. Trump is heading to Palm Beach where he'll likely declare victory. That is when the crying starts.",
         "Honestly, you can find plenty of threads on reddit full of leftie tears.",
         "Almost every subreddit is having a meltdown, even shit that has nothing to do with politics, like Star Wars",
         "Ah yes, the true intent comes out lol it was all to “own the libs”",
         "There will be a return to SJW cringe compilations. Don't you worry.",
         "Well, you're on Reddit, have have a look around. They're everywhere here, lol.",
         "Main feed of Threads is pretty loaded with insane takes",
         "Tik tok 😂",
         "HasanAbi - Extreme cope",
         "Ana recently has become omega based so don't expect any meltdown from her",
         "Bro, right here on reddit lmao 🤣 😂 😆",
         "Give it a day or so, the isolated clips will start popping up. If not, maybe they aren't as mad as the echo chamber, that we call Reddit, would suggest.",
         "I just ran into a good one.\n\nhttps://preview.redd.it/kycs9uexdazd1.jpeg?width=1080&format=pjpg&auto=webp&s=fd305ed4926cf5fe882bebdf3187a40f592de803",
         "This guy melted down\n\nhttps://slate.com/news-and-politics/2024/11/election-results-president-trump-harris-win.html",
         "Typical Democrat on instagram was almost crying 🤣",
         "The irony of libertarians being ok with a large government conservative winning an election is not lost on me.",
         "Dana Perrino on Fox going with the Colonel Sanders look tonight.",
         "I think Harris is scum but she’s hardly a lefty",
         "Ana has been slowly red pilling, so there’s no meltdown from her.",
         "Ana is probably partying with dailywire",
         "https://youtu.be/cjj4cdSNQ9Y?si=A4V0o6YJ-eU3Fez-",
         "TikTok is FULL of them. I just want those public cry sessions more than anything.",
         "There's some hand wringing in r / new jersey over how close it came to flipping red.",
         "They are in shock right now. Also they know ppl like me would love to see the meltdown n have a huge grin on their faces waiting, so there's holding out. It'll take a day or so.",
         "Seem to be all over Reddit",
         "Ana has been getting red pulled hard as of late.",
         "If you can't find any tears, here is some high energy for you:\n\nTrump | Never Come Down [Remastered]\nhttps://www.youtube.com/watch?v=_6HT_AqXL-o",
         "The mask slipped right then.",
         "Oh no, he let the racism slip.",
         "I find it funny that talking heads were surprised at the conservative Latino vote. They must not know many Latinos. The legal citizen Latinos are more conservative than a lot of white people I know",
         "Haha wow",
         "Do you have a clip of this?",
         "Yes, calling the voter base you NEEDED stupid has worked well in the past",
         "that is gold.",
         "Oh man I'd like to have a link to that. I'm sure YouTube has buried it though",
         "I can’t wait for the YouTube compilations in a week",
         "Link?",
         "Kamala ruin kamala.",
         "Same. I was in fact shamed for it since I live in a battle ground state. The entire third party vote still leaves a gap of 100k between trump and Harris in the popular vote.",
         "I was told the same",
         "There’s a thread on the WI page blaming third party voters",
         "Funny I was told that it'd only help Kamala... 😂",
         "Well yes. Left leaning and the bishop henchmen style libertarians voted chase Oliver. While the mises causes right leaning ones went trump..\n\nPlus you had the rfk jr ones go trump also. \n\nSo yeah third party did deliver trump the win.",
         "The famous 3 AM voters",
         "CNN just showed them arriving with a police escort in Philadelphia. Those mail-in ballots?",
         "Didn’t believe it was rigged or barely rigged in 2020. But now it suspicious. Especially looking at total votes",
         "By everyone, I assume you mean everyone who didn't realize that COVID is already over in 2024\n\nOh wait, yeah, that checks out.",
         "I have avoided that place like it was weaponized ebola, but I might have to go look now.",
         "I've been yelling this from the start. She finished what, 11th or 12th last primary? What made them think she would be popular besides, not Trump. Hopefully this is a fuck around and find out moment for the DNC.",
         "I just love the 'Clinton failed her run against Trump because she thought she deserved it, Let's put in another female candidate with 3 times the entitlement!'",
         "I mean. We barely see her over the past four years then they just stick her in like. \"Here! Put this bandaid over this gaping wound. Then just leave it there. No stitches! No gauze! Just use this bandaid we found at the bottom of the first aid kit! We'll tell the people it's the best bandaid in the world. They'll accept it.\"",
         "Look, she has a lot of negatives.  One is that she's a woman - that's just the truth.  But let's go on from there - she has no roots in this country.  Neither of her parents is American.  She is one of many who got their passport through the largesse of the 14th Amendment.  She spent her adolescence abroad.  (Her unusual background is so similar to that of Barack Obama it's crazy, and no one talks about it - at least Obama's mother was American.)\n\nI don't want a virtual foreigner to be the president of my country, and I don't want a virtual foreigner to be the first female president.\n\nAnd then she is just not intellectually impressive.  She can't speak extemporaneously.  Everyone knows this.  If she were president, I foresee a repeat of George \"Bloody\" Bush - a warmonger puppet who makes constant dumb statements.",
         "She kept texting me and I kept asking for nudes but, alas, no response. Maybe if she tried harder to earn my vote... Nah.",
         "Maybe if Kamala made just one more traffic-crippling visit to Philly and I would've voted for her highness.",
         "Cracked me up when the guy came out saying she wasn’t gonna speak until today. That’s concession and if it wasn’t then why would I want a president unwilling to stay up late and talk to the American people. Gotta give Trump credit for that",
         "It's really quite difficult to qualify for naturalization in another country once you're over forty.",
         "Once they figure out everyone else’s borders are tighter than ours…",
         "Think the whole crew over there loaded up on Valium to avoid making total fools of themselves like they did in 2016.",
         "Ohhh so this is the Project 2025 I've been hearing about",
         "Meanwhile multiple states approved solid Pro-Choice abortion amendments. They realize he wants it to be a state issue and it is, now many states are approving CONSTITUTIONAL AMENDMENTS regarding abortion being allowed and without governmental overstepping. These people don’t understand politics or government at all and it shows",
         "I doubt anyone has ever washed to see her ass in fishnets.",
         "I got banned from mildly furiating because I said the one lady that screamed at the kid looked like a Harris voter because she was surrounded by people with Harris/walz signs. For some reason they dont realize that banning people for simply stating what they see does not help their side",
         "I think they had a better chance keeping Biden on the ticket than doing the switch up they did.\n\nThey thought \"black\" and woman would be enough regardless of how wildly unpopular she was.",
         "Unless...  they realized that should couldn't win, and they think putting in Trump is actually better for their long-term plans.",
         "These people live in a bubble online and have no clue how the world keeps on turning",
         "Also this, “drink lefties tears” shit is cringe.",
         "This 🙌🏼",
         "They’re comparing it to the empire vs Jedi, they think Darth Vader won and they voted for acolytes. haha",
         "I love the fact that he mentions it's an unfair system because Trump won. However you know if Harris  had won it would have been, the people have spoken!",
         "She is nothing more than a puppet. I don’t think she’s had a thought since becoming VP to the man she trash talked.",
         "Dad is a Marxist economist. Hard to get more lefty than that.",
         "I see her more authoritarian than Trump honnestly",
         "She's definitely far left. These large political parties have cliques and groups within them, they're not as unified as they like to lead people to believe\n\nHarris is definitely part of the far left within the party that includes Newscum",
         "Yeah, it's Walz that's the problem here.",
         "Happy Cake Day!",
         "We need a meltdown megathread with links and vids.",
         "While that’s true, it still surprised me a bit. I own a construction company and have several legal Hispanic employees and they were all telling me their entire communities were voting Harris. I know this is a tiny sample size so not really helpful but it did surprise me a bit.",
         "I would also like the clip",
         "![gif](giphy|MxqPlIC8TmbPW|downsized)",
         "This also makes me wonder about all of the people who told me I was wasting my vote because I was picking a loser.",
         "If they can't scrape up the electoral votes\n 1: California is an all-or-nothing state. Libertarians can EXTRA vote for whoever the fuck they want, and there isn't a single DNC soul that can whine about it because they all count as blue every election anyway. \n2: lol. lmao even. The major parties always cry that third parties didn't help. Just because you can't get your voter base erect for an election doesn't make me your fluffer.",
         "If you add up all third party votes and give them to Harris, Trump still wins the popular vote. Did you look at the states they came from to determine electoral votes would have been or something? Or are you “just sayin?”",
         "I think the 3 a.m. voters showed up for Tammy Baldwin in Wisconsin. When I went to bed Hovde was winning with 100% of precincts reported.",
         "My stance on the elections is if Florida which is 3rd as far as population in the country can have it all figured out within 2 hours there is zero excuse for these other states. Anything less than that invites the country to suspect that this shit isn’t being done right.",
         "I thought it was “rigged” in the sense that the corporate media and the powers that be really stacked the deck against Trump (letting Biden hide in his basement, making the lockdowns hurt, suppressing the Hunter Biden laptop story, etc) but I was kinda agnostic on if there was enough actual voter fraud to swing it. It did look suspicious to me, and I understood why people came to that conclusion, and it wouldn’t have surprised me if they did steal it, I just wasn’t sure. \n\nBut now when you compare 2020 to 2024, You’re telling me nearly 20% of people that voted for Biden just stayed home? Especially when trumps turnout was relatively similar? It looks way more suspicious now",
         "It absolutely was",
         "She dropped out in December of 2019 before a single vote had been cast, that's how unpopular she is",
         "She just doesn't have the cock sucking capacity she once did in her younger years. If she had just puffed more peters, she'd have done better. I'm sure she got a new BMW out of the deal regardless.",
         "Actually, they never said it was a good band-aid, they said it wasn't the \"other\" band-aid.\n\nHer whole campaign was \"I'm not Trump.\"",
         "To be honest they won’t leave.  Very few actually do. They will calm down and keep participating in our society.   I think it’s they are in shock that everyone didn’t think exactly like them.",
         "It’s really not. If you have enough cash you can move almost anywhere. There’s a list of about 12 countries that will automatically grant you citizenship if you give them minimum $250k to invest for you.",
         "No it’s not, if you’re wealthy. There are many countries with buy-in dual citizenship programs, Costa Rica, Belize, Romania, Slovenia, Croatia, and several others off the top of my head.",
         "Maybe they should switch to propofol.",
         "The hivemind doesn't like anything it isn't lockstep with their thoughts.",
         "They are so ingrained with identity politics in mind they are surprised when these demographics aren’t monoliths supporting Democrats blindly every election. Minorities lean left but they aren’t all leftys! This election showed that big time",
         "True but it is pretty funny how crazy these people are whenever Trump wins 😂",
         "My mom was a hardline lefty and I’m Libertarian lol your parents’ views don’t mean anything",
         "What’s ironic is my senate vote wasn’t a waste because the only options were republican and independent. And what’s also weird is I haven’t been harassed by trump supporters for voting for Chase.",
         "TBF this is Kamala we're talking about. Erections are in short supply.",
         "Wait...did my state just get called smart? You mean, Florida did something good? It's not just that Im missing the joke or something?",
         "It’s insane the way we’ve been gaslit since 2020 to just expect that it takes a week to count these votes when every election of my life before then (aside from 2000) we had the results the night of with no controversy",
         "Matt Walsh?",
         "I know it's a small sample, but I know a few dems that simply wouldn't vote for her, they all told me that they would have voted any other Democrat...I really think the Democrat party effed themselves by just handing her the nomination.",
         "Tulsi only got to talk for 30-seconds and killed her campaign with it. If that's all it takes to knock you out of an election, you probably shouldn't get anointed to bypass a primary.",
         "You clearly aren’t aware of her biggest campaign policy. She grew up in a middle class family. That’s it, that’s the policy",
         "Exactly, when she couldn’t explain her platform and resorted to “orange man weird” it was over.",
         "Costa Rica is $150k.  Already was looking at buying a house there and getting dual citizenship before the election and still will totally unrelated to the election.\n\nEdit to say in costs rica it doesn’t have to be a government investment just an in country investment, including, say a house.",
         "How many people have +$250k of liquid cash willing to lose to a government investment. Space isn’t that hard to go to, you just need millions of dollars.",
         "Facts",
         "Her dad is a Marxist",
         "Florida man gets his shit together and makes up his mind quickly.\n\nUnlike 24 years ago.",
         "No, Florida gets one thing right then fucks up the abortion amendment and the recreational cannabis amendment in the same night, y’all are still dumbfucks as a whole, present company possibly not included.",
         "The first election I really paid attention to was 2016 (High School me didn’t care as much) and I remember just staying up a little later than normal and knowing Trump beat Hillary. \n\nFast forward to 2020 and I go to bed thinking Trump won again and wake up, get to work, check my phone and it’s Biden and being confused as hell",
         "Fully agreed on your last point. She was a uniquely awful candidate in a lot of ways and I could see how she would just turn people off, but that margin is still so massive that it’s hard for me to believe it was just that, especially with all the other shenanigans that went on in 2020. I’m not claiming to know for sure or say anything definitive, but it certainly looks more suspicious today to me than it did yesterday.",
         "I think you’re both forgetting the joy and hope in her campaign.\n\nI’m not sure if that means I should feel joy about her not being Trump, or joy for being able to buy eggs for almost eight bucks.  Maybe it’s just hope my family will one day return to the middle class?\n\nEither way… Joy and hope people, joy and hope.  That’s the band-aid we were promised!",
         "Basically anyone who owns their house outright or is in the top 1%.",
         "You keep repeating that but there are heaps of stories about children distancing themselves from their parents and families, usually dems/libs and repubs/maga but you get the point. Your argument doesn’t hold.",
         "Okay? If you love a candidate for their views do you immediately disregard them if their parent was a Marxist?",
         "Yeah, i know ☹️",
         "You kind of need the sale of your house to buy a new house to live in… so don’t really have $250k lying around… and the top 1% literally excludes 99% of people. What camp do you think the “this didn’t go my way, I can’t live in the county anymore” fall under?",
         "\"You kind of need the sale of your house to buy a new house to live in…\"\n\nYou can buy a flat in a 2nd or 3rd world country for about $50K. If you sell an average priced house at about $500k, you can put $250K down, buy a flat for $50K, and still have $200K leftover for savings/taxes. It's not unrealistic at all, but most people don't have the guts to do it.\n\nIf you're in the top 10% in this country you can easily move to those countries and live like a king at any age. However, it's obviously could be more dangerous and sketchy, depending on where you go."
      ]
   },
   "1gkgip8": {
      "title": "Finally switched to the libertarian party. ",
      "text": "For the longest time I've considered myself to be a conservative in the sense I wanted lower taxes, smaller government, less regulations, more freedoms, etc. But several years ago I met a libertarian and we talked about many political things and he brought up several valid pointd. He essentially brought up several points that I never thought of before. Briught stuff up about \"how free are you if they will arrest you for not doing what they demand.\" He also described the typical social beliefs that come with libertarianism. Which some to this date I've personally struggled to side with. \n\nBut when looking at the bigger picture there are more things I've agreed with the libertarian party than disagreed with.",
      "comments": [
         "Fiscal conservative + social liberal = Libertarian\n\nKeep the government out of my doctor’s office, wallet, bedroom, voting booth, gun safe, and marketplace.\n\nAnyway, WELCOME!",
         "Welcome.  Just don't EVER go to your local meetings.  If you do we'll lose you in much less time than it took to make you decide to join.\n\nStick to online boards, and revel in the party platform being the best available option.",
         "A lot of libertarians are basically people who don't like taxes and the government and stuff. \n\nThat's a far cry from Thomas Paine, or any person who's given serious thought to individual liberties. Libertarianism doesn't even mean the disestablishment of government, rather it puts the onus on the one who wants to take away rights rather than on the person who has to argue for why to keep them. \n\nLike it's entirely possible and probable that the IRS stays around because we need to pay for *some* things as a society.  The military is a clear example, I'd argue that issuing passports and managing the borders probably fall into there too. Maybe even the FAA, NTSB, and... port dredging operations? FBI?\n\nEventually though you start running into things that may, or may not, be a great idea. Department of Education? Department of Health and Human Services? \n\nFortunately you don't need to solve every issue or plan out your last chess move. You start with the things that are the most egregious and that have the most momentum to break apart or otherwise redo in a better way.\n\nBut I'd urge you to read some books by libertarian thinkers to get the whole understanding and not just be the rather knuckle-dragging version of many political folks where they have a loose grasp of their ideals.",
         "Now do your own research on the intellectual roots of libertarian thinking and perhaps even associated economic ideas.\n\nPerhaps a good place to start:  \n\nhttps://www.libertarianism.org/publications/essays/history-libertarianism\n\nAnd associated with libertarian thought is the Austrian School of Economics. This is not to say all libertarians must be Austrian School adherents, nor to say all Austrians must be libertarians. But it is safe to say the two have concurrent thought and many people are both libertarians and Austrian School adherents.\n\nThe most well know voices of the Austrian School include:\n\nMises Institute:  https://mises.org/\n\nEuropean Center of Austrian Economics Foundation (ECAEF):  https://ecaef.org\n\nAustrian Economics Center:   https://austriancenter.com\n\nWell known economists like Milton Friedman and George Stigler are considered to be members of the Chicago School of economics and it is also loosely aligned with libertarian thought but diverges on the question of central banks and monetary policy.\n\nPerhaps the most well known concept associated with libertarian thought is the non-aggression principle or NAP.\n\nThe NAP is by no means the perfect definition of libertarian thought and does have issues:  https://www.libertarianism.org/blog/six-reasons-libertarians-should-reject-non-aggression-principle\n\nHowever, the main idea behind it drives libertarian thought. Namely, it is an ethical principle that forbids the initiation of aggression. And it flows that if an individual lacks the right to initiate aggression then a collection of people, even a majority of them, also lacks the right to engage in aggression.\n\nProto-libertarian Bastiat applies this principle to government in his treatise, The Law, when he wrote the following:\n\n>The law is the organization of the natural right of lawful defense. It is the substitution of a common force for individual forces. And this common force is to do only what the individual forces have a natural and lawful right to do: to protect persons, liberties, and properties; to maintain the right of each, and to cause justice to reign over us all.\n\nThis, to me, is the essence of libertarian thought regarding government. It has no more rights than any individual to act beyond that which an individual can lawfully do.\n\nHave fun going down this rabbit hole.",
         "Most people are Libertarians, they just don’t know it yet",
         "Libertarians are nice, their candidate this year is anything but one though.",
         "Welcome aboard! Now get out there and vote for RON FUCKIN' PAUL BABY!",
         "I wasn't interested in politics at all until Ron Paul ran for president and suddenly there was a guy who could articulate all of the dumb thoughts I have, in a way that sounds smart, and I just knew. Watching him in the debates I was literally thinking to myself, wow this guy is gonna win, he's the only one who has the right answers. Then I got into politics for real (maybe over-corrected) but now yes, I 100% identify as Libertarian, and still struggle to understand how any American wouldn't do the same. It sucks that the GOP isn't more Libertarian in general, I know they definitely used to be, but damn. It also really sucks that the Libertarian party itself is largely a joke, consisting of a lot of political grifters, and single issue drug legalization people. Because the ideology itself (to me anyway) seems so profoundly and obviously SOLID in all aspects that it seems like it should be an auto-pick for any thinking breathing individual. As soon as it's explained you should go, well yeah DUH if we want to be as free as possible, and have as little tyranny as possible, we should definitely do that.",
         "  Please remember that libertarians are known for being conservatives who dont want the conservative name. If you are a libertarian then you *must* believe in gay rights and the ability to have cosmetic and life altering surgeries if you please, given that you are an adult. You do not have to personally or morally agree with these things but in the name of liberty, we support them.",
         "I think it’s hilarious that on a Libertarian sub there are so many people arguing about which flavor of dog shit is better.\n\nI really can’t wait until this whole fiasco is over with.  Then the folks who backed whatever abysmal candidate ends up winning can bask in the glorious smell of their own farts while the broken system continues to devour itself.\n\nBe sure to pick up your “I voted” sticker.",
         "Question, I’ve been libertarian in my head for a decade but never officially joined. Was considering running for a local seat or something in the future and figured going to meetings would be the first step. What is wrong with local meetings?",
         "Lol, what does it say about us that the online discourse is more sane than the meetings? ",
         "Just tell him to read Mises, Hayek, Bastiat, Hazlitt and Hoppe.",
         ">Maybe even the FAA, NTSB, and... port dredging operations? FBI?\n\nThis is exactly where I'm at.  I'm a pilot, and there's zero way an entire industry like ours that by necessity crosses state lines and national borders on a daily basis could exist without the FAA (and by extension the NTSB).  We're seeing right now what happens when the FAA is underfunded with lots of flight delays due to understaffed air traffic control and local airports crumbling due to delays in funding infrastructure projects.\n\nAnd with the current incompetent state of a lot of local police forces and their insistence on trampling basic civil liberties, we absolutely need the FBI/DOJ to be an arbiter keep them in check.  Theoretically at least.",
         "I mean, what normal person wants to run for president? Now shrink that to be \"who wants to run for president with no realistic shot in hell of getting it?\" Don't get me wrong, I want a libertarian candidate party that can actually mount a non-zero chance, but 2024 isn't that year.",
         "Trump is NOT the best choice if you're Libertarian. \n\nEspecially with project 2025. I'm not going to tell people who to vote for, but Trump is the FARTHEST candidate from what a libertarian stands for. \n\nToo many fake Libertarians on this sub now.",
         "They are overrun with sovereign citizens, tinfoil hat conspiracy types (some quite literally), and various other wackos pushing really odd niche causes.  \n\nAnd they all want YOU to join their particular brand of crazy.  And they don't like it if you tell them NO, even if you don't give details on why.",
         "I’m registered but I don’t pay dues, like the party, especially the state ones baffle me at times. Especially their twitters which aren’t libertarian at all. Cough cough New Hampshire. Cough Cough Connecticut",
         "That's what I try to explain to people. It wouldn't matter if we over throw the government. It would eventually be filled with power driven, narcissistic people, who make deals with sharks. Those are the type of people who want to be president or in government in general.",
         "You're telling me that Kamala Harris is closer to libertarianism?",
         "Here’s a good Libertarian take on 2025. The mainstream media has been spreading wild disinformation about it considering *no one has actually read it*. It’s not all bad, but based upon restructuring government agencies when they should just be eliminated. https://youtu.be/cv72BigxKEY?si=uGrOTQ_a9VME2nw3\n\nIf you haven’t read it (I have) please stop using project 2025 to fearmonger. It isn’t directly associated with Trump as it is. Spreading misinformation wouldn’t be a very Libertarian thing to do, would it?",
         "If Ron Paul joins Trump's team, then how is Trump not the best choice? That's rhetorical, of course.",
         "Both candidates are Auth. Don't vote for either of them.",
         "''Project 2025'' oh my god, when did Democrat bots start gettin' in? - the image is you, except you're straight up going for the Dems.\n\n  \nRon Paul, Trump and Musk are INFINITELY more Libertarian than the Marxist, price-controller Kamala and her establishment party, supported by Socdems and Neocons.\n\nhttps://preview.redd.it/g49z7hd2p5zd1.png?width=901&format=png&auto=webp&s=76ab91a280ae9d2d9aea8a859818f5717d515379",
         "Power corrupts\n\nAbsolute power corrupts absolutely.",
         "On a personal ideological level or in style of government?\n\nTrump certainly uses more libertarian like rhetoric but in terms of how he actually intends to govern it will be significantly less libertarian\n\nKamala will be more or less a continuation of the status quo for all the good and bad that entails",
         "Did I say that?",
         "It's literally meant specifically for Donald Trump if he wins. It's a literal playbook for aTrump administration.",
         "They are literally saying this DAYS before the election to get naive libertarian undecided voters.\n\nTrump does not have this country's best interests in mind. He only cares about himself. \n\nWhy else did practically his entire cabinet + VP  denounce him and say he would be bad for America.",
         "And none of them are getting my vote for one.  Amazing to watch the whole country get in line like they have to vote either R or D.  Never Trump 2024.",
         "> Ron Paul, Trump and Musk are INFINITELY more Libertarian\n\n\nYeah, none of these people is at all like the other.",
         "You're special",
         "Trump is using Christian Nationalist rhetoric consistently. Which is far-right.\n\nNot a single thing he stands for is libertarian. He wants total control. \n\nHave you actually heard what he says, actually listened?",
         "Well yeah:\n\"Trump is the FARTHEST candidate from what a libertarian stands for.\"\n\n\nOr do you not know what FARTHEST means?",
         "I can write you a book and hand it to you. I can’t force you to read it or do as it instructs. Trump claims to have never read it, and his expressed policy positions support that notion.",
         "Sorry, no -- you're the victim of establishment propaganda.",
         "https://preview.redd.it/b6e312gkw6zd1.jpeg?width=901&format=pjpg&auto=webp&s=104e9d4bb8be5d54b59a46fd8e7b5180504039ef",
         "2 are billionaires who only care about $.",
         "and yet they're still infinitely more libertarian than Kamala.",
         "Socialist advocating for an anti-free speech, anti-gun, pro-price control government in a Libertarian subreddit, nice.\n\nWhat's next? Public healthcare?",
         "I mean he definitely uses libertarian rhetoric like low taxes deregulation ect\n\nAgain in terms of actual governing much less so he actually raised taxes on my Community because of the repeal of the salt tax",
         "Mf that's what \"farthest candidate\" means. Who are the other candidates?\n\nEdit: my bad bro. I responded to the wrong one. But yeah you right",
         "No, there are multiple candidates to vote for. It's not just 2 people. \n\nBut compared to Trump she is more libertarian.\n\nOne wants to force 1 religion on children and everyone else, one doesn't. \n\nOne wants to control women's bodies, one doesn't. \n\nOne wants to legalize recreational Marijuana federally. \n\nOne doesn't want to take away certain social/welfare services, one does.\n\nOne wants to tax the rich while one wants to give the rich tax cuts.\n\nOne wants stricter gun control (NOT taking away), one wants looser.\n\nOne wants protection for LGQBTA and one doesn't. \n\nNeed i go on?",
         "You actually believe what he says? Seriously? \n\nThe guy who has lied and cheated MULTIPLE times.\n\n🤦‍♂️\n\nNobody can help how gullible you are.",
         "Oh, you got any evidence to deny ANYTHING I've said?",
         "🤣",
         "Ron Paul - absolutely!\n\nElon Musk - probably a bit.\n\nDonald Trump - no.",
         "You're obviously a republican pretending to be a libertarian.",
         "Where did he ever say lower taxes for everyone?\n\nHe wants tariffs, which were one of the catalysts for the Great Depression. \n\nLook up the Smoot Hawley Act.",
         "Clearly you need an update on libertarianism. Abortion is a very controversial issue among libertarians. Welfare is very non libertarian because it's a social program funded by taxes. Tax cuts, no matter what, are almost always libertarian. Stricter gun control is one of the least libertarian things you could do.\nKamala is a pos just like trump and all they care about is power. They're both authoritarian.",
         "Dude you basically just made the case why Kamala isn’t Libertarian. More taxes, more gun control, more government.",
         "Doesn’t matter if it’s *plainly obvious* by the fact his expressed policy positions don’t line up. Quit being the type of person Lenin described as “useful idiots.”",
         "sorry bud, it's too late to troll over here; you and your astroturfers missed the timing.\n\nIt's over, crawl back to your 1st amendment-destroying, 2nd amendment-regulating, economy-controlling, taxation-increasing and government-expanding ways.",
         "Donald Trump is definintely more Libertarian than Kamala, do we really have another ''left-libertarian'' here? God...\n\nUnless you're saying that he isn't a Libertarian, which I agree with; I never claimed otherwise",
         "Yes he talk out of both sides of his mouth\n\nAlso personally I think the Federal Reserve is more to blame for the Great Depression",
         "Those are NOT against libertarianism.\n\nYall need a refresher. Libertarian is personal freedom. Trump is against personal freedom.",
         "Taxing people above $400k, that's bad? Did you not see the comparison of what their tax plans would do to the lower class?\n\nGun control in the sense of background checks, criminals will always find a way to circumvent those but it's better than letting someone who shouldn't own a gun just go get one.\n\nWhere did I say more government? Only Trump wants more government.",
         "The naivety of some people.",
         "Only Trump wants to destroy the 1st amendment, cultist much?\n\nHe's literally threatened multiple people and news outlets who have spoken against him.\n\nHe wants tariffs, which are BAD and increase inflation.\n\nPull your head out your ass. Oh wait you can't, it up Trumps because like the MAGA you're delusional and in a cult.",
         "Left libertarianism is an oxymoron. There can be no liberty without economic liberty.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "Don't know why you decide to ramble about Left Libertarian, which is an oxymoron.\n\nIt seems we agree that neither Trump nor Harris are libertarian, so let's leave it at that.",
         "Abortion is a violation of the rights of the fetus. Taxation is theft. Gun control is restriction on your right to self defense.",
         "I think you need to open yourself to some alternative sources from wherever you are consuming your news if you believe that Kamala is the small government candidate. You brought up project 2025 earlier and that specifically identifies numerous government departments to be eliminated or streamlined, a great example being the Department of Homeland Security an agency detested by most Libertarians. Simply look at the jobs numbers to see how the current admin is increasing the size of government.  25% of all new jobs are government workers, over 30% of our GDP is government spending. You can make an argument that is good but you cannot argue it is libertarian.",
         "holy TDS.\n\nI don't like tariffs. You know what else I don't like? Everything else about the Democrats. You are either extremely ignorant or a troll, just the fact you're trying to compare Democrat economic control and freedom raveging with Trump is insane. You are not and will never be a Libertarian, you're an ashamed progressist, I've already told you; go back.",
         "Left libertarianism is an oxymoron. There can be no liberty without economic liberty.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "1. Fetuses have no rights as they are not a person until they have been born to become an infant.Not all fetuses are consensual nor viable,  hence why abortion care is important. \n\n2. Taxation is not theft, unless it's being used for the wrong reasons.  Taxation is necessary for a government, otherwise it can't pay for things.\n\n3. Gun control is not a restriction on your right to self defense. It is there to make sure those who shouldn't own a gun don't have legal access. \n\n2/3 of your points are literal Conservative points.",
         "You do realize that everything that Trump wants to do is exactly what Hitler did with Germany. \n\nYou really need to re-up on your history. \n\nHistory is one thing I pay attention to and I'm fairly tuned to. Everything about P25 screams Totalitarian Dictatorship.\n\nFar-right? ✔️\nCentralized Government? ✔️\nMedia control? ✔️\nPunishment for political enemies? ✔️\n\n\nDo your research before coming at me.",
         "You seem to like Trunp.",
         "You are NOT a libertarian if you agree with anything about Trump. \n\nHe's far-right conservative and is not anywhere close to having libertarian views/values."
      ]
   },
   "1gkjoa7": {
      "title": "ELECTION ALERT: Still Too Early To Know Which Minority To Scapegoat",
      "text": "",
      "comments": [
         "I look forward to it every cycle. My fellow Cubans always make the cut.",
         "As tight as this race is, they are definitely ready to scapegoat a third party. The polls in recent weeks made them trot out Papa Ron to dangle in front of us to get that extra 2%.",
         "They fucking called it once again the democrats sub is going feral with blaming Latinos. As if ignoring immigrants for 4 years is suddenly gonna make them vote for you.",
         "Our candidate was cautious to make sure we’re not the spoilers this time I guess.",
         "The year of the Inuit!",
         "On a personal note my girlfriend is blaming me for Trump winning because I voted for Chase.  LOL.",
         "This morning the first thing I heard on the radio is that: \"White Women did not turn out in the numbers that were needed and underperformed as a voting bloc\".  So they have already named a guilty scapegoat.",
         "This is accurate.",
         "My colleague blamed the Amish.",
         "Unpopular opinion: the libertarian party should merge with the republicans and becoming just a caucus or at least stop candidating people for President and endorse the repubblican nominee",
         "Chechnya zindabad",
         "Lol",
         "Yep",
         "Yep, one single vote would have changed the entire race.",
         "I actually think libertarians made the difference this time.",
         "Nah, we will never give them an unconditional support. If they don't promise is things, we will not show up to vote.\n\nIdeally we should push for a libertarian vice president soon.",
         "VP does nothing though.",
         "VP is often next in line."
      ]
   },
   "1glbyxi": {
      "title": "Bet On Ron Paul for Cabinet on Kalshi - Should Be higher than 27% he was just talking with Elon about this.",
      "text": "\n",
      "comments": [
         "I’m not betting over something I have zero control over"
      ]
   },
   "1gkm9hw": {
      "title": "Florida Efficiency",
      "text": "I just wanna say... Florida has the least government funding per-capita of any state and is already over 70% in, while the second closest is Kentucky at 30% after almost 2 hours. Florida has been counting for half of that. More government is less efficient.",
      "comments": [
         "Florida allows local election boards to count ballots as they come in so all the mail in and early votes have already been counted.  \n\nWaiting until polls close to count all the votes is just plain government stupidity.",
         "You could just do all of this by computer. It should take about 4 seconds to count every ballot in America, if this were about efficiency, and not political gamesmanship. We can already do money safely with the internet using Bitcoin, but for some reason we have to go to a special physical location to use other computers to do voting, computers that sit idle 99% of their lives. There is no reason we can't just vote with our personal computers, public/private key encryption has been a thing since internet commerce took off, and there is no reason voting couldn't be done online...",
         "Delays are only necessary for adding additional ballots to the mix...",
         "That is nuts, I’ve never thought about it before but I really can’t believe they don’t “count as they go” so to speak.",
         "Counterpoint: the reason mail-in ballots are not opened until election day is to avoid influencing behavior prior to the election. If the early and mail-in vote totals are known prior to election day, someone will inevitably leak the data. That can be used to influence those who haven't yet voted (usually by persuading them to vote or not vote at all), or can be used by malicious actors to determine which races to target with ballot harvesting.\n\n\nNo solution is ideal; just trade-offs"
      ]
   },
   "1gl0hfb": {
      "title": "The Damage Done By Our Inflationist Regime",
      "text": "",
      "comments": []
   },
   "1gl868s": {
      "title": "True thoughts on more political appointees in the Executive?",
      "text": "What are your thoughts on having more political appointees in the Executive?\n\nI am dual-minded about it: \n\n1. The buck stops with the President in the Executive, so he/she should have the commanding power. Congress, Judiciary, states, and the constitution are his/her checks.\n\n2. Even though our government is bloated right now, especially in the executive agencies - I do think making bureaucrats into political appointees and firing in mass, is setting us to for failure in serious domains like health, safety, energy, and environment. And, it can clearly be weaponized with the Justice Department even more so than already.",
      "comments": [
         "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "The President is the only publicly-accountable figure in the Executive branch of the federal government. If he can't fire someone that means they don't work for him and, in turn, don't work for us."
      ]
   },
   "1gknrae": {
      "title": "How is NH libertarian?",
      "text": "Everybody says that NH is the most libertarian state, so I thought it's like a tax haven, but while there are no income or sales tax, its property taxes are some of the highest in the country and it has other taxes like 5% on dividends etc. Not sure how that'd be a tax haven. The really high property taxes make it unattractive quickly. Yeah there's a project going on there that's libertarian, but I'm interested in actual working policies, mainly fiscal, but social ones too. And also, it's actually pretty blue.",
      "comments": [
         "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "Lot of transplants from MA voting for the policies they moved to escape",
         "Free-staters vs. locusts and unfortunately there are more locusts.",
         "Recently, there have been a shitload of transplants from out of state. Escaping their own high taxes, high costs, and stifled environment. They are bringing their politics with them…",
         "You can carry your gun to vote even if the polling place is in a school. So that's pretty libertarian.\n\nHopefully it doesn't get taken over by folks moving there from Massachusetts though.",
         "NH pretends to be Libertarian for Reason TV and John Stossel and then they suck commie dick every election and cup the balls.",
         "There is more to Libertarianism than just taxes.",
         ">I thought it's like a tax haven\n\nIt is a tax haven. \n\nSpecifically, they're trying to attract people from the nearby, densely-populated areas of New England (Massachusetts, New York, etc). Legally reside in NH and pay no income taxes!\n\nA lot of city folk have second houses or cabins in Vermont or New Hampshire. They often go up there on the weekend, or to hunt. And if they can figure out a way to establish residence in New Hampshire, they can avoid the (heavy) New York taxes.\n\n>I'm interested in actual working policies, mainly fiscal\n\nAnything besides taxes?\n\n>And also, it's actually pretty blue.\n\nIt's more purple than blue. Republican governor. Democrat Senators.\n\nIn presidential elections, it's been a blue-leaning, but competitive state. Bush won it in 2000.",
         "Same is true of Nevada and Californians... Which is disheartening to say the least.",
         "I see, so some libertarian social policies. It's just that for me money matters the most.",
         "From surfing the thread for a while I think there's actually a higher amount of LP members of the gov than other states.\n\nSomeone who knows better than I do feel free to correct/support that claim^"
      ]
   },
   "1gkqejn": {
      "title": "Is Chase Oliver an establishment plant?",
      "text": "Pretty generic politician who has done absolutely nothing to spread the libertarian message and has pretty much quashed support for the party this election. Why wouldn't he be engaging more with Dave Smith and the podcast world?",
      "comments": [
         "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "He was a Democrat a couple election cycles ago, but didn't like that Obama was drone-striking everyone.",
         "He's doing worse than RFK, who isn't even running lmao",
         "Yes",
         "From what I've read on this sub, there were better possible candidates they just didn't get the nomination. I wouldn't be too surprised if the people that picked Oilver did so, so Libertarians didn't vote for him. Plus, with Musks government inefficiency task force, which Ron Paul is supposedly joining, that's going to take some votes away from the LP. Hopefully, it's made out to be as advertised. I wasn't going to be happy with Harris winning either, but that last bit is a silver linning for me.",
         "A plant? Nah. He's just a shit candidate. It happens.",
         "My conspiracy theory is that some republicans got involved with the nomination and put a candidate that was \"too far left\" for the people flirting with libertarianism and in doing so push people to the trump campaign. Then the tossing Ron Paul's name out there to drive more.",
         "He is just a poor candidate",
         "After backing Bob Barr and Gary Johnson (2x) to the hilt, I do not waste my time with the LP. It is a lost cause, unfortunately. Parties are made up of disparate voting blocks and interest groups. It's hard to found a party solely on a singular philosophy, no matter how good that philosophy may be.",
         "Chase Oliver’s biggest problem is he can’t read the room.",
         "Effectively. \n\nI don't think he's being paid to do this by the DNC or the like, but he came from the Democrats, and apparently still has a lot of internalized stuff left over that he's not really thought through. \n\nStuff like not engaging with people that disagree. \n\nThis goes poorly, as we see today.",
         "We had a chairman candidate strip on stage in 2016. Do you think we are worth the time of day for a plant to be planned out and executed?",
         "He sucks.  And supporting big tent capital L libertarian party sucks.   It’s a nice idea.  But the GOP has just delivered the most libertarian policy proposal since Ron Paul ran for president.  The big L party is now useless until needed. It has spent zero time making itself meaningful and instead spent all its energy encouraging malcontent at all cost behavior.  For 20+ years that’s been fine. This year that has changed.   Hilarious part is that libertarians have now won, and surprise surprise they’re still not happy about it.   I am a Ron Paul libertarian in principle.",
         "YES",
         "Correct.",
         "I mean kudos to him for that but that's also a pretty low bar to be considered a libertarian. A lot of people don't like drone bombing hospitals. In seriousness though, I just feel like there would be a lot of straight forward avenues for him to run a more visible campaign and it just all seems very low effort.",
         "I tried to search his history last week. However, looks like they've managed to completely scrub it.",
         "What libertarian policy proposal? A do nothing Elon Musk commission? That wasn't even really a Trump idea. And GAO already exists. There are hundreds and thousands of reports of waste, fraud, and abuse. Congress needs to act on them. Elon Musk coming in on the weekends will do nothing. ",
         "With what money and support ? \n\nYeah someone with more media attention ability should have been the candidate. \n\nBut candidates weren't chosen on being the best they were chosen on tribal affiliations of pro or counter mises caucus",
         "Oh yeah, he's correct on that issue, but he has some learning to do before running for president.",
         "The party tore itself apart and may never be the same.  I hate the woke trans bullshit but he put out the message and I never heard one non-libertarian thing \n\nRemember there were lots of vocal Republicans who hate Trump and endorsed his opponent.  Maybe it's because he used to be a Democrat too?\n\nHonestly the LP should be embarrassed, not because of Chase, he actually campaigned pretty well for a guy whose own party turned against him.  It comes down to us, the rank and file.  While we were not paying attention factions took over the party and fought each other instead of the state.  That's the sad truth.\n\nGod I hope Trump meant some of the small government things he said.  Interesting times.",
         "Libertarians got pretty typical vote totals overall. Just not Chase. \n\nChase performed abysmally low, even as other candidates did not."
      ]
   },
   "1gkx20q": {
      "title": "Does anyone know the best place for finding out voter demographic info once the election is settled?",
      "text": "I'm curious to see the demographics after the fact to see what happened. A friend and I are discussing the primary factor in this election was, and we want to see if there are signs of actual republican shifts amongst many voting blocks, or if this was the result of young-and-left-leaning people still being a horrendously unreliable group. \n\nNever really taken the time to hyper analyze the data before and we'd like to find a good source with specifics of possible. ",
      "comments": [
         "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "Exit poll data should be taken with a big grain of salt. ",
         "I'd be interested too",
         "No doubt. That's why I'm curious if there are any more concrete sources or if it's just estimates.",
         "It's really based on self reporting since you can't tell for sure how someone voted. If that person lies, there's no way to know. You can't even assume a registered R or D voted for their party. I don't know how you could ensure any level of accuracy on a secret ballot. ",
         "Valid point! I figured that was the situation."
      ]
   },
   "1gk2s52": {
      "title": "What “i tHiNk GoVeRnMeNt ShOuLd” actually looks like",
      "text": "",
      "comments": [
         "Not really, im actually seeing a lot of these weasels on the left defending the NY state government on this because if they criticize it, they think its somehow helping Trump.. it's party over principal always for them. \n\nwhen the movie Sound of Freedom came out, you had reviewers literally glossing over child sex trafficking in their reviews simply because the people involved in the movie were conservative and giving them praise was a big no no.\n\nEven if I'm not a huge Trump fan, at least I can stomach a number of his basic ideas. The modern day left has literally no redeeming qualities. They are lower than Bush era Neo cons which is pretty fucking low.",
         "They actively support the Cheneys so they are literally the same people",
         "![gif](giphy|QVP7DawXZitKYg3AX5)"
      ]
   },
   "1gkqa76": {
      "title": "Libertarian?",
      "text": "I've always considered myself unaffiliated with any political party, but this is the year it *really* hit me, I've only ever genuinely liked canditates that *just so happened* to be Libertarian. I'm quite young, so it's not like I've much experience in vetting candidates yet, but they always seem to be the ones that make the most logical sense, that have the most intricate and realistic gameplans, that are the most confident and non-malleable in their beliefs and views about citizens rights and societal betterments. I've scrolled through this group a bit and it seems to be a good one on getting more informed on what this party believes in and stands for currently! \nMy boy Chase Oliver is yet another underrated candidate.🤧 ",
      "comments": [
         "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "You are an idealist. Unfortunately, we live in a society that likes taking your paycheck for their pet projects. All of my family are hard core Democrats, and its impossible to logically argue with them about the unjustness of inflation or taxes, even when it seems obvious to me, and the belief that the team red or blue Uniparty candidate is somehow going to change anything is as absurd as it is dominant.  A lot of education of government school graduates will be needed before we can get out of the doghouse and actually play this game with the big boys.",
         "https://www.lp.org/platform/\n\nThat is the libertarian party's official platform and stances so you can read up on what the party stands for.",
         "Welcome! I hope you will find libertarianism to your liking!"
      ]
   },
   "1gk2vua": {
      "title": "Ron Paul: \"Suddenly Ideas Are Back in this Campaign\"",
      "text": ">After I posted some encouragement on Musk’s Twitter/X, he responded that he would be happy to have me join him looking for places to cut! While the last thing I am looking for is another job, I am encouraged by the outpouring of support and happy to help any effort to correct the wrong path we have been going down – a path toward total bankruptcy.\n\nhttps://x.com/RonPaul/status/1853652711142564328",
      "comments": [
         "This all should have come up earlier. By the time the whole \"Department of Government Efficiency\" with Elon and Paul came up I had already voted. \nTip for next election... Don't save the best idea of your candidacy until the day before the general election.",
         "Does he not realize what party increased the national debt much more than the other?",
         "They got my vote when they brought in Ron Paul. Idk if they're serious about getting two trillion a year but only one side talks about it.",
         "\"I have the concepts of ideas\"\n\nSad to see possibly the only principled politician of our time shill for Trump.",
         "You can't announce things early when you had no plans to begin with and you are just grasping at straws in the midnight hours.",
         "If you wait until the week of election to announce something you were never serious about it.",
         "I hope I don't see u crying on here when under kamala ur taxpayer money will be used to fund more meaningless wars.",
         "It's exactly what they wanted. Name drop and hope to lure in some suckers, while they have zero intent to listen to the man let alone implement anything he suggests.",
         "Same. The man is a legend.",
         "Same here. The party that brings in Ron Paul will have my vote every time",
         "Brought in Rand Paul… what exactly have they committed to? Did they have any discussions with him? Did Trump offer him any named position? No.\n\nIn the last week before the election there a few tweets. That’s it. Seems awfully convenient.",
         "Idk if it’s sad that there are people posting that this swayed their vote, or if all these posts are propaganda designed to sway votes.",
         "I did not vote for her, but let's not forget the 20 years of war created by Bush and other neocons. Do you really think Trump will cut support for Isreal? People here seem to forget what Libertarianism actually means.",
         "Exactly this. Less than a week before the election and it's all through twitter? This is clear cut bait.",
         "And Milei and Elon and Ross Ulbricht",
         "Either way, voting for Trump because of Ron Paul is absolutely not a smart idea.",
         "\n\n>but let's not forget the 20 years of war created by Bush and other neocons.\n\nThe neocons that back kamala? \n\n>Do you really think Trump will cut support for Isreal? \n\nNo, but I believe he will end the war with fewer casualties. Same for the Ukraine war. Neither of them would've happened if Trump stayed president.",
         "Agreed.\n\nTrump is not for libertarian views.",
         "Putin was attacking Ukraine regardless of who was president. In fact, it is no secret that Putin wanted and still wants Trump as president. Do you really think Hamas was not going to attack Isreal on October 7th if he was president?  I want the US out of all foreign conflicts, but let's not kid ourselves. Democrats and Republicans love a good show of military power around the world.",
         "And the guy who supports taxpayers money going to transgenders in prison does?",
         ">Putin was attacking Ukraine regardless of who was president.\n\nNato pushed him, too. Doubt Trump would've ever let it get that far. Trump would've gone to Russia before, just like he did in North Korea. \n\n>Do you really think Hamas was not going to attack Isreal on October 7th\n\nIt was weeks after we unfroze 6b in Iranian assets. That's quite the coincidence.\n\n>but let's not kid ourselves. Democrats and Republicans love a good show of military power around the world.\n\nI definitely don't disagree but Trump is by no mean a traditional conservative and is still imo the closest president in recent history to be anti-war.",
         "That's a Trump policy 🤣🤣🤣🤣",
         "Send a link",
         "It has been in law since 2016.\n\nhttps://19thnews.org/2024/10/harris-gender-affirming-care-incarcerated-people-fact-check/\n\nhttps://abcnews.go.com/Politics/election-fact-check-transgender-issues-trump-harris/story?id=115349047\n\nhttps://www.nytimes.com/2024/10/16/us/politics/trump-prisons-transgender-care-harris.html",
         "[deleted]"
      ]
   },
   "1gkpca7": {
      "title": "What is libertarian ideology ",
      "text": "I'm not trying to be disrespectful I'm just curious considering I vote in the next election and want to learn more ",
      "comments": [
         "It’s pretty wide. Big base of agreement is NAP. Non-Aggression principle. Basically we don’t support anything that would hurt others. How that’s defined can be broad, but I think most would agree that laws stopping things that don’t harm others are not necessary. Some may not like speed limits, drug laws, gun laws, etc. big variance when it comes to defining what harms others. But basically if what I’m doing doesn’t harm you, don’t stop me from doing it. \n\nExample: drugs. Robbery and murder are already illegal, so if I want to do drugs leave me alone.\n\nEdit to add- another relatively large agreement point is small or no government.",
         "Personal liberty. Small government. Anti war. \n\nThere's a wide spectrum of libertarians but that's how I'd introduce someone. Also, look into the non-aggression principle.",
         "Do your own thing and leave others free to do their own thing. Let free people make voluntary agreements with others rather than using government to violently force them to do what you want.",
         "Really depends on who you ask.",
         "All about freedom baby! Government control bad! Personal rights good! Taxes the devil",
         "My response to someone earlier today saying they are new to libertarian ideas:\n\nNow do your own research on the intellectual roots of libertarian thinking and perhaps even associated economic ideas.\n\nPerhaps a good place to start:\n\nhttps://www.libertarianism.org/publications/essays/history-libertarianism\n\nAnd associated with libertarian thought is the Austrian School of Economics. This is not to say all libertarians must be Austrian School adherents, nor to say all Austrians must be libertarians. But it is safe to say the two have concurrent thought and many people are both libertarians and Austrian School adherents.\n\nThe most well know voices of the Austrian School include:\n\nMises Institute:  https://mises.org/\n\nEuropean Center of Austrian Economics Foundation (ECAEF):  https://ecaef.org\n\nAustrian Economics Center:   https://austriancenter.com\n\nWell known economists like Milton Friedman and George Stigler are considered to be members of the Chicago School of economics and it is also loosely aligned with libertarian thought but diverges on the question of central banks and monetary policy.\n\nPerhaps the most well known concept associated with libertarian thought is the non-aggression principle or NAP.\n\nThe NAP is by no means the perfect definition of libertarian thought and does have issues:  https://www.libertarianism.org/blog/six-reasons-libertarians-should-reject-non-aggression-principle\n\nHowever, the main idea behind it drives libertarian thought. Namely, it is an ethical principle that forbids the initiation of aggression. And it flows that if an individual lacks the right to initiate aggression then a collection of people, even a majority of them, also lacks the right to engage in aggression.\n\nProto-libertarian Bastiat applies this principle to government in his treatise, The Law, when he wrote the following:\n\n>The law is the organization of the natural right of lawful defense. It is the substitution of a common force for individual forces. And this common force is to do only what the individual forces have a natural and lawful right to do: to protect persons, liberties, and properties; to maintain the right of each, and to cause justice to reign over us all.\n\nThis, to me, is the essence of libertarian thought regarding government. It has no more rights than any individual to act beyond that which an individual can lawfully do.\n\nHave fun going down this rabbit hole.",
         "In 2 words......personal responsibility",
         "First thing you should know:\n\n\n\n\n\n\n\n\nLibertarian =/= anarchy\n\n\n\n\n\n\n\n\nGenerally, Libertarians (myself included) believe in the NAP (anti-war, anti-meddling in other country's shit unless they meddle in ours), limited federal government (deregulated markets, emphasis on local and state governing) and advocacy for autonomy across the board. \n\n\n\n\n\n\n\n\nRule of thumb in Libertarianism: if it doesn't hurt anyone else or is an infringement upon their liberties granted to them by the US constitution (Bill of Rights), then it should be legal (gambling, drugs, prostitution).\n\n\n\n\n\n\n\n\nWhere different sects of Libertarians will differ is environmental issues and economic issues. But ultimately, Libertarianism is an ideology rather than a politician party, I like to say. Cuz for one, the USLP or any state's Libertarian party is a poor representation of what a Libertarian truly is. And two, Libertarians hate identity politics to begin with.",
         "Each human being is the sole owner of him or herself. It is unethical to initiate force or fraud against another human being.",
         "https://www.lp.org/platform/\n\nThis is the official platform and stances of the US libertarian party.",
         "Let the Lesbian couple defend their marijuana farm with ar-15. ",
         "I think this is the most succinct way to explain it. \n\nAny time the government imposes laws restricting what people can/can’t do, no matter the intention, it always affects some innocent people. Whether it’s sending kids off to fight a war they didn’t ask for, forcibly taking money from citizens who need it and giving it to foreigners, preventing people from engaging in recreational activities among themselves, or forcing them to have or kill a baby they want or don’t want. The best solution for everyone is to not put the government in a position where they have the power to control what people do, unless it’s to protect them from other people.",
         "I'll ask you",
         "What topic do you want to hear my beliefs on?"
      ]
   },
   "1gk0suf": {
      "title": "Team Red vs Team Blue: Election 2024 (ReasonTV)",
      "text": "b",
      "comments": [
         "Hell ya some Heaton in the mornin' with my coffee.",
         "Oh man so glad to see these guys back. BRILLIANT and getting slightly more harried and tired of this nonsense every time.",
         "I love the skits these guys do! The one where they are both impersonating used car salesmen a few years ago was gold",
         "[Full version here](https://www.youtube.com/watch?v=U58gzkIx7ps). Heaton and Bragg are great.",
         "![gif](giphy|hVTouq08miyVo1a21m|downsized)",
         "The difference for me this time around is Ron Paul",
         "The full version of these are usually great, not the tiktok version https://reason.com/video/",
         "Please don't be tricked into thinking they would actually leverage Ron Paul in their administration. Its just a last minute grasping at straws moment."
      ]
   },
   "1gl7gr1": {
      "title": "Libertarian on our sub,what are you stance on free speech and worker right? ",
      "text": "\nOk let assume we has worker name jim,jim are worker who do job perfectly According to the employment contract and jim never cheat buiness at all,but jim \"critize LGBTQ+\" and \"talk about race at job\", anyway jim never cross the line of employment contact,should business owner has right to free jim or not?i mean accord to worker right and free speech principle ,jim job security should get protected right?because\"cancle cultrue\" are very undemocratic and non libertarian thing?",
      "comments": [
         "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "I think a private enterprise owner should be able fire anyone he wants",
         "Free speech everyday. If Jim works at a private company, free speech doesn’t apply. Free speech is freedom from government telling people what they can say.",
         "All rights are property rights. Jim does not have the right to talk about whatever he wants at his job. He is on someone else’s property and that property owner sets the rules he wants. His employer can fire him for whatever reason he sees fit. Freedom of association is paramount in libertarianism. At Jim’s house, he can set whatever rules he wants.\n\nOn a personal note, I think we do need to foster a culture of free speech where it’s viewed unfavorably to fire someone for voicing an opinion. But, ultimately, it should be legal to do so.",
         "I think anti-harassment policies for worker’s rights is a good thing, but I also understand that it often gets abused. If it’s not affecting business, workers’ morale, or having any severe impact, I don’t think that person should be fired. Only if it’s impossible to find a work around for it (such as having those uncomfortable with him work with someone else instead of him) then, and only then, should he be let go. But it should also be up to the person in charge of personnel for that business what they wanna do.",
         "Free speech is about preventing the State from controlling speech.\n\nThe law does not shield you from consequences from private actors.\n\nWhat you're asking is no different from asking if you're girlfriend is allowed to breakup with you because you said something she doesn't like. Yes she can. \n\nSo too, employment is voluntary association, and either party can end that relationship for any reason.",
         "Only left leaning libertarians such as age old Argentines have a stance on worker's rights. Would be thrilled to find other libs worrying about that but at least in this subreddit I find them thinking more from the owner's perspective than the laborer's. Obviously (for me) a compromise should be made.",
         "Hit the nail on the head as far as I’m concerned.  Well put.\n\nI agree about the culture change as well.  After hours, off the clock, on my personal time and devices, my actions and speech are my own.  Employers trying to control or police my speech or behavior outside work hours and off work property is an over reach.\n\nCancel culture would be severely curtailed if employers could find enough backbone to say “We don’t control employees outside work.”",
         "If you don’t like the owner’s rules, can’t you take your labor elsewhere?\n\nIt’s hard to imagine a better compromise than letting workers be free to find a place they are happy working.\n\nMaybe I’m misunderstanding your comment?  🤷‍♂️"
      ]
   },
   "1gk8kay": {
      "title": "Partisan Press Conference: Election Day",
      "text": "",
      "comments": []
   },
   "1gjsa8s": {
      "title": "New Gonzales flag just dropped",
      "text": "",
      "comments": [
         "Very good",
         "But they literally came and took it..",
         "you can have my raccoons when you take them from my cold, dead hands"
      ]
   },
   "1gk8ga8": {
      "title": "Post-Election Truths: The Things That Won’t Change (No Matter Who Wins)",
      "text": "",
      "comments": [
         "You’re allowed to post libertarian stuff on here still? I thought this was a maga sub now.",
         "Seriously lmao"
      ]
   },
   "1gkzyy9": {
      "title": "The Wars of Donald Trump",
      "text": "",
      "comments": [
         "Trump got some praise on foreign policy, but he really wasn't all that great. \n\n* Sent weapons to Ukraine, which even Obama who backed the 2014 coup wouldn't do\n\n* Escalated tensions with Iran, bombing them multiple times\n\n* Was a complete shill for Israel, backing the Abraham Accords which essentially bribed Israel's neighbors into being friendly with US taxpayer dollars.\n\n* Nominated neocons like John Bolton, Nikki Haley, and Mike Pompeo to key foreign policy slots.",
         "Time to hold Trump's feet to the fire on war.",
         "lol like kamala wasn't campaigning with Liz Cheney"
      ]
   },
   "1gjnhn9": {
      "title": "We are all partially enslaved by a system that treats us as tax cattle",
      "text": "",
      "comments": [
         "She's from Canada. It really is this bad.\n\nMy marginal rate is 53%. I don't know how we got here, but if a militia were ever to form to destroy the fuckers responsible I would be first to sign up.",
         "I drove to work on a public road, that sure justifies the government taking a cumulative 40% cut on all of my transactions. /s",
         "She is SO wrong! We don’t work for free, we receive the great and very beneficial service of dropping bombs on men, women, and children in poor countries overseas! How could society even survive without this essential service. Do you know how hard your life would be if you had to pay private businesses to bomb all those children for you?!? Did you ever think about that?",
         "Could she buy bigger glasses?",
         "*chattel",
         "Preaching to the choir here, it’s real bad. Real bad.",
         "What state does she live in where she’s paying 46% income tax?",
         "I love that the government is so shit at managing the money they get from taxes. Time to send more money to fund the military complex.",
         "This is inaccurate because nobody works 7 days per week for 5½ months.",
         "Sure if you ignore that all those taxes go into everything that allows you to actually make any money at all. Along with being healthy, safe, etc etc...",
         "The militia most likely would not be able to afford ammunition.",
         "It’s all that “free” healthcare.",
         "Fuuuuuuuuuck. Sorry m8...",
         "Does it though? How about this, I kind of agree with you. I like public roads and I think we should all chip in to make them and maintain them. \n\nMy problem is how Tax Dollars are being spent. I am not a supporter of war. We all operate under the rule of law. If we step out of line, there are immediate consequences. The DoJ has never passed their own audits. And I have never heard of anyone being punished.",
         "Ackchyually at this point we are just working to pay the interest on the money borrowed for the services of dropping bombs on men, women, and children in poor countries overseas!",
         "I don't know man. I know a guy that can kill pet squirrels for way cheaper.",
         "Better to be dropping bombs on people we don’t know than have bombs dropped on us by people we don’t know. Amirite?",
         "Roads! ROAAAADS!",
         "She would, but too much of her glasses-money goes to uncle sam!",
         "She doesn't specify income tax.\n\nWhen you add all the taxes up, federal income tax, property taxes, state and local taxes, sales tax, fuel taxes, car registration tax, capital gains tax, I'm sure it would be even higher than that.\n\nNot to mention the hidden inflation tax that steals your buying power every year.",
         "It's Canada, and it is likely one of the lower taxed Provence.  Quebec without a dependant and married with two salaries is over 55% if you make over $160,000 Canuckistani dollars.",
         "Your right. Working for free for only 4 months out of the year is so much more reasonable. /s",
         "That's federal plus state in a lot of states.",
         "The State of Canada.",
         "They don't pay you for 7 days either. They pay you only for the days you work",
         "The underlying concept still applies",
         "The militia almost crippled the RCMP in Ottawa with some trucks so I'm not too worried.",
         "Baseball bats and crowbars would be fine too",
         "Boom! You get the best post of the day award!",
         "Appreciate that. \n\nI wish I didn't have to, but I'm planning my exit",
         "I wouldn't mind paying taxes if I get a 100% return on them in the form of public services that I actually use.\n\nWe all know that is not the case, especially for middle class people like myself. Even if the money wasn't wasted on foreign wars, at the end of the day I would still be required to give way more than I'm allowed to take in return. I want my taxes to be proportional to the value I get in return.",
         "And the taxes that businesses pay that are then passed on to you. It's taxes all the way down.",
         "That website appears to be Canadian?\n\n[https://www.fraserinstitute.org/tax-freedom-day-calculator](https://www.fraserinstitute.org/tax-freedom-day-calculator)",
         "I hear you buddy...",
         "Do you have any idea how much just a single road costs to build?\n\nEven if you only used one road to get back and forth to work everyday, you're paying far, far less in taxes then it would have taken you to build and maintain that road yourself. \n\nYou're definitely getting back WAY more than you put in.",
         "Lmao\n\nBro, the reason roads cost so damn much is... because they're built by the freaking government.",
         ">Do you have any idea how much just a single road costs to build?\n\nThe real cost? Or the arbitrary amount that any contractor could and would ask for the job? Even if you take the highest price, divide the costs by the number of total users, and suddenly, it won't be as high anymore. Take toll roads as an example. \n\nAnd if me using one road makes me a leech, then I'm curious about your opinion on people on welfare who use even more public services and provide even less.",
         "Oh right, I forgot to include the magic libertarian fairy where you can trade a 10 mile private road for two cows and a virgin maiden. 🙄",
         ">Even if you take the highest price, divide the costs by the number of total users, and suddenly, it won't be as high anymore.\n\nYou mean just like taxes do? 🙄\n\nPeople on welfare don't generally complain about getting more back than they put in.",
         "A road is literally just some black shit you schlop on the ground and then flatten out. It's not complicated.",
         "My taxes are not determined by how much I use public services. It even seems to be the case in a welfare state that the more I contribute, the less I get in return. All I'm asking for is a balance between the amount I have to pay and the value I get in return.",
         ">My taxes are not determined by how much I use public services.\n\nCorrect. As you have pointed out in the example of roads. You get FAR more use of public services than you actually have to pay in. You're literally using multi-million dollar roads every day for pennies a day.  That's the point of public services."
      ]
   },
   "1gjoklu": {
      "title": "Without TSA, who would hold up the lines at airport security?",
      "text": "Saw this news article today. Those that have flown into MSY know that it’s not a big airport, and it’s not a busy travel time right now. Imagine if this was pre 9/11, the company in charge of security would have either lost their contract or gotten a stern warning from the airport. ",
      "comments": [
         "Fuck TSA and fuck the Patriot Act.",
         "We had to travel through MSY after a cruise this last May. Out of the say 10 TSA checkpoints, 4 were open. The lines are only long from inept management and staffing practices. Also security is an illusion.",
         "\"Hey, I caught a terrorist!\" -said no TSA agent ever.",
         "Thanks GWB... the entire flying experience has gone to the shitter since then.",
         "Sounds like a good deal to me. People pay good money to stand around and get their junk touched. The government just subsidizes it at the airport.",
         "You know what would prevent a mass-casualty event? Corralling a mass of people, into a single choke point, with no walls or barriers, right *BEFORE* anyone is screened for any potential hazards or weapons!",
         "New Orleans native here. It’s a shithole. Done waste your time. Everything in Nola is run by incompetent people from the top down. Democrat leadership on full display.",
         "Well pay for fastpass. Then the super fastpass. Then your own plane.",
         "I'm voting for the presidential candidate who pledges to abolish the TSA!!!",
         "The patriot act was the least patriotic thing they have ever pushed on this nation.",
         "They’d have to do security like at the private side of the airport: modern. Blogs, posts, etc … a bot can sift through someone’s online personal and deem them safe or dangerous in seconds. Combine that with armed pilots (which is what we do in the USAF) and viola, actual security.",
         "Puhlease, it takes time to snap the latex gloves",
         "Well, how else can the TSA increase their budget? If everyone made their plane showing up 30 minutes before it took off, the TSA would get a budget cut.\n\nI'm not being clever or funny, this is how you increase budgets in government. Kids are stupid? More money. Long lines at TSA? More money. People getting sick? More money",
         "It always struck me as inherently unsafe to have large groups of people not knowing each other, standing together, in the name of safety.",
         "Last time I flew, the line for TSA was 3 minutes, and the line to check a damn bag was 90+. This isn’t just a government problem.",
         "TSA would be better as a prostitution agency. Here’s why:\n\n1. I’ve never seen TSA stop a terrorist.\n2. I’ve had my balls fondled by TSA many times\n3. I enjoy getting my balls fondled\n\nIf we take these 3 points into consideration and make the mandatory adjustments, I would be more than willing to pay for TSA.",
         "https://preview.redd.it/bms0dwn9r5zd1.jpeg?width=3024&format=pjpg&auto=webp&s=42ab89ad94091835987d21746729a1f0894ba16e\n\nIt was pretty busy yesterday. They wouldn’t let us downstairs. We had to stand in one of two lines. I had priority, but since I hardly ever fly, I didn’t know what this meant. So I stood in the regular line. When I got to the front he wouldn’t let me go downstairs at the same time as people were going in the priority line. I had to go start all the way over in the priority line. 🫠 But, I blamed it on my naïveté and went along with it.",
         "ABOLISH the TSA, ATF,DEA, DMV!!!!!!",
         "The TSA is why I will probably never travel. I don't like people touching me or my things. Or even looking, really.",
         "I'm a little clueless so forgive me, but what alternatives to TSA could be used? I'd like to think that we could get away with not screening people, but I have a bad feeling that terrorism would skyrocket. People are a lot more violent now than they were twenty or thirty years ago",
         "I thought this sub was all in favor of checking everyone’s documentation. Just think of all the murders they’re preventing!",
         "The Patriot act was crazy. Whenever we lead policy with fear it’s a dangerous road.",
         "No worries! The issue with Libertarians is more so to do with the nationalization of airport security, not so much having no security. When you have a privatized system like we did pre-9/11, you have competition between security firms, which incentivizes them to innovate, use new technology, ect, because if they didn’t, they would lose their contract to their competitor.\n\nWhen 9/11 happened, it was a sort of knee jerk response to nationalize, having convinced the American public that the government could do it better. In free markets, when these types of catastrophies happen, the company responsible will have to answer for their blunder. Will they go under? Will they be fired? Consumers ultimately will make the decision for them, and it will be corrected. Has their been a 9/11 style attack since 9/11? No, but it’s arguably not due to government taking over, in fact just the opposite happened.\n\nWithin the first months of the TSA takeover, security line wait times at airports skyrocketed, which led to more people driving. Controlling other factors like decreased air traffic and weather, automobile accident fatalities increased by 327 deaths per month, arguably killing more Americans  in a few months than 9/11 did. Not only that but in 2015, audits where Homeland Security attempted to sneak 70 dummy explosives across dozens of the US’s busiest airports, 67 made it through security.\n\nThat’s just the tip of the iceberg and there’s more, but Homeland Security in general is a contentious topic that Libertarians are passionate about.\n\nSorry for the long post!\n\nTL:DR version - big government taking over security made things worse, not better",
         "People are not more violent now than they were 20 or 30 years ago, its the media that makes it seem that way.",
         "Whenever people start saying \"We have to do *something*!\"",
         "still is crazy.  provisions of it are STILL in place.",
         "Exactly yet that’s all the media does fear monger people into voting against their best interests",
         "That's a really good explanation. Sounds cheesy, but you've really opened my eyes on that!",
         "That actually does make a lot of sense. The only reason why terror attacks seem more prevalent is because they're reported on more.",
         "\"Something\" may have started with investigation of the Israeli \"art students\" and their connections if any to the relatively new owner of the twin towers, but what do I know?   \n\nConversely, the \"war on terra\" gave us 20+ years of Uniparty sand wars and decimated two generations of American boys and men for the sake of oil, poppies, and destabilization of the middle east.\n\nNow Dick Cheney is in the tank for the American Socialists, and the Populist/Isolationists are adding Blue Dog Dems to their team.  Crazy times.",
         "I read in snowdens memoir that essentially they redefined what collecting data meant so that they were only “seizing/searching your papers” when they actually query their database of collected data. Like what!? If I take a copy of your personal documents but don’t look at them I’m still seizing them. I’ve heard the liberty act is bad too but I haven’t actually looked at it tbh",
         "Absolutely, because of the shock value that it provides and then people can't look away, and then they can make money off of advertising and shares and clicks and fear. \n\nthe last time i went through TSA my bag got pulled to the side along with about 5 other bags to be hand searched because of something that set off the machine. The agent went on break, the replacements just handed everyone their bags without even opening them. I call it security theater, an illusion of safety like someone else commented. \n\nI wish people would be more discerning of the motive, audience, source, etc of all messages they are being told before accepting them."
      ]
   },
   "1gk8c7u": {
      "title": "No Matter Who Wins, Half the Country Won’t Believe in the Election. Here's Why That's a Good Thing:",
      "text": "",
      "comments": [
         "“Here’s why that’s a good thing” couldn’t be a more Orwellian sentence, im sorry I’ve seen it with too many propaganda articles these days. I agree with the actual story though, just annoyed by the last sentence.",
         "If Harris wins “half” will claim the election was rigged through illegal fake votes or destroyed legitimate votes.\n\nIf Trump wins “half” will claim the election was stolen because misinformation is so prevalent and infectious, uneducated people were brainwashed to vote against their interests.",
         "No matter who is elected, the government wins and that is not the path to liberty or justice. People get too wrapped up in their side winning control of the power in Washington and forget that power is not the goal. It is liberty and justice.",
         "You should never put too much trust in them regardless.\n\nElection manipulation and fraud by interested parties has happened throughout all of history, and continues to openly happen today. America is not special. America is not immune. Every single election, there are people arrested for doing illegal election things. \"It was just a little.\" \"It wasn't widespread.\" \"It was caught.\" Whatever. It happens. It is happening.\n\nIt's like they say, \"the price of freedom is eternal vigilance.\" Be skeptical.\n\nNot saying go burn down your polling center if your preferred candidate doesn't win, of course. But absolutely do not blindly trust either.",
         "Downvoted. The Democrats will accept the results if Trump wins.\n\nI also think that at least 50% of Republicans will accept the results if Harris wins. \n\nThe very tiny percentage of Trumpies will riot, but the media is exaggerating how many Republicans have the motivation to riot. These same voters can't even be bothered to pick up prescriptions from the pharmacy, go to a doctor when sick, cook and clean for themselves, or maintain contact with relatives and childhood friends. 99.9% of them won't riot.",
         "If Kamala wins 100% of the country won’t believe it 😂",
         "Note that I did add to the title to make it a bit more provocative, but the author does highlight that a lack of confidence in elections will open up more peoples' eyes to the true nature of democracy and the state",
         "Hopefully Trump wins, so the left can see the result of democracy. And that living under an occupied government that results from democracy is an inherent evil.",
         "People losing faith in democracy is a good thing. Libertarians seek to abolish democracy, why wouldn't we applaud the decline of trust in it?",
         "No one claims election was stolen in 2016. There was lots of complaints, yes, but no one questioned the integrity of the electoral process. Please don't equate.",
         "The former only reduces faith in the electoral system, the latter will be used to justify censorship and is much more dangerous in my opinion.",
         "“Libertarians seek to abolish democracy”\n\nOn what scale? Consensus is important in any form of government, to a land dispute, or defining public utilities.\n\nI think the only thing all libertarians agree on, is that there should be less government, and that government should have less control, not necessarily on how we get there.",
         "I’ve seen that you oppose the idea of democracy and am curious to learn about the kinds of systems you can get behind. Is the issue the majoritarian aspect where 51% or more can infringe the rights of 49% or less?",
         "We don't seek to abolish democracy. You are sorely mistaken. It's broken and needs fixed in this country",
         "Yes i fully agree, i only was annoyed by the phrase “here’s why that’s a good thing”. So i completely agree with you, besides the phrase. I am afraid however that people will become lazy and that they’ll lose interest in politics and that their mindset will be like idc anymore it’ll happen regardless I have no power. But that’s of course our point, the power is with the people but many don’t understand that unfortunately. I think people get demoralized to the point of where they completely comply with whatever the government tells them to do. Im just really black pilled about the future because look at the history, it always repeats itself and it was always the people who were too afraid to speak out. Libertarianism is the only thing that can help humanity against a totalitarian system. We’re heading towards a dystopian totalitarian system and im fully convinced we’re going to lose it purely because of our fellow humans will be full of fear. Crabs in the bucket is a good metaphor for what i mean.",
         "https://www.washingtonpost.com/politics/hillary-clinton-trump-is-an-illegitimate-president/2019/09/26/29195d5a-e099-11e9-b199-f638bf2c340f_story.html\n\nYou guys have the memories of goldfish.",
         "Clinton said Trump was illegitmate president, Dems said Bush was also when he won in 2000. D's have a long history of election denial",
         "😆😆😆😆",
         "Consensus can be achieved in better ways than a majority forcing their choice on the rest. \n\nTake the choice, separate groups into no and yes, and give each side the choice they wanted and split the group. \n\nNow there's no tyranny of the majority.",
         "Exactly. Democracy is tyranny of the majority. Two wolves and a lamb voting on what to have for dinner",
         "Clinton conceded defeat on election night.  Look in the mirror and you may be shocked to discover than you’re floating in a spherical bowl.",
         "Clinton accepted defeat immediately. Your article is about her statement in 2019, which I agree I'm wrong in saying no one ever claim Trump is illegitimate.",
         "Yeah… Hillary repeatedly claimed that Russia worked with Trump to  steal the election from her. That’s not “nobody”. In fact, wasn’t there an investigation about this very thing? So many people “believed it” that Mueller was appointed anti investigate it. “No one claims”… interesting way to frame that.",
         "Much easier said than done. It’s clean if you only do it with one issue but as soon as you start adding more it’s messy",
         "What system or perhaps principles would you propose instead?",
         "She SAID she conceded defeat, then immediately worked to undermine the presidency of Trump behind the scenes. You cant say one thing, then actively work to oust a sitting president IMMEDIATELY and claim that you conceded. Both cant be true at the same time, especially when you claim him to be illegitimate in every interview you partake in. \"Not my president\" became the anthem of the left in 2016/17. Say what you will about her, she's not an idiot, she's a political killer. Her concession wasn't a modest act of contrition, it was a tactical  one.\n\nIn the obverse, Trump refused to concede defeat and immediately began working in the same way that Clinton did, but in the open and without the requisite political knowledge to do so effectively. It partially worked to galvanize his base, but mostly failed because when it comes to playing  the \"game\", he's a fucking idiot.\n\nIt's only circle toilet bowl talk because both sides do the same shit they accuse the other side of....and they both do it to varying degrees of success. It's easier to get away with when you control the shadow branches of government.",
         "Her campaign literally funded the now accepted fake  Steele Dossier which inevitably interfered with the 2020 election (And arguably still does because it's still accepted as favt for those who find it convenient). You can't both accept defeat and work behind the scenes to oust a sitting President. She literally is quoted in the article as saying that he's illegitimate, and in numerous other interviews from 2016/17, that's just the one I pulled.",
         "Anarcho-capitalism I think is the subreddit consensus",
         "Those actions aren't contradictory. You can acknowledge that someone won the election, and then seek to use constitutional methods to limit their power or oust them.",
         "Sometimes, I cant even believe how uninformed some people are. It's mind boggling. She's been fined multiple times for her \"Constitutional Methods\". When you set up a pay for play system with your foundation while occupying one of the highest ranking positions of government, you make enough money to be teflon. And yes, they are contradictory, especially when she says so verbatim in interviews for years."
      ]
   },
   "1gjdzey": {
      "title": "Innocence is no defense",
      "text": "",
      "comments": [
         "Rorschach's journal \n\nNovember 1 2024\n\nPeanut the Squirrel was murdered in New York.",
         "There is no law that government will not shoot you to enforce ... this is why government can never be the means to fix anything.",
         "This is why I believe in using tannerite filled fake dogs. The Feds hate animals for some reason, so if they’re gonna steal our property and shoot our pets, might as well have a good joke in the tragedy.",
         "We're heading down another timeline again, aren't we? Like when they put down harambe and everything went to shit",
         "The term anarcho-tyranny is increasingly useful to describe modern government.",
         "JUSTICE FOR PEANUT!",
         "https://preview.redd.it/ijjk3qjygzyd1.jpeg?width=1920&format=pjpg&auto=webp&s=82d20c5e4c5da85ef7786727e383f223eb04fa68",
         "They'll regain consciousness when bullets pierce their skin. By then it'll be too late.",
         "Didn't he bite some asshole, forcing the state to kill him to check for rabies?\n\n\nSure, the asshole shouldn't have been in a position to get bit in the first place, you could call it some form of squirrel self defense, but in general we value the lives and well beings of people over animals.\n\n\nWhat the DMV should have done here (if they must do anything) was issue a warning or a fine then follow up a few months later to see if he still has the unregistered animal.\n\n\nThe owner said that he was \"in the process of filing paperwork\" to get Peanut registered as an educational animal. He had peanut for 7 years. How long does it take to file that paperwork?\n\n\nI can appreciate the old libertarian/anarchist bulwark of \"the state shouldn't have a say in what I keep as a pet!\"and that's all cool until your neighbor gets a tiger and lets it roam free, or has dozens of feral hogs that they call pets.",
         "I don't like what they did either but come on, it was a squirrel not a human.\n\nHumans kill and eat literally billions of livestock every year. Trillions of animals killed for human consumption if you're counting seafood.\n\nAnd no, I'm not a vegan, I love meat. But let's be real here.",
         "Where are all the don't eat meat people? Where are the farmers abuse animals people? Where are the people who made the sign for okay to eat and not okay to eat? \n\nAwfully quiet 🤫",
         ">“They hate when I say, you know, when the elves— when I called Sauron, the elves said, ‘Well, he called Sauron brilliant.’ Well, he’s a brilliant guy. He controls 1.4 billion orcs with an iron fist. I mean, he’s a brilliant guy, whether you like it or not. And they go crazy.”\n\n>“He’s now Dark Lord for life, Dark Lord for life. And he’s great. And look, he was able to do that. I think it’s great. Maybe we’ll have to give that a shot someday.”",
         "You clearly haven't read the full story. The owner had filed the paperwork and was left in limbo with a response of \"in review\".\n\nHe cared for the squirrel for 7 years. If the thing had rabies it would be evident. Plus, the guy cared for it and, this is conjecture on my part, but likely had all the necessary shots for the animal.\n\nI honestly have a hard time siding with the entity that murdered a pet squirrel on this one.",
         "Squirrels and other small rodents don’t carry rabies. There has never once been a case of a human contracting rabies from a squirrel in the United States. The rabies excuse is blatant hogwash from the NYDEC. Let’s pretend that there was a chance that Peanut was rabid. In this case we can consider that the whole situation could have been avoided if the NYDEC would have not oppressed the poor man who owned the squirrel even if they were told to do so. Just because it’s the law doesn’t make it the right thing.",
         "We don't eat pets.",
         "They won't say a damn thing because they see speaking out on it as \"helping Donald Trump\" and I am 100% certain that the modern day left would defend child molesters before they did that. These people don't have any values they have a faction.",
         "are you saying that we should be vegetarian because we don't want to kill animals, like this squirrel?",
         "> If the thing had rabies it would be evident\n\nfalse.\n\n> Plus, the guy cared for it and, this is conjecture on my part, but likely had all the necessary shots for the animal.\n\nspeculation. also, there are plenty of shitty pet owners and plenty of pets that get into trouble without their owners knowing.",
         "The quotes that I've seen from the owner/caretaker had him saying that he was \"in the process of filing the paperwork,\" not that he had filed it and was having issues getting it approved. Still, he had had 7 years to figure out what I'm sure may be a super convoluted process.  \n\n\nAlso my understanding is that the state showed up because of his recently acquired raccoon, which are famously high risk for rabies, and took the squirrel because it was also unlawfully kept. \n\n\nReally if he cared that much about keeping the squirrel, he should have lived in a state that's not an authoritarian shit hole. South Dakota, for example, I believe lets you register exotic animals for $10 per animal, or legally become a zoo for $100.\n\n\nYes the state sucks for doing what they did, how they did it, but this guy could've also seen this coming when he constantly posted on social media about the animal that he was unlawfully housing.",
         "If I could give you an award I would.\nThere has been no single case of transmission as you say and the fact that such gross government overreach is defended on the libertarian sub is dumbfounding.",
         "> Squirrels and other small rodents don’t carry rabies\n\nit's rare, but entirely possible",
         "I don't know how we got here. Its like if Hitler had ever claimed the sky was blue they'd deny it because Hitler said it. The idea that they'd compare Donald Trump to Hitler blows my mind.",
         "Hardly. I'm just saying they're always talking about how horrible humans are for killing animals to eat...what about killing an animal bc it dared to live indoors?!",
         "> false\n\nYou're right. Rabies is known as a silent killer and doesn't show itself in any meaningful way.",
         "You're a sad little man, aren't you?",
         "> Really if he cared that much about keeping the squirrel, he should have lived in a state that's not an authoritarian shit hole. South Dakota, for example, I believe lets you register exotic animals for $10 per animal, or legally become a zoo for $100.\n> \n> \n\nif the squirrel had bitten someone in SD, they would still have killed it to check for rabies. It's a public health issue, not a heavy-hand-of-the-state issue",
         "Plain and simple, the smallest amount of research will confirm in the minds of any person with the smallest amount of common sense that the brutal execution of these animals was totally unjustified and is a very clear example of government overreach.",
         "> Hardly. I'm just saying they're always talking about how horrible humans are for killing animals to eat\n\nAnd you are saying that it's okay. So what's your problem with what happened?",
         "it does show up, but not until the late stages. it can be transmitted prior to frothing at the mouth",
         "I don't think animals should be killed needlessly. This was needless. The whole permit for exotic animals thing is insane. Have your animals. Just know that if they destroy property or hurt someone you're liable for the damages. \n\nAs for the vegan argument. They do themselves a huge disservice by being poor spokesman for their cause. Meatless Mondays should be their primary goal right now. Slowly introduce people to the idea of eating less meat. Eating meat less often. Not 'you're a monster! Only eat plants!'. Seriously shooting their cause in the face with that rhetoric. Play the long, slow game.",
         "> This was needless. \n\n-\n\n>Have your animals. Just know that if they destroy property or hurt someone you're liable for the damages.\n\nThese are contradictory statements. The squirrel did hurt someone. It bit a person. \n\n> As for the vegan argument. They do themselves a huge disservice by being poor spokesman for their cause. Meatless Mondays should be their primary goal right now. Slowly introduce people to the idea of eating less meat. Eating meat less often. Not 'you're a monster! Only eat plants!'. Seriously shooting their cause in the face with that rhetoric. Play the long, slow game.\n\nI don't give a shit about your opinions on veganism, I was just pointing out how incoherent your own argument is.",
         "Alrighty."
      ]
   }
}