{
   "1gl0ur8": {
      "title": "The Libertarian Party candidate is losing to the Green Party and a guy who dropped out of the race and begged people not to vote for him. This is what happens when you nominate weak candidates",
      "text": "",
      "comments": [
         "A very large chunk of libertarians voted for Trump.",
         "He was just a bad candidate.  Honestly, the LP is such a joke.  There really needs to be something better.",
         "Chase Oliver was a weak candidate.  It also didnt help Chase Trump was actively courting libertarians in a way a Republican hasn’t since Calvin Coolidge.\n\nThe Ron Paul being floated as someone to work with Elon also gave us some tingles in the week before the election.",
         "Unfortunately the Libertarian Party has a history of sabotaging itself. Just look at [Dancing Underwear Man](https://www.youtube.com/watch?v=7BAOiGTizU4) or Nick [\"I got physically assaulted\"](https://www.youtube.com/watch?v=63AgZqwk4Sg) Sarwark",
         "Good. Chase Oliver was a terrible candidate. The Libertarian Party needs to realize that we're tired of them nominating clowns",
         "It wouldn't matter if Ron Paul himself had run with 80's Ross Perot on the same ticket.\n\nI honestly don't think the US can go back from this two-party system at this point.  I put my vote to him, even if he is a clown, just to say \"I reject this D/R bullshit\", and no one gives a shit.\n\nFight local, ignore the big offices - for now.",
         "Nobody is going to take the Libertarian Party seriously until the Libertarian Party takes themselves seriously.",
         "Chase Oliver is an idiot and a joke. Got what you deserved. Liberty is not the same as Anarchy",
         "Yep. This party sure knows how to get me excited and then nominate some middle of the road candidate that has no change of moving the needle. \n\nLet’s all be real nice to Dave Smith. I believe he has a shot to make an impact in the near future",
         "There were no libertarians on my ticket at all. I only had 4 choices for President/VP.",
         "I had no idea who was even running until 2 weeks ago",
         "The entire party needs a reboot. I've seen more organization in a stampede.",
         "LP is not ready for Primetime. \n\nLocally, they don't even support state legislation that they believe in. If a L did not propose the bill they won't discuss it.\n\nSo short sited.",
         "You think maybe the Mises Caucus just turned people away from the party that just didn’t come back? When the Mises Caucus became the leader of the LP I personally swore it off and was going to vote D/R for the election, but when I saw people on these supposedly libertarian subs that I never bothered to leave pissed about him I actually looked into him and he’s what brought me back, because he seems significantly more sane than the people running the rest of the party",
         "I found it weird that the guy I would vote for was publicly supporting Trump already.",
         "We should give up on presidential races and put the money in targeted local elections. Chase's result is embarrassing.",
         "I'm literally subscribed to this sub and barely knew a thing about him. 3rd party is a waste of time and energy. Best option is to get libertarian minded candidates into one of the dominant parties. Last real effort was Rand Paul in 16, but he was just a shadow of his father, and got steamrolled by Trump 🤷🏻",
         "I am so surprised the Dems didn’t attempt a primary and just threw support behind Harris.",
         "Yeah... why DID he get the nomination?  I didn't think they could do worse than Jo Jorgensen, but boy did they manage to prove me wrong.",
         "Neither party ever had a candidate",
         "The Libertarian party might as well cease to exist and reform as a PAC for libertarian-leaning Republican candidates in the future if they have no interest in actually supporting their candidates for office. The two party system is a corrupt shackle on our representation, but the current state of our third parties is an embarrassment as well.",
         "...or maybe we swayed to vote for Red or even the Blue?",
         "Now would be a good time to choose and focus on preparing the next candidate.",
         "I thought it was obvious that the LP went with Oliver to keep from nominating a candidate who would take voters from Trump.",
         "I was undecided up until a few days ago but was probably going to vote for Oliver. It may have been done just as a stunt but getting Ron Paul on board to help eliminate government waste sold me.",
         "It's impossible for the third party to perform tolerable on the national level with ANY candidate. First, it should try to win or at least make a name for itself on the local level. And use gained authority to climb higher.\n\nAny results below 5% are statistically insignificant and should not be compared to each other.",
         "Chase Oliver wasn’t a serious candidate",
         "The LP cannot move forward without serious candidates. They should be focusing more on local elections. Revenue and membership is at an all time low, even the Mises Caucus is feeling the strain.",
         "Libertarians never win the election ever, I don't know why it's even an option on the list for people to vote, it's always either red or blue. Either way, I'm just glad we get a break from all the woke nonsense for the next 4 years.",
         "Because Oliver was a shit show to start and can go F himself.",
         "I think bigger than anticipated at the end, with Ron Paul being responsive.",
         "I really think Ron Paul’s comments on working with Elon in the days working up to the election really helped tip the scale here",
         "I am one of those. Because Oliver was a worse candidate than Jo Jorgensen and I predicted he wouldn't even get one percent of the vote I didn't think it would be this bad where RFK Jr beat him. The LNP needs to take a long look in the mirror how do you not even get 1 percent of the vote with so much anti-war energy.",
         "Yes, i did. The angry left wing LP got their big primary victory and nominated the third place guy nobody liked outside of far left LGBT activists. This is what they wanted.",
         "Yeah, to stop shit like this from democrats.\n\nhttps://en.wikipedia.org/wiki/Disinformation_Governance_Board",
         "Or Kennedy",
         "jo jorgensen was decent in my opinion. she’s what lead me to find out about libertarian",
         "Chase Oliver also went out of his way to alienate half of his own party. He bashed Ron Paul, he called the great Lew Rockwell a \"racist\", and he seemed more interested in starting drama with other libertarians than actually campaigning.",
         "If the LP wants me to care, they'll nominate a libertarian.",
         "Chase Oliver is about as libertarian as Trotsky",
         "I think it would take someone like Ron Paul, but maybe even more traction, getting a deep primary run then running as an independent. And even that might not be enough.",
         "Nobody is going to take the libertarian party until the libertarian party starts actually wanting to grow as well",
         "Genuine question: How is Chase Oliver an Anarchist?",
         "Chase never claimed to be an Anarchist, at best he was more Minarchist.",
         "The last statement is false. Chase is not an anarchist",
         "Oliver was on my ticket in MN and I was surprised to see a libertarian running for one of our senate seats (Rebecca Whiting). She ended up getting 1.7% of the vote to Oliver’s 0.5% which shows his weakness.",
         "Jo was based AF, I would love to have her back",
         "You seem like a real libertarian, you are for limited choice? 🙄",
         "I not a trump supporter but him coming to the LPC and telling libertarians he would free ross...was a pretty nice olive branch we dont normally get.",
         "It was what did it for me. Himming and hawing, then Ron Paul possibly working with Elon to cut waste? Deal.",
         "She was a great candidate.  I really liked her.",
         "She was definitely one of the best ones we have had running in the last couple decades",
         "Nah she was pretty bad not as bad as Oliver. The Anti-racist stuff was a joke and alienated a lot of Libertarians.",
         "Same, I always thought that after the whole Gary Johnson debacle the LP was a joke, until I heard about Jo and her policies.",
         "If reading this sub frequently is any indicator, libertarians love bashing other Libertarians. ",
         "She was just virtually unknown outside the party and wasn't really that exciting. She was maybe too based lol",
         "No, I'm just saying that's all there ever is.",
         "Even if it's a small chance, it's worth the bet to me, because ain't no way anything libertarian is coming from the other side.",
         "There were 5 choices on my ballot. Was yours different?",
         "Yes, but tell me when the last time was we had a libertarian president?"
      ]
   },
   "1gklzpw": {
      "title": "Ladies and gentlemen, Edward Snowden. ",
      "text": "",
      "comments": [
         "Cats are a horrible analogy for the libertarian party. My cat is a dick.",
         "Is this a real libertarian group? I was just banned from another for defending my 3rd party vote",
         "Someone help me understand this",
         "People don't fear libertarians.  They hate them.  Because most people have a religious faith in government to protect them and take care of them.  And the Libertarian stance calls that faith into question, causing cognitive dissonance, which is painful.   And hatred is the result.",
         "Being left alone is their fear along with the fear of what their neighbors will do with freedom.",
         "Something something selfish ideology something something",
         "Libertarian party leaving you alone sometimes equates to getting rid of the police force to hire private contractors, there are terrible ideas on this side too",
         "That's easy the dems (and Rs) have committed a significant effort in destroying this country and indoctrinating people.",
         "The fear comes from people’s own insecurities about self reliance and responsibility",
         "Porcupine is a better animal comparison",
         "People equate Mcarthyism to Libertarianism and look no further than that.",
         "They either love you or hate you and you never know which one it is and can flip sides at any moment.",
         "They're afraid because instead of siding on an issue, we want to take away their right to make those issues exist.",
         "🤣",
         "I almost got banned from this sub by making a cat reference one time:/. Libertarians DO NOT LIKE HOUSE CAT JOKES.",
         "There are some REALLY big cats out there...just say'n",
         "Cats? Like the ones who annihilate local bird and rodent populations, piss nearly pure ammonia to destroy plants (and thus pollinator populations), breed with wild abandon, and become incredibly territorial and violent at random?\n\nIf the libertarian party wants to stop funding animal control, then yes, I am afraid. I was a libertarian once when I was young. As I've gotten older, I just want a libertarian voice in the conversation of people who ensure my comfort.",
         "yea until the oligarchy comes and replaces the libertarians. I'm sure unrestricted capitalism will go wonderfully. Korea definitely doesn't have a problem like that :)",
         "Yeah, but organizing libertarians is like herding cats.",
         "I don't kill 200 small mammals every year if I'm left outside.",
         "Yeah while they may like to nap they do not follow the NAP",
         "Yeah my cat ass-Sprays me while I’m working on the car.",
         "Is more like being scared of a gecko",
         "A lot of non-libertarian traffic here. Which sub banned you for defending your vote? I'm vociferous about not voting for Kamala or Donald.",
         "This sub is sort of libertarian but a lot of republicans and anarchists seem to be members",
         "I mean, I got banned from the meme one because I dared to defend bodily autonomy for women in the same way everyone was up in arms about vaccines. \n\nI get the argument against abortion, and morally I agree with it. Apparently applying the same logic to bodily autonomy to both abortion and vaccines was too much for them. \n\nAnd I know they’re different, I just don’t believe the State has a right to tell people what they can’t do with their body.",
         "I'm not libertarian, but I agree with some ideas. The group here is at least open to reasonable discussion, and even when they internally disagree the conversation seems to be respectful form what I've seen.\n\nIt's not like a \"100% libertarian ideas or you can go die\" group.",
         "I'm not a libertarian and I get along just fine around here.",
         "He doesn’t understand why a political philosophy based on leaving people free to do as they please is a hard sell. \n\nBut it makes sense if you think about it. Most people don’t want to be left alone, they want to be taken care of. And they don’t want to leave other people alone, they want to control them. Because most people are not self sufficient, responsible, or tolerant people. If they were, libertarianism would be a much easier sell.",
         "I Agree",
         "Short of an overwhelming supermajority of incredibly ideologically consistent libertarians at all 3 levels of government, it’d be impossible to get the society you’re worried about\n\nA strong libertarian minority playing “kingmaker” in exchange for concessions from more traditional establishment parties would basically just be a moderating force leading to fewer people rather than more being ground up under the boot of the State each year",
         "I've never heard of anyone conflating McCarthyism and Libertarianism.",
         "Never heard of that comparison.\n\nWhat is a problem is how both parties agree on one item and that’s keeping libertarians off of ballots.\n\nBallot access has been an issue for years for the libertarian party and both Rs and Ds have gone to great lengths to refuse ballot access",
         "So really, everyone *else* is the cat",
         "That's because everyone else isn't a *real* libertarian like me!",
         "That's a feature, not a bug.",
         "Cats suck ass.\n\nNo wonder the movement isn’t catching on\n\nIf bet if we were herding dogs? 5X world election champs, THE LIBERTARIAN PARTTYYYYYYYY",
         "Damn hunting seasons.",
         "r/libertarianmeme \n Someone shared something calling a 3rd party votes a waste. I simply stated it was a weird sub to choose for being against 3rd party voters.",
         "I like to make that comparison too. But I also add in infant male circumcision and conscription (Selective Service). Bodily autonomy for me, but not for thee...",
         "A better way, is to just enjoy the meme. Yaaaassss",
         "![gif](giphy|f4IlrIxdBqw7kamU5T)",
         "And also because a lot of people actively want to tell others what to do.",
         "Thanks. Misinterpreted “fear of libertarians”. Makes sense now",
         "For some reason its pretty common.",
         "*an indoor cat",
         "Sure thing, Pinko.",
         "Ask four Libertarians their opinion and you will get five diferent  replies.",
         "Right to jail.  That language is totally verboten.  How dare you criticize a criticizer.  /s",
         "Libertarianmeme is basically republicanechochamber now. This sub has been a lot better recently.\n\nI got permabanned for posting a \"meta meme\" because apparently a libertarian meme subreddit has a bunch of rules? Doesn't make sense to me",
         "I don't live in a swing state so I would say not voting 3rd party is a waste of a vote.  Won't happen this time either but hitting 5% would be awesome.",
         "Ha! Welcome to the club. Banned from there as well for saying conservative memes are annoying.",
         "They're red af right now. A bunch of disaffected left-leaning independents will decide they are Libertarian soon and flock to any Libertarian sub and this sub will swing blue, while the meme sub balances out.\n\nThis sub has been comfortably balanced lately but I'll need to find a new home once the Trump hate moves in."
      ]
   },
   "1gkykwu": {
      "title": "California doesn’t make sense",
      "text": "“Prohibits the California Department\nof Corrections and Rehabilitation\nfrom punishing incarcerated persons\nfor refusing a work assignment.\nAllows incarcerated persons to\nvoluntarily accept work assignments\nin exchange for credit to reduce their\nsentences.” \n\nBut they’ll virtue signal online, don’t pay attention to the fact that these votes against rent control (I’m against) are all from LA and the bay. Rich posers that don’t even believe the shit they preach. If you gave a fuck about minorities let’s just acknowledge the fucking elephant dude. More PEOPLE are on the street than ever, and are incarcerated more than ever. At least they voted for stronger sentences for drug offenses(mentioned fent in the prop specifically) and theft, but they’ll never admit they did. No, the leftists in California are holier than thou. They’re actually decent human beings… yeah fucking right. They’ll protect their shit over your life and point the finger at GOP for being the worst thing since satan. Be up front about what you want. ",
      "comments": [
         "Never has",
         "They did the same thing here in louisiana they won't pass the law to abolish slavery because then they can't work the inmates and get free labor or basically free labor",
         "Californian here. They have played funny games with the wording on propositions for so long now, most people have trained themselves to just vote no on everything down the line.",
         "I always wonder about the wording on the ballot for some of these. The summary on the certainly seems a lot more inflammatory. I know in my state we've had wording come across with double or triple negative to try and confuse people into voting one way.",
         "The more I think of this, especially in the context of it being California, the more messed up this is. Just... wow",
         "“So you sue him and he has to become your butler?”",
         "Who is going to prison in California? Harris is not top cop anymore.",
         "So working in jails is wrong now? 54% say its OK...",
         "Almost everyone in California has been a victim of a crime.  We're tired if it and sympathy for criminals is at an all-time low.  All it takes is for someone to steel your catalytic converter, and you too will be pro slavery.",
         "Apparently they listened to Kanye and decided to get rid of involuntary servitude as a  punishment for crime",
         "Now, do they throw people in jail or give community service.\n\nGuess it's Jail and fines for people now",
         "Will be ironic if people are thrown in jail for stealing then have to make what they stole in prison…",
         "Can we just cut them loose or take over?? Waiting for the other show to drop with California’s ridiculousness is exhausting.",
         "They need their free fire fighting.",
         "this was mainly around involuntary servitude in prisons.  seems a bit of a stretch to call that slavery.  That'd be liking saying your were kidnapped instead of imprisoned.",
         "Commies gonna commie.",
         "I vote in CA and I was blown away how out of step the results were.\n\nWe won't raise the minimum wage and we want slavery...",
         "I voted against the theft one",
         "California loves prison labor. Their former AG turned VP, turned failed POTUS candidate used to lock people up to use as slave labor, even keeping them beyond their sentences.",
         "How many rich people have maids, nanny, and servant working for nothing live over there?",
         "Did they somehow relate this to M/s relationships?",
         "This, lots of states do this. Usually you can labor when sentenced and get time taken off.",
         "I developed a strategy several years ago, \"No unless there's a good reason\" and voting on propositions I don't understand is much easier now.",
         "We did pass Prop 36 and it undid a bad Prop 47 in 2014. That was basically our anything stolen under $950 was a slap on the wrist. 36 basically says if you have 2 other similar charges in the past, it’s a felony. It was a good correction. The only opposition they put on the ballet were fiscal cost and “increased state court workload” lmaoo\n\nCan’t buy anyone is worried about fiscal cost of fucking anything in California. We passed Prop 35 that states “make permanent an existing tax on managed health care insurance plans that provides funding for the state's Medi-Cal health care program.” So our plan is to just keep printing money apparently..",
         "Working? Absolutely not. You volunteer to work, you don’t force chained men to fight wildfires though.",
         "Agree to disagree pal",
         "Why did they put \"theft or drug crimes\" in the same vote.  Those are two vastly different issues that people are likely to have different opinions about.",
         "To be fair I’d be stereotyping but yeah. Landlords in the “nice and urban” areas. Tech bros and university 20 somethings. Always gonna be the most fake people lol",
         "\"Working for nothing\"?\n\nDo you mean literally or figuratively? All those service providers definitely charge for their services.  There is a demand for this labor, and it seems hard to be deported just for working illegally.",
         "My issue is when it’s involuntary",
         "I saw that, and was not surprised to hear that Ca had a ~70B deficit last year. Who knew things cost money???",
         "did what could in my state to make my voice heard on these issues. all you can do really, i think prisoners can be rehabilitated better than a chain gang program.",
         "Wouldn’t this also include sentences like community service? That’s forced free labor. Too vaguely worded for me.",
         "Interesting point of view... I thought they should pay for their own spending one way or another. Instead of relying on taxpayers pockets.",
         "I thought the firefighters were 100% voluntary. But yes, I get not having forced labor.",
         "Have you ever worked with fire crews?",
         "That actually happened? And they voted for it to CONTINUE? Wow...  TIL",
         "I don’t have an issue with putting criminals to work. I work everyday. Lounging about a cell isn’t good mentally or physically. So long as the conditions are humane, I have no issues with involuntary labor - with one caveat. The state should not make $$ from it. Can’t incentive the state to grow inmate population. But you can ensure those who are incarcerated are being productive members of society even if it isn’t by choice - it’s a punishment.",
         "![gif](giphy|lXu72d4iKwqek)",
         "I guess giving someone options of community services vs jail would make it not involuntary.",
         "They should have the option to work for wages, which goes straight to paying off their expenses. Anything they make on top of that they can keep when they are released. ",
         "They should have the option to work for wages, which goes straight to paying off their expenses. Anything they make on top of that they can keep when they are released. ",
         "I don’t have an issue with putting inmates who want to work, to work. What I have an issue with is involuntary labor being punishment. Punishment and involuntary are the key words for me.",
         "I can dig it. Maybe I’m overthinking it but I feel like community service should have been mentioned specifically to avoid confusion.",
         "Should they be given food if they don't work? What about the guards wages?",
         "Yes. Let’s let convicted felons decide what they want to do everyday.\n\nDude, it’s work and paying off a debt to society. Just send them to a country club next time with your line of thinking",
         "How does involuntary labor work in prisons? I’m curious. Do people get beat if they don’t meet rock breaking quotas or something? Or is it work in exchange of something?",
         "Legislators have to be the laziest group of human refuse imaginable. They have to write all these shitty vague laws on purpose because they always seem to go out of their way to make laws inefficient and terrible.",
         "Involuntary servitude as a punishment for crime. If you consent to community service that’s preferable. But if you don’t, we just sentence you to jail for the original crime. What this would actually do, is make it unconstitutional to punish an existing inmate for not consenting to work in the kitchen, for example.",
         "What a straw man 😂",
         "You can elect to work and get time taken off your sentence in return. If you don’t want to work no one makes you. If you like being in prison and just want to hang out with the boys no one is going to force you to work.",
         "You’re not wrong. Intentionally vague describes most of our nation’s laws.",
         "Which is ridiculous. And why it will hopefully never pass.\n\nTo a certain extent, you have relinquished your rights when you decided to violate the rights of someone else (the victim)…which is why you are in prison \n\nSo I don’t follow you here",
         "How? Lol. It’s directly addressing your point.\n\nDo you know what a Strawman is?",
         "You over simplified the fuck out of what I said haha",
         "Well, yeah. Simple is better.\n\nBut that’s not a strawman, bro."
      ]
   },
   "1gkqer8": {
      "title": "how is everyone NOT excited about RON FREAKIN PAUL being called into the admin",
      "text": "AUDIT THE FED PLEASE !!\n\nI LOVE RON PAUL .. i canvassed for him and supported the hell out of him .. he had TRUE grass roots following AND HE IS POTENTIALLY GOING TO BE A PART OF THE ADMIN!\n\nARE YOU KIDDING ME!?!?!?!?!?!",
      "comments": [
         "I’ll say this as a 2014-2019 Marine when General Mattis was brought on as SecDef.\n\nI guarantee it’ll be short lived when the person you (rightfully) worship doesn’t get along with the Trump admin. But I’ll take any amount of Ron Paul at any level with the Federal Government",
         "Do you actually think trump will follow through? Even if he does he will probably just fire him over some stupid thibg",
         "I’m skeptical anything is going to happen. I think it was a ploy by Trump to get independents to vote for him. I don’t think Trump has much desire to slash the government.",
         "Because I don't trust Trump for shit. I'll believe it when I actually see it, and not a second before. Trump is a fucking scumbag who isn't fit to shine Ron's shoes.",
         "For me, it's the lack of consistency that the Trump administration has. I fear he is just using Ron Paul as a way to get the Libertarians to vote for him and nothing more.",
         "Bc he's 89 years old. It's clearly a gimmick",
         "Lol trump isn’t cutting the size of government.  He is a big believer in big government and big government spending as shown when he actually governed and grew government more than anyone before him.",
         "Ron Paul is at the age where he could drop dead any day. What makes you think he will have any influence at all and this isn’t just Trump/Elon just pandering for more votes?",
         "Because it's still the Republicans in office and they're still beholden to their own masters. We got some candy, not dinner. ",
         "We will get excited when he actually gets the axe in his hand and chops something. Libertarians are a skeptical bunch, for good reason.",
         "Ron Paul involved to any degree with the federal government is a win",
         "Can he have Javier Milei move to the US for a cabinet position? How about he takes his advice... that would be frigging awesome!!",
         "Well he hasn't yet or did I miss something",
         "Got Ron Paul on people's radar again. That's a huge plus for our party!",
         "How is Ron Paul doing these days?\n\nI remember him having a stroke on a live TV or livestream or something 4 or 5 years ago.\n\nHopefully he's well and could be effective.",
         "End the fed! Ron Paul 2012!",
         "He is 89 years old, and Trump can either be lying or he's going to choose him and then change him after 1 year or so",
         "It won’t happen. Empty promise that they don’t intend to keep.",
         "Chase Oliver getting 400,000 votes really showing the system who is boss 😂😂😂",
         "Excited about a politicians promise? I’ll hold the excitement for now.",
         "It's not that we don't want Ron Paul, it's that we don't trust Trump to actually do anything he says",
         "I kinda doubt this will happen plus to be fair Paul is getting a little long in the tooth \n\nAmazing guy but still we all have our time",
         "It's the only positive thing I've seen in politics for decades",
         "Trump will audit the fed in the same manner he released those Kennedy docs.",
         "It's the only thing that got me to vote the way I did. Better some influence than none at all.",
         "I’ll believe it when I see it. There are always a lot of promises made during a campaign that don’t actually happen. \n\nHe’ll get shelved. Trump is a liar.",
         "Love me some Ron Paul, but the man is almost 90 and I haven't really heard much from him in 10 years.",
         "We will see if he does the same thing he did to Jeff Sessions",
         "no way! he was amazing back in the 90’s",
         "I really hope that happens! Like would be incredibly excited if it does! I can imagine he'll be an advisor to the president, of some sort, so I don't think he'll be touching any military things.",
         "Oh, we ARE FUCKING EXCITED, BABY!\n\nBeen waiting many years for something like this to finally happen.",
         "Orange man can go piss himself in a corner somewhere. \n\nSuper excited to think about ron paul being part of the admin tho. If irangey can hire him to start shutting down fed agencies and audit the fed it will be an amazing thing to watch.",
         "Excited??? I just popped!!!!!!!!!!!!!!!!!!!",
         "I'll believe it when I see it.",
         "Elon and Ron Paul cleaning house!!!!! \n\n\nI'm practically foaming at the mouth for it!",
         "Simply put as everyone has already stated,  IF it happens - great. Chances he utilizes him even then, very little.",
         "Super excited!",
         "Because it hasnt happened yet. It's only words at this point. Once its action i will get excited.",
         "…this didn’t age well 😆 \n\n“I reject Ron Paul and I am #sorrynotsorry about it.”",
         "Trump is Trump. Everything is about him and loyalty to him. I don’t think Ron Paul will have much room to maneuver in that environment.",
         "Because Trump and Elon are attached? Not a hard concept to grasp.",
         "Sorry Chase but this was the right decision.",
         "Anybody remember the revolving door of his last cabinet? Some of them like Gen Mattis didn't have time for his chair to get warm before he was out of it.",
         "I’m with you.  Having watched him get screwed on the primary stage. This is amazing.  Every one who is contrary is too immature to grasp what is going on or a kamala supporter.  No in between.  Those who choose to remain skeptical are fine, but have to be willing to admit that if even 10% of what we’ve been promised is delivered, it will be the most libertarian administration in US history.",
         "I’m excited that Kennedy will be able to have cart Blanche and can make some real health changes that will help a lot of people.",
         "you guys are all very very bitter lol",
         "Yeah this only came out a couple of days before the election to drum up libertarian support it might not even happen",
         "I think Doge-man will be running interference...",
         "You are right\n\nBut even a week of Ron on the job will do us all much greater good, let alone imagine a month, a year",
         "As a fellow autist from 2008-2013 I feel your pain.",
         "Mattis was absolutely terrible, he resigned because he was upset that Trump wasn't enough of a warmonger, specifically that he wanted to withdraw from Syria",
         "Hopefully it is Ron Paul, talking to Elon Musk.  Trump seems to be very influenced and will listen to someone like musk.",
         "Let's see how he treats angela.",
         "Exactly this",
         "Ron Paul is anti establishment we good",
         "Trump already had a term and I don't know why people keep thinking its gonna be any different...",
         "Elon did it bud",
         "Trump is a business man, and can be convinced if it's either profitable or good for the American people. I'm sure Ron can influence him, when he has his ear.",
         "That's the oldest trick in the book but I have some hope it doesn't happen",
         "That first term. However shi don’t happen over night. Look at Vivek he literally very libertarian. So much better then most republican. And trump like him. Trump also endorsed Javier millei in Argentina and Javier is definitely different then him when it comes to to policy",
         "So is trump",
         "That's my thought as well. I love Ron Paul as much as anyone, but who I really want is some forensic accountant who is just old enough to have the experience to know what to do, while being young enough to work the 15 hour days for months on end tracing every transaction.",
         "Well said",
         "The Machine is gonna Machine. \n\nThat said, the absolute meltdown on Federal employees subreddits is kinda intriguing. They're worried.",
         "the tree remembers what the axe forgets \n\n\n..... give ron paul that government axe !",
         "trump isn't president yet buddy",
         "I saw a lot of libertarian reps on the ballot this election. Compared to my last 5 elections I'd say there's solid growth. We might get a seat on senate in the near future, relatively speaking.",
         "He still does his show to this day and seems to have better mental acuity than people half his age, to be honest.",
         "Omg really? I was looking for how much votes he got. Where did you find that?",
         "I hope he’s in the equation. Normalize a divine hatred for waste.",
         "I hate that you might be right.  Although Trump generally did what he said he would do last go-round.",
         "You're probably right. Best to hope though.",
         "This. Trump famously runs off at the mouth every chance he gets. As soon as Ron wants to cut one of Trump's buddies sacred cows it'll blow up into a shit storm. The good news is Ron will absolutely not back down and say what he thinks, and it will all be very public. So I do have just the tiniest sliver of cautious optimism if it happens.",
         "Yeah one has got to wonder why republicans don't cut government spending when they actually have the power to do so (the governors, too, benefit from big government and high taxes).",
         "Not just a full term, but he also had a trifecta for 2 years. He could have passed spending cuts if he wanted to. Instead he passed 1 tax cut and increased spending. Anyone thinking that 89 year old Ron Paul would actually do anything is deluded.",
         "I ask the same of people who thought Kamala Harris would do anything different. She even said she wouldn't. We were kind of doomed no matter who won.",
         "The only thing I wonder is that this time around it'll be a lame duck. He doesn't have to worry about reelection and could therefore be a lot more direct with some of his policies.",
         "Maybe the lawsuits and the assassinations attempts might make things be different?",
         "I would not be surprised to see a fallout between the two of them. Just look at how things turned out with his last administration. Could absolutely see Trump turning on Elon and blaming him for something",
         "Most people would not like the idea of appealing the civil right act. They just don’t. So I won’t be surprise if someone can if most people couldn’t vote",
         "It not that. Trump have to appealed to massive so if most people couldn’t vote Trump would probably have more libertarian policy",
         "!remindme 3 months",
         "Trump is 89 years old? News to me.",
         "Now he is",
         "And in 500 short years, maybe 2!",
         "Look at the google election results. It’s like 500k now. Less than RFK who isn’t even running.",
         "repealing the Civil rights act? what? did he say that?",
         "One doesn’t need to be 89 to be at an age where they are more likely to drop dead at any moment",
         "Oh dang I see 560,000. Oh shit lol",
         "In 2020 the libs got 34,000",
         "yes Ron Paul has said that he doesn't believe the civil rights act was necessary and was an unnecessary intrusion into the private world:  https://www.lewrockwell.com/2004/07/ron-paul/the-trouble-with-the-64-civil-rights-act/",
         "An 89 yr old can expect 4 years. A 78 year old can expect 9 years. It gets more likely as you age.",
         "I’m just asking, did you read what his message was? His points weren’t wrong, and he’s always been about removing from and not adding to the government. The smaller the the fed the better, and freedoms granted to us in the constitution are more important than virtue signaling. Because that’s what laws like these are. They restrict liberty and promote more hate than they quell. Real change doesn’t come from a law, it comes from the combined effort of the people to change a opinion and shift societial views for the better.",
         "Yes I've read it, but at this point I don't care about idealistic virtues.  We haven't tried to be a better society in 60 years.  Our democracy is being eroded and the majority of people seem okay with ceding it to aristocrats and oligarchs.  The only direction views have shifted is towards despotism and away from liberty.  A bunch of 'do nothing' congresses have only made the situation worse.  \n\nMy ideals still align with a lot of Paul's, but I don't think anything other than extraordinary efforts towards education, limitations of capital in politics, and congress doing its job will slow the decay in the short term.   I also don't think going straight to idealistic anarchy is going to fix the massive wealth gap either, but only intensify the disparity in power.\n\nP.S. Rights are not granted.  Rights are inherent."
      ]
   },
   "1gl2q25": {
      "title": "We made the presidency too powerful ",
      "text": "The fact that every four years, we end up in a situation where one of the sides is this scared or angry - just goes to show that the presidency has too much power. \n\nWith the ruling about official actions from the Supreme Court, it’s truer now than ever.\n\nThere’s a reason why the founders wanted checks and balances, instead of resorting to executive actions. \n\nWe were already screwed because of political parties and coordination across branches, but since the overuse of EA since the Bush era by both parties and continued outsized influence of the executive, we are not in a good place.\n\nTo make it worse, it boggles my mind that we have notions of conservative and liberal judges. They shouldn’t be political. \n\nNow, there’s no way to turn back the clock on the overrun window on any of it.",
      "comments": [
         "Preach it.",
         "Well said",
         "That is what the Supreme Court and Congress is for, balance of power. Sadly Presidents have usurping the power of Congress for decades. Congress has literally just handed over authority to the Executive.",
         "The Supreme Court hold the most unconstitutional power in the federal government, followed by the executive",
         "Short sighted, but that’s what we get with the same political parties across branches and institutions, federally and across state lines. This is the true duopoly",
         "I think it would be more fair to say Congress abandoned their obligations. This also caused the problem with appointed departments creating rules out of thin air using the Chevron ruling. It was never supposed to be that way.",
         "Unfortunately its explicitly constitutional, they just forgot to add checks and balances."
      ]
   },
   "1gkorz9": {
      "title": "In honor of 🥜 the 🐿️ ",
      "text": "",
      "comments": [
         "#JusticeForPeanut",
         "Context?",
         "Im also OoTL, from my understanding this has always been the law when it comes to exotic animals kept as pets. \n\nI remember reading about a lady in Georgia who kept pet raccoons, one of them bit someone and they had to come euthanize the animal and remove it's head to verify it didn't have rabies.",
         "🙏",
         "P'nut, a squirrel pet that a guy rehabilitated and took in as his pet. He made frequent tiktoks with the squirrel that earned hundreds of thousands of views and followers. The police ransacked his apartment, confiscated P'nut and euthanized it because he didn't have a permit to rehabilitate wildlife.\n\nEdit: I may be wrong here, but I don't think it was NYPD. Pretty sure the guy lived upstate somewhere.",
         "Raccoons are extremely likely to have rabies.  The incubation period is typically 2-3 months, but it can be up to 2 years for Raccoons in rare cases. \n \nSo if you take in wild raccoons they can seem perfectly healthy, but can turn on you surprisingly fast and with little warning.  So it is something you need to be aware of when you are around them.\n\nIt isn't true for all animals though.  For example Opossums they are very resistant to rabies because of their low metabolism.  The virus that causes rabies has a very hard time growing in them.  They can get the disease from a infection, but it is very rare. \n\n\nAlso cutting-off-the-head to check for rabies is something they do for any susceptible animal that bites a human.  Squirrel, bat, cat, dog, etc.  That is normal procedure.\n\nNone of that is really a issue here.\n\n------------------------------------------------------\n\nThe problem is that this was a case of blind and violent bureaucracy failing to use judgement and treat other people like humans.  They have rules, they apply the rules sans judgement, and are quite proud of themselves for doing it. \n\nAny sort of \"Zero tolerance\" approach to government results in this sort of brutish unfeeling illogical behavior.  At that point the people in charge are less human and more android.  They are just acting as automatons carrying out hard coded instructions without feeling, remorse, or reason.  \n\nKeeping squirrels as pets are actually pretty common.  It isn't a \"exotic\" pet in the same way that a tiger or cobra is.  It wasn't a threat to anybody. \n\nThe destruction of the man's home and family is just a result of a busybody neighbor complaining to a unfeeling unthinking state bureaucracy."
      ]
   },
   "1gkhvqu": {
      "title": "Smaller government = happy life",
      "text": "",
      "comments": [
         "I want a government so small I don't care who wins.",
         "![gif](giphy|z3HFoEzXCMykr4L0TB|downsized)",
         "I want a truly small government. Not this state government bullshit the statist pseudo Libertarians are peddling. If it's bigger than the famously authoritarian Singaporean government, it's not a small government.",
         "So.  Defund the police ?",
         "0 government= happy life",
         "What our tax dollars are going to btw",
         "Be nice if they shrunk govt and the spending enough to start paying down the debt every year",
         "The USA should be 50 tiny governments. The only large part should be a military budget that could fight God.",
         "That's actually a huge point. Part of the reason the partisan divide is getting more and more fervent is that government intrudes too much, so the elections matter too much. We won't heal until the size of government is checked, and unfortunately I don't see that happening until a major crisis. ",
         "beautifully put",
         "If they change some laws along with it, sure to a decent degree. If people are allowed to actually defend themselves and their property with little to no oversight, or fear of prosecution. There are more good people than bad, no holds barred, I think society will figure itself out with a much smaller police force. \n\nBy no means am I suggesting abolishing police, but to be so utterly dependent on them is pretty ridiculous. If someone is stealing something from my private property in my state (Washington) I'm not legally allowed to do anything physically. That's just dumb. We've swung too far in that direction."
      ]
   },
   "1gksy2s": {
      "title": "It took one of the worst libertarian performances to get ron Paul into the white house",
      "text": "Congratulations to Oliver, he's helped get a true libertarian into what's hopefully a position to cut this bloated government ",
      "comments": [
         "I can't believe I am in a timeline where I get to see Ron Paul AUDIT THE F UCKING FEDERAL RESERVE\n\n![gif](giphy|vv41HlvfogHAY|downsized)",
         "Do you guys really believe Ron Paul is going to be able to do anything in the Trump administration? I’ll believe it when I see it, but some of you are acting like Ron Paul was elected president because of a tweet between Ron Paul and Elon Musk.",
         "Not gonna get my hopes up. Now hing is confirmed. But this is definitely the closest we have ever been to an overhaul of the financial system as Ron Paul taught us about.\n\nI am actually excited to see how this presidency goes.",
         "I’m surprised at how sure everyone is about this happening. These are politicians we’re talking about here.",
         "chase oliver, the reverse spoiler hero",
         "Oliver was so bad that Rfk still got more votes then him even though Rfk is off most ballots",
         "Trump actively courted Libertarians this time around. 1-3% of the vote matters. \n\nI am not going to hold my breath though. The guy is a fraud.",
         "This will not happen and Trump will install a new fed chair that will go back to buying up MBS and UST, I guarantee it",
         "People are so dumb, I'm sorry. Ron Paul will not be part of the administration, and even if he was he's not the yes guy that Trump wants so he would never listen to anything he says.",
         "Yeah, weird times",
         "I hope so",
         "For me, this is honestly the best part of the whole election.",
         "I'd be surprised if he ever even sets foot inside white house for even a photo op",
         "They got conned. Maybe I will be wrong but if any of these people are over 30 they should know better. Since Trump can't have another term, they will push the con to another guy and everyone will fall for it again",
         "No he’s not lmao people are gullible here",
         "No, he is just too old and he declined any official position already. I am very sure he would act as an 'advisor'—like you call him up and he will answer some questions—but that's about it. It is a sham that he would be more than that, and he also stated his positions on things are already well known.",
         "Likely not. It's wishful thinking. All Ron said was that he was willing to chat with Elon about his idea. I'm sure that is true. It isn't a promise of a cabinet position. \n\nI hope that Ron does manage to get his ideas in the ear of folks willing to run with them, but the guy's up there in age. He deserves his retirement.",
         "Assuming any of this actually happens, let’s hope Ron Paul can talk some sense into Trump and educate him on tariffs too.",
         "The hero nobody wanted… and possibly the one nobody deserved. 😂",
         "It’s the only important part of this election",
         "I have high doubts it happens. The man is 89 years old. He deserves to retire.\n\nHe's already denied an official position. But one can dream :)",
         "No way. You don't teach an 78 year old like Trump new tricks. His platform is tariffs and always will be.",
         "Never gonna happen. Trump is only going to get the biggest sycophants and yes men humanly possible.",
         "It's an important one, but hard disagree on the only important part. Freedom-loving appointees throughout government, libertarian-leaning policies, federal judges, etc. all portend well for liberty in the U.S.",
         "Only if DJT keeps his word... so we shall see."
      ]
   },
   "1gl2csl": {
      "title": "If you have friends/family breaking down over the election, they may be receptive to the only logical conclusion to draw from this election: No president should be powerful enough to have such a large impact on your life that a single election could ruin your life. ",
      "text": "As the title says, they shouldn't be focused on how they can dominate the other side next election. They should instead be focused on changing the system so that no single president or no single election can \"ruin their life\". \n\nThe  takeaway from this election is not that the republicans or democrats are the enemy... The enemy is the power of the federal government to get involved in our every day lives. \n\nArgentina elected milei to destroy the power of the government from within. With enough enlightenment, we can do the same here. ",
      "comments": [
         "The conservatives have the presidency, the house, the senate, and the Supreme Court. So yeah get ready for far-right super authoritarian policy making.\n\nThe checks and balances are unbalanced."
      ]
   },
   "1gl0nex": {
      "title": "Dave Smith calls out Netanyahu for propping up Hamas",
      "text": "",
      "comments": []
   },
   "1gkmtu4": {
      "title": "My favorite part watching the election results... ",
      "text": "When states get called with no or virtually no votes reported ",
      "comments": [
         "Tennesseean here, they did the same for Trump",
         "I'm not insulting your intelligence OP, but I think a lot of people watching the news don't realize that everything being reported is merely a prediction and that no state officially certifies its election results on election night.",
         "I’m willing to call Alabama for Trump with no exit polling data.   It’s not that damn hard  to know which way certain states will vote.   Bonus.  Utah will be Trump.    California Harris.   It’s why everyone says there are 7 states that will decide the election",
         "I’d call it too? It’s Maryland. It’ll be 65/35 Harris.",
         "WY and Utah were called immediately after polls closed, with 0% votes reported. Tbh seems fine, it’s obvious who’s going to win those states.",
         "Yeah, Maryland is...blue AF. It's dumb, but probably not wrong.",
         "Check Reuters election map, it’s a tad better than AP.",
         "I don't know why they don't call the race on the west coast",
         "That's the same way she got the nomination",
         "You ever hear of exit polling?",
         "jerking my shit to harris rn",
         "What makes it even better is right now Trump is up but none of this is official until it’s called",
         "She's just THAT good.... 🙄🙃",
         "But like...",
         "It's fun when it all ends in one night, and everyone thought it wouldn't.",
         "Such is life in California lmao. Wait hold up I just checked Young Kim won our district 😅 damn",
         "Yeah same in Washington",
         "That was a freebie, though. Even the Tennessee subreddit is right leaning, lol.",
         "Oh I know, I just enjoy watching states get called before reports come in, and then spend my night watching in case it flips lol",
         "I used to live in MDs 4th. It was between 80-90% D every time.",
         "I deliberately lie to those people. Just did today. ",
         "I mean with exit polling I would understand a lead, but this is supposed to be news.... 0 percent reporting should mean you can't call anything. A lead would make sense based on the exit polls. And in most cases the state will go that way.\n\nStill fun to see if any of those early calls flip",
         "Bro what?",
         "Comparing current map, he will have 264ish and she should have 274ish. If it follows 2020.",
         "Maryland isn’t a freebie either for the left? Doesn’t matter anymore regardless.",
         "If the state subreddit leans red, that's impressive.",
         "I'm in illinois and I called it to be democratic 20 years ago",
         "Some states the exit polling is so far in one direction the result is a certainty. Same this has happened with Utah, which has been called for Ttump with no results in, and California will be certainly called for Kamala the second polls close there.",
         "And how often has it flipped? I can’t recall any occurrence from a major news organization in the last several decades.",
         "I’m in Utah and it looked like this but for Trump",
         "Can confirm",
         "That's why they ask more than one person.",
         "free speech",
         "I think it was one of 5 that did. Someone made a map, lol.",
         "Google had it (briefly) red and I laughed out loud.",
         "Florida in gore vs bush",
         "Wincinsin 2012",
         "Fair enough, but I am sure there is a better person to jack it to",
         "had texas blue too",
         "It’s just how they get reported.  PA and Ohio were blue at first because the big cities report their votes first.  Happens all the time.",
         "So once in over 30 years? Hardly seems worth paying attention to.",
         "imma keep going now",
         "A case like Maryland obviously not, but Fox calling Arizona for Biden in 2020 waaay too early (in hindsight) was a pretty big deal",
         "You should check out AOC",
         "And that ended up being the result, right? No flip after the call. My point is these orgs have, historically, actually worked quite hard to vet these calls before publishing.",
         "Or Bernie, if you are into old dudes.  It's cool if you are.",
         "As a women who likes women but not politicians: AOC is beautiful... for a representative, I mean."
      ]
   },
   "1gl23p8": {
      "title": "Which country are we telling our grieving socialist friends to move to so they can set up the Un-Free State Project and live in a workers paradise?",
      "text": "Cuba? Venezuela? People's Democratic Republic of Algeria?   Where will their demands for more government not be ignored?",
      "comments": [
         "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "Ukraine or Palestine would be perfect.",
         "Cuba, hands down.",
         "China, Venezuela, North Korea. \n\nIn all seriousness Spain is probably good.  \n\nAlthough most American ultra-lefts are going to have a hard time dealing with majority white country that speaks Spanish.  That level of nuance and understanding to cope with something other then American race-based politics is beyond most of them. It is essentially a religion and being around other people who don't look at everything through the same lens will cause them extreme discomfort.",
         "Liberia",
         "North Korea",
         "My vote is Iran or China. \n\nUkrainian people are actually very nice. It’s not their fault they were invaded. Their leader is looking out for them by grifting any money he can get from the Warhawk’s in our country (plus a little tucked away for himself).\n\nIn any case no need to inflict them with our problems",
         "Wait until they find out other countries are more strict with immigration lol"
      ]
   },
   "1gl0qxk": {
      "title": "US foreign policy be like",
      "text": "",
      "comments": []
   },
   "1gkpnmi": {
      "title": "Chase Oliver Polling",
      "text": "I knew it was gonna be bad, figured under .5%, but holy shit Jill Stein is beating him in many states. What a loss of momentum. Not that it would have trabslated at the national stage, but normies did notice Gary Johnson and Jo Jorgenson polling \"very good\" for 3rd parties, and I think that matters.",
      "comments": [
         "I was so excited 4 years ago when someone would randomly ask \"who the hell is this jo jorgensen lady\". \n\nNever heard anyone ask who chase oliver is this year",
         "RFK Jr was beating Oliver in one state and he dropped out.",
         "I mean, if you tweet that you're \"not a Ron Paul libertarian,\" that's pretty damning.",
         "Maybe next election cycle we nominate someone we actually like? I was proud to vote for Mama Jo 4 years ago. The thought of voting for Chase just makes me feel like I'm actually wasting my vote.",
         "What momentum? He had less going for him than the Johnson race in 16.",
         "When you nearly lose to \"no one\", what do you expect to happen.",
         "The party does worse in close elections because it is much easier to vote 3rd party when your vote matters less",
         "I think this election cycle the press was so anti-Trump they weren't going to let anyone be heard about that might take a single vote from Kamala.  They were a LOT quieter about 3rd parties this year than I remember them ever being.",
         "Dude, he did worse than RFK, who dropped out. What a fucking clown.",
         "I voted Chase.  But i know he has no shot.  If I was in a swing state i would not vote Chase.  If i knew Stein would lead Chase I would have voted her.  For me there's more to it than picking a party. That's what got us into this inflection point.",
         "I voted Republican for the first time since 2008. And I defended Gary Johnson until I was blue in the face after “Aleppo.” Our party has to do better in 2028.",
         "Yes, but an understandable reason might be that there were a lot more libertarians this year who felt they were in a position to affect the election of either Trump or Harris, and felt that was a better use of their vote.",
         "we didnt vote for him. try to keep up, terrible candidate and the party sabotaged itself",
         "Nominating Oliver was a catastrophic mistake that torpedoed the party.",
         "I didn’t see a single add or piece on Oliver, at all. Nothing… that had to be a choice made by the LP, right?",
         "I'm a fairly attentive libertarian and I didn't even know he was our candidate until a month after he was selected lol.",
         "Chase Oliver sucks, be more disappointed that he was the one chosen",
         "Kinda what happens when you say Ron Paul is stupid",
         "Chase Oliver was a poor candidate. The days of a Ron Paul are sadly behind us.",
         "The party did a terrible job promoting him.",
         "His own party sold him out for trump, so that was a major blow to his campaign",
         "The LP's viability as a political movement is inversely proportional to the Mises Caucus' involvement in it... \n\nJust saying...",
         "He losing to RFK he not even running for the election 🤣",
         "RFK is beating him and he's not even running.",
         "The LP did this to themselves by allowing that worthless candidate to slip in as our representative. Good riddance, if you ask me.\n\n![gif](giphy|lZhymdRsuFDmU|downsized)",
         "1) Trump put together a better coalition with libertarians than 2016/2020.\n\n\n2) Kamala absolutely failed to build a coalition with anything resembling principled leftists; i.e. Jill Stein got a lot of the anti-Zionist votes.",
         "I felt like Jo was all over my feeds last election and basically saw nothing for Chase at all this year. Voted Johnson in 2016 and Jo in 2020. Was actually planning on voting for RFK Jr. this year but the Dems blocked his candidacy in several key states. Once he came out in support of Trump, I ended up voting for him.",
         "Bring back Gary Johnson!!!!!!",
         "Shocker. A democrat who rebrands himself doesn’t get many votes from people who can’t differentiate the libertarian from the democrat from the republican. Give it up. The libertarians need a libertarian candidate.",
         "“We did so much for liberty by voting for Chase tonight!”",
         "Man if we come in 5th in this election it’s over",
         "I am shocked too… I didn’t expect great but better… I still voted for him",
         "Oliver is a joke.",
         "On the bright side, the LP candidate in the Ohio Senate race broke 3%",
         "Hahahahhaha\n\nChase who??",
         "He was the single worst candidate that the libertarian party has ever run. Which is fine, trump didn’t need anyone possibly spoiling it anyway. ",
         "He was not someone who anybody who take seriously. If Libertarians are serious about bringing the philosophy to governance they will need to start offering serious candidates.",
         "No one cared about Chase, just like Kamila.",
         "I have said it on this sub before and people got mad. I do not like chase. I voted trump but would LOVE to vote libertarian. Next election I'd be surprised if I didnt. I just really do not like chase. I think most of the party agrees... based on the lowest turnout in 12 years...",
         "My choices for president were:\n\nA) a New York Democrat who violates just laws.\n\nB) a California Democrat who prosecutes unjust laws\n\nC) Chase fuckin Oliver \n\nD) Wetsack O'Catshit\n\nVoting for Oliver just because of an (L) is no better than voting for Harris just because of a (D). If you want my vote , then nominate a real Libertarian. Otherwise I have to rock this ridiculous \"Wetsack O'Catshit\" sticker for another 7 years.",
         "I disliked him more than I dislike Trump. So this election, at least at the presidential level, was voting for the person I dislike the least. Maybe in 4 years the party will select someone palatable.",
         "He's just a Democrat who ran with an L next to his name",
         "I did my part!  I voted for him, even though he seems crazier than the other two, but I wanted to do my part to get him to 5%.",
         "Trump owes Libertarians!",
         "He got less votes than RFK Jr. this was an important election to move the liberty football one way or another. The fetish of libertarians to throw their vote away is troubling. I’ve proudly done it in several elections as a protest vote, but this wasn’t the election to do it.",
         "Didn’t even hear him mention last night unfortunately",
         "I voted for him just to promote the party. I was indifferent to him until he wanted to fund trans operations...",
         "Here in NY, both Stein and Oliver were only write-in candidates due to changes that the Democratic Party made that make far more difficult for 3rd parties to exist in this state. While I'll never denigrate someone for doing a write-in, I truly believe that they aren't officially counted so I don't do write-ins.",
         "That's just what happens when a leftist infiltrator gets nominated.",
         "A lot of us voted Trump. I’m glad we did.",
         "https://preview.redd.it/0u3w1w3eebzd1.jpeg?width=1170&format=pjpg&auto=webp&s=49c28f9347edf4b5508876c2006126f7ff5268e0\n\nSay what you will, but this guy ahead some amazing results for a libertarian candidate…",
         "Next time go Mises or get out",
         "Very little funding, LP national leadership told everyone to vote Trump, no national support in advertising / campaigning (maybe some X posts at the very end), wasn't on all 50 states, states like TN threw fits the candidate wasn't Dave Smith and refused to support getting him on the ballot, supposedly a tight race that third parties do generally poor in, etc\n\nThere was basically nothing going right. This is what you get when LP internal politics implode and what basically Oliver got by himself plus some LP name recognition. I would recommend Mises and the chair not endorsing another candidate if they wanted more votes.",
         "I mean if you’ve been paying attention the LP leadership/MC basically abandoned him and made a deal with the devil to campaign hard for Trump",
         "It baffled me that a party controlled by the mises caucus could nominate a liberal candidate, until I thought they probably used him as a red herring, and actually want trump to win.",
         "While you can criticize elements of Jo's campaign, she did do a markedly better campaign from a messaging perspective. I became a libertarian because of her showing me that I was wrong about the war on drugs.",
         "Same",
         "yea probably bcs some of those video jo put out were fucking awesome.",
         "He was a clown.",
         "Currently RFK is beating him in the National popular vote.  🤣",
         "Meh, I still voted for him. Surely someone who thinks they’re a libertarian is better than someone who knows they’re a R or D.",
         "The problem with the party is that we fundamentally hate centralized power which prevents us from organizing and getting our shit together long enough to actually run a campaign.",
         "Yeah, I mean, I threw my vote to him (lesser of the evils) but I loved Mama Jo. I had shirts, signs, stickers. I brought her up all the time. I honestly forgot about Chase. I was hoping Justin would have represented our party if we wanted to get some serious momentum.",
         "Same. I felt good to vote for Jo and Spike. This year I said \"fuck it\" and voted NOTA.",
         "I didn’t care for Jo, but she was miles ahead of Oliver.",
         "I would hope a JoJo and Carly ticket would erupt.  If we can roll out Weld, we should certainly be able to ask Mitch to come and play",
         "Justin Amash?",
         "[removed]",
         "It also does worse with awful candidates like Chase Oliver.",
         "It is difficult to argue that this election is closer than 2020.",
         "Good point. Unlike Johnson and RFK, Chase would've taken votes from the Democrats, which explains his absence in media coverage.",
         "Bro stein is literally the complete opposite of chase",
         "\"How do you disappoint libertarians with just one leppo?\n\nWhat is a leppo? 🤦‍♂️\"\n\n--Reason",
         "Makes sense, I still voted lib though because that’s what I believe in, even if I know they will probably lose for the foreseeable future lol",
         "5D chess by Angela to get the president who will welcome libertarians into his inner circle",
         "The LP doesn't run their campaign. That was a choice made by the Oliver campaign. The dude sleepwalked through the whole thing. And I'm being pretty generous on the \"walk\" part of it.",
         "It was. I mean, the LP chair 'endorsed' him wearing a clown nose only to later endorse Trump. Fundamentally unserious.",
         "No. Campaigns run their advertising. \n\nThe LP gets people registered, fights as many ballot access fights in advance as possible, etc. This is all stuff that Chase did benefit from by getting the nomination. \n\nChase simply sucked at fundraising and advertising. One of his big advertising pushes was so that he could take a helicopter ride.",
         "To be fair, he won the nomination because of a super shady, back room deal with Ter Maat. Rectenwald was on a path to win easily.",
         "That's literally his job as candidate, not the party's job. \n\nYou don't just show up and wait for the party to elect you, that's not how politics works.",
         "Chase did not perform better in non-Mises states.\n\nIn fact, reporting so far indicates that he did worse.",
         "Cope",
         "Lol no thanks",
         "To me, he's no different from a Democrat. I would barely prefer him over Kamala.",
         "I'm optimistic he'll follow through on his promises to us.\n\nRoss pardon and a libertarian in the cabinet!\n\nAnd if Ron Paul is involved in the administration in any way, then it's an enormous blessing in disguise that Chase the Disgrace was the nominee!",
         "In TN, Chase hired canvassers that were not people known to be reliable, as experienced party members recommended. \n\nThe outsiders he hired turned in names with a ridiculously high failure rate, and failed to meet the insanely low standard. Fewer than 300 names were required. \n\nTN was a Chase failure, open and shut.",
         "I was a delegate at convention, and I assure you, Mises tried their best to stop Chase from getting the nomination.\n\nMany shenanigans were in play.",
         "Yup. While imperfect, her campaign was light years ahead of Chase's. \n\nShe even went up against Trump, and Jill Stein's back again too, so it's a pretty fair comparison.",
         "I take back everything I said about Jojo and Gary Johnson. We have someone who’s actually a lot worse",
         "*Is*",
         ">Chase Oliver and Mike ter Maat are on a mission to remove government barriers that stand in the way of your dreams. Be part of the movement—help us break down these obstacles and make your aspirations a reality!\n\n![gif](giphy|6kC6MdAALf6Pm)",
         "When someone made a joke about it. I couldn’t stop laughing 😭",
         "This 100%. I’ll vote libertarian every single time as a recorded fuck you",
         "I wrote in another post. I'm registered LP, I'll vote LP. I'm not going to put a chase oliver yard sign out, but he'll get my vote. Dave Smith would get a yard sign, I still have a Ron Paul yard sign in my garage. \n\nMostly I just want more choices so I'll continue to support LP candidates when I don't think there's a better alternative.",
         "I was one of 52 people in my county that voted for em. lol",
         "The age old 'nobody is the libertarian party's biggest rival than libertarians' or something like that",
         "I've voted Libertarian for pres since 2004 when I was 19. First year writing in NOTA. \n\n\nHoping for Trump but wanting a clean conscience when he does something dumb.",
         "Your comment has been removed. Petitions, Surveys, and Polls are not allowed here.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "Fiscally, yes. Culturally, no.",
         "Bylaw number 2 is the purpose of the party:  \n\n> 2. electing Libertarians to public office to move public policy in a libertarian direction;\n\n> 3. chartering affiliate parties throughout the United States and promoting their growth and activities;\n\n> 4. nominating candidates for President and Vice-President of the United States, and supporting\nParty and affiliate party candidates for political office;\n\nThey always fail at the actual electing part. This year, they totally failed at the promoting and support part, too.",
         "Tried to give him the benefit of the doubt. …when you make deals with a potential VP pick to stab people in the back to get votes, the party should frown on it. Once you go down that route… I could see the party taking a hands off position.",
         "I'm more of a \"let's get shit done\" kind of a guy than a just cope with it kind...\n\nWas heavily involved in leadership of a different caucus, decided to drop party affiliation and just be a happy libertarian instead of a Libertarian... \n\nThe LP as a party is entirely too encompassing leading to fracture of the organization which contributes to its inability to build any consensus and move forward as a political philosophy... Mostly because the Mises Caucus is too busy calling everyone else a statist... (Joking...ok not really joking)\n\nBreaking the duopoly will take a concerted effort that the current LP isn't capable of performing...",
         "In most states, the party chapter works with the campaign to get them ballot access. TN and others did not. Chase did have to do it on his own, and yes, failed. However, every TN LP member could have helped in the effort to get LP ballot access. It is due to both of them that TN citizens did not get it. I can only hope states care about Libertarian ballot access next cycle and go out and get it.",
         "How's that working out for them?",
         "Okay? None of that disproves what I said that campaign decisions are made by the candidate, not the party.",
         "You will note that promoting is for affiliate parties. \n\nGotta read the whole sentence. \n\nThe LP didn't fund Gary or JoJo. They did great compared to Chase. This is just coping.",
         "I guarantee if the mises candidate would've been nominated rather than the all the back room dealing to skirt it, the libertarian party would be an enormous part of the national conversation. Joe rogan probably doesn't endorse trump and the republican party would be bending over backwards to get libertarian support away from mises caucus. Chase oliver is a joke. He might finish behind green party and a guy who said don't vote for me.",
         "The statement was about seeing ads or pieces for Oliver. You tried to separate LP from Oliver completely, which is both true and untrue. National can run ads or pieces and it is their duty to support their candidate. They have done so in past elections.They failed to do so here. That much is obvious.",
         "Supporting is for Party candidates.\n\nNo one said anything about funding the campaign directly. That is not what 'support' was for Johnson and Jo which they did not give Oliver. This is just excuses.",
         "Show me where I said they are completely separate. I don't even disagree that national should have supported him much more. That's not the point here. \n\nThe candidate has to give direction on the ads and take the lead on it. Oliver did not work with party membership very well and didn't coordinate well with members even trying to throw him fundraisers. Plus, it's not Angela telling chase to decline Dave Smith or Tim pools podcast invitations. That is 100% chases decision.\n\nEdit to add: I've been part of a few campaigns (not presidential). It's never the expectation the party will decide and run ads or promo for you. The candidate has to do or at least plan for the ads then ask for money from the party to do so, which even that is a shaky ordeal.",
         "Oh? What support, exactly, did the other two get that was withheld?"
      ]
   },
   "1gkd9pq": {
      "title": "No matter who wins, so does the war machine",
      "text": "",
      "comments": [
         "https://preview.redd.it/xgylers386zd1.jpeg?width=1077&format=pjpg&auto=webp&s=1f5a26fc517a34c2c15f77d514ef8ca5e39b8f30\n\nWrong map goy",
         "Where's Ukraine in this picture?",
         "It's odd seeing as how current day Isreal is a product of our meddling.",
         "The military industrial complex would much rather a Democrat win i'd imagine. The neocons are endorsing them en masse.",
         "One candidate was in office when shit hit the fan and has the support of Liz Cheney, Dick Cheney, and all the neocons.... the other accomplished the Abraham Accords. I know who I prefer.",
         "Considering ron paul, might join the trump administration, he could very well influence trump on that issue",
         "Baby steps are still steps",
         "I think it's pretty clear the MIC would do FAR better under a Harris regime. Trump had four years and no wars...",
         "Sad, but true.",
         "Glad to see somebody say it, didn’t think the libertarian sub would actually get red pilled about this",
         "![gif](giphy|5twCMNij5xDag|downsized)",
         "Ugh those drones scare the fuck out of me and my husband...",
         "https://preview.redd.it/mqmdvyluz7zd1.jpeg?width=1070&format=pjpg&auto=webp&s=1cf2250b56f3b54006b2bb611b6592fbc4f1795d",
         "Tulsi is on Trump’s team, there is hope",
         "They don’t like to talk about this though 😐",
         "Bodily autonomy is out the window  if Trump wins. And yes, I’m a Libertarian",
         "Hit the nail on the head, my dude.",
         "Unfortunately.",
         "![gif](giphy|tEQ8aAOh60us0)",
         "Based",
         "Isreal is covering them up so they get more money",
         "Never thought I'd see the Cheneys siding with Democrats and a Kennedy siding with Republicans. Crazy times",
         "Yea but Trump did take $100 million from Miriam Adelson…Palestinians may be fucked regardless.",
         "Especially if Ron Paul comes in with his pruning shears.",
         "That’s not necessarily true. I’m an European and in my country the debate right now is a lot about how we in Europe can protect ourselves if Trump chooses to disband NATO or pull out troops of Europe. Guess where we will buy all new military technology and weapons from… \n\nThis might benefit US weapon manufacturers more than people might think.",
         "Agreed. Also conservative Zionism is powered by religious prophecy which is has lost significant clout in the last few years.",
         "I agree that the Cheneys are warmongering scum, but the Abraham Accords were not a good thing. Essentially the Abraham Accords are just the US bribing Middke Eastern countries into being friendly with Israel using taxpayer dollars (foreign aid).\n\nMy taxpayer dollars shouldn't go to Israel, and they shouldn't go to other countries so they'll be friends with Israel.",
         "Both of them sent our taxpayer money to the Middle East, just in different ways.",
         "Your point about the Cheneys notwithstanding, the Abraham Accords are a reason to vote against Trump not for him. Libertarians oppose foreign aid and the military industrial complex",
         "[removed]",
         "No he won't.",
         "This is the lesson",
         "What Federal law interferes with body autonomy? Other than drug laws and the military draft…",
         "How? All he did was give the states a choice if they wanted it or not. He didn't ban abortion or IVF like everyone thought he was and has stated that he doesn't want to ban it but instead wants to make it easier for women to have kids because statistically most women get abortions because they can't afford to have a kid. Trump and Vance want to change that.",
         "who bans bodily autonomy? thats news. Every livin human has bodily autonomy",
         "When the Dems say that the GOP changed they always forget how much *they* changed.\n\nPro-establishment, pro-war, pro-censorship. I'll let y'all guess just how far left one has to go to find all of these acceptable.",
         "I'm very sympathetic to Palestinians, but honestly i think even they know no one's coming to save them. Sad all around.",
         "God i hope that's true. Would be a wildly popular move all around. \n\nI wonder if he'd still be up for it though. 90 is quite the age.",
         "People have to stop with the RP nonsense. I love the guy, but if you don't realize that Trump/Musk name dropping him isn't a desperate last grasp then I don't know what to tell you.\n\nIf Trump wins, he's certainly not going to be listening to Ron Paul, he doesn't listen to anyone.\n\nTrump knows how many suckers are out there and this is a classic \"hook the suckers\" push.",
         "How is it a bad thing to encourage normalization of relations amongst the most stable powers in the region? The underlying motivation is to get Arabs and Israelis doing more business with each other, which is the best way to ensure lasting peace.",
         "I'd rather an expensive peace than an expensive war.",
         "One of them left billions of dollars of highly classified military equipment to terrorists while they sell it to underground terrorist organizations for years to come while getting 13 soldiers killed and leaving interpreters who we promised citizenship to behind for the Taliban to kill, the other is the most anti war president of our lifetime regardless of their views on his personal life.",
         "No one's asking him to re-roof a house in summer.",
         "Giving the states a choice to decide for the individual isn’t any better for the individual. The government should prevent the state from deciding for the individual to protect individual liberties, not just remove themselves from the situation. \n\nSame reason that if you were having a fight with your neighbor about where property lines were, the state shouldn’t leave you to the HOA to decide, they’ll just make it worse. They have the knowledge and power to figure out who’s right, they should step in and sort it out.",
         "Honestly I feel like IVF and other fertility treatments should be banned (also tax people more per child if we're gonna have taxes) and I'm otherwise very radically supportive of medical freedom.",
         "Boy do I have news for you",
         "There are many on the left who are still anti-establishment, anti-war, and anti-censorship. It may be an unpopular opinion, but I think there are many on the left who align with libertarian principles and would gladly vote for libertarian leaning candidates. If Libertarians didn't run them off with all the anarchist doomsday talk.",
         "So, I didn't vote for Trump. (I voted \"your mama\".) But I imagine demoralizing libertarians about Ron Paul getting a say is only going to backfire on the Republicans. Demoralization loses elections.",
         ">How is it a bad thing to encourage normalization \n\nEncouragement is fine, bribery with US taxpayer dollars is not. Israel is already a massive welfare queen with all the foreign aid we send them, now we have to pay their neighbors to be nice to them too? Screw that, end every last penny of foreign aid.",
         "I thought taxation was theft",
         "This is fanfuckingtastic.",
         ">Giving the states a choice to decide for the individual isn’t any better for the individual.\n\nYes it is. If the federal government forces a state to legalize something like abortion, that doesn't say shit about how your neighbors or family members will treat you if they find out. And people DO find out. At least if it's up to the states, you might know where the average citizen stands on an issue so you know whether or not you should nope out to another state that's more accepting.\n\nObligatory \"as a woman\" disclaimer so it's not like I don't have skin in the game.\n\nOf course, in an ideal world, I'd obviously rather everyone be for bodily autonomy amd medical freedom across the board. This isn't an ideal world though. In our current shitty political system, I'd rather a state's policies not belie the sentiment of the actual people I might have to deal with.",
         "Not every human has bodily autonomy? Please share me news, where???",
         "They've been drowned out by the neo-liberals and turbo-progressives. Being a libertarian is being a far-right extremist to the liberal mind.",
         "Yes, but except for some brave people voting for Jill Stein, they all vote Blue.  \n\nThey are conformists first, principled leftists second.",
         "So…like bribing people to vote with Coddling illegals (tax dollars), Student loan repayment (tax dollars), and universal income (you guessed it…Tax dollars!)\n\nI’d rather vote for money to go directly up Benny’s ass, than put a dime into any of that shit.",
         "If your biggest concern about abortion legislation is how your neighbors and family members treat you, I don’t think we can have a meaningful discussion about this issue because we clearly care about different things. I come from an ultra conservative family, they say and do all kinds of stupid shit, and that’s what made me believe in libertarian values. I don’t care what people believe in, I care about what they can do, and anything the government does that enables people like my extended family to control people’s individual liberties is something I strongly oppose.",
         "That's because many fascists pretend to be libertarian.",
         "People like your family can, oh I don't know, physically fucking assault you if they find out you've had an abortion even if it's legal. It happens. If your family makes you feel unsafe, you should move away from them and others who are like them instead of expecting what the federal government to stop them from harming you for your choices. Easier to do that when the laws of a state at least somewhat reflect the sentiment of the people. That said, none of it is really my concern because I'm sterile anyway. Needless to say, if another aspect of medical freedom that could actually affect me (aside for setting a bad precedent; again, medical freedom across the board would be my preference in an ideal world) was up for debate, I'd be more invested. I fully support the right to abortion - especially as a misanthropist and antinatalist - but I get sick of people trying to treat women as a monolith and expecting us to all support each other simply because we're all women. As it stands, neither candidate poses any particular threat to my way of life and neither offer me anything useful.",
         "Ahh yes, the fascist ideal of wanting everyone to be free... OR ELSE!",
         "You don't understand at all. Many fascists say they are libertarian, because they don't want to come out and say they are fascist. Fascists sometimes use the words \"libertarian\" or \"centrist\" or \"moderate\" to hide their actual views.\n\nYou end up with a society where 50% of the self-described \"centrists\", \"moderates\", and \"libertarians\" are actual bootlickers and then the real libertarians, centrists, and moderates are unable to find and socialize with each other.",
         "From my personal experience I’ve def met some this meet this definition unfortunately",
         "Yes. People are pretending to be Libertarian, to hide their fascism.\n\nFor fuck fake.\n\nAnd you wonder why you got your asses plowed tonight in the elections",
         "I don’t think it’s super common, but it does occur. There are some in my hometown who say they’re libertarian but then support everything Trump does with fervor"
      ]
   },
   "1gky5dm": {
      "title": "We did not do well this year. ",
      "text": "As of right now, Jill Stein and RFK Jr. have more votes than Chase Oliver. We need to put out better candidates. My first election was Gary Johnson, he was a great candidate and that year it felt like we had a chance to get on the stage and debate. We have to do better next election cycle. ",
      "comments": [
         "If Paul actually gets a role in cabinet that is a huge success.",
         "Just means if you voted libertarian you’re part of an even more exclusive club 👍",
         "They didn't even make the ballot in my state. Hard to get votes if you have to write in.",
         "Dave Smith is the only runnable candidate I've seen since Ron Paul, and he announced he would not pursue the libertarian nomination for personal family reasons. So we got an incredibly weak candidate instead. Perhaps in 2028 he could be convinced?",
         "More of us need to get involved in nominating the Libertarian candidate. I honestly don't know how Chase made it as far as he did.",
         "We'll do better once the party doesn't elect Democrats posing as Libertarians.",
         "On a plus side Ron Paul hopefully gets his shot with musk.\n\n![gif](giphy|5mBE2MiMVFITS)",
         "Don Kissick outperformed Trump massively in Ohio. Still only 3.4%, but that's a bit telling since that senate race was critical for both parties whereas Trump was more or less a lock from the get-go. I can't imagine there are that many libertarians who genuinely think Trump is better than Moreno, and that means a lot of people won't even lodge a protest vote with Oliver.",
         "You had better candidates, you voted for a woke liberal instead of a libertarian.",
         "The LP is a massive joke.  They roll out this failed Democrat.  I voted for him only for the final tally.",
         ">campaign a candidate who deserves a 6th place finish\n\n>candidate finishes in 6th place\n\nOr 5th.  Or 7th.  Idk, idc.",
         "💯",
         "Think he will. Libertarians voted for Trump. It’s on Trump and his team to honor their word.",
         "![gif](giphy|6uGhT1O4sxpi8|downsized)\n\nMe after voting libertarian and seeing the abysmal numbers",
         "This ⬆️ 💯",
         "No, there wasn't. You can look at the vote—the other one was Rectenwald which is who Mises leadership wanted. Weeks later, he says Jews run the country, the world, and are the biggest threat to freedom, he wants them exterminated etc several anti Judaism posts. If he had been our nominee, it is doubtful Trump 'works with us' as the LP would be shunned nationally as a racial-focused party. It would have somehow actually been worse.",
         "Dozens of us!"
      ]
   },
   "1gl0kxx": {
      "title": "Some of Our Leaders Are Putting Other Countries First",
      "text": "",
      "comments": []
   },
   "1gkwqa8": {
      "title": "It was nice to see my vote count.",
      "text": "I know this probably isn't popular for a libertarian,, but I live in Pennsylvania and had voted for Johnson and Jorgensen in 2016 and 2020. \n\nHowever after seeing the Biden administration did the last four years and the utter shit candidate they were shoving down the country's throat in Kamala, I decided to vote for Trump. He is obviously far from perfect, but I am cautiously optimistic some of the more radical left policies will fade. \n\nI see it as a voting win as well, knowing that I had a small part in helping a crucial swing state flip back red.",
      "comments": [
         "I hope you’re right. I’m not looking forward to the tariff proposals. Trump is very anti free market.",
         "A vote for Trump was a vote to resurrect Ron Paul.",
         "Same. PA resident. Voted Gary Johnson x2 and then Jo Jorgensen. Voted for trump this election. \n\nI guess we will see what happens.",
         "I feel the same, now we need to hold the new administration to account for what they will do for our country.  Same as any other.  Good job!",
         "Awesome job man",
         "Hopefully anyone inside the Party would be cool enough to speak against it.",
         "Well not the like the other side would be better with wanting the government to take over whole industries (i.e., healthcare).\n\nIdeally we need more libertarian ideals, maybe if they hold true to the government efficiency and getting ROn Paul involved we could see small changes",
         "We can hope. It's a least getting his name back into mix.",
         "Agreed the other side would have issues as well, especially around price fixing. I am just pessimistic that this whole gov efficiency thing will actually happen, I’ll believe it when I see it."
      ]
   },
   "1gkpydl": {
      "title": "Where are the meltdowns?",
      "text": "MSNBC was just running graphics. \n\nTYT doesn't have Ana on.\n\nWhere to drink sweet leftie/tankie tears?",
      "comments": [
         "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "Chuck Todd had a minor one earlier, saying Latinos went for Trump due to their lack of education.",
         "Joy Reid has been losing her shit all night",
         "I was told my 3rd party vote was going to ruin Kamala. Is that still true? 🤣",
         "Everyone’s holding their breathes for the mythical “batches of mail-in ballots”",
         "Maybe this time the Democrats will actually learn that running someone who isn't an orange-tinted vulgarian won't automatically win elections. Maybe we'll see some introspection instead.\n\nI mean, probably not, but maybe.",
         "The politics sub has a live chat and it's basically nothing but meltdowns.",
         "The true meltdown is Kamala not coming out and giving one more RA-RA speech after that 150 emails she’s sent me in the last month.",
         "Enjoy the somber tone for now. We’ll get our meltdowns soon enough",
         "Oh they are there. Reddit is melting and several of my coworkers are claiming they will leave the US.  I love it",
         "Ana won't be on tyt much longer. She's moved to the center and I expect her to start her own thing in 2025 like everyone on that show",
         "Reddit.\n\nhttps://preview.redd.it/qs4z8fnoc8zd1.jpeg?width=1440&format=pjpg&auto=webp&s=e6f0a6b3bd07dee72e73f66c60a3d5e6dfda87b0",
         "I always turn on MSNBC to watch that sniffling cunt, Chris Hayes, sit with his bitch face.\n\nLol. \n\nFox had some good ones when Biden won. But the left always shows they ass in fantastic form.",
         "They're on Reddit.",
         "Poke around Reddit for a while if you’re looking for that. \n\n\nI am personally not surprised by the outcome. I think a lot of people knew this was a Hail Mary play from the left. Like switching out your decrepit candidate for an equally if not more unpopular candidate 3 months before the election? That’s desperation right there. I don’t think anyone was shocked that strategy didn’t pay off. ",
         "Go to the millennials & rants groups. Probably the rant group too. Idk, they banned me for saying it's possible to dislike both Trump & Biden. Complete meltdown city in those first 2 though",
         "I don't know - Trump was heading for certain victory last time when I went to sleep needing just one of 3 states (IIRC), and when I awoke, he had lost all 3 of them.\n\nI'll wait for the media meltdowns, but my state sub is really angry. A Democrat posted an olive branch, and almost no reply from other Democrats is positive in the slightest.",
         "CBS has been in meltdown mode for the last hour or so. Nora O'Donnell and her cohorts look like they want to die.",
         "Reddit is having quite a few meltdowns.\n\nVery frightened people. And some nasty ones.",
         "Are we looking at the same Reddit? All I see, especially teacher subs, is “What do I do today?” “I’ve been crying all night and haven’t gotten any sleep.” “Project 2025, the world is ending, the sky is falling, blah, blah, blah”\n\nWhat do you do? You act like an adult! You put on your big boy/ big girl underwear and you go to work and do your job. You go to your kid’s fall play. You do all the things you’d do in a normal day because that’s all today is.",
         "All the paid shills aren’t  under new contract yet",
         "Checked the big subs at all? Lmao",
         "I've seen people on discord litterally sobbing and trying to encourage each other from \"the darkest age\".\n\nLike goddamn how effective was the lefts fear mongering?",
         "We’re not really gonna freak out. Cause we aren’t insane.",
         "It’s so glorious to see the legacy media implode and be in denial!!!",
         "They'll be here in two hours. Trump is heading to Palm Beach where he'll likely declare victory. That is when the crying starts.",
         "It went about like I thought. Americans upset with economy, minority groups taken for granted. I can deal with moderates on both sides but maybe now the progressives will realize that just because you force your policies down our throats doesn't mean we won't go the opposite way. Unfortunately the far right will be insufferable for a while. \n\nI wonder if antifa will riot again? Blm? Any other fringe groups burning cities now?",
         "Honestly, you can find plenty of threads on reddit full of leftie tears.",
         "Almost every subreddit is having a meltdown, even shit that has nothing to do with politics, like Star Wars",
         "Ah yes, the true intent comes out lol it was all to “own the libs”",
         "There will be a return to SJW cringe compilations. Don't you worry.",
         "Well, you're on Reddit, have have a look around. They're everywhere here, lol.",
         "Main feed of Threads is pretty loaded with insane takes",
         "Ana recently has become omega based so don't expect any meltdown from her",
         "Bro, right here on reddit lmao 🤣 😂 😆",
         "Give it a day or so, the isolated clips will start popping up. If not, maybe they aren't as mad as the echo chamber, that we call Reddit, would suggest.",
         "I just ran into a good one.\n\nhttps://preview.redd.it/kycs9uexdazd1.jpeg?width=1080&format=pjpg&auto=webp&s=fd305ed4926cf5fe882bebdf3187a40f592de803",
         "This guy melted down\n\nhttps://slate.com/news-and-politics/2024/11/election-results-president-trump-harris-win.html",
         "Typical Democrat on instagram was almost crying 🤣",
         "HasanAbi - Extreme cope",
         "Dana Perrino on Fox going with the Colonel Sanders look tonight.",
         "I think Harris is scum but she’s hardly a lefty",
         "Ana has been slowly red pilling, so there’s no meltdown from her.",
         "Ana is probably partying with dailywire",
         "https://youtu.be/cjj4cdSNQ9Y?si=A4V0o6YJ-eU3Fez-",
         "TikTok is FULL of them. I just want those public cry sessions more than anything.",
         "There's some hand wringing in r / new jersey over how close it came to flipping red.",
         "They are in shock right now. Also they know ppl like me would love to see the meltdown n have a huge grin on their faces waiting, so there's holding out. It'll take a day or so.",
         "Seem to be all over Reddit",
         "Ana has been getting red pulled hard as of late.",
         "If you can't find any tears, here is some high energy for you:\n\nTrump | Never Come Down [Remastered]\nhttps://www.youtube.com/watch?v=_6HT_AqXL-o",
         "The mask slipped right then.",
         "Oh no, he let the racism slip.",
         "Haha wow",
         "Do you have a clip of this?",
         "that is gold.",
         "I find it funny that talking heads were surprised at the conservative Latino vote. They must not know many Latinos. The legal citizen Latinos are more conservative than a lot of white people I know",
         "Yes, calling the voter base you NEEDED stupid has worked well in the past",
         "I can’t wait for the YouTube compilations in a week",
         "Link?",
         "Kamala ruin kamala.",
         "Same. I was in fact shamed for it since I live in a battle ground state. The entire third party vote still leaves a gap of 100k between trump and Harris in the popular vote.",
         "I was told the same",
         "There’s a thread on the WI page blaming third party voters",
         "Well yes. Left leaning and the bishop henchmen style libertarians voted chase Oliver. While the mises causes right leaning ones went trump..\n\nPlus you had the rfk jr ones go trump also. \n\nSo yeah third party did deliver trump the win.",
         "The famous 3 AM voters",
         "CNN just showed them arriving with a police escort in Philadelphia. Those mail-in ballots?",
         "Didn’t believe it was rigged or barely rigged in 2020. But now it suspicious. Especially looking at total votes",
         "By everyone, I assume you mean everyone who didn't realize that COVID is already over in 2024\n\nOh wait, yeah, that checks out.",
         "I've been yelling this from the start. She finished what, 11th or 12th last primary? What made them think she would be popular besides, not Trump. Hopefully this is a fuck around and find out moment for the DNC.",
         "I just love the 'Clinton failed her run against Trump because she thought she deserved it, Let's put in another female candidate with 3 times the entitlement!'",
         "I mean. We barely see her over the past four years then they just stick her in like. \"Here! Put this bandaid over this gaping wound. Then just leave it there. No stitches! No gauze! Just use this bandaid we found at the bottom of the first aid kit! We'll tell the people it's the best bandaid in the world. They'll accept it.\"",
         "Look, she has a lot of negatives.  One is that she's a woman - that's just the truth.  But let's go on from there - she has no roots in this country.  Neither of her parents is American.  She is one of many who got their passport through the largesse of the 14th Amendment.  She spent her adolescence abroad.  (Her unusual background is so similar to that of Barack Obama it's crazy, and no one talks about it - at least Obama's mother was American.)\n\nI don't want a virtual foreigner to be the president of my country, and I don't want a virtual foreigner to be the first female president.\n\nAnd then she is just not intellectually impressive.  She can't speak extemporaneously.  Everyone knows this.  If she were president, I foresee a repeat of George \"Bloody\" Bush - a warmonger puppet who makes constant dumb statements.",
         "I have avoided that place like it was weaponized ebola, but I might have to go look now.",
         "Maybe if Kamala made just one more traffic-crippling visit to Philly and I would've voted for her highness.",
         "She kept texting me and I kept asking for nudes but, alas, no response. Maybe if she tried harder to earn my vote... Nah.",
         "Cracked me up when the guy came out saying she wasn’t gonna speak until today. That’s concession and if it wasn’t then why would I want a president unwilling to stay up late and talk to the American people. Gotta give Trump credit for that",
         "It's really quite difficult to qualify for naturalization in another country once you're over forty.",
         "Once they figure out everyone else’s borders are tighter than ours…",
         "Think the whole crew over there loaded up on Valium to avoid making total fools of themselves like they did in 2016.",
         "Ohhh so this is the Project 2025 I've been hearing about",
         "I doubt anyone has ever washed to see her ass in fishnets.",
         "Meanwhile multiple states approved solid Pro-Choice abortion amendments. They realize he wants it to be a state issue and it is, now many states are approving CONSTITUTIONAL AMENDMENTS regarding abortion being allowed and without governmental overstepping. These people don’t understand politics or government at all and it shows",
         "I think they had a better chance keeping Biden on the ticket than doing the switch up they did.\n\nThey thought \"black\" and woman would be enough regardless of how wildly unpopular she was.",
         "Unless...  they realized that should couldn't win, and they think putting in Trump is actually better for their long-term plans.",
         "I got banned from mildly furiating because I said the one lady that screamed at the kid looked like a Harris voter because she was surrounded by people with Harris/walz signs. For some reason they dont realize that banning people for simply stating what they see does not help their side",
         "These people live in a bubble online and have no clue how the world keeps on turning",
         "Also this, “drink lefties tears” shit is cringe.",
         "This 🙌🏼",
         "I love the fact that he mentions it's an unfair system because Trump won. However you know if Harris  had won it would have been, the people have spoken!",
         "She is nothing more than a puppet. I don’t think she’s had a thought since becoming VP to the man she trash talked.",
         "Dad is a Marxist economist. Hard to get more lefty than that.",
         "I see her more authoritarian than Trump honnestly",
         "She's definitely far left. These large political parties have cliques and groups within them, they're not as unified as they like to lead people to believe\n\nHarris is definitely part of the far left within the party that includes Newscum",
         "Yeah, it's Walz that's the problem here.",
         "Happy Cake Day!",
         "We need a meltdown megathread with links and vids.",
         "I would also like the clip",
         "![gif](giphy|MxqPlIC8TmbPW|downsized)",
         "This also makes me wonder about all of the people who told me I was wasting my vote because I was picking a loser.",
         "If they can't scrape up the electoral votes\n 1: California is an all-or-nothing state. Libertarians can EXTRA vote for whoever the fuck they want, and there isn't a single DNC soul that can whine about it because they all count as blue every election anyway. \n2: lol. lmao even. The major parties always cry that third parties didn't help. Just because you can't get your voter base erect for an election doesn't make me your fluffer.",
         "If you add up all third party votes and give them to Harris, Trump still wins the popular vote. Did you look at the states they came from to determine electoral votes would have been or something? Or are you “just sayin?”",
         "I think the 3 a.m. voters showed up for Tammy Baldwin in Wisconsin. When I went to bed Hovde was winning with 100% of precincts reported.",
         "My stance on the elections is if Florida which is 3rd as far as population in the country can have it all figured out within 2 hours there is zero excuse for these other states. Anything less than that invites the country to suspect that this shit isn’t being done right.",
         "I thought it was “rigged” in the sense that the corporate media and the powers that be really stacked the deck against Trump (letting Biden hide in his basement, making the lockdowns hurt, suppressing the Hunter Biden laptop story, etc) but I was kinda agnostic on if there was enough actual voter fraud to swing it. It did look suspicious to me, and I understood why people came to that conclusion, and it wouldn’t have surprised me if they did steal it, I just wasn’t sure. \n\nBut now when you compare 2020 to 2024, You’re telling me nearly 20% of people that voted for Biden just stayed home? Especially when trumps turnout was relatively similar? It looks way more suspicious now",
         "It absolutely was",
         "She just doesn't have the cock sucking capacity she once did in her younger years. If she had just puffed more peters, she'd have done better. I'm sure she got a new BMW out of the deal regardless.",
         "Actually, they never said it was a good band-aid, they said it wasn't the \"other\" band-aid.\n\nHer whole campaign was \"I'm not Trump.\"",
         "To be honest they won’t leave.  Very few actually do. They will calm down and keep participating in our society.   I think it’s they are in shock that everyone didn’t think exactly like them.",
         "It’s really not. If you have enough cash you can move almost anywhere. There’s a list of about 12 countries that will automatically grant you citizenship if you give them minimum $250k to invest for you.",
         "Maybe they should switch to propofol.",
         "They are so ingrained with identity politics in mind they are surprised when these demographics aren’t monoliths supporting Democrats blindly every election. Minorities lean left but they aren’t all leftys! This election showed that big time",
         "The hivemind doesn't like anything it isn't lockstep with their thoughts.",
         "True but it is pretty funny how crazy these people are whenever Trump wins 😂",
         "My mom was a hardline lefty and I’m Libertarian lol your parents’ views don’t mean anything",
         "What’s ironic is my senate vote wasn’t a waste because the only options were republican and independent. And what’s also weird is I haven’t been harassed by trump supporters for voting for Chase.",
         "TBF this is Kamala we're talking about. Erections are in short supply.",
         "Wait...did my state just get called smart? You mean, Florida did something good? It's not just that Im missing the joke or something?",
         "It’s insane the way we’ve been gaslit since 2020 to just expect that it takes a week to count these votes when every election of my life before then (aside from 2000) we had the results the night of with no controversy",
         "Matt Walsh?",
         "You clearly aren’t aware of her biggest campaign policy. She grew up in a middle class family. That’s it, that’s the policy",
         "How many people have +$250k of liquid cash willing to lose to a government investment. Space isn’t that hard to go to, you just need millions of dollars.",
         "Her dad is a Marxist",
         "Florida man gets his shit together and makes up his mind quickly.\n\nUnlike 24 years ago.",
         "No, Florida gets one thing right then fucks up the abortion amendment and the recreational cannabis amendment in the same night, y’all are still dumbfucks as a whole, present company possibly not included.",
         "I think you’re both forgetting the joy and hope in her campaign.\n\nI’m not sure if that means I should feel joy about her not being Trump, or joy for being able to buy eggs for almost eight bucks.  Maybe it’s just hope my family will one day return to the middle class?\n\nEither way… Joy and hope people, joy and hope.  That’s the band-aid we were promised!",
         "You keep repeating that but there are heaps of stories about children distancing themselves from their parents and families, usually dems/libs and repubs/maga but you get the point. Your argument doesn’t hold.",
         "Okay? If you love a candidate for their views do you immediately disregard them if their parent was a Marxist?",
         "Yeah, i know ☹️"
      ]
   },
   "1gl2fyr": {
      "title": "Reminder from the people to the jesters",
      "text": "This election outcome should be a great reminder to so called celebrities that they are entertainers (at best) and not political advisors. They are merely court jesters to me and I couldn’t possibly care any less about who they think I should cast my ballot for. When the people follow the advice of the jesters the whole country is made a fool. ",
      "comments": [
         "Are you sure? They make a lot of money which must mean they are very intelligent and capable and stuff. Their jobs are very important."
      ]
   },
   "1gkgip8": {
      "title": "Finally switched to the libertarian party. ",
      "text": "For the longest time I've considered myself to be a conservative in the sense I wanted lower taxes, smaller government, less regulations, more freedoms, etc. But several years ago I met a libertarian and we talked about many political things and he brought up several valid pointd. He essentially brought up several points that I never thought of before. Briught stuff up about \"how free are you if they will arrest you for not doing what they demand.\" He also described the typical social beliefs that come with libertarianism. Which some to this date I've personally struggled to side with. \n\nBut when looking at the bigger picture there are more things I've agreed with the libertarian party than disagreed with.",
      "comments": [
         "Fiscal conservative + social liberal = Libertarian\n\nKeep the government out of my doctor’s office, wallet, bedroom, voting booth, gun safe, and marketplace.\n\nAnyway, WELCOME!",
         "Welcome.  Just don't EVER go to your local meetings.  If you do we'll lose you in much less time than it took to make you decide to join.\n\nStick to online boards, and revel in the party platform being the best available option.",
         "A lot of libertarians are basically people who don't like taxes and the government and stuff. \n\nThat's a far cry from Thomas Paine, or any person who's given serious thought to individual liberties. Libertarianism doesn't even mean the disestablishment of government, rather it puts the onus on the one who wants to take away rights rather than on the person who has to argue for why to keep them. \n\nLike it's entirely possible and probable that the IRS stays around because we need to pay for *some* things as a society.  The military is a clear example, I'd argue that issuing passports and managing the borders probably fall into there too. Maybe even the FAA, NTSB, and... port dredging operations? FBI?\n\nEventually though you start running into things that may, or may not, be a great idea. Department of Education? Department of Health and Human Services? \n\nFortunately you don't need to solve every issue or plan out your last chess move. You start with the things that are the most egregious and that have the most momentum to break apart or otherwise redo in a better way.\n\nBut I'd urge you to read some books by libertarian thinkers to get the whole understanding and not just be the rather knuckle-dragging version of many political folks where they have a loose grasp of their ideals.",
         "Now do your own research on the intellectual roots of libertarian thinking and perhaps even associated economic ideas.\n\nPerhaps a good place to start:  \n\nhttps://www.libertarianism.org/publications/essays/history-libertarianism\n\nAnd associated with libertarian thought is the Austrian School of Economics. This is not to say all libertarians must be Austrian School adherents, nor to say all Austrians must be libertarians. But it is safe to say the two have concurrent thought and many people are both libertarians and Austrian School adherents.\n\nThe most well know voices of the Austrian School include:\n\nMises Institute:  https://mises.org/\n\nEuropean Center of Austrian Economics Foundation (ECAEF):  https://ecaef.org\n\nAustrian Economics Center:   https://austriancenter.com\n\nWell known economists like Milton Friedman and George Stigler are considered to be members of the Chicago School of economics and it is also loosely aligned with libertarian thought but diverges on the question of central banks and monetary policy.\n\nPerhaps the most well known concept associated with libertarian thought is the non-aggression principle or NAP.\n\nThe NAP is by no means the perfect definition of libertarian thought and does have issues:  https://www.libertarianism.org/blog/six-reasons-libertarians-should-reject-non-aggression-principle\n\nHowever, the main idea behind it drives libertarian thought. Namely, it is an ethical principle that forbids the initiation of aggression. And it flows that if an individual lacks the right to initiate aggression then a collection of people, even a majority of them, also lacks the right to engage in aggression.\n\nProto-libertarian Bastiat applies this principle to government in his treatise, The Law, when he wrote the following:\n\n>The law is the organization of the natural right of lawful defense. It is the substitution of a common force for individual forces. And this common force is to do only what the individual forces have a natural and lawful right to do: to protect persons, liberties, and properties; to maintain the right of each, and to cause justice to reign over us all.\n\nThis, to me, is the essence of libertarian thought regarding government. It has no more rights than any individual to act beyond that which an individual can lawfully do.\n\nHave fun going down this rabbit hole.",
         "Most people are Libertarians, they just don’t know it yet",
         "Libertarians are nice, their candidate this year is anything but one though.",
         "Welcome aboard! Now get out there and vote for RON FUCKIN' PAUL BABY!",
         "I wasn't interested in politics at all until Ron Paul ran for president and suddenly there was a guy who could articulate all of the dumb thoughts I have, in a way that sounds smart, and I just knew. Watching him in the debates I was literally thinking to myself, wow this guy is gonna win, he's the only one who has the right answers. Then I got into politics for real (maybe over-corrected) but now yes, I 100% identify as Libertarian, and still struggle to understand how any American wouldn't do the same. It sucks that the GOP isn't more Libertarian in general, I know they definitely used to be, but damn. It also really sucks that the Libertarian party itself is largely a joke, consisting of a lot of political grifters, and single issue drug legalization people. Because the ideology itself (to me anyway) seems so profoundly and obviously SOLID in all aspects that it seems like it should be an auto-pick for any thinking breathing individual. As soon as it's explained you should go, well yeah DUH if we want to be as free as possible, and have as little tyranny as possible, we should definitely do that.",
         "  Please remember that libertarians are known for being conservatives who dont want the conservative name. If you are a libertarian then you *must* believe in gay rights and the ability to have cosmetic and life altering surgeries if you please, given that you are an adult. You do not have to personally or morally agree with these things but in the name of liberty, we support them.",
         "I think it’s hilarious that on a Libertarian sub there are so many people arguing about which flavor of dog shit is better.\n\nI really can’t wait until this whole fiasco is over with.  Then the folks who backed whatever abysmal candidate ends up winning can bask in the glorious smell of their own farts while the broken system continues to devour itself.\n\nBe sure to pick up your “I voted” sticker.",
         "Question, I’ve been libertarian in my head for a decade but never officially joined. Was considering running for a local seat or something in the future and figured going to meetings would be the first step. What is wrong with local meetings?",
         "Lol, what does it say about us that the online discourse is more sane than the meetings? ",
         "Just tell him to read Mises, Hayek, Bastiat, Hazlitt and Hoppe.",
         ">Maybe even the FAA, NTSB, and... port dredging operations? FBI?\n\nThis is exactly where I'm at.  I'm a pilot, and there's zero way an entire industry like ours that by necessity crosses state lines and national borders on a daily basis could exist without the FAA (and by extension the NTSB).  We're seeing right now what happens when the FAA is underfunded with lots of flight delays due to understaffed air traffic control and local airports crumbling due to delays in funding infrastructure projects.\n\nAnd with the current incompetent state of a lot of local police forces and their insistence on trampling basic civil liberties, we absolutely need the FBI/DOJ to be an arbiter keep them in check.  Theoretically at least.",
         "I mean, what normal person wants to run for president? Now shrink that to be \"who wants to run for president with no realistic shot in hell of getting it?\" Don't get me wrong, I want a libertarian candidate party that can actually mount a non-zero chance, but 2024 isn't that year.",
         "Trump is NOT the best choice if you're Libertarian. \n\nEspecially with project 2025. I'm not going to tell people who to vote for, but Trump is the FARTHEST candidate from what a libertarian stands for. \n\nToo many fake Libertarians on this sub now.",
         "They are overrun with sovereign citizens, tinfoil hat conspiracy types (some quite literally), and various other wackos pushing really odd niche causes.  \n\nAnd they all want YOU to join their particular brand of crazy.  And they don't like it if you tell them NO, even if you don't give details on why.",
         "I’m registered but I don’t pay dues, like the party, especially the state ones baffle me at times. Especially their twitters which aren’t libertarian at all. Cough cough New Hampshire. Cough Cough Connecticut",
         "That's what I try to explain to people. It wouldn't matter if we over throw the government. It would eventually be filled with power driven, narcissistic people, who make deals with sharks. Those are the type of people who want to be president or in government in general.",
         "Here’s a good Libertarian take on 2025. The mainstream media has been spreading wild disinformation about it considering *no one has actually read it*. It’s not all bad, but based upon restructuring government agencies when they should just be eliminated. https://youtu.be/cv72BigxKEY?si=uGrOTQ_a9VME2nw3\n\nIf you haven’t read it (I have) please stop using project 2025 to fearmonger. It isn’t directly associated with Trump as it is. Spreading misinformation wouldn’t be a very Libertarian thing to do, would it?",
         "You're telling me that Kamala Harris is closer to libertarianism?",
         "If Ron Paul joins Trump's team, then how is Trump not the best choice? That's rhetorical, of course.",
         "Both candidates are Auth. Don't vote for either of them.",
         "''Project 2025'' oh my god, when did Democrat bots start gettin' in? - the image is you, except you're straight up going for the Dems.\n\n  \nRon Paul, Trump and Musk are INFINITELY more Libertarian than the Marxist, price-controller Kamala and her establishment party, supported by Socdems and Neocons.\n\nhttps://preview.redd.it/g49z7hd2p5zd1.png?width=901&format=png&auto=webp&s=76ab91a280ae9d2d9aea8a859818f5717d515379",
         "Power corrupts\n\nAbsolute power corrupts absolutely.",
         "It's literally meant specifically for Donald Trump if he wins. It's a literal playbook for aTrump administration.",
         "On a personal ideological level or in style of government?\n\nTrump certainly uses more libertarian like rhetoric but in terms of how he actually intends to govern it will be significantly less libertarian\n\nKamala will be more or less a continuation of the status quo for all the good and bad that entails",
         "Did I say that?",
         "They are literally saying this DAYS before the election to get naive libertarian undecided voters.\n\nTrump does not have this country's best interests in mind. He only cares about himself. \n\nWhy else did practically his entire cabinet + VP  denounce him and say he would be bad for America.",
         "And none of them are getting my vote for one.  Amazing to watch the whole country get in line like they have to vote either R or D.  Never Trump 2024.",
         "> Ron Paul, Trump and Musk are INFINITELY more Libertarian\n\n\nYeah, none of these people is at all like the other.",
         "You're special",
         "I can write you a book and hand it to you. I can’t force you to read it or do as it instructs. Trump claims to have never read it, and his expressed policy positions support that notion.",
         "Trump is using Christian Nationalist rhetoric consistently. Which is far-right.\n\nNot a single thing he stands for is libertarian. He wants total control. \n\nHave you actually heard what he says, actually listened?",
         "Well yeah:\n\"Trump is the FARTHEST candidate from what a libertarian stands for.\"\n\n\nOr do you not know what FARTHEST means?",
         "Sorry, no -- you're the victim of establishment propaganda.",
         "https://preview.redd.it/b6e312gkw6zd1.jpeg?width=901&format=pjpg&auto=webp&s=104e9d4bb8be5d54b59a46fd8e7b5180504039ef",
         "2 are billionaires who only care about $.",
         "and yet they're still infinitely more libertarian than Kamala.",
         "Socialist advocating for an anti-free speech, anti-gun, pro-price control government in a Libertarian subreddit, nice.\n\nWhat's next? Public healthcare?",
         "You actually believe what he says? Seriously? \n\nThe guy who has lied and cheated MULTIPLE times.\n\n🤦‍♂️\n\nNobody can help how gullible you are.",
         "I mean he definitely uses libertarian rhetoric like low taxes deregulation ect\n\nAgain in terms of actual governing much less so he actually raised taxes on my Community because of the repeal of the salt tax",
         "Mf that's what \"farthest candidate\" means. Who are the other candidates?\n\nEdit: my bad bro. I responded to the wrong one. But yeah you right",
         "No, there are multiple candidates to vote for. It's not just 2 people. \n\nBut compared to Trump she is more libertarian.\n\nOne wants to force 1 religion on children and everyone else, one doesn't. \n\nOne wants to control women's bodies, one doesn't. \n\nOne wants to legalize recreational Marijuana federally. \n\nOne doesn't want to take away certain social/welfare services, one does.\n\nOne wants to tax the rich while one wants to give the rich tax cuts.\n\nOne wants stricter gun control (NOT taking away), one wants looser.\n\nOne wants protection for LGQBTA and one doesn't. \n\nNeed i go on?",
         "Oh, you got any evidence to deny ANYTHING I've said?",
         "🤣",
         "Ron Paul - absolutely!\n\nElon Musk - probably a bit.\n\nDonald Trump - no.",
         "You're obviously a republican pretending to be a libertarian.",
         "Doesn’t matter if it’s *plainly obvious* by the fact his expressed policy positions don’t line up. Quit being the type of person Lenin described as “useful idiots.”",
         "Where did he ever say lower taxes for everyone?\n\nHe wants tariffs, which were one of the catalysts for the Great Depression. \n\nLook up the Smoot Hawley Act.",
         "Clearly you need an update on libertarianism. Abortion is a very controversial issue among libertarians. Welfare is very non libertarian because it's a social program funded by taxes. Tax cuts, no matter what, are almost always libertarian. Stricter gun control is one of the least libertarian things you could do.\nKamala is a pos just like trump and all they care about is power. They're both authoritarian.",
         "Dude you basically just made the case why Kamala isn’t Libertarian. More taxes, more gun control, more government.",
         "sorry bud, it's too late to troll over here; you and your astroturfers missed the timing.\n\nIt's over, crawl back to your 1st amendment-destroying, 2nd amendment-regulating, economy-controlling, taxation-increasing and government-expanding ways.",
         "Donald Trump is definintely more Libertarian than Kamala, do we really have another ''left-libertarian'' here? God...\n\nUnless you're saying that he isn't a Libertarian, which I agree with; I never claimed otherwise",
         "The naivety of some people.",
         "Yes he talk out of both sides of his mouth\n\nAlso personally I think the Federal Reserve is more to blame for the Great Depression",
         "Those are NOT against libertarianism.\n\nYall need a refresher. Libertarian is personal freedom. Trump is against personal freedom.",
         "Taxing people above $400k, that's bad? Did you not see the comparison of what their tax plans would do to the lower class?\n\nGun control in the sense of background checks, criminals will always find a way to circumvent those but it's better than letting someone who shouldn't own a gun just go get one.\n\nWhere did I say more government? Only Trump wants more government.",
         "Only Trump wants to destroy the 1st amendment, cultist much?\n\nHe's literally threatened multiple people and news outlets who have spoken against him.\n\nHe wants tariffs, which are BAD and increase inflation.\n\nPull your head out your ass. Oh wait you can't, it up Trumps because like the MAGA you're delusional and in a cult.",
         "Left libertarianism is an oxymoron. There can be no liberty without economic liberty.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "Don't know why you decide to ramble about Left Libertarian, which is an oxymoron.\n\nIt seems we agree that neither Trump nor Harris are libertarian, so let's leave it at that.",
         "Abortion is a violation of the rights of the fetus. Taxation is theft. Gun control is restriction on your right to self defense.",
         "I think you need to open yourself to some alternative sources from wherever you are consuming your news if you believe that Kamala is the small government candidate. You brought up project 2025 earlier and that specifically identifies numerous government departments to be eliminated or streamlined, a great example being the Department of Homeland Security an agency detested by most Libertarians. Simply look at the jobs numbers to see how the current admin is increasing the size of government.  25% of all new jobs are government workers, over 30% of our GDP is government spending. You can make an argument that is good but you cannot argue it is libertarian.",
         "holy TDS.\n\nI don't like tariffs. You know what else I don't like? Everything else about the Democrats. You are either extremely ignorant or a troll, just the fact you're trying to compare Democrat economic control and freedom raveging with Trump is insane. You are not and will never be a Libertarian, you're an ashamed progressist, I've already told you; go back.",
         "Left libertarianism is an oxymoron. There can be no liberty without economic liberty.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "1. Fetuses have no rights as they are not a person until they have been born to become an infant.Not all fetuses are consensual nor viable,  hence why abortion care is important. \n\n2. Taxation is not theft, unless it's being used for the wrong reasons.  Taxation is necessary for a government, otherwise it can't pay for things.\n\n3. Gun control is not a restriction on your right to self defense. It is there to make sure those who shouldn't own a gun don't have legal access. \n\n2/3 of your points are literal Conservative points.",
         "You do realize that everything that Trump wants to do is exactly what Hitler did with Germany. \n\nYou really need to re-up on your history. \n\nHistory is one thing I pay attention to and I'm fairly tuned to. Everything about P25 screams Totalitarian Dictatorship.\n\nFar-right? ✔️\nCentralized Government? ✔️\nMedia control? ✔️\nPunishment for political enemies? ✔️\n\n\nDo your research before coming at me.",
         "You seem to like Trunp.",
         "You are NOT a libertarian if you agree with anything about Trump. \n\nHe's far-right conservative and is not anywhere close to having libertarian views/values."
      ]
   },
   "1gkjoa7": {
      "title": "ELECTION ALERT: Still Too Early To Know Which Minority To Scapegoat",
      "text": "",
      "comments": [
         "I look forward to it every cycle. My fellow Cubans always make the cut.",
         "As tight as this race is, they are definitely ready to scapegoat a third party. The polls in recent weeks made them trot out Papa Ron to dangle in front of us to get that extra 2%.",
         "They fucking called it once again the democrats sub is going feral with blaming Latinos. As if ignoring immigrants for 4 years is suddenly gonna make them vote for you.",
         "Our candidate was cautious to make sure we’re not the spoilers this time I guess.",
         "The year of the Inuit!",
         "This is accurate.",
         "On a personal note my girlfriend is blaming me for Trump winning because I voted for Chase.  LOL.",
         "Unpopular opinion: the libertarian party should merge with the republicans and becoming just a caucus or at least stop candidating people for President and endorse the repubblican nominee",
         "Chechnya zindabad",
         "Lol",
         "Yep",
         "I actually think libertarians made the difference this time.",
         "Nah, we will never give them an unconditional support. If they don't promise is things, we will not show up to vote.\n\nIdeally we should push for a libertarian vice president soon."
      ]
   },
   "1gkm9hw": {
      "title": "Florida Efficiency",
      "text": "I just wanna say... Florida has the least government funding per-capita of any state and is already over 70% in, while the second closest is Kentucky at 30% after almost 2 hours. Florida has been counting for half of that. More government is less efficient.",
      "comments": [
         "Florida allows local election boards to count ballots as they come in so all the mail in and early votes have already been counted.  \n\nWaiting until polls close to count all the votes is just plain government stupidity.",
         "You could just do all of this by computer. It should take about 4 seconds to count every ballot in America, if this were about efficiency, and not political gamesmanship. We can already do money safely with the internet using Bitcoin, but for some reason we have to go to a special physical location to use other computers to do voting, computers that sit idle 99% of their lives. There is no reason we can't just vote with our personal computers, public/private key encryption has been a thing since internet commerce took off, and there is no reason voting couldn't be done online...",
         "Delays are only necessary for adding additional ballots to the mix...",
         "That is nuts, I’ve never thought about it before but I really can’t believe they don’t “count as they go” so to speak.",
         "Counterpoint: the reason mail-in ballots are not opened until election day is to avoid influencing behavior prior to the election. If the early and mail-in vote totals are known prior to election day, someone will inevitably leak the data. That can be used to influence those who haven't yet voted (usually by persuading them to vote or not vote at all), or can be used by malicious actors to determine which races to target with ballot harvesting.\n\n\nNo solution is ideal; just trade-offs"
      ]
   },
   "1gkqejn": {
      "title": "Is Chase Oliver an establishment plant?",
      "text": "Pretty generic politician who has done absolutely nothing to spread the libertarian message and has pretty much quashed support for the party this election. Why wouldn't he be engaging more with Dave Smith and the podcast world?",
      "comments": [
         "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "He was a Democrat a couple election cycles ago, but didn't like that Obama was drone-striking everyone.",
         "He's doing worse than RFK, who isn't even running lmao",
         "Yes",
         "From what I've read on this sub, there were better possible candidates they just didn't get the nomination. I wouldn't be too surprised if the people that picked Oilver did so, so Libertarians didn't vote for him. Plus, with Musks government inefficiency task force, which Ron Paul is supposedly joining, that's going to take some votes away from the LP. Hopefully, it's made out to be as advertised. I wasn't going to be happy with Harris winning either, but that last bit is a silver linning for me.",
         "A plant? Nah. He's just a shit candidate. It happens.",
         "My conspiracy theory is that some republicans got involved with the nomination and put a candidate that was \"too far left\" for the people flirting with libertarianism and in doing so push people to the trump campaign. Then the tossing Ron Paul's name out there to drive more.",
         "He is just a poor candidate",
         "Chase Oliver’s biggest problem is he can’t read the room.",
         "Effectively. \n\nI don't think he's being paid to do this by the DNC or the like, but he came from the Democrats, and apparently still has a lot of internalized stuff left over that he's not really thought through. \n\nStuff like not engaging with people that disagree. \n\nThis goes poorly, as we see today.",
         "YES",
         "Correct.",
         "He sucks.  And supporting big tent capital L libertarian party sucks.   It’s a nice idea.  But the GOP has just delivered the most libertarian policy proposal since Ron Paul ran for president.  The big L party is now useless until needed. It has spent zero time making itself meaningful and instead spent all its energy encouraging malcontent at all cost behavior.  For 20+ years that’s been fine. This year that has changed.   Hilarious part is that libertarians have now won, and surprise surprise they’re still not happy about it.   I am a Ron Paul libertarian in principle.",
         "After backing Bob Barr and Gary Johnson (2x) to the hilt, I do not waste my time with the LP. It is a lost cause, unfortunately. Parties are made up of disparate voting blocks and interest groups. It's hard to found a party solely on a singular philosophy, no matter how good that philosophy may be.",
         "We had a chairman candidate strip on stage in 2016. Do you think we are worth the time of day for a plant to be planned out and executed?",
         "I mean kudos to him for that but that's also a pretty low bar to be considered a libertarian. A lot of people don't like drone bombing hospitals. In seriousness though, I just feel like there would be a lot of straight forward avenues for him to run a more visible campaign and it just all seems very low effort.",
         "What libertarian policy proposal? A do nothing Elon Musk commission? That wasn't even really a Trump idea. And GAO already exists. There are hundreds and thousands of reports of waste, fraud, and abuse. Congress needs to act on them. Elon Musk coming in on the weekends will do nothing. ",
         "With what money and support ? \n\nYeah someone with more media attention ability should have been the candidate. \n\nBut candidates weren't chosen on being the best they were chosen on tribal affiliations of pro or counter mises caucus",
         "Oh yeah, he's correct on that issue, but he has some learning to do before running for president.",
         "The party tore itself apart and may never be the same.  I hate the woke trans bullshit but he put out the message and I never heard one non-libertarian thing \n\nRemember there were lots of vocal Republicans who hate Trump and endorsed his opponent.  Maybe it's because he used to be a Democrat too?\n\nHonestly the LP should be embarrassed, not because of Chase, he actually campaigned pretty well for a guy whose own party turned against him.  It comes down to us, the rank and file.  While we were not paying attention factions took over the party and fought each other instead of the state.  That's the sad truth.\n\nGod I hope Trump meant some of the small government things he said.  Interesting times.",
         "Libertarians got pretty typical vote totals overall. Just not Chase. \n\nChase performed abysmally low, even as other candidates did not."
      ]
   },
   "1gknrae": {
      "title": "How is NH libertarian?",
      "text": "Everybody says that NH is the most libertarian state, so I thought it's like a tax haven, but while there are no income or sales tax, its property taxes are some of the highest in the country and it has other taxes like 5% on dividends etc. Not sure how that'd be a tax haven. The really high property taxes make it unattractive quickly. Yeah there's a project going on there that's libertarian, but I'm interested in actual working policies, mainly fiscal, but social ones too. And also, it's actually pretty blue.",
      "comments": [
         "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "Lot of transplants from MA voting for the policies they moved to escape",
         "Free-staters vs. locusts and unfortunately there are more locusts.",
         "Recently, there have been a shitload of transplants from out of state. Escaping their own high taxes, high costs, and stifled environment. They are bringing their politics with them…",
         "You can carry your gun to vote even if the polling place is in a school. So that's pretty libertarian.\n\nHopefully it doesn't get taken over by folks moving there from Massachusetts though.",
         "NH pretends to be Libertarian for Reason TV and John Stossel and then they suck commie dick every election and cup the balls.",
         "There is more to Libertarianism than just taxes.",
         ">I thought it's like a tax haven\n\nIt is a tax haven. \n\nSpecifically, they're trying to attract people from the nearby, densely-populated areas of New England (Massachusetts, New York, etc). Legally reside in NH and pay no income taxes!\n\nA lot of city folk have second houses or cabins in Vermont or New Hampshire. They often go up there on the weekend, or to hunt. And if they can figure out a way to establish residence in New Hampshire, they can avoid the (heavy) New York taxes.\n\n>I'm interested in actual working policies, mainly fiscal\n\nAnything besides taxes?\n\n>And also, it's actually pretty blue.\n\nIt's more purple than blue. Republican governor. Democrat Senators.\n\nIn presidential elections, it's been a blue-leaning, but competitive state. Bush won it in 2000.",
         "I see, so some libertarian social policies. It's just that for me money matters the most.",
         "From surfing the thread for a while I think there's actually a higher amount of LP members of the gov than other states.\n\nSomeone who knows better than I do feel free to correct/support that claim^"
      ]
   },
   "1gkx20q": {
      "title": "Does anyone know the best place for finding out voter demographic info once the election is settled?",
      "text": "I'm curious to see the demographics after the fact to see what happened. A friend and I are discussing the primary factor in this election was, and we want to see if there are signs of actual republican shifts amongst many voting blocks, or if this was the result of young-and-left-leaning people still being a horrendously unreliable group. \n\nNever really taken the time to hyper analyze the data before and we'd like to find a good source with specifics of possible. ",
      "comments": [
         "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "Exit poll data should be taken with a big grain of salt. ",
         "I'd be interested too",
         "No doubt. That's why I'm curious if there are any more concrete sources or if it's just estimates.",
         "It's really based on self reporting since you can't tell for sure how someone voted. If that person lies, there's no way to know. You can't even assume a registered R or D voted for their party. I don't know how you could ensure any level of accuracy on a secret ballot. ",
         "Valid point! I figured that was the situation."
      ]
   },
   "1gl0hfb": {
      "title": "The Damage Done By Our Inflationist Regime",
      "text": "",
      "comments": []
   },
   "1gk2s52": {
      "title": "What “i tHiNk GoVeRnMeNt ShOuLd” actually looks like",
      "text": "",
      "comments": [
         "Not really, im actually seeing a lot of these weasels on the left defending the NY state government on this because if they criticize it, they think its somehow helping Trump.. it's party over principal always for them. \n\nwhen the movie Sound of Freedom came out, you had reviewers literally glossing over child sex trafficking in their reviews simply because the people involved in the movie were conservative and giving them praise was a big no no.\n\nEven if I'm not a huge Trump fan, at least I can stomach a number of his basic ideas. The modern day left has literally no redeeming qualities. They are lower than Bush era Neo cons which is pretty fucking low.",
         "They actively support the Cheneys so they are literally the same people",
         "![gif](giphy|QVP7DawXZitKYg3AX5)"
      ]
   },
   "1gkqa76": {
      "title": "Libertarian?",
      "text": "I've always considered myself unaffiliated with any political party, but this is the year it *really* hit me, I've only ever genuinely liked canditates that *just so happened* to be Libertarian. I'm quite young, so it's not like I've much experience in vetting candidates yet, but they always seem to be the ones that make the most logical sense, that have the most intricate and realistic gameplans, that are the most confident and non-malleable in their beliefs and views about citizens rights and societal betterments. I've scrolled through this group a bit and it seems to be a good one on getting more informed on what this party believes in and stands for currently! \nMy boy Chase Oliver is yet another underrated candidate.🤧 ",
      "comments": [
         "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "You are an idealist. Unfortunately, we live in a society that likes taking your paycheck for their pet projects. All of my family are hard core Democrats, and its impossible to logically argue with them about the unjustness of inflation or taxes, even when it seems obvious to me, and the belief that the team red or blue Uniparty candidate is somehow going to change anything is as absurd as it is dominant.  A lot of education of government school graduates will be needed before we can get out of the doghouse and actually play this game with the big boys.",
         "Welcome! I hope you will find libertarianism to your liking!"
      ]
   },
   "1gk2vua": {
      "title": "Ron Paul: \"Suddenly Ideas Are Back in this Campaign\"",
      "text": ">After I posted some encouragement on Musk’s Twitter/X, he responded that he would be happy to have me join him looking for places to cut! While the last thing I am looking for is another job, I am encouraged by the outpouring of support and happy to help any effort to correct the wrong path we have been going down – a path toward total bankruptcy.\n\nhttps://x.com/RonPaul/status/1853652711142564328",
      "comments": [
         "This all should have come up earlier. By the time the whole \"Department of Government Efficiency\" with Elon and Paul came up I had already voted. \nTip for next election... Don't save the best idea of your candidacy until the day before the general election.",
         "Does he not realize what party increased the national debt much more than the other?",
         "They got my vote when they brought in Ron Paul. Idk if they're serious about getting two trillion a year but only one side talks about it.",
         "\"I have the concepts of ideas\"\n\nSad to see possibly the only principled politician of our time shill for Trump.",
         "You can't announce things early when you had no plans to begin with and you are just grasping at straws in the midnight hours.",
         "If you wait until the week of election to announce something you were never serious about it.",
         "I hope I don't see u crying on here when under kamala ur taxpayer money will be used to fund more meaningless wars.",
         "It's exactly what they wanted. Name drop and hope to lure in some suckers, while they have zero intent to listen to the man let alone implement anything he suggests.",
         "Same. The man is a legend.",
         "Same here. The party that brings in Ron Paul will have my vote every time",
         "Brought in Rand Paul… what exactly have they committed to? Did they have any discussions with him? Did Trump offer him any named position? No.\n\nIn the last week before the election there a few tweets. That’s it. Seems awfully convenient.",
         "Idk if it’s sad that there are people posting that this swayed their vote, or if all these posts are propaganda designed to sway votes.",
         "I did not vote for her, but let's not forget the 20 years of war created by Bush and other neocons. Do you really think Trump will cut support for Isreal? People here seem to forget what Libertarianism actually means.",
         "Exactly this. Less than a week before the election and it's all through twitter? This is clear cut bait.",
         "And Milei and Elon and Ross Ulbricht",
         "Either way, voting for Trump because of Ron Paul is absolutely not a smart idea.",
         "\n\n>but let's not forget the 20 years of war created by Bush and other neocons.\n\nThe neocons that back kamala? \n\n>Do you really think Trump will cut support for Isreal? \n\nNo, but I believe he will end the war with fewer casualties. Same for the Ukraine war. Neither of them would've happened if Trump stayed president.",
         "Agreed.\n\nTrump is not for libertarian views.",
         "Putin was attacking Ukraine regardless of who was president. In fact, it is no secret that Putin wanted and still wants Trump as president. Do you really think Hamas was not going to attack Isreal on October 7th if he was president?  I want the US out of all foreign conflicts, but let's not kid ourselves. Democrats and Republicans love a good show of military power around the world.",
         "And the guy who supports taxpayers money going to transgenders in prison does?",
         ">Putin was attacking Ukraine regardless of who was president.\n\nNato pushed him, too. Doubt Trump would've ever let it get that far. Trump would've gone to Russia before, just like he did in North Korea. \n\n>Do you really think Hamas was not going to attack Isreal on October 7th\n\nIt was weeks after we unfroze 6b in Iranian assets. That's quite the coincidence.\n\n>but let's not kid ourselves. Democrats and Republicans love a good show of military power around the world.\n\nI definitely don't disagree but Trump is by no mean a traditional conservative and is still imo the closest president in recent history to be anti-war.",
         "That's a Trump policy 🤣🤣🤣🤣",
         "Send a link",
         "It has been in law since 2016.\n\nhttps://19thnews.org/2024/10/harris-gender-affirming-care-incarcerated-people-fact-check/\n\nhttps://abcnews.go.com/Politics/election-fact-check-transgender-issues-trump-harris/story?id=115349047\n\nhttps://www.nytimes.com/2024/10/16/us/politics/trump-prisons-transgender-care-harris.html",
         "[deleted]"
      ]
   },
   "1gkpca7": {
      "title": "What is libertarian ideology ",
      "text": "I'm not trying to be disrespectful I'm just curious considering I vote in the next election and want to learn more ",
      "comments": [
         "It’s pretty wide. Big base of agreement is NAP. Non-Aggression principle. Basically we don’t support anything that would hurt others. How that’s defined can be broad, but I think most would agree that laws stopping things that don’t harm others are not necessary. Some may not like speed limits, drug laws, gun laws, etc. big variance when it comes to defining what harms others. But basically if what I’m doing doesn’t harm you, don’t stop me from doing it. \n\nExample: drugs. Robbery and murder are already illegal, so if I want to do drugs leave me alone.\n\nEdit to add- another relatively large agreement point is small or no government.",
         "Personal liberty. Small government. Anti war. \n\nThere's a wide spectrum of libertarians but that's how I'd introduce someone. Also, look into the non-aggression principle.",
         "Do your own thing and leave others free to do their own thing. Let free people make voluntary agreements with others rather than using government to violently force them to do what you want.",
         "Really depends on who you ask.",
         "All about freedom baby! Government control bad! Personal rights good! Taxes the devil",
         "My response to someone earlier today saying they are new to libertarian ideas:\n\nNow do your own research on the intellectual roots of libertarian thinking and perhaps even associated economic ideas.\n\nPerhaps a good place to start:\n\nhttps://www.libertarianism.org/publications/essays/history-libertarianism\n\nAnd associated with libertarian thought is the Austrian School of Economics. This is not to say all libertarians must be Austrian School adherents, nor to say all Austrians must be libertarians. But it is safe to say the two have concurrent thought and many people are both libertarians and Austrian School adherents.\n\nThe most well know voices of the Austrian School include:\n\nMises Institute:  https://mises.org/\n\nEuropean Center of Austrian Economics Foundation (ECAEF):  https://ecaef.org\n\nAustrian Economics Center:   https://austriancenter.com\n\nWell known economists like Milton Friedman and George Stigler are considered to be members of the Chicago School of economics and it is also loosely aligned with libertarian thought but diverges on the question of central banks and monetary policy.\n\nPerhaps the most well known concept associated with libertarian thought is the non-aggression principle or NAP.\n\nThe NAP is by no means the perfect definition of libertarian thought and does have issues:  https://www.libertarianism.org/blog/six-reasons-libertarians-should-reject-non-aggression-principle\n\nHowever, the main idea behind it drives libertarian thought. Namely, it is an ethical principle that forbids the initiation of aggression. And it flows that if an individual lacks the right to initiate aggression then a collection of people, even a majority of them, also lacks the right to engage in aggression.\n\nProto-libertarian Bastiat applies this principle to government in his treatise, The Law, when he wrote the following:\n\n>The law is the organization of the natural right of lawful defense. It is the substitution of a common force for individual forces. And this common force is to do only what the individual forces have a natural and lawful right to do: to protect persons, liberties, and properties; to maintain the right of each, and to cause justice to reign over us all.\n\nThis, to me, is the essence of libertarian thought regarding government. It has no more rights than any individual to act beyond that which an individual can lawfully do.\n\nHave fun going down this rabbit hole.",
         "In 2 words......personal responsibility",
         "First thing you should know:\n\n\n\n\n\n\n\n\nLibertarian =/= anarchy\n\n\n\n\n\n\n\n\nGenerally, Libertarians (myself included) believe in the NAP (anti-war, anti-meddling in other country's shit unless they meddle in ours), limited federal government (deregulated markets, emphasis on local and state governing) and advocacy for autonomy across the board. \n\n\n\n\n\n\n\n\nRule of thumb in Libertarianism: if it doesn't hurt anyone else or is an infringement upon their liberties granted to them by the US constitution (Bill of Rights), then it should be legal (gambling, drugs, prostitution).\n\n\n\n\n\n\n\n\nWhere different sects of Libertarians will differ is environmental issues and economic issues. But ultimately, Libertarianism is an ideology rather than a politician party, I like to say. Cuz for one, the USLP or any state's Libertarian party is a poor representation of what a Libertarian truly is. And two, Libertarians hate identity politics to begin with.",
         "Each human being is the sole owner of him or herself. It is unethical to initiate force or fraud against another human being.",
         "I think this is the most succinct way to explain it. \n\nAny time the government imposes laws restricting what people can/can’t do, no matter the intention, it always affects some innocent people. Whether it’s sending kids off to fight a war they didn’t ask for, forcibly taking money from citizens who need it and giving it to foreigners, preventing people from engaging in recreational activities among themselves, or forcing them to have or kill a baby they want or don’t want. The best solution for everyone is to not put the government in a position where they have the power to control what people do, unless it’s to protect them from other people.",
         "I'll ask you",
         "What topic do you want to hear my beliefs on?"
      ]
   },
   "1gk0suf": {
      "title": "Team Red vs Team Blue: Election 2024 (ReasonTV)",
      "text": "b",
      "comments": [
         "Hell ya some Heaton in the mornin' with my coffee.",
         "Oh man so glad to see these guys back. BRILLIANT and getting slightly more harried and tired of this nonsense every time.",
         "I love the skits these guys do! The one where they are both impersonating used car salesmen a few years ago was gold",
         "[Full version here](https://www.youtube.com/watch?v=U58gzkIx7ps). Heaton and Bragg are great.",
         "![gif](giphy|hVTouq08miyVo1a21m|downsized)",
         "The difference for me this time around is Ron Paul",
         "The full version of these are usually great, not the tiktok version https://reason.com/video/",
         "Please don't be tricked into thinking they would actually leverage Ron Paul in their administration. Its just a last minute grasping at straws moment."
      ]
   },
   "1gk8kay": {
      "title": "Partisan Press Conference: Election Day",
      "text": "",
      "comments": []
   },
   "1gjsa8s": {
      "title": "New Gonzales flag just dropped",
      "text": "",
      "comments": [
         "Very good",
         "But they literally came and took it..",
         "you can have my raccoons when you take them from my cold, dead hands"
      ]
   },
   "1gkzyy9": {
      "title": "The Wars of Donald Trump",
      "text": "",
      "comments": [
         "Time to hold Trump's feet to the fire on war.",
         "lol like kamala wasn't campaigning with Liz Cheney",
         "Trump got some praise on foreign policy, but he really wasn't all that great. \n\n* Sent weapons to Ukraine, which even Obama who backed the 2014 coup wouldn't do\n\n* Escalated tensions with Iran, bombing them multiple times\n\n* Was a complete shill for Israel, backing the Abraham Accords which essentially bribed Israel's neighbors into being friendly with US taxpayer dollars.\n\n* Nominated neocons like John Bolton, Nikki Haley, and Mike Pompeo to key foreign policy slots."
      ]
   },
   "1gk8ga8": {
      "title": "Post-Election Truths: The Things That Won’t Change (No Matter Who Wins)",
      "text": "",
      "comments": [
         "You’re allowed to post libertarian stuff on here still? I thought this was a maga sub now.",
         "Seriously lmao"
      ]
   },
   "1gkr5n7": {
      "title": "If you suddenly got elected for president, who would you choose to be your advisers, press secretary, etc",
      "text": "If you suddenly got elected for president, who would you choose to be your advisers, press secretary, etc? Name who and what position you’d give them. It has to be an American who is currently still alive, but it can be anyone who meets those requirements.",
      "comments": [
         "Michael Malice for press secretary without question.",
         "Bob Murphy - Chairman of the Fed... Also in charge of dismantling the Fed.",
         "Those most likely to cut bullshit deadweight. DeAngelis would be a first round pick, so would Ron Paul. Maybe get Uncle Ted on wildlife mgmt.",
         "Nobody currently involved with government, but is otherwise qualified. I would put out applications like any other job, perform interviews, and hire whom I felt is the best for it.",
         "Look, Don, this is not the way to fill a cabinet.  You should've already made a list.  But if you really want suggestions, Ron Paul & Rand Paul both need to be considered.",
         "Stossel for FCC chair.",
         "Roshambo.",
         "Literally anyone under the age of 60.",
         "I’d find a position for Thomas Sowell."
      ]
   },
   "1gjnhn9": {
      "title": "We are all partially enslaved by a system that treats us as tax cattle",
      "text": "",
      "comments": [
         "She's from Canada. It really is this bad.\n\nMy marginal rate is 53%. I don't know how we got here, but if a militia were ever to form to destroy the fuckers responsible I would be first to sign up.",
         "I drove to work on a public road, that sure justifies the government taking a cumulative 40% cut on all of my transactions. /s",
         "She is SO wrong! We don’t work for free, we receive the great and very beneficial service of dropping bombs on men, women, and children in poor countries overseas! How could society even survive without this essential service. Do you know how hard your life would be if you had to pay private businesses to bomb all those children for you?!? Did you ever think about that?",
         "Could she buy bigger glasses?",
         "*chattel",
         "Preaching to the choir here, it’s real bad. Real bad.",
         "What state does she live in where she’s paying 46% income tax?",
         "This is inaccurate because nobody works 7 days per week for 5½ months.",
         "Sure if you ignore that all those taxes go into everything that allows you to actually make any money at all. Along with being healthy, safe, etc etc...",
         "The militia most likely would not be able to afford ammunition.",
         "It’s all that “free” healthcare.",
         "Fuuuuuuuuuck. Sorry m8...",
         "Does it though? How about this, I kind of agree with you. I like public roads and I think we should all chip in to make them and maintain them. \n\nMy problem is how Tax Dollars are being spent. I am not a supporter of war. We all operate under the rule of law. If we step out of line, there are immediate consequences. The DoJ has never passed their own audits. And I have never heard of anyone being punished.",
         "Ackchyually at this point we are just working to pay the interest on the money borrowed for the services of dropping bombs on men, women, and children in poor countries overseas!",
         "I don't know man. I know a guy that can kill pet squirrels for way cheaper.",
         "Better to be dropping bombs on people we don’t know than have bombs dropped on us by people we don’t know. Amirite?",
         "Roads! ROAAAADS!",
         "She would, but too much of her glasses-money goes to uncle sam!",
         "She doesn't specify income tax.\n\nWhen you add all the taxes up, federal income tax, property taxes, state and local taxes, sales tax, fuel taxes, car registration tax, capital gains tax, I'm sure it would be even higher than that.\n\nNot to mention the hidden inflation tax that steals your buying power every year.",
         "It's Canada, and it is likely one of the lower taxed Provence.  Quebec without a dependant and married with two salaries is over 55% if you make over $160,000 Canuckistani dollars.",
         "Your right. Working for free for only 4 months out of the year is so much more reasonable. /s",
         "That's federal plus state in a lot of states.",
         "The State of Canada.",
         "They don't pay you for 7 days either. They pay you only for the days you work",
         "The underlying concept still applies",
         "The militia almost crippled the RCMP in Ottawa with some trucks so I'm not too worried.",
         "Baseball bats and crowbars would be fine too",
         "Boom! You get the best post of the day award!",
         "Appreciate that. \n\nI wish I didn't have to, but I'm planning my exit",
         "I wouldn't mind paying taxes if I get a 100% return on them in the form of public services that I actually use.\n\nWe all know that is not the case, especially for middle class people like myself. Even if the money wasn't wasted on foreign wars, at the end of the day I would still be required to give way more than I'm allowed to take in return. I want my taxes to be proportional to the value I get in return.",
         "And the taxes that businesses pay that are then passed on to you. It's taxes all the way down.",
         "That website appears to be Canadian?\n\n[https://www.fraserinstitute.org/tax-freedom-day-calculator](https://www.fraserinstitute.org/tax-freedom-day-calculator)",
         "I hear you buddy...",
         "Do you have any idea how much just a single road costs to build?\n\nEven if you only used one road to get back and forth to work everyday, you're paying far, far less in taxes then it would have taken you to build and maintain that road yourself. \n\nYou're definitely getting back WAY more than you put in.",
         "Lmao\n\nBro, the reason roads cost so damn much is... because they're built by the freaking government.",
         ">Do you have any idea how much just a single road costs to build?\n\nThe real cost? Or the arbitrary amount that any contractor could and would ask for the job? Even if you take the highest price, divide the costs by the number of total users, and suddenly, it won't be as high anymore. Take toll roads as an example. \n\nAnd if me using one road makes me a leech, then I'm curious about your opinion on people on welfare who use even more public services and provide even less.",
         "Oh right, I forgot to include the magic libertarian fairy where you can trade a 10 mile private road for two cows and a virgin maiden. 🙄",
         ">Even if you take the highest price, divide the costs by the number of total users, and suddenly, it won't be as high anymore.\n\nYou mean just like taxes do? 🙄\n\nPeople on welfare don't generally complain about getting more back than they put in.",
         "A road is literally just some black shit you schlop on the ground and then flatten out. It's not complicated.",
         "My taxes are not determined by how much I use public services. It even seems to be the case in a welfare state that the more I contribute, the less I get in return. All I'm asking for is a balance between the amount I have to pay and the value I get in return.",
         ">My taxes are not determined by how much I use public services.\n\nCorrect. As you have pointed out in the example of roads. You get FAR more use of public services than you actually have to pay in. You're literally using multi-million dollar roads every day for pennies a day.  That's the point of public services."
      ]
   },
   "1gjoklu": {
      "title": "Without TSA, who would hold up the lines at airport security?",
      "text": "Saw this news article today. Those that have flown into MSY know that it’s not a big airport, and it’s not a busy travel time right now. Imagine if this was pre 9/11, the company in charge of security would have either lost their contract or gotten a stern warning from the airport. ",
      "comments": [
         "Fuck TSA and fuck the Patriot Act.",
         "We had to travel through MSY after a cruise this last May. Out of the say 10 TSA checkpoints, 4 were open. The lines are only long from inept management and staffing practices. Also security is an illusion.",
         "\"Hey, I caught a terrorist!\" -said no TSA agent ever.",
         "Thanks GWB... the entire flying experience has gone to the shitter since then.",
         "Sounds like a good deal to me. People pay good money to stand around and get their junk touched. The government just subsidizes it at the airport.",
         "You know what would prevent a mass-casualty event? Corralling a mass of people, into a single choke point, with no walls or barriers, right *BEFORE* anyone is screened for any potential hazards or weapons!",
         "New Orleans native here. It’s a shithole. Done waste your time. Everything in Nola is run by incompetent people from the top down. Democrat leadership on full display.",
         "Well pay for fastpass. Then the super fastpass. Then your own plane.",
         "I'm voting for the presidential candidate who pledges to abolish the TSA!!!",
         "The patriot act was the least patriotic thing they have ever pushed on this nation.",
         "They’d have to do security like at the private side of the airport: modern. Blogs, posts, etc … a bot can sift through someone’s online personal and deem them safe or dangerous in seconds. Combine that with armed pilots (which is what we do in the USAF) and viola, actual security.",
         "Puhlease, it takes time to snap the latex gloves",
         "Well, how else can the TSA increase their budget? If everyone made their plane showing up 30 minutes before it took off, the TSA would get a budget cut.\n\nI'm not being clever or funny, this is how you increase budgets in government. Kids are stupid? More money. Long lines at TSA? More money. People getting sick? More money",
         "It always struck me as inherently unsafe to have large groups of people not knowing each other, standing together, in the name of safety.",
         "Last time I flew, the line for TSA was 3 minutes, and the line to check a damn bag was 90+. This isn’t just a government problem.",
         "TSA would be better as a prostitution agency. Here’s why:\n\n1. I’ve never seen TSA stop a terrorist.\n2. I’ve had my balls fondled by TSA many times\n3. I enjoy getting my balls fondled\n\nIf we take these 3 points into consideration and make the mandatory adjustments, I would be more than willing to pay for TSA.",
         "https://preview.redd.it/bms0dwn9r5zd1.jpeg?width=3024&format=pjpg&auto=webp&s=42ab89ad94091835987d21746729a1f0894ba16e\n\nIt was pretty busy yesterday. They wouldn’t let us downstairs. We had to stand in one of two lines. I had priority, but since I hardly ever fly, I didn’t know what this meant. So I stood in the regular line. When I got to the front he wouldn’t let me go downstairs at the same time as people were going in the priority line. I had to go start all the way over in the priority line. 🫠 But, I blamed it on my naïveté and went along with it.",
         "ABOLISH the TSA, ATF,DEA, DMV!!!!!!",
         "The TSA is why I will probably never travel. I don't like people touching me or my things. Or even looking, really.",
         "I'm a little clueless so forgive me, but what alternatives to TSA could be used? I'd like to think that we could get away with not screening people, but I have a bad feeling that terrorism would skyrocket. People are a lot more violent now than they were twenty or thirty years ago",
         "I thought this sub was all in favor of checking everyone’s documentation. Just think of all the murders they’re preventing!",
         "The Patriot act was crazy. Whenever we lead policy with fear it’s a dangerous road.",
         "No worries! The issue with Libertarians is more so to do with the nationalization of airport security, not so much having no security. When you have a privatized system like we did pre-9/11, you have competition between security firms, which incentivizes them to innovate, use new technology, ect, because if they didn’t, they would lose their contract to their competitor.\n\nWhen 9/11 happened, it was a sort of knee jerk response to nationalize, having convinced the American public that the government could do it better. In free markets, when these types of catastrophies happen, the company responsible will have to answer for their blunder. Will they go under? Will they be fired? Consumers ultimately will make the decision for them, and it will be corrected. Has their been a 9/11 style attack since 9/11? No, but it’s arguably not due to government taking over, in fact just the opposite happened.\n\nWithin the first months of the TSA takeover, security line wait times at airports skyrocketed, which led to more people driving. Controlling other factors like decreased air traffic and weather, automobile accident fatalities increased by 327 deaths per month, arguably killing more Americans  in a few months than 9/11 did. Not only that but in 2015, audits where Homeland Security attempted to sneak 70 dummy explosives across dozens of the US’s busiest airports, 67 made it through security.\n\nThat’s just the tip of the iceberg and there’s more, but Homeland Security in general is a contentious topic that Libertarians are passionate about.\n\nSorry for the long post!\n\nTL:DR version - big government taking over security made things worse, not better",
         "People are not more violent now than they were 20 or 30 years ago, its the media that makes it seem that way.",
         "Whenever people start saying \"We have to do *something*!\"",
         "still is crazy.  provisions of it are STILL in place.",
         "Exactly yet that’s all the media does fear monger people into voting against their best interests",
         "That's a really good explanation. Sounds cheesy, but you've really opened my eyes on that!",
         "That actually does make a lot of sense. The only reason why terror attacks seem more prevalent is because they're reported on more.",
         "\"Something\" may have started with investigation of the Israeli \"art students\" and their connections if any to the relatively new owner of the twin towers, but what do I know?   \n\nConversely, the \"war on terra\" gave us 20+ years of Uniparty sand wars and decimated two generations of American boys and men for the sake of oil, poppies, and destabilization of the middle east.\n\nNow Dick Cheney is in the tank for the American Socialists, and the Populist/Isolationists are adding Blue Dog Dems to their team.  Crazy times.",
         "I read in snowdens memoir that essentially they redefined what collecting data meant so that they were only “seizing/searching your papers” when they actually query their database of collected data. Like what!? If I take a copy of your personal documents but don’t look at them I’m still seizing them. I’ve heard the liberty act is bad too but I haven’t actually looked at it tbh",
         "Absolutely, because of the shock value that it provides and then people can't look away, and then they can make money off of advertising and shares and clicks and fear. \n\nthe last time i went through TSA my bag got pulled to the side along with about 5 other bags to be hand searched because of something that set off the machine. The agent went on break, the replacements just handed everyone their bags without even opening them. I call it security theater, an illusion of safety like someone else commented. \n\nI wish people would be more discerning of the motive, audience, source, etc of all messages they are being told before accepting them."
      ]
   },
   "1gk8c7u": {
      "title": "No Matter Who Wins, Half the Country Won’t Believe in the Election. Here's Why That's a Good Thing:",
      "text": "",
      "comments": [
         "“Here’s why that’s a good thing” couldn’t be a more Orwellian sentence, im sorry I’ve seen it with too many propaganda articles these days. I agree with the actual story though, just annoyed by the last sentence.",
         "If Harris wins “half” will claim the election was rigged through illegal fake votes or destroyed legitimate votes.\n\nIf Trump wins “half” will claim the election was stolen because misinformation is so prevalent and infectious, uneducated people were brainwashed to vote against their interests.",
         "No matter who is elected, the government wins and that is not the path to liberty or justice. People get too wrapped up in their side winning control of the power in Washington and forget that power is not the goal. It is liberty and justice.",
         "You should never put too much trust in them regardless.\n\nElection manipulation and fraud by interested parties has happened throughout all of history, and continues to openly happen today. America is not special. America is not immune. Every single election, there are people arrested for doing illegal election things. \"It was just a little.\" \"It wasn't widespread.\" \"It was caught.\" Whatever. It happens. It is happening.\n\nIt's like they say, \"the price of freedom is eternal vigilance.\" Be skeptical.\n\nNot saying go burn down your polling center if your preferred candidate doesn't win, of course. But absolutely do not blindly trust either.",
         "Downvoted. The Democrats will accept the results if Trump wins.\n\nI also think that at least 50% of Republicans will accept the results if Harris wins. \n\nThe very tiny percentage of Trumpies will riot, but the media is exaggerating how many Republicans have the motivation to riot. These same voters can't even be bothered to pick up prescriptions from the pharmacy, go to a doctor when sick, cook and clean for themselves, or maintain contact with relatives and childhood friends. 99.9% of them won't riot.",
         "If Kamala wins 100% of the country won’t believe it 😂",
         "Note that I did add to the title to make it a bit more provocative, but the author does highlight that a lack of confidence in elections will open up more peoples' eyes to the true nature of democracy and the state",
         "Hopefully Trump wins, so the left can see the result of democracy. And that living under an occupied government that results from democracy is an inherent evil.",
         "People losing faith in democracy is a good thing. Libertarians seek to abolish democracy, why wouldn't we applaud the decline of trust in it?",
         "No one claims election was stolen in 2016. There was lots of complaints, yes, but no one questioned the integrity of the electoral process. Please don't equate.",
         "The former only reduces faith in the electoral system, the latter will be used to justify censorship and is much more dangerous in my opinion.",
         "“Libertarians seek to abolish democracy”\n\nOn what scale? Consensus is important in any form of government, to a land dispute, or defining public utilities.\n\nI think the only thing all libertarians agree on, is that there should be less government, and that government should have less control, not necessarily on how we get there.",
         "I’ve seen that you oppose the idea of democracy and am curious to learn about the kinds of systems you can get behind. Is the issue the majoritarian aspect where 51% or more can infringe the rights of 49% or less?",
         "We don't seek to abolish democracy. You are sorely mistaken. It's broken and needs fixed in this country",
         "Yes i fully agree, i only was annoyed by the phrase “here’s why that’s a good thing”. So i completely agree with you, besides the phrase. I am afraid however that people will become lazy and that they’ll lose interest in politics and that their mindset will be like idc anymore it’ll happen regardless I have no power. But that’s of course our point, the power is with the people but many don’t understand that unfortunately. I think people get demoralized to the point of where they completely comply with whatever the government tells them to do. Im just really black pilled about the future because look at the history, it always repeats itself and it was always the people who were too afraid to speak out. Libertarianism is the only thing that can help humanity against a totalitarian system. We’re heading towards a dystopian totalitarian system and im fully convinced we’re going to lose it purely because of our fellow humans will be full of fear. Crabs in the bucket is a good metaphor for what i mean.",
         "https://www.washingtonpost.com/politics/hillary-clinton-trump-is-an-illegitimate-president/2019/09/26/29195d5a-e099-11e9-b199-f638bf2c340f_story.html\n\nYou guys have the memories of goldfish.",
         "Clinton said Trump was illegitmate president, Dems said Bush was also when he won in 2000. D's have a long history of election denial",
         "😆😆😆😆",
         "Consensus can be achieved in better ways than a majority forcing their choice on the rest. \n\nTake the choice, separate groups into no and yes, and give each side the choice they wanted and split the group. \n\nNow there's no tyranny of the majority.",
         "Exactly. Democracy is tyranny of the majority. Two wolves and a lamb voting on what to have for dinner",
         "Clinton conceded defeat on election night.  Look in the mirror and you may be shocked to discover than you’re floating in a spherical bowl.",
         "Clinton accepted defeat immediately. Your article is about her statement in 2019, which I agree I'm wrong in saying no one ever claim Trump is illegitimate.",
         "Yeah… Hillary repeatedly claimed that Russia worked with Trump to  steal the election from her. That’s not “nobody”. In fact, wasn’t there an investigation about this very thing? So many people “believed it” that Mueller was appointed anti investigate it. “No one claims”… interesting way to frame that.",
         "Much easier said than done. It’s clean if you only do it with one issue but as soon as you start adding more it’s messy",
         "What system or perhaps principles would you propose instead?",
         "She SAID she conceded defeat, then immediately worked to undermine the presidency of Trump behind the scenes. You cant say one thing, then actively work to oust a sitting president IMMEDIATELY and claim that you conceded. Both cant be true at the same time, especially when you claim him to be illegitimate in every interview you partake in. \"Not my president\" became the anthem of the left in 2016/17. Say what you will about her, she's not an idiot, she's a political killer. Her concession wasn't a modest act of contrition, it was a tactical  one.\n\nIn the obverse, Trump refused to concede defeat and immediately began working in the same way that Clinton did, but in the open and without the requisite political knowledge to do so effectively. It partially worked to galvanize his base, but mostly failed because when it comes to playing  the \"game\", he's a fucking idiot.\n\nIt's only circle toilet bowl talk because both sides do the same shit they accuse the other side of....and they both do it to varying degrees of success. It's easier to get away with when you control the shadow branches of government.",
         "Her campaign literally funded the now accepted fake  Steele Dossier which inevitably interfered with the 2020 election (And arguably still does because it's still accepted as favt for those who find it convenient). You can't both accept defeat and work behind the scenes to oust a sitting President. She literally is quoted in the article as saying that he's illegitimate, and in numerous other interviews from 2016/17, that's just the one I pulled.",
         "Anarcho-capitalism I think is the subreddit consensus",
         "Those actions aren't contradictory. You can acknowledge that someone won the election, and then seek to use constitutional methods to limit their power or oust them.",
         "Sometimes, I cant even believe how uninformed some people are. It's mind boggling. She's been fined multiple times for her \"Constitutional Methods\". When you set up a pay for play system with your foundation while occupying one of the highest ranking positions of government, you make enough money to be teflon. And yes, they are contradictory, especially when she says so verbatim in interviews for years."
      ]
   },
   "1gjdzey": {
      "title": "Innocence is no defense",
      "text": "",
      "comments": [
         "Rorschach's journal \n\nNovember 1 2024\n\nPeanut the Squirrel was murdered in New York.",
         "There is no law that government will not shoot you to enforce ... this is why government can never be the means to fix anything.",
         "This is why I believe in using tannerite filled fake dogs. The Feds hate animals for some reason, so if they’re gonna steal our property and shoot our pets, might as well have a good joke in the tragedy.",
         "We're heading down another timeline again, aren't we? Like when they put down harambe and everything went to shit",
         "The term anarcho-tyranny is increasingly useful to describe modern government.",
         "JUSTICE FOR PEANUT!",
         "https://preview.redd.it/ijjk3qjygzyd1.jpeg?width=1920&format=pjpg&auto=webp&s=82d20c5e4c5da85ef7786727e383f223eb04fa68",
         "They'll regain consciousness when bullets pierce their skin. By then it'll be too late.",
         "Didn't he bite some asshole, forcing the state to kill him to check for rabies?\n\n\nSure, the asshole shouldn't have been in a position to get bit in the first place, you could call it some form of squirrel self defense, but in general we value the lives and well beings of people over animals.\n\n\nWhat the DMV should have done here (if they must do anything) was issue a warning or a fine then follow up a few months later to see if he still has the unregistered animal.\n\n\nThe owner said that he was \"in the process of filing paperwork\" to get Peanut registered as an educational animal. He had peanut for 7 years. How long does it take to file that paperwork?\n\n\nI can appreciate the old libertarian/anarchist bulwark of \"the state shouldn't have a say in what I keep as a pet!\"and that's all cool until your neighbor gets a tiger and lets it roam free, or has dozens of feral hogs that they call pets.",
         "I don't like what they did either but come on, it was a squirrel not a human.\n\nHumans kill and eat literally billions of livestock every year. Trillions of animals killed for human consumption if you're counting seafood.\n\nAnd no, I'm not a vegan, I love meat. But let's be real here.",
         "Where are all the don't eat meat people? Where are the farmers abuse animals people? Where are the people who made the sign for okay to eat and not okay to eat? \n\nAwfully quiet 🤫",
         ">“They hate when I say, you know, when the elves— when I called Sauron, the elves said, ‘Well, he called Sauron brilliant.’ Well, he’s a brilliant guy. He controls 1.4 billion orcs with an iron fist. I mean, he’s a brilliant guy, whether you like it or not. And they go crazy.”\n\n>“He’s now Dark Lord for life, Dark Lord for life. And he’s great. And look, he was able to do that. I think it’s great. Maybe we’ll have to give that a shot someday.”",
         "You clearly haven't read the full story. The owner had filed the paperwork and was left in limbo with a response of \"in review\".\n\nHe cared for the squirrel for 7 years. If the thing had rabies it would be evident. Plus, the guy cared for it and, this is conjecture on my part, but likely had all the necessary shots for the animal.\n\nI honestly have a hard time siding with the entity that murdered a pet squirrel on this one.",
         "Squirrels and other small rodents don’t carry rabies. There has never once been a case of a human contracting rabies from a squirrel in the United States. The rabies excuse is blatant hogwash from the NYDEC. Let’s pretend that there was a chance that Peanut was rabid. In this case we can consider that the whole situation could have been avoided if the NYDEC would have not oppressed the poor man who owned the squirrel even if they were told to do so. Just because it’s the law doesn’t make it the right thing.",
         "We don't eat pets.",
         "They won't say a damn thing because they see speaking out on it as \"helping Donald Trump\" and I am 100% certain that the modern day left would defend child molesters before they did that. These people don't have any values they have a faction.",
         "are you saying that we should be vegetarian because we don't want to kill animals, like this squirrel?",
         "> If the thing had rabies it would be evident\n\nfalse.\n\n> Plus, the guy cared for it and, this is conjecture on my part, but likely had all the necessary shots for the animal.\n\nspeculation. also, there are plenty of shitty pet owners and plenty of pets that get into trouble without their owners knowing.",
         "The quotes that I've seen from the owner/caretaker had him saying that he was \"in the process of filing the paperwork,\" not that he had filed it and was having issues getting it approved. Still, he had had 7 years to figure out what I'm sure may be a super convoluted process.  \n\n\nAlso my understanding is that the state showed up because of his recently acquired raccoon, which are famously high risk for rabies, and took the squirrel because it was also unlawfully kept. \n\n\nReally if he cared that much about keeping the squirrel, he should have lived in a state that's not an authoritarian shit hole. South Dakota, for example, I believe lets you register exotic animals for $10 per animal, or legally become a zoo for $100.\n\n\nYes the state sucks for doing what they did, how they did it, but this guy could've also seen this coming when he constantly posted on social media about the animal that he was unlawfully housing.",
         "If I could give you an award I would.\nThere has been no single case of transmission as you say and the fact that such gross government overreach is defended on the libertarian sub is dumbfounding.",
         "> Squirrels and other small rodents don’t carry rabies\n\nit's rare, but entirely possible",
         "I don't know how we got here. Its like if Hitler had ever claimed the sky was blue they'd deny it because Hitler said it. The idea that they'd compare Donald Trump to Hitler blows my mind.",
         "Hardly. I'm just saying they're always talking about how horrible humans are for killing animals to eat...what about killing an animal bc it dared to live indoors?!",
         "> false\n\nYou're right. Rabies is known as a silent killer and doesn't show itself in any meaningful way.",
         "You're a sad little man, aren't you?",
         "> Really if he cared that much about keeping the squirrel, he should have lived in a state that's not an authoritarian shit hole. South Dakota, for example, I believe lets you register exotic animals for $10 per animal, or legally become a zoo for $100.\n> \n> \n\nif the squirrel had bitten someone in SD, they would still have killed it to check for rabies. It's a public health issue, not a heavy-hand-of-the-state issue",
         "Plain and simple, the smallest amount of research will confirm in the minds of any person with the smallest amount of common sense that the brutal execution of these animals was totally unjustified and is a very clear example of government overreach.",
         "> Hardly. I'm just saying they're always talking about how horrible humans are for killing animals to eat\n\nAnd you are saying that it's okay. So what's your problem with what happened?",
         "it does show up, but not until the late stages. it can be transmitted prior to frothing at the mouth",
         "I don't think animals should be killed needlessly. This was needless. The whole permit for exotic animals thing is insane. Have your animals. Just know that if they destroy property or hurt someone you're liable for the damages. \n\nAs for the vegan argument. They do themselves a huge disservice by being poor spokesman for their cause. Meatless Mondays should be their primary goal right now. Slowly introduce people to the idea of eating less meat. Eating meat less often. Not 'you're a monster! Only eat plants!'. Seriously shooting their cause in the face with that rhetoric. Play the long, slow game.",
         "> This was needless. \n\n-\n\n>Have your animals. Just know that if they destroy property or hurt someone you're liable for the damages.\n\nThese are contradictory statements. The squirrel did hurt someone. It bit a person. \n\n> As for the vegan argument. They do themselves a huge disservice by being poor spokesman for their cause. Meatless Mondays should be their primary goal right now. Slowly introduce people to the idea of eating less meat. Eating meat less often. Not 'you're a monster! Only eat plants!'. Seriously shooting their cause in the face with that rhetoric. Play the long, slow game.\n\nI don't give a shit about your opinions on veganism, I was just pointing out how incoherent your own argument is.",
         "Alrighty."
      ]
   },
   "1gjc7hc": {
      "title": "Justice for Peanut!",
      "text": "",
      "comments": [
         "Fuck those guys",
         "However much you hate government, it’s not enough.",
         "This is what overstepping with 0 accountability gets you, disgusting.",
         "How dare they",
         "This is what happens when you vote for more government.",
         "This guy needs to hit up Afroman and come up with a new track...\"All this for a squirrel\"",
         "I posted something similar elsewhere.  There's a lot of boot lickers saying bUt hE dIdN't HaVe A pErMiT!!!  hE dEsErVeD iT!!!!!!\n\nlet's pretend for a moment that the government is justified in saying having a squirrel & raccoon requires a permit.  I'm not saying I believe or disbelieve this is the right thing, I'm just playing along with your average Redditor here.\n\nIs the right response to not having a permit sending armed goons break into your house with guns drawn,  trashing your house, treating you like your slinging meth and selling \"illegal firearms\", all just to seize an animal they are worried is unsafe to keep because of rabies, while not wearing any protective gear to handle potentially rabid animals, and then euthanize said animal because they got bit?  All in the name of animal welfare?\n\nOr would the right response be to civiliy contact the person?  Request he get a license within X number of days, and if he then doesn't comply give him the option of turning over the animal to a facility that's appropriately permitted?  And if he still fails to comply fine him, and I'd imagine let a lawsuit be involved to take things over from there.\n\nThey fucking went after this guy harder than they go after dangerous criminals.  FUCK. EVERY. SINGLE. PERSON. WHO. SIGNED. OFF. ON. THIS.",
         "I laughed so hard when I heard this story and then got really pissed. Didn't they kill it? Like you don't have the common sense to see this is a cool dude who loves the animals. Not destroy his stuff... They should at least hold the raiders, who signed the warrant, and who reported it accountable by the social mob. Do we know these people yet??",
         "a reasonable man would buy a komatsu D65EX12",
         "This generation's Harambe moment.",
         "“We own you”",
         "Do we really hate the government enough? I mean every time I feel like I can't be more pissed at them, they prove me wrong.",
         "Time to leave new York buddy",
         "This act of authoritarianism paid for by your tax dollars",
         "[All This for a Squirrel](https://files.catbox.moe/lf5nao.mp3)\n\nQuick song I threw together ... All This for a Squirrel",
         "This is a great example to refute, “But if you have nothing to hide, you have nothing to fear.”",
         "I will never live in CA, nor will I ever live in NY, and anyone sensible should make the same commitment. These states are lost, and anyone with any foresight needs to get out now while they still can.",
         "Absolutely unnecessary and over the top.  Infuriating!",
         "If you guys think this is bad I can’t wait to see how outraged you get about Roger Fortson, or Robert Dotson, or Philando Castile.",
         "Who would have thought people would go to war with the government over a raccoon and a squirrel?",
         "Wierd how I’m only reading about this on one particular sub……\n\nFuck I hate this bootlicking place.  But I just can’t leave.  \n\n*sigh*",
         "Can’t share this enough in the next 24 hours.",
         "Disturbing",
         "I don’t know the story, is having a squirrel as a pet illegal?",
         "Do we really think they were looking for animals in suitcases and dressers? Don't kid yourself, the squirrel and racoon were the pretense.   \n  \nThey raided his house because they can!",
         "It’s that illegal to own a squirrel? The fuck is wrong with these people.",
         "At what point should we use our 2nd amendment rights to protect ourselves frpm a tyranical gov?",
         "Just say if you start modifying a bulldozer to avenge your little friend, i got a welder and am willing to travel",
         "This seriously makes my blood boil. I am scowling at my screen. How can it not make you mad if you have a heart? This man had his house vandalized and his family murdered by the state.\n\nDisgusting. I’m seething.",
         "You think this is bad you should see how they react to families being in their home which is the wrong place at the wrong time.",
         "Blue state doing what blue states do",
         "how did they find his location?",
         "Idk how he leaned politically, but tyranny like this would for sure change anyone's stance. All of this for a fucking squirrel and racoon? What was their reasoning behind it? They didn't have the proper papers, so they're authorized to murder pets?",
         "Fight! Flight! Fight!",
         "Probably lucky they didn’t euthanize him too.",
         "There's no reason the community can't rise up and take out the law enforcement in that area and then replace it. You can actually do this by physical Force but it has to be unanimous throughout the community. I think something like this warrants that if they are this gross ignorant it's time for a complete new formula.",
         "Did they have a warrant or did you let them in?",
         "can't do this without money.  even if every person paid zero taxes, they can just print it. drop the national debt ceiling and politicians will learn economics 101",
         "Did you find any squirrels inside the shampoo bottles? Did you see any raccoons or squirrels in my shampoo bottles. I would like to philosophize with Aristotle about why the fuck you think you’d find a squirrel in my shampoo bottles.",
         "[All This for a Squirrel](https://files.catbox.moe/lf5nao.mp3)\n\nI put this together to honor Peanut.",
         "What worsens the excuse that they are testing for rabies, and I’ve said this in numerous comment sections because apparently not people know that squirrels don’t carry rabies and there has never been a single case of a human contracting rabies from a squirrel bite in the United States. That being said, let’s forget that and consider that the man owned Peanut for seven years. Could a reasonable person not assume that after that amount of time, the owner would know whether or not his pet is rabid?",
         "Too much logic here, more overreach, less rights.",
         "NY DEC did this, from what all the news is saying in NY they did kill the squirrel and I think the raccoon also, they are saying to test for rabies.",
         "No state is safe from this type of shit. It's despicable, but it's the system we have nationwide. They can take our cash on suspicion and destroy our houses with probable cause. Even when it turns out they were wrong, we have to pick up the pieces and accept it was legal.",
         "I admit I haven't heard of the former two, but many libertarians, including *Reason* Magazine (a libertarian publication), expressed outrage over what happened to Philando Castile.",
         "From what I gather, you need a permit there. The guy had applied but had not received approval. Guess the state figured it was more efficient to just kill the squirrel and raccoon then review the paperwork.",
         "If it is, why kill the squirrel?  Release the poor thing",
         "They had a warrant as an actual judge signed off this raid",
         "Warrant or not, it’s totally unjustifiable from a moral perspective. We have a moral responsibility to disobey unjust laws.",
         "That’s a fuckin banger that seriously almost brought me to tears… I hate this world.",
         "F'n brilliant man!",
         "What compounds the issue is he recently rescued Fred the raccoon.  I think the raccoon was actually the instigator of sending goons to his house.  Raccoon's are rabies carriers and given Fred and P'Nut were cohabitated, it increased the likely hood of P'Nut being considered exposed.\n\nMy understanding is that rabies is only transmissible if the animal is showing symptoms, thus with cats/dogs many states will allow them to quarantined to see if they display symptoms.  However no studies have been done with wild animals to be able to properly identify rabies based on behavioral symptoms.  If a human is infected with rabies, once they start showing symptoms it's generally considered to be 100% fatal (though there are cases of a handful of people surviving rabies).  So they take a 0 tolerance attitude.\n\nBut i guess what i don't get is, we have rabies vaccines that are effective if given even after exposure.  So why kill the animal? and not just fucking shoot the cock sucker full of rabies vaccines.  In fact if you're being sent to capture a potentially rabid animal how do you not have up to date rabies vaccinations?\n\nI'm a little more open minded on the \"ok, we have a potential exposure and we have to take zero changes\", what i'm not open minded on is it's a fucking travesty of government that it escalated to this point so quickly, and i'd castrate every person without anesthesia from the judge who signed the order to the agents to do a fucking full raid as their first action.",
         "All the names of the people involved should get leaked so they can at least have some level of accountability even if it's just social and not legal. Two innocent animals were killed for no good reasons. And a good hearted couple is traumatized for trying to love those animals. This is insane...",
         "the only way to test a raccoon for rabies is to kill it first.  last year a woman brought her pet racoon to a pet store for grooming and they killed it to test it. not sure why people care if it's rabid if they're gonna kill it anyway, but that's what humans do apparently",
         "This is what the 2A was installed into the foundation of the country for.",
         "As with any pet that isn’t a fish - you need documentation, vaccines, etc. \n\nThis guy found a squirrel and homed it. Over the course of 7 years he never got it registered nor had it checked. He was eventually reported for housing a wild animal and the animals (a raccoon as well) were put down to be tested for rabies.\n\nDomesticated wild animals don’t just get released. You’re not supposed to take wild animals home with you - that’s common sense 101.",
         "Think of the havoc a squirrel and a raccoon could have if they escaped, they had no other options but to kill them.",
         "Wow, unbelievable! This is why judicial elections matter.",
         "Agreed. Just wondering.",
         "Thanks!",
         "They’ve all been leaked. Well, the girl who made the original complaint (who lives in TEXAS) posted on fb bragging that she called the authorities. She has since deleted all her social medias. But the officials names & such has been leaked as well.",
         "Originally, yes, but we all know if we defend ourselves in this situation, we will be shot or face felony murder charges since the cops have immunity and we don't.",
         "I agree that having a tree rat for a pet is a silly idea, health concerns aside. The issue is how poorly the situation was handled. The fact 10 armed ass hats can bust into your place and smash the place up just because you're having fun without permission is crazy. What serious threat was posed to the public to warrant the situation?",
         "😑either you’re a bot or you have gotten me with your sarcastic wit",
         "I'll Google it, thank you!!",
         "Revolting against the British was also illegal. Our founders shot them and killed them, and faced potential charges of treason and getting shot as well.\n\nI'm not saying I have the balls to do it.",
         "It is ridiculously bureaucratic.\n\nAlthough this guy could have kept it up if he wasnt always posting on social media. If youre gonna put your undocumented pets on blast on the internet for hundreds of thousands of followers, might want to take the necessary steps to avoid something like this.",
         "You nailed it: “…having fun without permission…”",
         "I once had a squirrel jump out of a garbage can when I opened it; I truely understand the dangers of squirells.  Not to mention how Chip and Dale (strippers) are the names of chipmunks, a close cousin of the squirrels and they are attacking the morals of the country.",
         "If you’re on X….its alllll over there!",
         "Exactly. Then the rest of this gung ho bravado is kind of pointless. I think.",
         "The problem is that the founders were still dealing with wilderness, they were a different kind of person.\n\nNowadays the bread and circus is so good that most of us are overweight and obese (complacent).\n\nThe ones that could/would take action have a “it’s not me and mine” mentality.",
         "He owned the thing for seven years with no issues. It wouldn’t have escaped. He tried to release it eight months after he rescued him and the squirrel CAME BACK ON ITS OWN.",
         "Chipmunks are chirpy little jerks, but just because your cousin did onlyfans, doesn’t mean you should be euthanized",
         "I dont think I am allowed to euthanize my cousin, but if he goes back to prison then it might happen on its own."
      ]
   },
   "1gjk87c": {
      "title": "I was reminded by my red and blue family members that if I vote 3rd party tomorrow, I am helping Kamala Harris...or helping Donald Trump. I guess I'm helping the winner either way it goes.",
      "text": "Same old story election after election.",
      "comments": [
         "It means you get to upset both sides at once, the true essence of the libertarian experience.",
         "The only wasted vote is the one thrown into the sea of the status quo.",
         "Chase Oliver isn't our savior but I'd like to see us hit 5%",
         "When both sides are afraid of the same thing, that is the time to vote 3rd party.",
         "I'm a registered Republican, but I've voted Libertarian in the past.\n\nIf the number of Libertarian votes was high enough to affect the overall outcome of an election, then that's the exact opposite of \"wasting\" it. It shows the two major parties that they have to move in a certain direction to court more Libertarian voters, Green Party voters, etc.\n\nSo vote your conscience, not party, not \"lesser of two evils\". Let your voice be heard, because they are actually listening.",
         "[removed]",
         "Lmao this is the part that cracks me up. No matter which side it is you’re helping the other one win by voting third party.",
         "It is not your fault that the duopoly has brainwashed people into picking between a shit sandwich and a shit shake.",
         "You’re neither helping nor hurting. Virtually inconsequential.",
         "Wild how most people treat the presidential election like a life or death vote but completely forget about politics after the inauguration (state elections, local elections) until main stream media blasts a new issue out at their face they feel like they have to rage about.",
         "Instead of an \"I voted\" sticker, you should wear an \"I helped elect _____\" sticker - to be filled in once the results are in.",
         "Drink the tears of whichever side loses. I get more pleasure out of liberal tears, but that's because they're louder and more melodramatic. Like we've already had a term with both of them in power. Neither is the antichrist. Neither will kill you or your family and friends if they win. Same shit, different color.",
         "One of the priceless benefits of being a libertarian…\n\nOnly we have the privilege of casting Schrödinger votes.",
         "Same I’ve been labeled as a trump supporter for voting 3rd party lol",
         "All we care about is 5%. Who cares what they say.",
         "Yes the old, you voted once and somehow tallied three times (3rd party, a vote against Kamala, and a vote against Trump).",
         "I could write in Mickey Mouse and it wouldn’t matter in my state.  People just want to bully anyone who doesn’t agree with them.",
         "Either way, one side is getting a reckoning. The Republicans for picking Trump again, or the democrats for skipping another primary. I only wish both could have a reckoning.  And sadly, whoever does will probably learn the wrong lesson from it.",
         "I voted for chase, doin ma part 🗿🗿😎😎",
         "Don’t listen to them. Listen to Dave Smith, Tom Woods, and Ron Paul.",
         "In georgia and had my friends tell me the same thing... first time i voted 3rd party",
         "Always nice to be part of a winning team... I guess.",
         "You didn't throw away your vote, you Chased down another option!",
         "Here is an interesting way the next similar conversation might go...\n\n\"You voted for a 3rd party. Well, if you want to waste your vote on a protest, that's a waste.\"\n\n\"Who did you vote for in that election?\"\n\n\"I voted for X!\"\n\n\"That candidate won and would have won no matter how you voted. I got a protest out of my protest vote. Mathematically, it's your vote that was wasted.\"\n\n\"Shut up.\"",
         "No, you’re not.",
         "Screw those people man. You vote for who you support.",
         "I didn't vote for either one either. I can't in good conscience vote for eother of them of their parties. They've caused every problem this country has ever had. Nothing will change by continuing to vote for them.",
         "I’d be a loser if my vote was for the loser and since my third party vote helps the winner then I am a winner regardless of the result",
         "Unless you live in a swing state your presidential vote doesn't matter at all.",
         "I'm in Florida so it won't hurt either candidate. I voted Libertarian just because I could. Two party system is so divisive.",
         "1. The electoral college chooses the president, not the people. \n\n2. A vote to get a 3rd party in the debates is literally a vote for democracy. \n\n3. They are equally bad and the media can't decide which one will be the downfall of America.",
         "“If someone claims you’re wasting your vote, recognize that they don’t care about you. It’s a selfish statement. They are saying your beliefs aren’t worth being represented, that you should silence your voice so theirs can be louder. Don’t give in to that.\nVote your conscience.” - Libertarian Party of Texas",
         "Tell them their gripe is with Jill Stein specifically. LP did so bad this year, we aren’t the threat they think we are.",
         "Unless you’re in one of about 3 states it’s not gonna matter",
         "I call it pure bullshit by that standard",
         "LP is not near ready for Primetime",
         "At a family event a couple months ago my uncle told me I was supporting Harris by not voting Trump. I was actually able to show him that he was assuming that I would have voted Trump otherwise, and that if I had been planning to vote Harris then changed, I’d be helping Trump. Still probably my proudest moment.",
         "I was told on SM I was voting for Facism.",
         "I’m 3rd party year after year, depending on who’s running. Vote the best candidate, not who you think will win 👍",
         "I'm in a solid blue state. Dem will get 100% of the delegates. \n\nSo I can vote easily with a clean conscious.\n\nIf I lived in a swing state I'd have to think it over.",
         "If you are the passenger of a car where the driver has fainted, you have the choice of grabbing the wheel so the damage that is about to occur, or stating that you aren't going to do anything because you don't want to be responsible even for the least of evils. What do you do, and why is that different from a refusal to vote? \n\nI gave my vote to the LP for many years, but that was when Texas was reliably going to go GOP and it was easy. But not this time. The weakest LP candidate ever, plus the Trump team that we are going to have, and the horror of Kamala of president...this is not a Bill Clinton/Bob Dole race.",
         "2 time Trump voter here, I've come to my senses and voted for Chase Oliver today. I'm oddly more satisfied than I believed I would be...",
         "Kinda depends on where you live.    If you live in a swing state than you will be helping Kamala Harris.   That is because most libertarians align with the Republican party.   One good reason to vote for **Trump / J.D. Vance** is that if Democrats win they will surely keep the borders open and grant amnesty to even more immigrants.   Much of the country will become like California, New York and Illinois and become a one party state.   You will have even less a voice when the country becomes that way.    This one is important.   This election voting for **Trump J.D. Vance** is the libertarian vote.",
         "Vote Trump and free Ross, get a Libertarian in the Cabinet and a department with Elon and Ron Paul to slash the size of government.  Unlike other times we were given an offer and have something to look forward to.  Plus I want to see the leftist go crazy, it is going to be hilarious.",
         "i mean, your vote is effectively meaningless voting 3rd party. Wouldn’t it make more sense to vote for the candidate closest to your ideals?",
         "This is how I feel about journalism as well.if both parties diehard members are upset and call the article biased with it you know it’s probably a balance and well thought out story.",
         "The best part of the experience. lol 😂",
         "That's exactly how I feel.\n\n\nIf I'm passing off both parties, I'm probably doing something right",
         "Logic would say that Harris is literally the status quo as she’s the sitting VP and plans to continue what she’s already done.",
         "I want this on a t shirt.  Or a sticker.  Or a tattoo.",
         "If Jo didn't hit 5% I highly doubt Chase will.  I didn't even hear of him until a couple weeks ago and I had to go searching for him.",
         "Same. He’s as nutty as the other two, but I won’t have his win on my conscience, but may help the party get to 5% where we can really have a seat at the table.",
         "Unfortunately I doubt we even hit 1% in this election. So many so called “libertarians” are voting for Trump. It’s maddening",
         "*Last election of your life.*\n\n*Libertarian is now a major party on par with GOP and Dems.*\n\n*You scream as you remember your pledge and vote Green.*",
         "According to South Park, it's always between a giant douche and a turd sandwich.",
         "I feel like With Kamala the media will just not report anything negative and with trump it will just be media outrage. I don't think either will do anything that bad or great, just more shitty government selling out to corporations. It's a dog and pony show in reality.",
         "I tell my fam\n\n\"You're not betting on a winning horse, you're letting them know who you think should run this country!\"\n\nSo many people vote for Biden because they don't want Trump, and ppl vote for Trump because they don't want Biden. This time it's the same with Harris and Trump.\n\nI voted libertarian both this election and last election. And if there's an election with nobody I see fit to be leader I'll write in Jesus, or some decent person that's not even running. Joe Rogan! I like his take on things. If anything he should at least run the debates. He's fair, doesn't cut ppl off, fact checks, and no one's using a teleprompter.",
         "Lol he's very aware of it",
         "I did that even in my swing state. I couldn't bring myself to pick between the lesser of 2 evils.",
         "I do, and couldn't bring myself to pick one of them. I voted libertarian where I could (a lot of candidates for state offices, surprisingly), and then against incumbents for the rest.",
         "Open boarders is a libertarian principal. So is free trade, not Trump's tarrifs. Most libertarians do not align with Republicans.",
         "I don't know how any genuine Libertarian can support Trump with his insane tariffs. They are literally just another tax, that will be pushed onto consumers and raise prices. It's kinda insane to see Republicans go from being once the party of free market economics under Reagan to now supporting such big regulations under Trump",
         "Meaningless? Voting for one of the two parties who change nothing for the better, that’s meaningless. \n\nSending a message or helping a third party get to 5% one day, meaningful.",
         ">Wouldn’t it make more sense to vote for the candidate closest to your ideals?\n\nUh... what? That's literally why they're voting third party.",
         "Feet look like hands and the brain looks like mush",
         "We get to vote *three* times!",
         "Trump is undeniably the lesser of 2 status quos. More so than any candidate in my lifetime.",
         "I honestly didn’t like Jo too much.",
         "Is 5% some kind of threshold ?",
         "![gif](giphy|kDWOjr5X0uFPFhygKk)",
         "Lol hopefully if the Libertarians ever become a serious political force they don't go back on all their policy positions.  I'd hate to have to vote Green.",
         "If we had two open primaries, these would not be the candidates. NPAs and Independent voters in primaries would have elected more likeable people. The Republican base chose Trump and Harris didn't even participate in a primary.",
         "Wow,  these are like the top reasons why I can't be a full libertarian.  I once had a strong mind that I was a libertarian.     While I agree strongly with libertarian viewpoints on most things, I can't be in a political party that doesn't protect it's citizens.  That is why I'm a conservative Republican and I support representative government.   You have to protect your borders and you had to protect your economy.  You have to protect your people.    Like not doing that is like saying you don't need police.   It's really Trump's border policy that garners my support.  I actually think he is soft of the border and wish he would had done more when he had the chance.",
         "I can see the benefit of tariffs only providing there is no other form of tax.  It would free every person from taxing authorities, you would no longer have to report things to the government and it fundamentally changes the relationship between the government and you.  Any changes to the tariffs will be noticeable so raising them may be a no go limiting the size and scope of government.  Mind you the government was small when when tariffs were the main.  Plus all those IRS agents get fired so there is a plus.",
         "How is getting a 3rd party to 5% meaningful?",
         "\"WASTED VOTE!!! You're just voting for the other guy!!!\"\n\nHate this argument. I'm voting for the person the most aligns with my beliefs. Like.. literally. I'm literally using my vote to vote for the person I believe is best for the position.\n\nNo, it's not a protest vote. No it's not an emotional vote. It's me voting for the person I would like to see in office.",
         "I honestly dont like any of them too much. There is no one up there you are going to agree with 100%",
         "From my understanding, any party that gets at least 5% of the general vote gets federal funding in subsequent elections and a presence in debates.",
         "Somehow it will still be Stein, too. \n\n\"How do you never age!?\"\n\n\"It's hard to age, dear, when you have perfected cloning.\"",
         "Why didn't Republicans support the Democrats' border bill, if they're really that concerned about immigration? They like using the border as a reason to keep chumps voting for them so they'll never actually fix it. \n\nAlso, I'd never support a candidate that wants such high tariffs. They'll fuck over the economy, nearly every economist agrees on this. They are literally just another tax, that will be pushed onto consumers and raise prices. It's kinda insane to see Republicans go from being once the party of free market economics under Reagan to now supporting such big regulations under Trump",
         "5% of the popular vote is the threshold DNC and RNC established to keep other parties out of the debates in an attempt to keep focus on themselves and off of better candidates. Hit 5% and LP will be at the next election's debates.",
         "https://law.stackexchange.com/questions/57619/what-would-it-actually-mean-for-a-minor-3rd-party-to-get-5-of-the-vote-in-a-g",
         "Yeah the two other parties will totally let us in if we get 5%!",
         "Because it was essentially an amnesty bill.",
         "Hit 5% and they'll raise the bar again. The main thing that they agree on is squashing competition.",
         "Yeah….i know. But even if they change the rules, maybe that would get more people to wake up to how dirty the two party’s are.",
         "Did you read the bill? Or just hear someone say that, and thought it sounded good? Because no it wasn't.",
         "And salary increases 👍",
         "Oh, I don't disagree with you, I'm just explaining the significance of 5% at current.",
         "I watched the debate on it on c-span.  I watched the vote which was basically party line voting.  I heard both sides of the argument.  The big sticking points for Republicans was there was very little funding for the border patrol.   Then there was the extensions for the VISA for migrants and that one plan that was implated (honeslty I've forgotten what it was now)   To answer your point, No I didn't read the bill text.   No I didn't just go by what someone said.   It was a clear path to citizenship for all these people.  If would have listened to the debates on it and committee meetings then you would know it was a non starter for all Republcians in congress."
      ]
   },
   "1gk46my": {
      "title": "European minority",
      "text": "As a Libertarian in Europe, I learned to be a minority, but on this channel you can see the dominance of the American view of libertarianism, hence I would like to present the European view and ask how to reverse what is happening here on the old continent.\n\nAnd although in the US elections are de facto held between two parties, people like Bernie Sanders are effectively marginalized while in Europe people like him rule in UK,Germany, Spain or Portugal. In turn, in other countries, populists with a no less \"red\" view of the economy are growing in strength in France, Hungary and Poland, not to mention the Netherlands. Even a relatively strong free market country like my family's Luxembourg is starting to turn towards this new \"Socialism with a Human Face\"\n\nWhenever you look at the statistics, all the indicators show clearly - Europe is shrinking or at least there is a \"Sick Man of the World\" - while the USA or China are developing, we are barely licking the wounds of Covid. There are problems related to migration and aging on the horizon. society or armament which, knowing life, will lead to bleeding our budgets even more And now the question - when laissez-faire shows a simple solution to these problems and minarchism would solve the problems of health care, social security and armaments, people choose the red path which led to the problems we currently have and the only thing this will multiply them even more - not to mention the burning problem of housing availability, which the Reds are increasingly bringing to the agenda, saying \"housing is a right, not a commodity\" - as the owner of several properties, I personally believe that we are only years away from introducing high inheritance taxes or outright expropriations.\n\nDo you, the American opinion, still think that in the USA your political conflict is such a big problem and the marginalization of libertarian ideas?",
      "comments": [
         "The US started more libertarian but is on the same path as Europe toward authoritarian collectivism. People only like liberty that they approve of and are fine with using the government to get what they want.",
         "Very true. Europe will eventually collapse. Likely before the US given their population has little savings outside their home values.  As I get older I unfortunately see that other countries don’t necessarily learn from other countries’ mistakes.  Collectivism is akin to a dogmatic religion for many and is just rebranded into ‘equity’ by the American leftist movement.",
         "yes, but the problem is not the fact of what is happening, but WHY it is happening - people do not see or do not want to see what the consequences of overregulating the economy or further indebtedness of the public sector will be - not to mention the increase in populist tendencies. One sighs when one company - SpaceX - can do more than all space agencies combined.",
         "Why? Because people are scared of death or hardships, and the government does a good job selling them a false security blankie."
      ]
   },
   "1gjksl7": {
      "title": "When a political canvasser starts walking up your driveway. ",
      "text": "",
      "comments": [
         "I was hired as a political canvasser for the Democrat Party when I was 18 years old. One of the worst jobs ever 🤣\n\n\nHowever, I'll never forget one incident. Out of the thousands of doors I knocked, there was one guy who challenged my beliefs in a respectful manner. It wasn't a long conversation. He just chatted with me for maybe 5 minutes, but he brought up really good points about the negative consequences of taxation - particularly about how things like corporate taxes are, at least in part, just passed along to the consumer.\n\n\nRandom dude planted a seed in my brain, which eventually sprouted. ",
         "Oh, I like talking to canvassers. \n\nYou convert enough of them, they'll stop sending them.",
         "Pocket sand!",
         "I looked like that the other morning when the jehovah’s witnesses came to my house. It was 7:30 in the morning and 4 of them got out and started wondering around my property.",
         "And the cops open fire because \"he's got a gun! Shoot! Shoot! Shoot!\"\n\nBecause cops think only they are allowed to carry guns",
         "yeah they use 18 year olds that are fresh from the public democrat education camps"
      ]
   },
   "1gjb7hp": {
      "title": "\"BUt loOK aT ChINa oR viEtnAM\"",
      "text": "",
      "comments": [
         "Two countries that moved away from communism and embraced capitalist market economies? Yeah they're doing great.\n\nI love how when Cuba was crying to China for aid and help, China's response was \"Do capitalism\".\n\n>[Chinese officials have been perplexed and frustrated at the Cuban leadership’s unwillingness to decisively implement a market-oriented reform programme despite the glaring dysfunction of the status quo, the people said.](https://www.ft.com/content/9ca0a495-d5d9-4cc5-acf5-43f42a9128b4)",
         "I grew up in China, where there’s no free school lunch, forming unions are forbidden, medical bills are higher than the States but the quality is only poorer, riches are richer than here and most people are poor. The cause is the government or the dictator controls justice and everything.",
         "\"But that wasn't real communist\"\n\nBitch, every time any country tries to attempt communism it all falls apart. Maybe that's a fucking sign that it isn't meant to be.",
         "Craziest shit I’ve seen on here was all the pro communism people on the AK47 sub. I mean it shouldn’t be that shocking, but it was still a shock to me. People really are pro communism, despite the mountain of evidence against it.",
         "Stop! Stop! Stop! Can libertarians stop pretending that communism is good in theory? It sucks in theory almost as much as it does in practice.",
         "Communism in theory isn’t even good",
         "I’ve never heard the Vietnam excuse but the Chinese one is an excuse for authoritarianism and then they’ll turn around and tell you how they won’t make it authoritarian this time yet they’ll defend an authoritarian state 😭. EVERY. SINGLE. TIME.",
         "Everything positive about China is not a result of communism how ignorant",
         "It is worse in theory. Any idealistic worldview is. They want to create heaven on earth, but they fail to understand that every human is Adam and Eve. \n\nIn other words, life without suffering makes humans eventually insane that they try to suffer themselves.\n\nIt will make too much suffering (more than a human can handle) in practice.",
         "I've legit tried to debate liberals about this topic, and their argument is that those countries are capitalist",
         "Communism in theory \n\nShit that wont work\n\n\nCommunism in practice\n\nShit that will never work.",
         "The factory is working, best case scenario lol",
         "This meme is 🤌",
         "I moved to Vietnam. Some people asked, \"Why would a libertarian move to a socialist country?\" and the answer is \"trends\". I'd rather live in a country that is trending toward free market, somewhat regardless of what that country began with. Look to the future and you'll notice that Vietnam has been gradually privatizing State Owned Enterprises (with plans to continue).",
         "Communism is bad in theory as well",
         "What about communism in theory is beautiful?! The theory is corrupt and idiot to begin with.",
         "China is not doing great they still have a command and control economy their nation is a toxic waste dump youth unemployment is 40 odd percent the lay flat and let it rot movements combined with massive inflation and currency instability are play havoc with the economy all that is just the start of China's problems demographically they are 5 to 10 years away from a 50 to 60% workforce population reduction due to old age.",
         "> riches are richer than here and most people are poor \n\n China's Gini coefficient in 2022 was **0.467** \n\n The Gini index for the United States in 2022 was **0.488**",
         "\"Medical bills are higher than the States\"  \n   \nThis is a crazy lie lol",
         "That's because \"real communism\" is just a theory that arrogant and entitled intellectuals cling to because they think only they are smart enough to bring about the \"utopia\"\n\nWhat we saw in the 20th century is the results of their experiment. Usually, when scientific experiments fail as miserably as communism did they become universally debunked. However, the intellectuals are so damn arrogant that they think only they have the keys to bring it to a success. So we're doomed to try it again  if the far left gets its way.  \n\nI mean, why not give it another try. It's only 100 million that were murdered on the first attempt... small price for the utopia, right? They've worked out the kinks, so maybe they can reduce the death toll to a mere 50 million this time around, and we can all live in rainbow  land, a foundation of equity and diversity you will own nothing and you willbe happ!(sarcasm incase anyone cant tell)",
         "There will always be those people haha looking at you flat earthers!",
         "Agreed. Abolishion of property rights isn't even a good theory. Your property is a byproduct, at least in part, of your labor. If you have no property rights, you do not have the freedom to enjoy the fruits of your labor. ",
         "What do you mean dude? It means FREE STUFF lmao!",
         "The ability to have opinions does certainly limit the dream\n\nEdit: It was a joke, not an advocation of Communism.",
         "I mean, China is kinda sorta capitalist now. It has slightly improved the quality of life of the average citizen over what they had before.\n\nAlthough, amusingly, they blame global capitalization as forcing them to adopt the market reforms that have benefited them. ",
         "Communism is a Utopian end-state.   What makes it Utopian is that it can't actually happen. \n\nMarxist theory dictates that people are controlled and formed by materialist forces. That your personality, your viewpoints, etc... are all controlled by economic circumstances. \n\nSo the idea is that if you implement a totalitarian \"people's state\" that controls all aspects of life, relationships, and economy then that state can then transform the material forces of life to restructure how people think and act.\n\nEffectively transforming humanity into something that is compatible with their communist Utopia.  At that point people's behavior will focus entirely on \"the greater good\", all individualism will be stamped out, all competition eliminated... etc etc.  The totalitarian state will no longer be needed since everybody is doing what they aught anyways. \n\nOf course none of this stuff is true and none if it ever going to work.  It is a monstrous totalitarian authoritarian evil ideology that causes endless misery and death. \n\nSo, technically, they are right when they say \"It wasn't real communism\"... Because \"real communism\" can never and will never actually exist because it doesn't work.\n\n------------------------------------------\n\nHowever what you say in response is that what makes a person or government communist isn't that they \"have implemented communism\".  It is that they are TRYING to implement communism.\n\nA communist government is one that is trying to achieve communism.  A communist person or political party is one that is trying to promote communism.\n\nAnd when you study things like Soviet Russia... you realize very quickly they were true believers. They were not faking it or just going along with the motion..  They believed 100% in what they were doing.",
         "Marx was a shit writer, and a shit human being who leeched off his family and friends.",
         "The government officials hold a big fortune more than we can imagine. They don’t pay taxes and there’s no way for people to track it. Some disclosed corruptions are about millions of dollars. The thing is a lot of these people are lower level officials such as mayors of small towns or rural counties.\n\nhttps://preview.redd.it/vmx8wh7016zd1.jpeg?width=1488&format=pjpg&auto=webp&s=8d4f1e2d2682ed5bb032534076c6e900f963c018",
         "While, I like using data to support opinions. And yes my argument might be subjective. But this is my understanding and many people who lived in China experienced. The people behind Jack Ma was hardly seen on news but was extremely powerful till Xi Jinping. I don’t think he helped Alibaba for free.",
         "When seen from an income to expense ratio the us health care costs less. The us health care costs are 60% more but income per person in the us is aproximately 400% on the low end and up to6 600% higher on the high end.\n\n GDP per capita statistics for the United States:\n2023: $81,695, a 5.76% increase from 2022 \n\nChina's GDP per capita in 2023 was $12,600, \n \nSo the amount of each chinese persons income which goes toward medical expenses is higher.",
         "As a percentage of income. Also you have to bribe the doctors to get a better service.",
         "China liberalized their economy by creating \"Special Economic Zones\". \n\nThese SEZs are essentially Party-sactioned Capitalist havens were free market forces and allowed (with restrictions) to create special import/export areas.   Effectively the normal rules that apply to China do not apply to these SEZs. \n\nThey started in the 1970s.\n\nThink of them as a sort of \"Free Trade Zone\" or \"Wild West\". \n\nThis is one of the major reasons China became dominate in electronics in the 2000s.  \n\nFor example: \n\nIf you are designing a product in the USA or Europe the time it takes to go from design to engineering plans to working prototypes can take weeks or months before you get your hands on a actual working engineering sample. \n\nhttps://en.wikipedia.org/wiki/Shenzhen_Special_Economic_Zone\n\nIf you were doing the same thing in Shenzhen it can be done literally overnight. You rent out space in a gigantic building, do your design there, drop off your designs and plans to a company down the hallway and they will produce everything in-house right then and there and have it delivered to your office by the next morning. \n\nhttps://www.youtube.com/watch?v=292-52DPexg\n\nAll of this meant that if you were NOT doing electronic design and farming out manufacturing to China it put you in a massive competitive disadvantage.\n\nThe old Republican meme that \"China is out competing us because they have slave labor\" is idiotic and wrong on so many levels it is hard to know where to start.  They are out competing the USA because they have a actual industrial policy.  The USA doesn't.  The USA's own draconian policies and financial manipulation is what is fucking the industry in the USA.  The inflationary policy since the 1970's in the USA actively makes it unprofitable to do manufacturing in the USA.  It makes importing goods much cheaper then making them for a large number of reasons that I won't go into here.  \n\nWhich means that in some parts of China they are far more capitalist then most of the USA.\n\n-----------------------\n\nThese SEZs are critical to China because they serve as outlets for those massive factories and other infrastructure China has built up around the country. \n\n--------------------------------------------------------------\n\nThe trouble is that with economic liberalization comes political liberalization, which is absolutely not what the Communist party wants. \n\nWhich is why under  Xi Jinping they are doubling down and reversing a lot of the progress made in the past 20-30 years. \n\nThe communist party of China would rather see the economy of China tank then see their own power wane.",
         "The irony in that is quite humorous",
         "What makes you think I'm going to trust a random stranger over figures which are collected by the World Bank?",
         "Now that is just shifting goalposts after a blatant lie. But whatever I guess",
         "Who did the World bank collect those figures from? The CCP do they have a track record of just making shit up? Yes 80 odd years of it.",
         "It’s the costs of getting basic healthcare and other basic services. Don’t know where you are heading to."
      ]
   },
   "1gjirty": {
      "title": "Colorado Libertarians sue Jena Griswold over leak of voting equipment passwords",
      "text": "",
      "comments": [
         "The fact that the government can’t count votes in a secure manner should tell you everything you need to know.",
         "This is the same woman who took Trump off the ballot and was smacked down by the Supreme Court. Not saying the things she says about Trump isn’t true but she needs to just do her job, and stop abusing her power.",
         "Yet a CO judge [locked up Tina Peters for 9 years](https://apnews.com/article/tina-peters-colorado-clerk-election-vote-fraud-b456ce4f80dc97f4b967eb6297311a51) for doing basically the same thing. Two tier justice system.",
         "I wonder why the elections are so insecure? It's almost as if there's cheating going on!",
         "\"Secret passwords\" are what keep voter integrity in line?\n\nMost secure elections ever!",
         "There are many ways to do so.. the fact is its a choice that some have made..",
         "The government can and mostly does count votes in a secure manner.",
         "Uh, i think you mean this is the woman who followed the law by not allowing an adjudicated insurectionist onto the ballot. The scotus being controlled by right wing hacks who DNGAF about the law when its inconvenient for them overturned her and the state supreme courts correct interpretation on the 14th.\n\nSCOTUS are the ones who abused their power to interfere and go agaist the 14th amendment.\n\n\nhttps://apnews.com/article/trump-insurrection-14th-amendment-2024-colorado-d16dd8f354eeaf450558378c65fd79a2",
         "You have to concede that, while the large majority of vote counting appears secure, leaking passwords is the very definition of “insecure.”",
         "\"mostly\" isn't good enough.",
         "How much is \"mostly\"?\n\n\nWhen elections are decided by a few thousand votes, it certainly does matter. A US Huse race in my area was decided by less than 200 votes. Before an automatic recount, the margin was literally a single vote.",
         "\"Adjudicated insurrectionist\" is a legal term with a very strict definition. Donald Trump is not an adjudicated Insurrectionist.",
         "> The scotus being controlled by right wing hacks\n\nYou know it was a 9-0 vote in SCOTUS,  right?  Lets hear your theory on why the liberal justices were coerced into voting the way they did by the evil right wing hacks.",
         "Leaked passwords obviously aren't ideal, but there are multiple levels of security so the leak didn't result in any stolen info.\n\nTo do anything with those passwords, you'd also need a second password and access to a badge-only room.",
         "Nothing is ever perfect. This mistake was made by a person (who is no longer employed in that role), but machines make mistakes too.\n\nI'm not opposed to making it more secure, but we need to be realistic too, nothing is ever *absolutely* secure.",
         "How do you think they should make it more secure?",
         "As a former auditor (CPA and CISA), when I see something so totally wrong, I wonder what else might be there. Did the halfwit who leaked them even need access to see them?  Not a good look.",
         "Do you have any idea the number of places I've gotten into that I shouldn't have been able to get into?",
         "https://apnews.com/article/top-officials-elections-most-secure-66f9361084ccbc461e3bbf42861057a5 AP news begs to differ",
         "Be like Canada...  Paper ballots and voter ID... if not paper ballots at least voter ID\n\nhttps://www.elections.ca/content.aspx?section=vot&dir=ids&document=index&lang=e#:~:text=To%20vote%20at%20the%20federal",
         ">Do you have any idea the number of places I've gotten into that I shouldn't have been able to get into?\n\nThat's why I'm saying, nothing is ever absolutely secure.\n\nElections in the US are still sufficiently secure to trust their results.",
         "I'm guessing you are posting from somebody else's account, in order to make your point. So that's one so far...",
         "Begs to differ with what? I'm the one arguing that elections in America are mostly secure. Well within acceptable margins of error.\n\nI know Trump claims to disagree with this, but he's hardly an unbiased party",
         "The Canadian System would never fly.  \nIt was made in a way that it is easy and secure for everyone to vote.",
         "Voter ID would not have anything to avoid the issue at hand. We are talking about people potentially attacking the voting machines not people fraudulently voting. they are entirely different things.",
         "Heh!",
         "Did you miss the part where i said paper ballots..."
      ]
   },
   "1gjmupb": {
      "title": "Ron Paul! I've been waiting a long time for this. Slashing Big Government - An Idea Whose Time Has Come!",
      "text": "I've been waiting for something like this to happen for many, *many* years. Let's get it done!\n\nSlashing Big Government - An Idea Whose Time Has Come!\n\nhttps://www.youtube.com/watch?v=wmSfE2nBEPA\n\nOn a side note, the wild man is still actively posting to youtube. I do miss his phone answering machine updates, though.",
      "comments": [
         "Why on earth would you believe that Trump would slash the size of government (if with Ron Paul's help)?  It's the same old game that conservatives always play: when they are out of power, they promise small government then they get in power and increase the size of government.",
         "Bro you need to lay off the kool aid",
         "https://preview.redd.it/6ogueeevvxyd1.png?width=1024&format=png&auto=webp&s=3ca3908acd823db0bebcd42ecd17cdc141b3ac60",
         "https://preview.redd.it/qufju9w7gzyd1.png?width=1100&format=pjpg&auto=webp&s=8f5c15a38d80db839fd53f573094186b7e1c2324",
         "There seems to be a pretty decent push in this sub to get the swing votes.",
         "Any libertarian that believes Trump will help the movement is just plain dumb.",
         "> they get in power and increase the size of government.\n\nSame game plan as the dems but the dems don't lie about it as much as the repubs. They lie about it ... just not quite as much.",
         "Trump's not going to do it, Ron Paul is.",
         "I think there is a better chance under Trump than Harris \n\nI mean the way the government agencies went after Trump and stalled his first term he may be in mindset to curb their power.",
         "this was hanging up in the booth when I voted for Trump.",
         "They will never get the chance.",
         "Thank you for calling it out for what it is",
         "As imperfect as Trump is, he did the following in his first term:\n\n1. Pass the FIRST STEP Act (important Criminal Justice reform)\n2. Cut taxes (always good from a libertarian perspective)\n3. Cut regulation by instituting a rule that for every new regulation made, two old ones must be repealed (this is also a good thing from a libertarian perspective, and many libertarian economists have been pushing this proposal for years)\n4. Abolish Title IX Kangaroo Courts on campus (again a good thing from a libertarian perspective, as Due Process is a critical civil liberty).\n5. Avoid getting the US involved in any new wars (also a good thing, as war is the health of the state).\n\nYes, he's a loudmouth asshole, he talks a big game and habitually underdelivers, he betrayed the Kurds (a truly atrocious thing to do) too. But from a libertarian perspective, he did *some* very good things. He certainly didn't wind back gay rights (like the left feared), and whilst he *is* responsible for getting the abortion issue thrown back to the states there's a perfectly reasonable jurisprudential case behind doing this (whatever one's politics are), libertarians are split on the abortion question (justifiably), AND even if you're pro-choice like I am democratic majorities tend to be very good at protecting the vast majority of abortions.\n\nI know he isn't a principled libertarian, but Trump *has* done some libertarian-ish or improvement-from-a-libertarian-perspective things. We know Hillary wouldn't have, and Biden did basically nothing good (apart from a few drug sentence commutations IIRC).",
         "Are you telling me you think Ron Paul is a sellout? The man is like 90 years old and still wants to fight, why don't you? What other choice do you have?",
         "Ron Paul is a 90 year old retired man who isn't going to do shit.  Are you serious??",
         "I just made it Saturday night, maybe someone else had the same idea! 😄",
         "Are you telling me you think Donald Trump will not spend money like he did before? He will take our vote and we will get nothing like we hope. What a joke. \n\nTrump spent more of our money without the Covid spend, which shouldn’t be excluded, than Biden did including his Covid spend. F’ing gullible.",
         "I said this in the last post about this crap",
         "!remindme 2 years",
         "Sorry, I gotta believe. This is the best chance we've had in my 35 years of paying attention.",
         "Really?  What about when Ron Paul was a reasonably high profile presidential candidate who was old but not nearly as old as Joe Biden in 2020?  Were you enthused then?  Did you try to \"get out the vote\" for Ron Paul because it was the \"best chance we've had\"? \n\nLet the man rest ffs.  He gave everything he had.  It was us that was the problem.  He deserves his retirement.  We are all better people for having known him.",
         "Don’t listen to sysop, he’s red through and through. Thinks Trump won’t spend it like last time. Grifters each and every one of them."
      ]
   }
}