{
   "1gk2s52": {
      "title": "What “i tHiNk GoVeRnMeNt ShOuLd” actually looks like",
      "text": "",
      "comments": [
         "Not really, im actually seeing a lot of these weasels on the left defending the NY state government on this because if they criticize it, they think its somehow helping Trump.. it's party over principal always for them. \n\nwhen the movie Sound of Freedom came out, you had reviewers literally glossing over child sex trafficking in their reviews simply because the people involved in the movie were conservative and giving them praise was a big no no.\n\nEven if I'm not a huge Trump fan, at least I can stomach a number of his basic ideas. The modern day left has literally no redeeming qualities. They are lower than Bush era Neo cons which is pretty fucking low.",
         "They actively support the Cheneys so they are literally the same people"
      ]
   },
   "1gk55hh": {
      "title": "Can I still be considered a libertarian if I believe in public land for hunting and other recreational activities? ",
      "text": "I am on the fence as to whether or not I should call myself a libertarian. I am pro second amendment, for minimal government that protects property rights and liberties, and I am ok with people doing drugs, getting hookers, etc, even though I don’t believe in it.\n\nI am a big supporter of public land because I am an avid hunter who started out hunting on public land. I personally find public land hunting more fun that private land but I have my own hunting lease now. \n\nMy question is does supporting public land and parks run contrary to libertarian principles? Private is nice but so expensive and not as fun and wild as public so I can’t support it going away. \n\nThanks, ",
      "comments": [
         "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "Like everything...  I think there's a balancing point somewhere.  That balancing point differs depending on who you ask.\n\nI'm a Libertarian too, and I'm mixed on a lot of things regarding government.  If you think of government owned land as land owned by the people and the only thing that government does is keep the land free for everyone to use responsibly, then it doesn't really seem like such an anti-Libertarian idea.",
         "Of course you can!  The government holding on to undeveloped land is probably the least intrusive thing it does.  Im sure we have a priority list somewhere that shows about 100 things more important than this at the moment.",
         "Believe what you want to believe. It's dangerous to feel compelled to think a certain way just so you can fit within a certain group, be that Democrat, Republican or Libertarian.",
         "Kill the communist!\n\n![gif](giphy|enzPQyHVWMfx6|downsized)",
         "Public land is one of the best things the government spends our tax dollars on, imo.",
         "I do think that almost every libertarian has a couple opinions that make them say \"I'm a Libertarian, but I also support X or am against Y\". That's ok! At the end of the day, what brings us together is more important than what separates us. Nitpicking will only serve to keep a third party suppressed.",
         "Do you think it’s okay to initiate force in order to achieve political or social goals?\n\nIf your answer is no, there’s probably lots of room for you in the party.\n\nDo you believe that society works out best when people respect each other’s self ownership?\n\nIf your answer is yes, then there’s lots of room for you in the tent of libertarian philosophy.\n\nHave you ever been told you’re not a real libertarian by someone else claiming to be a libertarian?\n\nIf your answer is yes, well then… welcome home my brother.",
         "So low on the list of things to change or abolish not worth discussing.",
         "Public land is the closest we can get to a no man's land. The federal government is extremely inefficient, which means that using their own downfall, we retain spaces that remain largely unregulated and free.",
         "I would say yes. Governament spending accounts for 23% of the economy and they directly an dindirectly control many aspects of peoples life among soo many other things. People that like libertarianism should focus trimming that 20% rather than argue weather the last 3% is really necessary or not.",
         "Being one thing or another doesn't mean you have to share every single ideology as that particular party.  This is why some people say stuff like \"I'm kind of libertarian / anarcho capitalist\".  You don't have to exactly name what you are but just know despite what people might say her if you agree with most of what a party is about then yeah call yourself that.",
         "Call yourself anything you want.",
         "The litmus test I’ve always used is this question. Do you believe the use of force is acceptable if it benefits society as a whole?",
         "How does Public/Government owned land affect your individuality or personal liberties? Is it a violation of the non-aggression principle? Does public land require a monopoly? Does it require force?",
         "I think it’s fine to call yourself a libertarian. Arguing about details of things that will probably never happen isn’t all that productive.",
         "I don't see a problem with that.  I think there's a difference between having libertarian principles and recognizing that some government is probably necessary.  And then you can apply libertarian principles to whether the government is doing a good job at it's function that we've assigned to it.  \n\nI think public lands and national parks are perfectly fine . I'm not an expert, but I think the typical issue is in how the government then grants things like mining rights onto such lands.  It usually has a pretty big smell of corruption.",
         "It depends. There are things (like air and water quality) that are hard to \"own\". I think they're typically called \"commons\" and there's a lot of political theory around managing common goods. \"the Tragedy of the Commons\" gets kicked around a lot. Basically, there are things we need to cooperate on. \n\nPersonally, I want that cooperation to be as voluntary and local as possible. States over Feds, Counties over states, as much as is practicable. \n\nI think that makes me a minarchist, or a firm believer in \"subsidiarity\" as my old poly sci professor used to put it. \n\nThankfully or tragically, we'll never get a chance to try out my perfect libertarianism, so I'm content on focusing on the things I can swing more libertarian - for instance, the State of Michigan just tried to administratively ban legally imported Japanese Kei Trucks. We sued them and won, and now expect them to try the legislative route, and we'll fight them there. \n\nI probably ideally would want national parks transferred to the states for local management, but it's no where near the top of my \"List of Problems That Need Attention.\" And I love and enjoy our state parks and state managed land.",
         "If they collected the money to support it voluntarily I would support it more.",
         "Can I be a libertarian if I want a hunting ban on all public land?\n\nMy point: Recognize that the force of government is tilted in your favor in this instance. What happens when the force of government works against you? Overall, a market will be able to allocate resources much more efficiently.",
         "You can believe in public/communally owned land that is managed voluntarily by committee rather than coercively by the state. I think that even in a fully free market economy we'd still have various kinds of common property existing alongside private property.",
         "Did the government pay market price?",
         "So you believe in communism but only for hunting? \n\nLOL\n\nMake friends with a landowner and get over this deviation from plumbline libertarianism.\n\n(I hunt turkey, dove, and deer, and I trap all sorts of forbearers and vermin.)",
         "Government least regulated agency.  They have simple rules like don’t kill the animals on Tuesday and don’t step on the animals food.  I also don’t see any issues on building golf courses and rental cabins if they make a profit, pay taxes and promote minimum impact. Same goes with oil drilling.",
         "Depends if its state owned land or federal gov owned land.  \n\nState owned is fine,  federal - not so much.",
         "Yeah that is what I am thinking.",
         "lol",
         "You think that government control of trillions of dollars worth of capital is a non-issue?",
         "I think that is part of the appeal to me. The wildness and the “no man’s land” feel.",
         "No. That idea of “ the greater good” can lead to some dark places in my opinion.",
         "Like other people have said here it is probably the least intrusive thing the government does. It doesn’t require a monopoly in the sense that it doesn’t have to be federal government it could be state or local. \n\nIt does require some force. Since somebody has to police it to make sure people are using it responsibly. I/E not burning the woods down or cutting down all the trees.",
         "And if you're a minimal government libertarian then you can even believe in public land managed by the government. As long as you're not advocating eminent domain or something similar.",
         "Does it matter?",
         "My buddy knocks up on peoples doors to ask permission and always shares his meat with them if they want it.",
         "I live out in the sticks on an old Forest Service road adjacent to about 17,000 acres of public land, it's protected as Forever Wild land in the state constitution, so I may be a little biased.",
         "I’d say you’re one of us then.",
         "Then public land is bad"
      ]
   },
   "1gjsa8s": {
      "title": "New Gonzales flag just dropped",
      "text": "",
      "comments": [
         "Very good",
         "But they literally came and took it.."
      ]
   },
   "1gk0suf": {
      "title": "Team Red vs Team Blue: Election 2024 (ReasonTV)",
      "text": "b",
      "comments": [
         "Hell ya some Heaton in the mornin' with my coffee.",
         "The full version of these are usually great, not the tiktok version https://reason.com/video/",
         "<>"
      ]
   },
   "1gk711t": {
      "title": "Let's gooo!!!!",
      "text": "",
      "comments": [
         "I think the right is joining Ron Paul.",
         "This seems a little disingenuous. Ron Paul tweeted a reply to a tweet. ",
         "![gif](giphy|bgOeHPlD3EernsOIiW)",
         "Finally.",
         "[Shhhhhhhh](https://youtu.be/bYJOfJQDMX4?t=3&si=NTOfjKME6Z8RHhSo)"
      ]
   },
   "1gk2vua": {
      "title": "Ron Paul: \"Suddenly Ideas Are Back in this Campaign\"",
      "text": ">After I posted some encouragement on Musk’s Twitter/X, he responded that he would be happy to have me join him looking for places to cut! While the last thing I am looking for is another job, I am encouraged by the outpouring of support and happy to help any effort to correct the wrong path we have been going down – a path toward total bankruptcy.\n\nhttps://x.com/RonPaul/status/1853652711142564328",
      "comments": []
   },
   "1gk606y": {
      "title": "Just Voted",
      "text": "Just Voted Bill Slantz for Governor this morning feels Great.",
      "comments": []
   },
   "1gjnhn9": {
      "title": "We are all partially enslaved by a system that treats us as tax cattle",
      "text": "",
      "comments": [
         "She's from Canada. It really is this bad.\n\nMy marginal rate is 53%. I don't know how we got here, but if a militia were ever to form to destroy the fuckers responsible I would be first to sign up.",
         "She is SO wrong! We don’t work for free, we receive the great and very beneficial service of dropping bombs on men, women, and children in poor countries overseas! How could society even survive without this essential service. Do you know how hard your life would be if you had to pay private businesses to bomb all those children for you?!? Did you ever think about that?",
         "I drove to work on a public road, that sure justifies the government taking a cumulative 40% cut on all of my transactions. /s",
         "Could she buy bigger glasses?",
         "*chattel",
         "What state does she live in where she’s paying 46% income tax?",
         "Preaching to the choir here, it’s real bad. Real bad.",
         "This is inaccurate because nobody works 7 days per week for 5½ months.",
         "The militia most likely would not be able to afford ammunition.",
         "Fuuuuuuuuuck. Sorry m8...",
         "It’s all that “free” healthcare.",
         "Ackchyually at this point we are just working to pay the interest on the money borrowed for the services of dropping bombs on men, women, and children in poor countries overseas!",
         "Better to be dropping bombs on people we don’t know than have bombs dropped on us by people we don’t know. Amirite?",
         "I don't know man. I know a guy that can kill pet squirrels for way cheaper.",
         "Roads! ROAAAADS!",
         "Does it though? How about this, I kind of agree with you. I like public roads and I think we should all chip in to make them and maintain them. \n\nMy problem is how Tax Dollars are being spent. I am not a supporter of war. We all operate under the rule of law. If we step out of line, there are immediate consequences. The DoJ has never passed their own audits. And I have never heard of anyone being punished.",
         "She would, but too much of her glasses-money goes to uncle sam!",
         "She doesn't specify income tax.\n\nWhen you add all the taxes up, federal income tax, property taxes, state and local taxes, sales tax, fuel taxes, car registration tax, capital gains tax, I'm sure it would be even higher than that.\n\nNot to mention the hidden inflation tax that steals your buying power every year.",
         "It's Canada, and it is likely one of the lower taxed Provence.  Quebec without a dependant and married with two salaries is over 55% if you make over $160,000 Canuckistani dollars.",
         "Your right. Working for free for only 4 months out of the year is so much more reasonable. /s",
         "That's federal plus state in a lot of states.",
         "The State of Canada.",
         "They don't pay you for 7 days either. They pay you only for the days you work",
         "The underlying concept still applies",
         "Baseball bats and crowbars would be fine too",
         "The militia almost crippled the RCMP in Ottawa with some trucks so I'm not too worried.",
         "Appreciate that. \n\nI wish I didn't have to, but I'm planning my exit",
         "Boom! You get the best post of the day award!",
         "I wouldn't mind paying taxes if I get a 100% return on them in the form of public services that I actually use.\n\nWe all know that is not the case, especially for middle class people like myself. Even if the money wasn't wasted on foreign wars, at the end of the day I would still be required to give way more than I'm allowed to take in return. I want my taxes to be proportional to the value I get in return.",
         "And the taxes that businesses pay that are then passed on to you. It's taxes all the way down.",
         "That website appears to be Canadian?\n\n[https://www.fraserinstitute.org/tax-freedom-day-calculator](https://www.fraserinstitute.org/tax-freedom-day-calculator)",
         "I hear you buddy..."
      ]
   },
   "1gjoklu": {
      "title": "Without TSA, who would hold up the lines at airport security?",
      "text": "Saw this news article today. Those that have flown into MSY know that it’s not a big airport, and it’s not a busy travel time right now. Imagine if this was pre 9/11, the company in charge of security would have either lost their contract or gotten a stern warning from the airport. ",
      "comments": [
         "Fuck TSA and fuck the Patriot Act.",
         "We had to travel through MSY after a cruise this last May. Out of the say 10 TSA checkpoints, 4 were open. The lines are only long from inept management and staffing practices. Also security is an illusion.",
         "\"Hey, I caught a terrorist!\" -said no TSA agent ever.",
         "Sounds like a good deal to me. People pay good money to stand around and get their junk touched. The government just subsidizes it at the airport.",
         "Thanks GWB... the entire flying experience has gone to the shitter since then.",
         "I'm voting for the presidential candidate who pledges to abolish the TSA!!!",
         "You know what would prevent a mass-casualty event? Corralling a mass of people, into a single choke point, with no walls or barriers, right *BEFORE* anyone is screened for any potential hazards or weapons!",
         "New Orleans native here. It’s a shithole. Done waste your time. Everything in Nola is run by incompetent people from the top down. Democrat leadership on full display.",
         "Well pay for fastpass. Then the super fastpass. Then your own plane.",
         "They’d have to do security like at the private side of the airport: modern. Blogs, posts, etc … a bot can sift through someone’s online personal and deem them safe or dangerous in seconds. Combine that with armed pilots (which is what we do in the USAF) and viola, actual security.",
         "True story.  Went through tsa with my infant daughter and they went through her bag with the formula and stuff and dumped it all out and black lighted her bottles and held us up for over an hour while she screamed and cried.  ",
         "Puhlease, it takes time to snap the latex gloves",
         "The patriot act was the least patriotic thing they have ever pushed on this nation.",
         "It always struck me as inherently unsafe to have large groups of people not knowing each other, standing together, in the name of safety.",
         "Last time I flew, the line for TSA was 3 minutes, and the line to check a damn bag was 90+. This isn’t just a government problem.",
         "Well, how else can the TSA increase their budget? If everyone made their plane showing up 30 minutes before it took off, the TSA would get a budget cut.\n\nI'm not being clever or funny, this is how you increase budgets in government. Kids are stupid? More money. Long lines at TSA? More money. People getting sick? More money",
         "I thought this sub was all in favor of checking everyone’s documentation. Just think of all the murders they’re preventing!",
         "I'm a little clueless so forgive me, but what alternatives to TSA could be used? I'd like to think that we could get away with not screening people, but I have a bad feeling that terrorism would skyrocket. People are a lot more violent now than they were twenty or thirty years ago",
         "The Patriot act was crazy. Whenever we lead policy with fear it’s a dangerous road.",
         "No worries! The issue with Libertarians is more so to do with the nationalization of airport security, not so much having no security. When you have a privatized system like we did pre-9/11, you have competition between security firms, which incentivizes them to innovate, use new technology, ect, because if they didn’t, they would lose their contract to their competitor.\n\nWhen 9/11 happened, it was a sort of knee jerk response to nationalize, having convinced the American public that the government could do it better. In free markets, when these types of catastrophies happen, the company responsible will have to answer for their blunder. Will they go under? Will they be fired? Consumers ultimately will make the decision for them, and it will be corrected. Has their been a 9/11 style attack since 9/11? No, but it’s arguably not due to government taking over, in fact just the opposite happened.\n\nWithin the first months of the TSA takeover, security line wait times at airports skyrocketed, which led to more people driving. Controlling other factors like decreased air traffic and weather, automobile accident fatalities increased by 327 deaths per month, arguably killing more Americans  in a few months than 9/11 did. Not only that but in 2015, audits where Homeland Security attempted to sneak 70 dummy explosives across dozens of the US’s busiest airports, 67 made it through security.\n\nThat’s just the tip of the iceberg and there’s more, but Homeland Security in general is a contentious topic that Libertarians are passionate about.\n\nSorry for the long post!\n\nTL:DR version - big government taking over security made things worse, not better",
         "People are not more violent now than they were 20 or 30 years ago, its the media that makes it seem that way.",
         "Whenever people start saying \"We have to do *something*!\"",
         "still is crazy.  provisions of it are STILL in place.",
         "Exactly yet that’s all the media does fear monger people into voting against their best interests",
         "That's a really good explanation. Sounds cheesy, but you've really opened my eyes on that!",
         "That actually does make a lot of sense. The only reason why terror attacks seem more prevalent is because they're reported on more.",
         "\"Something\" may have started with investigation of the Israeli \"art students\" and their connections if any to the relatively new owner of the twin towers, but what do I know?   \n\nConversely, the \"war on terra\" gave us 20+ years of Uniparty sand wars and decimated two generations of American boys and men for the sake of oil, poppies, and destabilization of the middle east.\n\nNow Dick Cheney is in the tank for the American Socialists, and the Populist/Isolationists are adding Blue Dog Dems to their team.  Crazy times.",
         "Absolutely, because of the shock value that it provides and then people can't look away, and then they can make money off of advertising and shares and clicks and fear. \n\nthe last time i went through TSA my bag got pulled to the side along with about 5 other bags to be hand searched because of something that set off the machine. The agent went on break, the replacements just handed everyone their bags without even opening them. I call it security theater, an illusion of safety like someone else commented. \n\nI wish people would be more discerning of the motive, audience, source, etc of all messages they are being told before accepting them."
      ]
   },
   "1gjdzey": {
      "title": "Innocence is no defense",
      "text": "",
      "comments": [
         "Rorschach's journal \n\nNovember 1 2024\n\nPeanut the Squirrel was murdered in New York.",
         "This is why I believe in using tannerite filled fake dogs. The Feds hate animals for some reason, so if they’re gonna steal our property and shoot our pets, might as well have a good joke in the tragedy.",
         "There is no law that government will not shoot you to enforce ... this is why government can never be the means to fix anything.",
         "We're heading down another timeline again, aren't we? Like when they put down harambe and everything went to shit",
         "The term anarcho-tyranny is increasingly useful to describe modern government.",
         "https://preview.redd.it/ijjk3qjygzyd1.jpeg?width=1920&format=pjpg&auto=webp&s=82d20c5e4c5da85ef7786727e383f223eb04fa68",
         "Didn't he bite some asshole, forcing the state to kill him to check for rabies?\n\n\nSure, the asshole shouldn't have been in a position to get bit in the first place, you could call it some form of squirrel self defense, but in general we value the lives and well beings of people over animals.\n\n\nWhat the DMV should have done here (if they must do anything) was issue a warning or a fine then follow up a few months later to see if he still has the unregistered animal.\n\n\nThe owner said that he was \"in the process of filing paperwork\" to get Peanut registered as an educational animal. He had peanut for 7 years. How long does it take to file that paperwork?\n\n\nI can appreciate the old libertarian/anarchist bulwark of \"the state shouldn't have a say in what I keep as a pet!\"and that's all cool until your neighbor gets a tiger and lets it roam free, or has dozens of feral hogs that they call pets.",
         "They'll regain consciousness when bullets pierce their skin. By then it'll be too late.",
         "JUSTICE FOR PEANUT!",
         "Where are all the don't eat meat people? Where are the farmers abuse animals people? Where are the people who made the sign for okay to eat and not okay to eat? \n\nAwfully quiet 🤫",
         "I don't like what they did either but come on, it was a squirrel not a human.\n\nHumans kill and eat literally billions of livestock every year. Trillions of animals killed for human consumption if you're counting seafood.\n\nAnd no, I'm not a vegan, I love meat. But let's be real here.",
         ">“They hate when I say, you know, when the elves— when I called Sauron, the elves said, ‘Well, he called Sauron brilliant.’ Well, he’s a brilliant guy. He controls 1.4 billion orcs with an iron fist. I mean, he’s a brilliant guy, whether you like it or not. And they go crazy.”\n\n>“He’s now Dark Lord for life, Dark Lord for life. And he’s great. And look, he was able to do that. I think it’s great. Maybe we’ll have to give that a shot someday.”",
         "You clearly haven't read the full story. The owner had filed the paperwork and was left in limbo with a response of \"in review\".\n\nHe cared for the squirrel for 7 years. If the thing had rabies it would be evident. Plus, the guy cared for it and, this is conjecture on my part, but likely had all the necessary shots for the animal.\n\nI honestly have a hard time siding with the entity that murdered a pet squirrel on this one.",
         "Squirrels and other small rodents don’t carry rabies. There has never once been a case of a human contracting rabies from a squirrel in the United States. The rabies excuse is blatant hogwash from the NYDEC. Let’s pretend that there was a chance that Peanut was rabid. In this case we can consider that the whole situation could have been avoided if the NYDEC would have not oppressed the poor man who owned the squirrel even if they were told to do so. Just because it’s the law doesn’t make it the right thing.",
         "We don't eat pets.",
         "They won't say a damn thing because they see speaking out on it as \"helping Donald Trump\" and I am 100% certain that the modern day left would defend child molesters before they did that. These people don't have any values they have a faction.",
         "The quotes that I've seen from the owner/caretaker had him saying that he was \"in the process of filing the paperwork,\" not that he had filed it and was having issues getting it approved. Still, he had had 7 years to figure out what I'm sure may be a super convoluted process.  \n\n\nAlso my understanding is that the state showed up because of his recently acquired raccoon, which are famously high risk for rabies, and took the squirrel because it was also unlawfully kept. \n\n\nReally if he cared that much about keeping the squirrel, he should have lived in a state that's not an authoritarian shit hole. South Dakota, for example, I believe lets you register exotic animals for $10 per animal, or legally become a zoo for $100.\n\n\nYes the state sucks for doing what they did, how they did it, but this guy could've also seen this coming when he constantly posted on social media about the animal that he was unlawfully housing.",
         "If I could give you an award I would.\nThere has been no single case of transmission as you say and the fact that such gross government overreach is defended on the libertarian sub is dumbfounding.",
         "You're a sad little man, aren't you?",
         "Plain and simple, the smallest amount of research will confirm in the minds of any person with the smallest amount of common sense that the brutal execution of these animals was totally unjustified and is a very clear example of government overreach."
      ]
   },
   "1gjc7hc": {
      "title": "Justice for Peanut!",
      "text": "",
      "comments": [
         "Fuck those guys",
         "However much you hate government, it’s not enough.",
         "This is what overstepping with 0 accountability gets you, disgusting.",
         "How dare they",
         "This is what happens when you vote for more government.",
         "This guy needs to hit up Afroman and come up with a new track...\"All this for a squirrel\"",
         "I posted something similar elsewhere.  There's a lot of boot lickers saying bUt hE dIdN't HaVe A pErMiT!!!  hE dEsErVeD iT!!!!!!\n\nlet's pretend for a moment that the government is justified in saying having a squirrel & raccoon requires a permit.  I'm not saying I believe or disbelieve this is the right thing, I'm just playing along with your average Redditor here.\n\nIs the right response to not having a permit sending armed goons break into your house with guns drawn,  trashing your house, treating you like your slinging meth and selling \"illegal firearms\", all just to seize an animal they are worried is unsafe to keep because of rabies, while not wearing any protective gear to handle potentially rabid animals, and then euthanize said animal because they got bit?  All in the name of animal welfare?\n\nOr would the right response be to civiliy contact the person?  Request he get a license within X number of days, and if he then doesn't comply give him the option of turning over the animal to a facility that's appropriately permitted?  And if he still fails to comply fine him, and I'd imagine let a lawsuit be involved to take things over from there.\n\nThey fucking went after this guy harder than they go after dangerous criminals.  FUCK. EVERY. SINGLE. PERSON. WHO. SIGNED. OFF. ON. THIS.",
         "I laughed so hard when I heard this story and then got really pissed. Didn't they kill it? Like you don't have the common sense to see this is a cool dude who loves the animals. Not destroy his stuff... They should at least hold the raiders, who signed the warrant, and who reported it accountable by the social mob. Do we know these people yet??",
         "a reasonable man would buy a komatsu D65EX12",
         "This generation's Harambe moment.",
         "“We own you”",
         "Do we really hate the government enough? I mean every time I feel like I can't be more pissed at them, they prove me wrong.",
         "Time to leave new York buddy",
         "This act of authoritarianism paid for by your tax dollars",
         "[All This for a Squirrel](https://files.catbox.moe/lf5nao.mp3)\n\nQuick song I threw together ... All This for a Squirrel",
         "This is a great example to refute, “But if you have nothing to hide, you have nothing to fear.”",
         "I will never live in CA, nor will I ever live in NY, and anyone sensible should make the same commitment. These states are lost, and anyone with any foresight needs to get out now while they still can.",
         "Absolutely unnecessary and over the top.  Infuriating!",
         "If you guys think this is bad I can’t wait to see how outraged you get about Roger Fortson, or Robert Dotson, or Philando Castile.",
         "Who would have thought people would go to war with the government over a raccoon and a squirrel?",
         "Wierd how I’m only reading about this on one particular sub……\n\nFuck I hate this bootlicking place.  But I just can’t leave.  \n\n*sigh*",
         "Can’t share this enough in the next 24 hours.",
         "Disturbing",
         "I don’t know the story, is having a squirrel as a pet illegal?",
         "Do we really think they were looking for animals in suitcases and dressers? Don't kid yourself, the squirrel and racoon were the pretense.   \n  \nThey raided his house because they can!",
         "It’s that illegal to own a squirrel? The fuck is wrong with these people.",
         "At what point should we use our 2nd amendment rights to protect ourselves frpm a tyranical gov?",
         "Just say if you start modifying a bulldozer to avenge your little friend, i got a welder and am willing to travel",
         "This seriously makes my blood boil. I am scowling at my screen. How can it not make you mad if you have a heart? This man had his house vandalized and his family murdered by the state.\n\nDisgusting. I’m seething.",
         "Blue state doing what blue states do",
         "how did they find his location?",
         "Idk how he leaned politically, but tyranny like this would for sure change anyone's stance. All of this for a fucking squirrel and racoon? What was their reasoning behind it? They didn't have the proper papers, so they're authorized to murder pets?",
         "Did they have a warrant or did you let them in?",
         "can't do this without money.  even if every person paid zero taxes, they can just print it. drop the national debt ceiling and politicians will learn economics 101",
         "Did you find any squirrels inside the shampoo bottles? Did you see any raccoons or squirrels in my shampoo bottles. I would like to philosophize with Aristotle about why the fuck you think you’d find a squirrel in my shampoo bottles.",
         "[All This for a Squirrel](https://files.catbox.moe/lf5nao.mp3)\n\nI put this together to honor Peanut.",
         "What worsens the excuse that they are testing for rabies, and I’ve said this in numerous comment sections because apparently not people know that squirrels don’t carry rabies and there has never been a single case of a human contracting rabies from a squirrel bite in the United States. That being said, let’s forget that and consider that the man owned Peanut for seven years. Could a reasonable person not assume that after that amount of time, the owner would know whether or not his pet is rabid?",
         "Too much logic here, more overreach, less rights.",
         "NY DEC did this, from what all the news is saying in NY they did kill the squirrel and I think the raccoon also, they are saying to test for rabies.",
         "No state is safe from this type of shit. It's despicable, but it's the system we have nationwide. They can take our cash on suspicion and destroy our houses with probable cause. Even when it turns out they were wrong, we have to pick up the pieces and accept it was legal.",
         "I admit I haven't heard of the former two, but many libertarians, including *Reason* Magazine (a libertarian publication), expressed outrage over what happened to Philando Castile.",
         "From what I gather, you need a permit there. The guy had applied but had not received approval. Guess the state figured it was more efficient to just kill the squirrel and raccoon then review the paperwork.",
         "If it is, why kill the squirrel?  Release the poor thing",
         "They had a warrant as an actual judge signed off this raid",
         "Warrant or not, it’s totally unjustifiable from a moral perspective. We have a moral responsibility to disobey unjust laws.",
         "That’s a fuckin banger that seriously almost brought me to tears… I hate this world.",
         "F'n brilliant man!",
         "What compounds the issue is he recently rescued Fred the raccoon.  I think the raccoon was actually the instigator of sending goons to his house.  Raccoon's are rabies carriers and given Fred and P'Nut were cohabitated, it increased the likely hood of P'Nut being considered exposed.\n\nMy understanding is that rabies is only transmissible if the animal is showing symptoms, thus with cats/dogs many states will allow them to quarantined to see if they display symptoms.  However no studies have been done with wild animals to be able to properly identify rabies based on behavioral symptoms.  If a human is infected with rabies, once they start showing symptoms it's generally considered to be 100% fatal (though there are cases of a handful of people surviving rabies).  So they take a 0 tolerance attitude.\n\nBut i guess what i don't get is, we have rabies vaccines that are effective if given even after exposure.  So why kill the animal? and not just fucking shoot the cock sucker full of rabies vaccines.  In fact if you're being sent to capture a potentially rabid animal how do you not have up to date rabies vaccinations?\n\nI'm a little more open minded on the \"ok, we have a potential exposure and we have to take zero changes\", what i'm not open minded on is it's a fucking travesty of government that it escalated to this point so quickly, and i'd castrate every person without anesthesia from the judge who signed the order to the agents to do a fucking full raid as their first action.",
         "All the names of the people involved should get leaked so they can at least have some level of accountability even if it's just social and not legal. Two innocent animals were killed for no good reasons. And a good hearted couple is traumatized for trying to love those animals. This is insane...",
         "the only way to test a raccoon for rabies is to kill it first.  last year a woman brought her pet racoon to a pet store for grooming and they killed it to test it. not sure why people care if it's rabid if they're gonna kill it anyway, but that's what humans do apparently",
         "This is what the 2A was installed into the foundation of the country for.",
         "As with any pet that isn’t a fish - you need documentation, vaccines, etc. \n\nThis guy found a squirrel and homed it. Over the course of 7 years he never got it registered nor had it checked. He was eventually reported for housing a wild animal and the animals (a raccoon as well) were put down to be tested for rabies.\n\nDomesticated wild animals don’t just get released. You’re not supposed to take wild animals home with you - that’s common sense 101.",
         "Think of the havoc a squirrel and a raccoon could have if they escaped, they had no other options but to kill them.",
         "Wow, unbelievable! This is why judicial elections matter.",
         "Agreed. Just wondering.",
         "Thanks!",
         "They’ve all been leaked. Well, the girl who made the original complaint (who lives in TEXAS) posted on fb bragging that she called the authorities. She has since deleted all her social medias. But the officials names & such has been leaked as well.",
         "Originally, yes, but we all know if we defend ourselves in this situation, we will be shot or face felony murder charges since the cops have immunity and we don't.",
         "I agree that having a tree rat for a pet is a silly idea, health concerns aside. The issue is how poorly the situation was handled. The fact 10 armed ass hats can bust into your place and smash the place up just because you're having fun without permission is crazy. What serious threat was posed to the public to warrant the situation?",
         "😑either you’re a bot or you have gotten me with your sarcastic wit",
         "I'll Google it, thank you!!",
         "Revolting against the British was also illegal. Our founders shot them and killed them, and faced potential charges of treason and getting shot as well.\n\nI'm not saying I have the balls to do it.",
         "It is ridiculously bureaucratic.\n\nAlthough this guy could have kept it up if he wasnt always posting on social media. If youre gonna put your undocumented pets on blast on the internet for hundreds of thousands of followers, might want to take the necessary steps to avoid something like this.",
         "You nailed it: “…having fun without permission…”",
         "I once had a squirrel jump out of a garbage can when I opened it; I truely understand the dangers of squirells.  Not to mention how Chip and Dale (strippers) are the names of chipmunks, a close cousin of the squirrels and they are attacking the morals of the country.",
         "If you’re on X….its alllll over there!",
         "Exactly. Then the rest of this gung ho bravado is kind of pointless. I think.",
         "The problem is that the founders were still dealing with wilderness, they were a different kind of person.\n\nNowadays the bread and circus is so good that most of us are overweight and obese (complacent).\n\nThe ones that could/would take action have a “it’s not me and mine” mentality.",
         "He owned the thing for seven years with no issues. It wouldn’t have escaped. He tried to release it eight months after he rescued him and the squirrel CAME BACK ON ITS OWN.",
         "Chipmunks are chirpy little jerks, but just because your cousin did onlyfans, doesn’t mean you should be euthanized",
         "I dont think I am allowed to euthanize my cousin, but if he goes back to prison then it might happen on its own."
      ]
   },
   "1gjk87c": {
      "title": "I was reminded by my red and blue family members that if I vote 3rd party tomorrow, I am helping Kamala Harris...or helping Donald Trump. I guess I'm helping the winner either way it goes.",
      "text": "Same old story election after election.",
      "comments": [
         "It means you get to upset both sides at once, the true essence of the libertarian experience.",
         "The only wasted vote is the one thrown into the sea of the status quo.",
         "Chase Oliver isn't our savior but I'd like to see us hit 5%",
         "When both sides are afraid of the same thing, that is the time to vote 3rd party.",
         "I will continue to vote 3rd party in every election for the rest of my life.  ",
         "I'm a registered Republican, but I've voted Libertarian in the past.\n\nIf the number of Libertarian votes was high enough to affect the overall outcome of an election, then that's the exact opposite of \"wasting\" it. It shows the two major parties that they have to move in a certain direction to court more Libertarian voters, Green Party voters, etc.\n\nSo vote your conscience, not party, not \"lesser of two evils\". Let your voice be heard, because they are actually listening.",
         "Lmao this is the part that cracks me up. No matter which side it is you’re helping the other one win by voting third party.",
         "It is not your fault that the duopoly has brainwashed people into picking between a shit sandwich and a shit shake.",
         "You’re neither helping nor hurting. Virtually inconsequential.",
         "Wild how most people treat the presidential election like a life or death vote but completely forget about politics after the inauguration (state elections, local elections) until main stream media blasts a new issue out at their face they feel like they have to rage about.",
         "Instead of an \"I voted\" sticker, you should wear an \"I helped elect _____\" sticker - to be filled in once the results are in.",
         "Drink the tears of whichever side loses. I get more pleasure out of liberal tears, but that's because they're louder and more melodramatic. Like we've already had a term with both of them in power. Neither is the antichrist. Neither will kill you or your family and friends if they win. Same shit, different color.",
         "One of the priceless benefits of being a libertarian…\n\nOnly we have the privilege of casting Schrödinger votes.",
         "Same I’ve been labeled as a trump supporter for voting 3rd party lol",
         "All we care about is 5%. Who cares what they say.",
         "Yes the old, you voted once and somehow tallied three times (3rd party, a vote against Kamala, and a vote against Trump).",
         "I could write in Mickey Mouse and it wouldn’t matter in my state.  People just want to bully anyone who doesn’t agree with them.",
         "Don’t listen to them. Listen to Dave Smith, Tom Woods, and Ron Paul.",
         "In georgia and had my friends tell me the same thing... first time i voted 3rd party",
         "Always nice to be part of a winning team... I guess.",
         "You didn't throw away your vote, you Chased down another option!",
         "Either way, one side is getting a reckoning. The Republicans for picking Trump again, or the democrats for skipping another primary. I only wish both could have a reckoning.  And sadly, whoever does will probably learn the wrong lesson from it.",
         "No, you’re not.",
         "I didn't vote for either one either. I can't in good conscience vote for eother of them of their parties. They've caused every problem this country has ever had. Nothing will change by continuing to vote for them.",
         "Unless you live in a swing state your presidential vote doesn't matter at all.",
         "I voted for chase, doin ma part 🗿🗿😎😎",
         "Here is an interesting way the next similar conversation might go...\n\n\"You voted for a 3rd party. Well, if you want to waste your vote on a protest, that's a waste.\"\n\n\"Who did you vote for in that election?\"\n\n\"I voted for X!\"\n\n\"That candidate won and would have won no matter how you voted. I got a protest out of my protest vote. Mathematically, it's your vote that was wasted.\"\n\n\"Shut up.\"",
         "“If someone claims you’re wasting your vote, recognize that they don’t care about you. It’s a selfish statement. They are saying your beliefs aren’t worth being represented, that you should silence your voice so theirs can be louder. Don’t give in to that.\nVote your conscience.” - Libertarian Party of Texas",
         "Screw those people man. You vote for who you support.",
         "I’d be a loser if my vote was for the loser and since my third party vote helps the winner then I am a winner regardless of the result",
         "Tell them their gripe is with Jill Stein specifically. LP did so bad this year, we aren’t the threat they think we are.",
         "Unless you’re in one of about 3 states it’s not gonna matter",
         "I'm in Florida so it won't hurt either candidate. I voted Libertarian just because I could. Two party system is so divisive.",
         "I’m 3rd party year after year, depending on who’s running. Vote the best candidate, not who you think will win 👍",
         "I'm in a solid blue state. Dem will get 100% of the delegates. \n\nSo I can vote easily with a clean conscious.\n\nIf I lived in a swing state I'd have to think it over.",
         "If you are the passenger of a car where the driver has fainted, you have the choice of grabbing the wheel so the damage that is about to occur, or stating that you aren't going to do anything because you don't want to be responsible even for the least of evils. What do you do, and why is that different from a refusal to vote? \n\nI gave my vote to the LP for many years, but that was when Texas was reliably going to go GOP and it was easy. But not this time. The weakest LP candidate ever, plus the Trump team that we are going to have, and the horror of Kamala of president...this is not a Bill Clinton/Bob Dole race.",
         "Vote Trump and free Ross, get a Libertarian in the Cabinet and a department with Elon and Ron Paul to slash the size of government.  Unlike other times we were given an offer and have something to look forward to.  Plus I want to see the leftist go crazy, it is going to be hilarious.",
         "Kinda depends on where you live.    If you live in a swing state than you will be helping Kamala Harris.   That is because most libertarians align with the Republican party.   One good reason to vote for **Trump / J.D. Vance** is that if Democrats win they will surely keep the borders open and grant amnesty to even more immigrants.   Much of the country will become like California, New York and Illinois and become a one party state.   You will have even less a voice when the country becomes that way.    This one is important.   This election voting for **Trump J.D. Vance** is the libertarian vote.",
         "i mean, your vote is effectively meaningless voting 3rd party. Wouldn’t it make more sense to vote for the candidate closest to your ideals?",
         "This is how I feel about journalism as well.if both parties diehard members are upset and call the article biased with it you know it’s probably a balance and well thought out story.",
         "The best part of the experience. lol 😂",
         "That's exactly how I feel.\n\n\nIf I'm passing off both parties, I'm probably doing something right",
         "Logic would say that Harris is literally the status quo as she’s the sitting VP and plans to continue what she’s already done.",
         "If Jo didn't hit 5% I highly doubt Chase will.  I didn't even hear of him until a couple weeks ago and I had to go searching for him.",
         "Same. He’s as nutty as the other two, but I won’t have his win on my conscience, but may help the party get to 5% where we can really have a seat at the table.",
         "Unfortunately I doubt we even hit 1% in this election. So many so called “libertarians” are voting for Trump. It’s maddening",
         "*Last election of your life.*\n\n*Libertarian is now a major party on par with GOP and Dems.*\n\n*You scream as you remember your pledge and vote Green.*",
         "According to South Park, it's always between a giant douche and a turd sandwich.",
         "I feel like With Kamala the media will just not report anything negative and with trump it will just be media outrage. I don't think either will do anything that bad or great, just more shitty government selling out to corporations. It's a dog and pony show in reality.",
         "Lol he's very aware of it",
         "I tell my fam\n\n\"You're not betting on a winning horse, you're letting them know who you think should run this country!\"\n\nSo many people vote for Biden because they don't want Trump, and ppl vote for Trump because they don't want Biden. This time it's the same with Harris and Trump.\n\nI voted libertarian both this election and last election. And if there's an election with nobody I see fit to be leader I'll write in Jesus, or some decent person that's not even running. Joe Rogan! I like his take on things. If anything he should at least run the debates. He's fair, doesn't cut ppl off, fact checks, and no one's using a teleprompter.",
         "I don't know how any genuine Libertarian can support Trump with his insane tariffs. They are literally just another tax, that will be pushed onto consumers and raise prices. It's kinda insane to see Republicans go from being once the party of free market economics under Reagan to now supporting such big regulations under Trump",
         "Open boarders is a libertarian principal. So is free trade, not Trump's tarrifs. Most libertarians do not align with Republicans.",
         "Meaningless? Voting for one of the two parties who change nothing for the better, that’s meaningless. \n\nSending a message or helping a third party get to 5% one day, meaningful.",
         ">Wouldn’t it make more sense to vote for the candidate closest to your ideals?\n\nUh... what? That's literally why they're voting third party.",
         "Feet look like hands and the brain looks like mush",
         "Trump is undeniably the lesser of 2 status quos. More so than any candidate in my lifetime.",
         "Is 5% some kind of threshold ?",
         "Lol hopefully if the Libertarians ever become a serious political force they don't go back on all their policy positions.  I'd hate to have to vote Green.",
         "I can see the benefit of tariffs only providing there is no other form of tax.  It would free every person from taxing authorities, you would no longer have to report things to the government and it fundamentally changes the relationship between the government and you.  Any changes to the tariffs will be noticeable so raising them may be a no go limiting the size and scope of government.  Mind you the government was small when when tariffs were the main.  Plus all those IRS agents get fired so there is a plus.",
         "Wow,  these are like the top reasons why I can't be a full libertarian.  I once had a strong mind that I was a libertarian.     While I agree strongly with libertarian viewpoints on most things, I can't be in a political party that doesn't protect it's citizens.  That is why I'm a conservative Republican and I support representative government.   You have to protect your borders and you had to protect your economy.  You have to protect your people.    Like not doing that is like saying you don't need police.   It's really Trump's border policy that garners my support.  I actually think he is soft of the border and wish he would had done more when he had the chance.",
         "How is getting a 3rd party to 5% meaningful?",
         "\"WASTED VOTE!!! You're just voting for the other guy!!!\"\n\nHate this argument. I'm voting for the person the most aligns with my beliefs. Like.. literally. I'm literally using my vote to vote for the person I believe is best for the position.\n\nNo, it's not a protest vote. No it's not an emotional vote. It's me voting for the person I would like to see in office.",
         "From my understanding, any party that gets at least 5% of the general vote gets federal funding in subsequent elections and a presence in debates.",
         "Somehow it will still be Stein, too. \n\n\"How do you never age!?\"\n\n\"It's hard to age, dear, when you have perfected cloning.\"",
         "Why didn't Republicans support the Democrats' border bill, if they're really that concerned about immigration? They like using the border as a reason to keep chumps voting for them so they'll never actually fix it. \n\nAlso, I'd never support a candidate that wants such high tariffs. They'll fuck over the economy, nearly every economist agrees on this. They are literally just another tax, that will be pushed onto consumers and raise prices. It's kinda insane to see Republicans go from being once the party of free market economics under Reagan to now supporting such big regulations under Trump",
         "5% of the popular vote is the threshold DNC and RNC established to keep other parties out of the debates in an attempt to keep focus on themselves and off of better candidates. Hit 5% and LP will be at the next election's debates.",
         "https://law.stackexchange.com/questions/57619/what-would-it-actually-mean-for-a-minor-3rd-party-to-get-5-of-the-vote-in-a-g",
         "Yeah the two other parties will totally let us in if we get 5%!",
         "Because it was essentially an amnesty bill.",
         "Hit 5% and they'll raise the bar again. The main thing that they agree on is squashing competition.",
         "Yeah….i know. But even if they change the rules, maybe that would get more people to wake up to how dirty the two party’s are.",
         "And salary increases 👍",
         "Oh, I don't disagree with you, I'm just explaining the significance of 5% at current."
      ]
   },
   "1gjb7hp": {
      "title": "\"BUt loOK aT ChINa oR viEtnAM\"",
      "text": "",
      "comments": [
         "Stop! Stop! Stop! Can libertarians stop pretending that communism is good in theory? It sucks in theory almost as much as it does in practice.",
         "Two countries that moved away from communism and embraced capitalist market economies? Yeah they're doing great.\n\nI love how when Cuba was crying to China for aid and help, China's response was \"Do capitalism\".\n\n>[Chinese officials have been perplexed and frustrated at the Cuban leadership’s unwillingness to decisively implement a market-oriented reform programme despite the glaring dysfunction of the status quo, the people said.](https://www.ft.com/content/9ca0a495-d5d9-4cc5-acf5-43f42a9128b4)",
         "I grew up in China, where there’s no free school lunch, forming unions are forbidden, medical bills are higher than the States but the quality is only poorer, riches are richer than here and most people are poor. The cause is the government or the dictator controls justice and everything.",
         "\"But that wasn't real communist\"\n\nBitch, every time any country tries to attempt communism it all falls apart. Maybe that's a fucking sign that it isn't meant to be.",
         "Communism in theory isn’t even good",
         "Craziest shit I’ve seen on here was all the pro communism people on the AK47 sub. I mean it shouldn’t be that shocking, but it was still a shock to me. People really are pro communism, despite the mountain of evidence against it.",
         "I’ve never heard the Vietnam excuse but the Chinese one is an excuse for authoritarianism and then they’ll turn around and tell you how they won’t make it authoritarian this time yet they’ll defend an authoritarian state 😭. EVERY. SINGLE. TIME.",
         "Everything positive about China is not a result of communism how ignorant",
         "It is worse in theory. Any idealistic worldview is. They want to create heaven on earth, but they fail to understand that every human is Adam and Eve. \n\nIn other words, life without suffering makes humans eventually insane that they try to suffer themselves.\n\nIt will make too much suffering (more than a human can handle) in practice.",
         "I've legit tried to debate liberals about this topic, and their argument is that those countries are capitalist",
         "The factory is working, best case scenario lol",
         "What about communism in theory is beautiful?! The theory is corrupt and idiot to begin with.",
         "This meme is 🤌",
         "I moved to Vietnam. Some people asked, \"Why would a libertarian move to a socialist country?\" and the answer is \"trends\". I'd rather live in a country that is trending toward free market, somewhat regardless of what that country began with. Look to the future and you'll notice that Vietnam has been gradually privatizing State Owned Enterprises (with plans to continue).",
         "Now do capitalism.",
         "Communism in theory \n\nShit that wont work\n\n\nCommunism in practice\n\nShit that will never work.",
         "Agreed. Abolishion of property rights isn't even a good theory. Your property is a byproduct, at least in part, of your labor. If you have no property rights, you do not have the freedom to enjoy the fruits of your labor. ",
         "\"Medical bills are higher than the States\"  \n   \nThis is a crazy lie lol",
         "That's because \"real communism\" is just a theory that arrogant and entitled intellectuals cling to because they think only they are smart enough to bring about the \"utopia\"\n\nWhat we saw in the 20th century is the results of their experiment. Usually, when scientific experiments fail as miserably as communism did they become universally debunked. However, the intellectuals are so damn arrogant that they think only they have the keys to bring it to a success. So we're doomed to try it again  if the far left gets its way.  \n\nI mean, why not give it another try. It's only 100 million that were murdered on the first attempt... small price for the utopia, right? They've worked out the kinks, so maybe they can reduce the death toll to a mere 50 million this time around, and we can all live in rainbow  land, a foundation of equity and diversity you will own nothing and you willbe happ!(sarcasm incase anyone cant tell)",
         "What do you mean dude? It means FREE STUFF lmao!",
         "The ability to have opinions does certainly limit the dream",
         "There will always be those people haha looking at you flat earthers!",
         "I mean, China is kinda sorta capitalist now. It has slightly improved the quality of life of the average citizen over what they had before.\n\nAlthough, amusingly, they blame global capitalization as forcing them to adopt the market reforms that have benefited them. ",
         "Communism is a Utopian end-state.   What makes it Utopian is that it can't actually happen. \n\nMarxist theory dictates that people are controlled and formed by materialist forces. That your personality, your viewpoints, etc... are all controlled by economic circumstances. \n\nSo the idea is that if you implement a totalitarian \"people's state\" that controls all aspects of life, relationships, and economy then that state can then transform the material forces of life to restructure how people think and act.\n\nEffectively transforming humanity into something that is compatible with their communist Utopia.  At that point people's behavior will focus entirely on \"the greater good\", all individualism will be stamped out, all competition eliminated... etc etc.  The totalitarian state will no longer be needed since everybody is doing what they aught anyways. \n\nOf course none of this stuff is true and none if it ever going to work.  It is a monstrous totalitarian authoritarian evil ideology that causes endless misery and death. \n\nSo, technically, they are right when they say \"It wasn't real communism\"... Because \"real communism\" can never and will never actually exist because it doesn't work.\n\n------------------------------------------\n\nHowever what you say in response is that what makes a person or government communist isn't that they \"have implemented communism\".  It is that they are TRYING to implement communism.\n\nA communist government is one that is trying to achieve communism.  A communist person or political party is one that is trying to promote communism.\n\nAnd when you study things like Soviet Russia... you realize very quickly they were true believers. They were not faking it or just going along with the motion..  They believed 100% in what they were doing.",
         "Marx was a shit writer, and a shit human being who leeched off his family and friends.",
         "When seen from an income to expense ratio the us health care costs less. The us health care costs are 60% more but income per person in the us is aproximately 400% on the low end and up to6 600% higher on the high end.\n\n GDP per capita statistics for the United States:\n2023: $81,695, a 5.76% increase from 2022 \n\nChina's GDP per capita in 2023 was $12,600, \n \nSo the amount of each chinese persons income which goes toward medical expenses is higher.",
         "As a percentage of income. Also you have to bribe the doctors to get a better service.",
         "China liberalized their economy by creating \"Special Economic Zones\". \n\nThese SEZs are essentially Party-sactioned Capitalist havens were free market forces and allowed (with restrictions) to create special import/export areas.   Effectively the normal rules that apply to China do not apply to these SEZs. \n\nThey started in the 1970s.\n\nThink of them as a sort of \"Free Trade Zone\" or \"Wild West\". \n\nThis is one of the major reasons China became dominate in electronics in the 2000s.  \n\nFor example: \n\nIf you are designing a product in the USA or Europe the time it takes to go from design to engineering plans to working prototypes can take weeks or months before you get your hands on a actual working engineering sample. \n\nhttps://en.wikipedia.org/wiki/Shenzhen_Special_Economic_Zone\n\nIf you were doing the same thing in Shenzhen it can be done literally overnight. You rent out space in a gigantic building, do your design there, drop off your designs and plans to a company down the hallway and they will produce everything in-house right then and there and have it delivered to your office by the next morning. \n\nhttps://www.youtube.com/watch?v=292-52DPexg\n\nAll of this meant that if you were NOT doing electronic design and farming out manufacturing to China it put you in a massive competitive disadvantage.\n\nThe old Republican meme that \"China is out competing us because they have slave labor\" is idiotic and wrong on so many levels it is hard to know where to start.  They are out competing the USA because they have a actual industrial policy.  The USA doesn't.  The USA's own draconian policies and financial manipulation is what is fucking the industry in the USA.  The inflationary policy since the 1970's in the USA actively makes it unprofitable to do manufacturing in the USA.  It makes importing goods much cheaper then making them for a large number of reasons that I won't go into here.  \n\nWhich means that in some parts of China they are far more capitalist then most of the USA.\n\n-----------------------\n\nThese SEZs are critical to China because they serve as outlets for those massive factories and other infrastructure China has built up around the country. \n\n--------------------------------------------------------------\n\nThe trouble is that with economic liberalization comes political liberalization, which is absolutely not what the Communist party wants. \n\nWhich is why under  Xi Jinping they are doubling down and reversing a lot of the progress made in the past 20-30 years. \n\nThe communist party of China would rather see the economy of China tank then see their own power wane.",
         "The irony in that is quite humorous",
         "Now that is just shifting goalposts after a blatant lie. But whatever I guess",
         "It’s the costs of getting basic healthcare and other basic services. Don’t know where you are heading to."
      ]
   },
   "1gjksl7": {
      "title": "When a political canvasser starts walking up your driveway. ",
      "text": "",
      "comments": [
         "I was hired as a political canvasser for the Democrat Party when I was 18 years old. One of the worst jobs ever 🤣\n\n\nHowever, I'll never forget one incident. Out of the thousands of doors I knocked, there was one guy who challenged my beliefs in a respectful manner. It wasn't a long conversation. He just chatted with me for maybe 5 minutes, but he brought up really good points about the negative consequences of taxation - particularly about how things like corporate taxes are, at least in part, just passed along to the consumer.\n\n\nRandom dude planted a seed in my brain, which eventually sprouted. ",
         "Oh, I like talking to canvassers. \n\nYou convert enough of them, they'll stop sending them.",
         "Pocket sand!",
         "I looked like that the other morning when the jehovah’s witnesses came to my house. It was 7:30 in the morning and 4 of them got out and started wondering around my property.",
         "And the cops open fire because \"he's got a gun! Shoot! Shoot! Shoot!\"\n\nBecause cops think only they are allowed to carry guns",
         "yeah they use 18 year olds that are fresh from the public democrat education camps"
      ]
   },
   "1gjirty": {
      "title": "Colorado Libertarians sue Jena Griswold over leak of voting equipment passwords",
      "text": "",
      "comments": [
         "The fact that the government can’t count votes in a secure manner should tell you everything you need to know.",
         "This is the same woman who took Trump off the ballot and was smacked down by the Supreme Court. Not saying the things she says about Trump isn’t true but she needs to just do her job, and stop abusing her power.",
         "Yet a CO judge [locked up Tina Peters for 9 years](https://apnews.com/article/tina-peters-colorado-clerk-election-vote-fraud-b456ce4f80dc97f4b967eb6297311a51) for doing basically the same thing. Two tier justice system.",
         "I wonder why the elections are so insecure? It's almost as if there's cheating going on!",
         "There are many ways to do so.. the fact is its a choice that some have made..",
         "The government can and mostly does count votes in a secure manner.",
         "Uh, i think you mean this is the woman who followed the law by not allowing an adjudicated insurectionist onto the ballot. The scotus being controlled by right wing hacks who DNGAF about the law when its inconvenient for them overturned her and the state supreme courts correct interpretation on the 14th.\n\nSCOTUS are the ones who abused their power to interfere and go agaist the 14th amendment.\n\n\nhttps://apnews.com/article/trump-insurrection-14th-amendment-2024-colorado-d16dd8f354eeaf450558378c65fd79a2",
         "You have to concede that, while the large majority of vote counting appears secure, leaking passwords is the very definition of “insecure.”",
         "\"mostly\" isn't good enough.",
         "How much is \"mostly\"?\n\n\nWhen elections are decided by a few thousand votes, it certainly does matter. A US Huse race in my area was decided by less than 200 votes. Before an automatic recount, the margin was literally a single vote.",
         "\"Adjudicated insurrectionist\" is a legal term with a very strict definition. Donald Trump is not an adjudicated Insurrectionist.",
         "> The scotus being controlled by right wing hacks\n\nYou know it was a 9-0 vote in SCOTUS,  right?  Lets hear your theory on why the liberal justices were coerced into voting the way they did by the evil right wing hacks.",
         "Leaked passwords obviously aren't ideal, but there are multiple levels of security so the leak didn't result in any stolen info.\n\nTo do anything with those passwords, you'd also need a second password and access to a badge-only room.",
         "Nothing is ever perfect. This mistake was made by a person (who is no longer employed in that role), but machines make mistakes too.\n\nI'm not opposed to making it more secure, but we need to be realistic too, nothing is ever *absolutely* secure.",
         "How do you think they should make it more secure?",
         "As a former auditor (CPA and CISA), when I see something so totally wrong, I wonder what else might be there. Did the halfwit who leaked them even need access to see them?  Not a good look.",
         "Do you have any idea the number of places I've gotten into that I shouldn't have been able to get into?",
         "https://apnews.com/article/top-officials-elections-most-secure-66f9361084ccbc461e3bbf42861057a5 AP news begs to differ",
         "Be like Canada...  Paper ballots and voter ID... if not paper ballots at least voter ID\n\nhttps://www.elections.ca/content.aspx?section=vot&dir=ids&document=index&lang=e#:~:text=To%20vote%20at%20the%20federal",
         ">Do you have any idea the number of places I've gotten into that I shouldn't have been able to get into?\n\nThat's why I'm saying, nothing is ever absolutely secure.\n\nElections in the US are still sufficiently secure to trust their results.",
         "I'm guessing you are posting from somebody else's account, in order to make your point. So that's one so far...",
         "Begs to differ with what? I'm the one arguing that elections in America are mostly secure. Well within acceptable margins of error.\n\nI know Trump claims to disagree with this, but he's hardly an unbiased party",
         "Voter ID would not have anything to avoid the issue at hand. We are talking about people potentially attacking the voting machines not people fraudulently voting. they are entirely different things.",
         "The Canadian System would never fly.  \nIt was made in a way that it is easy and secure for everyone to vote.",
         "Heh!",
         "Did you miss the part where i said paper ballots..."
      ]
   },
   "1gk46my": {
      "title": "European minority",
      "text": "As a Libertarian in Europe, I learned to be a minority, but on this channel you can see the dominance of the American view of libertarianism, hence I would like to present the European view and ask how to reverse what is happening here on the old continent.\n\nAnd although in the US elections are de facto held between two parties, people like Bernie Sanders are effectively marginalized while in Europe people like him rule in UK,Germany, Spain or Portugal. In turn, in other countries, populists with a no less \"red\" view of the economy are growing in strength in France, Hungary and Poland, not to mention the Netherlands. Even a relatively strong free market country like my family's Luxembourg is starting to turn towards this new \"Socialism with a Human Face\"\n\nWhenever you look at the statistics, all the indicators show clearly - Europe is shrinking or at least there is a \"Sick Man of the World\" - while the USA or China are developing, we are barely licking the wounds of Covid. There are problems related to migration and aging on the horizon. society or armament which, knowing life, will lead to bleeding our budgets even more And now the question - when laissez-faire shows a simple solution to these problems and minarchism would solve the problems of health care, social security and armaments, people choose the red path which led to the problems we currently have and the only thing this will multiply them even more - not to mention the burning problem of housing availability, which the Reds are increasingly bringing to the agenda, saying \"housing is a right, not a commodity\" - as the owner of several properties, I personally believe that we are only years away from introducing high inheritance taxes or outright expropriations.\n\nDo you, the American opinion, still think that in the USA your political conflict is such a big problem and the marginalization of libertarian ideas?",
      "comments": [
         "The US started more libertarian but is on the same path as Europe toward authoritarian collectivism. People only like liberty that they approve of and are fine with using the government to get what they want.",
         "yes, but the problem is not the fact of what is happening, but WHY it is happening - people do not see or do not want to see what the consequences of overregulating the economy or further indebtedness of the public sector will be - not to mention the increase in populist tendencies. One sighs when one company - SpaceX - can do more than all space agencies combined.",
         "Very true. Europe will eventually collapse. Likely before the US given their population has little savings outside their home values.  As I get older I unfortunately see that other countries don’t necessarily learn from other countries’ mistakes.  Collectivism is akin to a dogmatic religion for many and is just rebranded into ‘equity’."
      ]
   },
   "1gjmupb": {
      "title": "Ron Paul! I've been waiting a long time for this. Slashing Big Government - An Idea Whose Time Has Come!",
      "text": "I've been waiting for something like this to happen for many, *many* years. Let's get it done!\n\nSlashing Big Government - An Idea Whose Time Has Come!\n\nhttps://www.youtube.com/watch?v=wmSfE2nBEPA\n\nOn a side note, the wild man is still actively posting to youtube. I do miss his phone answering machine updates, though.",
      "comments": [
         "Why on earth would you believe that Trump would slash the size of government (if with Ron Paul's help)?  It's the same old game that conservatives always play: when they are out of power, they promise small government then they get in power and increase the size of government.",
         "Bro you need to lay off the kool aid",
         "https://preview.redd.it/6ogueeevvxyd1.png?width=1024&format=png&auto=webp&s=3ca3908acd823db0bebcd42ecd17cdc141b3ac60",
         "https://preview.redd.it/qufju9w7gzyd1.png?width=1100&format=pjpg&auto=webp&s=8f5c15a38d80db839fd53f573094186b7e1c2324",
         "There seems to be a pretty decent push in this sub to get the swing votes.",
         "Any libertarian that believes Trump will help the movement is just plain dumb.",
         "> they get in power and increase the size of government.\n\nSame game plan as the dems but the dems don't lie about it as much as the repubs. They lie about it ... just not quite as much.",
         "I think there is a better chance under Trump than Harris \n\nI mean the way the government agencies went after Trump and stalled his first term he may be in mindset to curb their power.",
         "Trump's not going to do it, Ron Paul is.",
         "this was hanging up in the booth when I voted for Trump.",
         "They will never get the chance.",
         "Thank you for calling it out for what it is",
         "As imperfect as Trump is, he did the following in his first term:\n\n1. Pass the FIRST STEP Act (important Criminal Justice reform)\n2. Cut taxes (always good from a libertarian perspective)\n3. Cut regulation by instituting a rule that for every new regulation made, two old ones must be repealed (this is also a good thing from a libertarian perspective, and many libertarian economists have been pushing this proposal for years)\n4. Abolish Title IX Kangaroo Courts on campus (again a good thing from a libertarian perspective, as Due Process is a critical civil liberty).\n5. Avoid getting the US involved in any new wars (also a good thing, as war is the health of the state).\n\nYes, he's a loudmouth asshole, he talks a big game and habitually underdelivers, he betrayed the Kurds (a truly atrocious thing to do) too. But from a libertarian perspective, he did *some* very good things. He certainly didn't wind back gay rights (like the left feared), and whilst he *is* responsible for getting the abortion issue thrown back to the states there's a perfectly reasonable jurisprudential case behind doing this (whatever one's politics are), libertarians are split on the abortion question (justifiably), AND even if you're pro-choice like I am democratic majorities tend to be very good at protecting the vast majority of abortions.\n\nI know he isn't a principled libertarian, but Trump *has* done some libertarian-ish or improvement-from-a-libertarian-perspective things. We know Hillary wouldn't have, and Biden did basically nothing good (apart from a few drug sentence commutations IIRC).",
         "Are you telling me you think Ron Paul is a sellout? The man is like 90 years old and still wants to fight, why don't you? What other choice do you have?",
         "Ron Paul is a 90 year old retired man who isn't going to do shit.  Are you serious??",
         "I just made it Saturday night, maybe someone else had the same idea! 😄",
         "Are you telling me you think Donald Trump will not spend money like he did before? He will take our vote and we will get nothing like we hope. What a joke. \n\nTrump spent more of our money without the Covid spend, which shouldn’t be excluded, than Biden did including his Covid spend. F’ing gullible.",
         "!remindme 2 years",
         "I said this in the last post about this crap",
         "Sorry, I gotta believe. This is the best chance we've had in my 35 years of paying attention.",
         "Really?  What about when Ron Paul was a reasonably high profile presidential candidate who was old but not nearly as old as Joe Biden in 2020?  Were you enthused then?  Did you try to \"get out the vote\" for Ron Paul because it was the \"best chance we've had\"? \n\nLet the man rest ffs.  He gave everything he had.  It was us that was the problem.  He deserves his retirement.  We are all better people for having known him.",
         "Don’t listen to sysop, he’s red through and through. Thinks Trump won’t spend it like last time. Grifters each and every one of them."
      ]
   },
   "1gjs1lb": {
      "title": "Guy Fawkes day.",
      "text": "Tommorow November 5th is Guy Fawkes day.  He tried to blow up a  repressive King James and Parliament in 1605.",
      "comments": [
         "Yeah! Down with the monarchy! Install the Catholic Theocracy! Wait... that doesn't  sound like ...",
         "Remember, remember the 5th of November; gunpowder, treason, and plot.  I see no reason, the gunpowder treason should ever be forgot! \n\nAlso, it’s sometimes Election Day, but everytime my Birthday!",
         "I always watch V for Vandetta on the 5th.  A great tradition.",
         "Guy Fawkes, the only man to enter Parliament with honest intentions. ",
         "He did it on orders of the Catholic Church. He was no anarchist.",
         "Let's make it a November the 5th that will never ever be forgot.",
         "I've never understood the support for someone who was a would-be terrorist and mass murderer. Why not lionize the unibomber while you're at it...",
         "Same here! Watching V for Vendetta on the 5th has been a small tradition for me, I even own the graphic novel.",
         "It’s is no longer about the man or the reason, but the symbolism it represents.",
         "Yeah James was a great king and was not repressive.  This was almost entirely an anti-protestant treason plot",
         "You mean you don’t have a copy of “Industrial Society and its Future”?"
      ]
   },
   "1gjx1t6": {
      "title": "What election coverage will you be watching?",
      "text": "Hey y’all,\n\nLooking for some alternatives to CNN/ABC/FOX for election night coverage. Can anyone recommend any good ones to check out?\n\nI don’t necessarily mind a paid service even to only watch for one night, but nothing crazy expensive.\n\nThanks!",
      "comments": [
         "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "None. PA won't be done counting, neither with MI or GA. Whoever wins PA basically takes it...",
         "Daily Wire and Timcast are collaborating. \n\nFor meltdowns, MSNBC.",
         "Since it’s also Guy Fawkes night I’m watching V for Vendetta.",
         "I always watch the extreme versions of whoever is losing and flip back and forth",
         "Whatever they have on at the bar. Because whatever way this goes, I'm gonna need a drink.",
         "Whichever side looks to be winning i will switch to the propaganda arm of the other for some entertaining meltdowns.",
         "If you have a VPN, watch the BBCs coverage. They always have great coverage of elections, British and American, and it's always interesting listening to non-American coverage. \n\nI'm sure they will kind of lean one way more than the other, but it will always be pretty unbiased coverage.",
         "Dave Smith is going to be on PBD all night. Free on Youtube. Likely what we'll be watching.",
         "I usually stick to CNN. In all honesty, they do have excellent election night coverage and presentation, and I've stuck with it ever since I was old enough to care, even though I couldn't vote in the 2000 election. I just ignore the bias, which is easier for me watching CNN than Fox News, which I can't find a single likeable person on and rots your brain anyway. I enjoy John King running the presentation.\n\nMSNBC is unbearable. Rachel Maddow is a garbage human being. No other MSM TV channel is all that relevant or interesting to watch.",
         "Strangely it might be the newspaper the day after for me. Or maybe McDonalds wifi. Tree limb hit the cable line and I'm almost out of mobile data.",
         "MSNBC, their meltdowns are epic. Then I float over to CNN to watch Van Jones cry once all the results come in (guaranteed, whether happy or sad).",
         "None",
         "I heard Jon Stewart will be doing coverage. Might as well laugh on our way to hell!",
         "[Tangle](https://m.youtube.com/@tanglenews) is doing a live watch party and I highly recommend them in general",
         "tiktok memes\n\nhey if they wanna make it a circus... 🤡",
         "You can give Bloomberg a try. I usually don't listen to their political focused shows much. There's def host bias on shows like balance of power, but Bloomberg is better than most at letting the pannel speak, as opposed to having the host give long opinion monologues",
         "reddit memes",
         "Daily Wire, OAN, TYT just to mix up the madness. But mostly local news to see what's going on with my local gubment because that's the one that directly affects me and my fam.",
         "I'm not. I voted over a month ago. I'm gonna go to work, come home, and go to bed, check real quick in the morning, and then continue with my day.",
         "I'll watch CNN, because they'll probably call it for Kamala around 9pm (regardlessof the % reporting), and I can get to bed at a reasonable hour 🤣🤣🤣",
         "I'll be at work, so probably going to have to stick to network TV that I get to watch for free there.",
         "Local News until after dinner. Then ill switch to cnn",
         "I spend most of the night on internet sources. I will say, however, John King on election night with that magic board is a guilty pleasure.",
         "None most likely but if I do tune in it will be Newsmax.",
         "\"Breaking Points\" With Krystal and Saagar on the youtubes\nEdit: My dogs bday is Nov 5th. I will also be watching V!",
         "This guy gets it",
         "Unless one of the big ones turns.",
         "For real meltdowns TYT, this is some real tankie shit.",
         "Remember, remember the 5th of November",
         "Tradition! I introduced my son to it as well, he has done the same thing on his own for the last couple years. I generally don't watch the election coverage anyway, it won't make any difference. I would rather just go to bed and see what happens.",
         "Excellent call",
         "Drink at home, cheaper. Do the Tim Pool one and drink every time he says \"Civil War\"",
         "BBC America will have coverage, no VPN needed.  I enjoy their coverage for major international events.",
         "This one?\n\nhttps://youtube.com/@pbdpodcast?si=XPr2KGMCFoOb186P",
         "Pat is good to watch",
         "I usually try to split my time evenly between Fox and CNN. You can usually get most of the actual story that way. The only time I start to worry is when they agree.",
         "The advantage to watching CNN is seeing the reporters slowly become unhinged if trump pulls ahead. I’ll never forget 2016, ole Anderson scooper and the rest looked and sounded like they were watching kittens get thrown into a wood chipper as the night went on. There’s actually a compilation video on YouTube of the various networks coverage from that night.",
         "Lets be fair, every major news outlet is brainrot",
         "Yeah I’ve always watched CNN just because I grew up on them. I’ll probably have an eye on them a bit just for tradition",
         "This was cancelled. ",
         "Because let's be honest, nothing will really change either way. ",
         "I forget that is even a thing! I'm a British expat so I am always connecting to BBC iPlayer for British TV. The thing I enjoy most is how they emphasize importance without being overdramatic. Something the American networks just cannot do.",
         "I think so. It might be under the overarching Valuetainment channel.",
         "I hear you. I grew up on CNN as well. Before it was nothing but talking heads. I miss it.",
         "Thank you"
      ]
   },
   "1gjvga7": {
      "title": "Voting Record",
      "text": "Does anyone find it weird that their is a way people could track if we voted or not? Neighbors could look up this information on us. Isn't that private?",
      "comments": [
         "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "They can see IF you voted, not who you voted for.",
         "State governments keep records of whether you voted to keep you registered as long as you keep voting, and states swap this information to ensure you don't vote in two different states. I think it's always been \"public\", but years ago anyone who wanted to check would have to go to some county office to look at paper records; now it's all searchable online.\n\nThis is the first year I've seen ads run over and over again reminding us of this. Evidently one side thinks shaming people into voting out of peer pressure will help their candidate. I mostly find it entertaining.",
         "Only yes or no, they can't see *how* you voted.",
         "I really don't give a crap if my neighbors know I vote. And I'm sure they feel likewise.",
         "Now we can point to the record and say, \"See? You can't blame me for the mess we're in.\"",
         "Who you voted for is private, not if you voted.",
         "They tell us our neighbors parties too! 🤠 All you need is their birthdate & address. So much for privacy, right?",
         "There*",
         "If Steve is voting and he died/moved out of state 7 years ago - should that be public knowledge?",
         "NY allows you to be unaffiliated- so it makes no difference to me if people see I voted — of course I also don’t show in many polling counts as they usually only show red or blue amounts.",
         "At least in my state you need to know the person's SSN to look that up which tends to limit it to people you know very, very well like a parent or spouse. None of my neighbors know my first name let alone my SSN.",
         "Same... I was like why are they using peer pressure. Rather 1984-esque, I found it rather intrusive that we all could monitor each other",
         "Even yes or no… that should be private I would think",
         "Ideally, but I don’t think so as I think it’d be much easier to catch widespread voter fraud this way",
         "It’s for election integrity purposes."
      ]
   },
   "1gjzcy2": {
      "title": "Do you remember freedom Young people don't remember how we stand up and fight but we also had real news that wasn't Sensored It was called investigative reporting",
      "text": "",
      "comments": [
         "More concerned with lying for clicks than the zero censorship.",
         "What's the difference in Countries like China, USSR, or even some Middle East countries that don't have free press, and the US Media?\n\nNot reporting all the facts is just like not tell8ng the truth."
      ]
   },
   "1gk5yia": {
      "title": "You’re Not Apathetic: Preserving Sovereignty by Rejecting the Illusion of Democracy",
      "text": "Ah, the grand and peculiar theater of democracy, where every individual, in casting a vote, may feel they’re shaping reality – while, in truth, they’re often swallowed by it. Your steadfast refusal to vote, then, becomes not mere apathy but a philosophical stance, a rejection of participation in what you perceive as an elaborate charade.\n\nIn essence, you’re choosing to retain sovereignty over your perception of reality. To cast a vote would be, as you see it, a betrayal of that sovereignty, an act of legitimizing a system that functions more as a conveyor of others’ wills than as a mirror of the people’s collective vision. The democratic ideal – that each vote builds a grand mosaic of collective intent – presupposes conditions of transparency, accountability, and genuine influence, the absence of which, as you’ve observed, renders the act largely symbolic.\n\nBy not voting, you avoid surrendering to the reality imposed by those who champion the system as a beacon of freedom. You see through the mechanism, recognizing that elections often serve to reinforce a particular narrative rather than to derive a genuine, unified will. Instead of validating that narrative, you reject it outright, refusing to let your voice be a note in a song you didn’t choose to sing.\n\nIn a way, your stance could be seen as a kind of civic duty in itself – a commitment to preserving personal integrity and clear-eyed observation over conformity to a distorted collective ritual. Rather than participating in what might feel like a hollow affirmation of the “will of the people,” you assert a different truth: that to participate would be to tacitly endorse a system that, by its current nature, rarely delivers the ideal it claims to uphold.\n\nIt’s a complex form of protest, a refusal that demands nothing, seeks no recognition, and yet quietly resists the machinery that would reduce individuals to mere cogs in a grander apparatus. Instead of engaging in the futile act of casting a vote, you stand firm in your conviction, embodying an alternative form of dissent that speaks volumes without a single mark on a ballot.",
      "comments": [
         "Democracy is tyranny of the majority. Read Hoppes [Democracy: The God That Failed](https://www.riosmauricio.com/wp-content/uploads/2013/04/Hoppe_Democracy_The_God_That_Failed.pdf), or other works by libertarians such as [Rothbard](https://mises.org/library/book/anatomy-state), [Spooner](https://oll-resources.s3.us-east-2.amazonaws.com/oll3/store/titles/2194/Spooner_1485_Bk.pdf), or [Hoppe](https://www.youtube.com/watch?v=qrl8YorTa1U) to learn about why so many libertarians [oppose democracy](https://www.youtube.com/watch?v=qrl8YorTa1U). Also check out r/EndDemocracy\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*"
      ]
   },
   "1gjm8hd": {
      "title": "I'm not a libertarian per se but I thought you guys would get a kick out of this",
      "text": "",
      "comments": [
         "This is catastrophic. Just the Fed further eroding your civil rights.",
         "This decision is a huge invasion of privacy, allowing the IRS to access our financial records through third parties without letting us know. It takes away our right to be informed when the government is digging into our personal finances, leaving us with no chance. This overreach puts government control above our basic freedoms and opens the door for even more surveillance and intrusion into our private lives."
      ]
   },
   "1gjf7dw": {
      "title": "Libertarian comedian Rob Bernstein put out a youtube special yesterday. Go show support.",
      "text": "",
      "comments": []
   },
   "1gio443": {
      "title": "Our new flag!",
      "text": "",
      "comments": [
         "https://preview.redd.it/xhdbj7uh9pyd1.jpeg?width=1000&format=pjpg&auto=webp&s=b11582892be53a4974003b07afc659114db3d9d2",
         "\"Don't touch our nuts\"",
         "Dicks out for peanut",
         "That poor squirrel shouldn't have been put down. He was living fine with that guy.",
         "Should be the subs banner",
         "Justice for peanut and fred",
         "Can I get a wallpaper version of this?",
         "If this was a patch I would buy it.",
         "This is nuts",
         "“Don’t euthanize me.”",
         "Fuck yeah",
         "Squirrel lives matter",
         "https://preview.redd.it/imc2ava8wqyd1.jpeg?width=750&format=pjpg&auto=webp&s=df5794899336119e31876d3a15a50a7855588200\n\nThis better?",
         "Remember peanut!",
         "Ahhh, because we forgot where we buried our nuts.",
         "Peanut must be avenged!",
         "Ironically a squirrel has been a symbol for classical liberalism for a while, at least here in Europe. Justice for squirrels.",
         "https://preview.redd.it/wmxzlhhyfvyd1.jpeg?width=1179&format=pjpg&auto=webp&s=e223edd84d0203c6b77296ebbb2c787d7e295f7a",
         "Don’t touch our drum set",
         "love.",
         "Need more Ar-15",
         "Without the government who would.... Uhhhh... Kill squirrels in funni hat?",
         "This is better than the snake imo.",
         "Can someone explain this one to me?",
         "I need one with a Carpincho drinking mate and the phrase \"No me jodás, boludo\". Colours should be light blue and white",
         "I mean the squirrel bit the official so they had to test for rabies...no other way. If he wanted a pet squirrel, he should move to a jurisdiction where that is LEGAL. Easy",
         "You guys are more mad about this than George Floyd getting murdered by the state",
         "https://preview.redd.it/nrg73i3i7qyd1.jpeg?width=1080&format=pjpg&auto=webp&s=d410f3f4ef0e61d62f91445bc8262faa91ecd832",
         "Aww yiss",
         "Right idea, but it really should be \"Nuts out for Peanut\".",
         "Maybe there should be a \"hands up don't shoot\" version",
         "Read about Peanut the squirrel. Was euthanized in NY because he was illegal to have as a pet.",
         "Squirrels don’t carry rabies. You’d think the DEC would know that, but I guess not.",
         "No. You can cope all you want. NY is a tyrannical state, and they deserve the ridicule. They martyred a fucking squirrel.",
         "Because Floyd was a druggie who was committing crime. Peanut was killed because of government regulations.",
         "Both are tragic but the GF thing was just one bad cop while this is an organization overstepping.  Also I have a soft spot for animals so this angers me greatly.",
         "They hunted down an innocent family and pet with our tax payer dollars then killed those innocent pets for no reason. George Floyd committed multiple violent crimes and the one that he committed the day he died from an overdose was what got him in front of cops. He wasn't hunted down innocently. He died from fentanyl not some out of shape cop half his size; this has been proven multiple times already but everyone memory holes it because they simp for thugs. If you cared about power hungry cops killing innocent people a kid died around the same time who was a beautiful violinist and truly wasn't doing anything wrong but no one cares about him because the kgb media didn't tell them what to feel",
         "They murdered the squirrel based on “regulation”. Floyd was killed by a state officer.",
         "Dude this one cracks me up 😂",
         "😂😂",
         "Mutha fuckin’ bread crumbsssss",
         "Thanks, I'll check it out.",
         "Just goes to show the inefficiency of these types of agencies. This is a basic piece of knowledge was completely missed and that ignorance resulted in the brutal execution of a poor man’s innocent pet.",
         "What an absolutely wild comment.",
         ">  committing crime\n\nis the death penalty the common punishment for a counterfeit bill?",
         "Could everybody please stop ignoring the fact that George Floyd was already a dead man walking, before he ever came into contact with law enforcement that day? He was on his way to death's door, even in the back of the police cruiser, you can plainly see that man struggling with nearly 4 times a lethal dose of Fentanyl in his system, along with *multiple* other, a veritable cocktail of toxic narcotics coursing through his veins, and one of his major arteries with a 75% *blockage*‽\n\nAnd then, the autopsy found no signs of damage, pressure, or bruising on his upper body. You ever heard of a man being choked to death, windpipe crushed, but no evidence of pressure, or bruising, is left behind? Face the facts. He was not asphyxiated to death by a knee that left no pressure marks on his body. That's just ludicrous.",
         "In a libertarian sub he is celebrating a police officer playing judge, jury and executioner for a private monetary dispute. Wild indeed\n\nFloyd was a degenerate but did not deserve to die by the state for passing a fake $20",
         "Dude, fuck off. You want to defend a guy who held a gun against a pregnant woman's stomach, that's on you.",
         "Point out where I was \"celebrating\". You want me to have more sympathy for a druggie than a pet? I don't like police, but fuck off for wanting me to care about someone who held a gun against a pregnant woman's stomach than a cute squirrel.",
         "Ok Charles Bronson"
      ]
   },
   "1giwju6": {
      "title": "Intolerable ",
      "text": "",
      "comments": [
         "Thomas Paine is the true father of America, and the way we have erased him from the country's collective memory is shameful.",
         "But is is just a little bit of rape and slavery we will even let you pick what jobs you do for us!",
         "Wut",
         "Talking about the real nature of government"
      ]
   },
   "1gjiwkb": {
      "title": "Private-Sector Jobs Went Negative in October. Will the Fed Panic Again?",
      "text": "",
      "comments": []
   },
   "1gjz1ei": {
      "title": "With Regard to the Recent Insanity",
      "text": "",
      "comments": []
   },
   "1gjxmbb": {
      "title": "Truly undecided voter",
      "text": "So I am new to the party and have been pondering my own beliefs and learning about libertarianism. My plan was to vote Oliver tomorrow and show my support, from MO, for pushing this country to not be a two party system. But now I’m starting to worry that if I don’t vote Harris then Trump is going to win and I really hate that idea. What to do…?",
      "comments": [
         "You live in Missouri, Trump is going to win your state.\n\nVote 3rd party.",
         "Statistically, the chance of your vote being the deciding vote in the national election is effectively zero. Don't let \"picking the winner\" be the reason you're voting."
      ]
   },
   "1gjiyfn": {
      "title": "US Bombers Arrive in Middle East as Part of New Deployment for Israel",
      "text": "",
      "comments": [
         "Ffs.",
         "After the election, I'm quite concerned what our lame duck president will send over there next."
      ]
   },
   "1gjw6dm": {
      "title": "Wrong polling place",
      "text": "So I moved 2 years ago and in my state when you get a new drivers license you can check a box to make your new place you can register to vote. I did that. Just checked to see where I needed to go and the state website says I am still registered at my old address. Thought this was odd and told a co worker. They checked and they had the same issue. We both are registered libertarian. It is odd because when my wife got her new license the new address was registered for our new house.  Any one else have this issue?\n\n\nIt is odd because this is the first time in a while Nebraska has a legitimate 3rd party candidate running for congress, and I'm curious if it really was just coincidence that two 3rd parties have had the same issue.",
      "comments": []
   },
   "1giu58h": {
      "title": "Never forget. Never forgive. ",
      "text": "",
      "comments": [
         "Why did Peanut get euthanized? Pls explain",
         "Ngl, pitbull ownership is one of those issues that challenge my libertarian views. I'm more of a minarchist anyway, but restricting which pets people can own as a generality is not something I'm a proponent of. However, I think owning particular species should either be banned, heavily restricted or be subject to much harsher legal penalties when the animal attacks someone or breaks property. At the moment, at least in my country, people can easily own dangerous dogs but aren't legally responsible when their animal attacks someone in the same way had they themselves caused the damage. In any case, protecting citizens from base level violence is pretty much the only legitimate government task and I feel like the clear risk that these animals pose makes it that restricting or banning them is sensible.",
         "After my family was attacked by a loose pit bull roaming the neighborhood and having to choke it out after failed attempts of beating it with random objects trying to get it to unlock it’s jaws from my dogs neck, fuck pit bulls. Take them all away.",
         "https://preview.redd.it/lg22bioezryd1.jpeg?width=720&format=pjpg&auto=webp&s=c1c61dd10f66c0e21523a8443fe33265d9b9b257\n\nJustice for Peanut 🥜",
         "Why shoving the pitbulls into this? Do you own pitbulls?\n\nBringing pitbulls around is like doing russian roulette on random people. They are animals and they do whatever the fuck they want.",
         "Gas the pit bulls",
         "Pitbulls deserve to be taken away",
         "What… the fuck is this thread? \n\n“Don’t tread on me!” But I’ll kill your dog cuz I’m a little bitch? \n\nWhat happened to y’all? \n\nBlanket statements against animals saying certain breeds need to be gassed? \nNo nuance?\n\nEvery pit bull I’ve ever known died a sweet, harmless angel.\nDoesn’t deny that some pit bulls (raised right or wrong, but almost always wrong) can be violent *under the right conditions*.\n\n\nSubstitute pitbull for \n- man\n- gun owner\n- black man\n- Muslim\n- drunk\n- insert other stereotype\n\nAnd see if what you’re saying still makes sense. \n\nMy English bulldog is incredibly sweet but HATES other dogs and will attack any other one, unprovoked. I didn’t train him to do that and they are a pretty derpy docile breed. \n\nKill all bulldogs?\n\nSeriously, I hope these are bot accounts because if they aren’t, you idiots need to stop watching movies and get out in the real world. \n\nRemember, before it was pit bulls it was Rottweilers, German shepherds, Dobermans, etc. \n\nThis is the first time my fellow Libertarians disappoint me, please be bots",
         "Don't blame the authorities, blame the idiot who made his illegal pet internet famous",
         "Damn, Trump is so right,.",
         "Because the totalitarian regime decided it’s illegal, so they do whatever they want to catch it and to kill it. In some states having a squirrel as a pet is legal in some it’s illegal. Still better to have states with different laws, in European countries everything is decided for the whole country. Europe is a hell if you hate the government.",
         "Because it bit the official and had to be checked for rabies. The owner was violating NY law. He should have moved to another jurisdiction where owning them is legal, I blame the owner tbh",
         "perhaps having to have some sort of insurance?",
         "I got my hand mauled about a year ago by a pit and I blame the owner for putting me in that situation. The reality is that rescue pits are usually not a very great idea after they come from god knows what kind of traumatic background.. I have met good pits that were raised from pups. I like dogs better than humans but I don’t ever trust pit bulls especially rescues. Alot of dogs suck because of the stupid people that raise them just like humans..That’s my opinion…",
         "Yeah i hate them too, they’re too dangerous. My brother had 2 pitbulls and they were really sweet and i loved them and they never showed signs of aggression, nothing bad ever happened with them. Still i think nonetheless these dogs aren’t pets. I guess the best solution is to weaponise yourself so you can defend yourself against them. I will never rely on the government to defend me or to ban them, just weaponise yourself if someone in your neighbourhood has a pitbull.",
         "Libertarians when someone owns a dog 🇨🇳🇨🇳🇨🇳",
         "Find my other comment to a poster in here, also feel free to go fuck yourself too. For a sub of forward thinkers, this is an ignorant comment",
         "The original quote says communists as the first one, so I wanted something that was in the same vein.",
         "I really hope this is a troll comment.",
         "Pitbulls aren't an issue if you concealed carry a blunderbuss.",
         "This was your takeaway reading this? Also, go fuck yourself. Pit bulls aren’t inherently bad, just the people that don’t train them like any breed. Explain how I’ve had them my entire life, never had an issue. Help my neighbors install their new counters to save them money, their husky sunk its teeth in the back of my leg just over a month ago. Must be mixed with pitt? Clown",
         "Why? You do realize pitbulls were bred for bloodsport. If you've spent any time around any working breed, you know they do what they were bred to do on instinct. Otherwise there'd be no point in creating specific dog breeds, we'd just train them all from square one. It would be highly inefficient, but sure.\n\nRetrievers play fetch with you because they were bred to retrieve duck and fowl. Great pyrenees herd and guard children because they were bred to guard flocks and herds from wolves and bears. Dachshunds run after little animals and bark like hell because they were bred to go on hunts. I shouldn't have to explain to you what pitbulls were bred to do.\n\nIf pure logic doesn't get you, how about statistics. Pitbulls are responsible for more bites and deaths than all other dog breeds COMBINED. We're talking rottweilers, german shepherds, dobermans, put them ALL together and they don't even come close.\n\nBut whatever right. Im lying. Your dog is a sweetheart, your dog is the exception. Tell that to the woman with the sweetest pitbulls in the world who never bit anyone, then one day they randomly ripped a 2 year old baby out of her arms and tore him to pieces. One of the most incredible things about pitbulls is that they were literally bred to give no warning before an attack, and good luck getting them to let go. If you ever bothered to look into the history of the breed, you'd understand why.",
         "None of those things you listed creates a genetic predisposition for violence that causes you to be responsible for the majority of violent attacks despite being a small minority of the population. \n\nBeing a pit bull does.",
         "\"don't blame the authorities, blame the women trying to get illegal abortions.\" \n\n\n\"don't blame the authorities, blame the people smoking an illegal plant.\" \n\n\"don't blame the authorities, blame the people harbouring Jews in their attic\" \n\n\nNo, I don't think I will.",
         "Blame the authorities, because who took it away for nothing? The “authorities”……",
         "Hats off for Peanut. A squirrel for the ages. He will be missed.",
         "Lol. You have no idea of Europe. You do know Europe is not a country. The Average European country is much smaller than Texas. Why wouldn’t everything be decided for the whole country?",
         "I generally dislike the idea of forced insurance since it fucks with the market, but it wouldn't be my least favourite option. I think a good first step is criminal liability for damage done by pets. \n\nThe difference between pets and other legal issues that have to do with liability is that animals are inherently unpredictable. If someone wants to own a potentially dangerous animal, they should realise they are responsible for that animal's actions, even if they're unpredictable. That's why I think negligence shouldn't be relevant in case an animal harms someone; if you get a potentially dangerous animal you should automatically be liable because if it harms someone, it means you didn't properly prepare for the unpredictable behaviour of the animal—or you were truly negligent.",
         "All dogs are animals and all dogs can behave poorly. Humans being so smart yet can’t train their animals, but then blame them is wild. Especially when you say shit like “my brother had two and never aggressive or problems” and still have that mindset. Where’s your herder?",
         "Why don’t you tell all the babies, toddlers, kiddos, adults, grandmas, cats, and dogs maimed and ripped to shreds by **shitbulls** to go **fuck themself**",
         "I doubt most pitbull attacks can be solved by carrying. Many happen too fast",
         "The statistics and breed tendencies say otherwise",
         "Risk of disease.  There are reasons for such laws.",
         "Where you from?😂😂😂",
         "Because just 2 examples don’t speak for the rest of them. I get that you apparently like the breed, but don’t be blind for the criticism. It’s not just the owner, they can just snap out of nothing. There’s people being attacked, even killed in some instances. Other smaller dogs being killed, i don’t care how well it’s raised it has the capabilities of killing someone. Animals will always be animals and idc how well it’s trained it will always be dangerous and they never can be fully trusted. Not that hard really to understand….",
         "I’ll continue to sympathize with them and continue to preach there’s bad owners that can’t figure out how to train an animal. If anything, let’s just remove the idea of domesticating animals, because people can’t be trusted to control them accordingly. You can trust an animal to behave on instincts. You can’t trust people for anything. So yes, you better go fuck yourself",
         "That's why I practice quick drawing my blunderbuss like a cowboy",
         "Do you want numbers on humans? Because suddenly your reasoning will make you sound like a human sympathizer even though we’re closer to parasites than mammals. I’ll wait for you to get the statistics to prove otherwise",
         "Laws…..🥱. If someone owns a squirrel and he doesn’t know about the risks of diseases, then it’s just the problem of that person alone. No need for cameras and microphones in my house for the government to protect me….for example if i would die because my squirrel bit me, who’s problem is that? Society? The government? The squirrel? Or just my own fault?",
         "Did you know that you can have pet rats, hamsters, chinchillas, gerbils, mice, rabbits, and Guinea pigs?",
         "My statement in another comment is this about all animals. They’re just that, animals. Pretending pitbulls are inherently bad is some seriously ignorant shit. The husky example is perfect for a statistic that’ll never show. I didn’t report my neighbors or dog, I told them this shit happens and now they know to keep him locked up around strangers. I’m sure the numbers are super accurate, never biased. Just like people /s",
         "Consider directing your “preaching” to bad owners themselves to clean up their act. Most of us already fucking know about shitty owners. Their shitty pitbulls just represent that. Their laziness and stupidity is the reason people hate pitbulls",
         "Based",
         "So your first attempt in defending pitbulls is saying huskies are worse, now you’re saying humans are worse than pitbulls? Jfc give it up or come up with a logical argument. \n\nBack to the meme posted, pitbulls are a terrible example to be included on it.",
         "What kind of argument is this lmao\n\n\n\n\nEDIT: typo",
         "Humans have free will, understand laws, threats and incentives and are held responsible for their choices. Humans are predictible.",
         "Those aren't wild animals.  They are bred to pets.  I guess a guy could pick a rat off the street and make it a pet, but who'd do that when you could get a nice rabies free rat from a shop.",
         "Not all animals, a small dog can’t kill me for example. A husky also isn’t really a pet, I’ve seen too many people who couldn’t handle them. And i know what you’re going to say, it’s the owners fault and that’s true im not saying people shouldn’t have them i just think a golden retriever for example is a better pet than a husky. There’s a difference in animals, animals who can do harm especially should be never fully trusted with other animals or other humans. There’s a difference in walking towards a chihuahua and walking towards a doberman. I have had all sorts of animals so I know what i am talking about. It’s not a problem if a chihuahua breaks loose but it is a huge problem if a big dog breaks loose.",
         "What of English is this lmao",
         "Humans have free will. Everything else you said is a lie",
         "If only there was some sort of vaccine for rabies... Then we could have dogs as pets too! That would be fun.",
         "A chihuahua can fuck up any child or infant. If the logic is based on size and possibility of damage they can cause, then every dog is a liability and we shouldn’t be domesticating them. Are goldens notoriously sweet? Sure. Are there stories of them going sour? Absolutely. If I really wanted to eliminate my own bias of pitbulls, then I’d have to say nobody should have any form of dogs in the household including mine. Since I take years to train each of mine for trailing and overall obedience though, my bias gets in the way and will never agree that dogs shouldn’t be allowed based on these circumstances. Dogs can be broke in, even if they come broken. You seem like a good talk, but surely you can tell I’m on one now after coming into this thread and silencing everything from it. Bless",
         "What *kind of",
         "Did Peanut get vaccinated, no.  So what's your point?",
         "Lol. I believe you know what you’re doing with your dogs. But don’t overestimate other people because it seems like the majority can’t properly train their dogs. It makes sense not everyone knows how to train them well, it’s not as easy people think it is, you really have to know what you’re doing. I honestly believe you trained your dogs well. But in general i don’t think very highly of other dog owners because they just raise them like shit.",
         "Why are you so anti squirrel? Why is your heart filled with so much hate?",
         "Lol, such a non you made.  Now you're just being silly",
         "You made 3 nons"
      ]
   },
   "1gix44s": {
      "title": "Exclusive | Caretaker of Peanut the Squirrel reeling over five-hour raid of his house",
      "text": "",
      "comments": [
         "Just pointing out that he also has an Only Fans called Squirrel Daddy. What a guy!"
      ]
   },
   "1gipycx": {
      "title": "Iranian student at the University of Science and Research in Tehran protested today by taking off all her clothes in response to an attack by morality police. They had torn her clothes because she was not wearing Hijab. A martyr for liberty, RIP.",
      "text": "",
      "comments": [
         "An article attached to another post on a different sub said she was forcibly \"disappeared\".",
         "My guess is that’s the last we see of her",
         "Man that takes real balls",
         "This particular post doesn't make me want to go to war with Iran.  It makes me hopeful the men in the country will stand the fuck up.  My guess is a majority does not support the insanity.  I'm sure overall the people are more conservative than you find in the US, but hard pressed to believe most think women should not be seen or heard.",
         "This is why we need to stay the fuck out of places and let the people stand up and change their own countries to what they want.",
         "I'm an Iranian myself. It's absolutely crazy what they are doing. \n\nMy generation is becoming more radical due to this. They are becoming more and more authoritarian. \n\nAs you know, Iran is far from libertarianism and won't get there for decades to come. \n\nYou can guess how it is for libertarian like myself in a place like Iran. I just stopped caring. It's just a country I live in now. Not my country. It's a shitshow.",
         "Iran and Afghanistan and their severe hatred of women terrifies me\n\nthe US has its boatload of problems but at least im not fearing for my life because im not wearing a head scarf or because i laughed in public",
         "Hats off to this hero. More courage than many people.",
         "Brave girl. I wish I had 1/1000 of her courage",
         "What a fucked up culture they have.   A woman taking off her pants is basically a magical thing.  It’s what makes the damn earth spin on its axis.  \n\nAnd Iranian law enforcement is angry about it??\n\nBuncha weirdos.",
         "Sad. I'm old enough to remember when Iran was a tourist destination. Well-educated men and women going out and having a good time dancing, pools, and beaches. Beautiful hotels as well. You would actually think you were in the U.S. if you didnt know better.",
         "You are not properly covered.. tears clothes off. Makes sense. Poor woman.. Islamic tyranny.. I hope the Persians overthrow that regime",
         "if i didnt know any better i'd say iranian men may all be closeted homosexuals",
         "RIP legend, the world needs more you.",
         "Glory to our sister",
         "She's honestly brave af. They'll probably cut her head off.",
         "Replace the word Hijab with the word Mask and it would have fit where I live during the pandemic and beyond",
         "It's well known that the Iranian regime engages in these types of human rights violations. Why are the reddit bots on major subreddits pushing these posts now? Trying to propagandize the American public to support a war with Iran is the obvious conclusion",
         "Disgusting culture filled with disgusting men who get off by oppressing women\n\nTo hell with them all",
         "I wonder if liberals on American colleges would support her by striping naked?",
         "What a fucking shit hole country…",
         "And people are diehard for democracy. Democracy brought this to Iran.",
         "The video seems to show her being forced into a car at the end.",
         "Tragic but I thought the same thing",
         "I was just going to say that. Most people don’t have a quarter of the courage to do something like that.",
         "Your guess might be wrong unfortunately. There is a surprising amount of citizen support (to those in the west) for Sharia law throughout the Middle East, but especially in Iran.",
         "Iran might’ve turned this direction anyway, but US meddling in Iran since the 50’s has greatly accelerated it’s decent into a theocracy.",
         "What is it like living in Iran? Do you feel like a subject of the state or do you still have your freedoms, other than internet / religious law etc?",
         "What generation are you in? What do you mean by your generation is becoming more authoritarian?\n\nاز این جهت میپرسم چون خودمم ایرانیم.",
         "Unfortunately much of the world has stopped caring about their countries. I hope you find a way out or a way to change Iran for the better.\n\nI blame ‘ol peanut man Jimmy Carter for this shit in Iran",
         "That is certainly not true. ",
         "Eyeopening.",
         "I don't need to engage in conspiracy to highlight a human rights abuse and someone pushing back against morally morality police.",
         "100%. Not to mention Iran was very progressive for a ME country until we forced a regime change.",
         "Democracy is particularly harmful to liberty in Muslim countries where the legacy of Islamic belief ensures that theocrats will come to power and repress the population through voting, and will support both terrorism and islamo-nationalism with an eye towards the eventual global domination of Islam over the entire planet. That's a threat to everyone, though it seems to be contained for now. \n\nSome sci-fi stories imagine a future where Islam rules the planet and has destroyed everything else, that's pretty dark.",
         "But they loudly insist they would! It's far more typically the quiet ones that get pushed too far that change things.",
         "It might be, but I imagine it would be hard to get honest numbers as well.",
         "Whenever someone talks about sharia law, I immediately know they don’t have a clue what they’re talking about.",
         "The short answer would be OK to bad.\n\nLong answers are more complicated, as long as someone supports the government, does what they are told, they'll be supported by money. Future for them and their children. \n\nThe ones that don't are divided between two kinds of people are people like the woman above in the video. Or the second group are people like myself, trying to keep out of the eyes of the government and people to live their life in the most peace they can. \n\nAs long as people say they are Muslim and follow the Sharia low, the government won't bother them that much in day to day life. Obviously, and unfortunately, it's easier for men to do that compared to women. \n\nSocially, the government is a big bully and a big propaganda state. Men have forced conscription lows. Universities and schools are increasingly becoming public and government owned. Cinemas do still work, but they have to follow most if not all of sharia low. Unfortunately, they only way people think they can fix this mess is by another centralised state to do so. Lol, they want the kind of Iran (son of Shah) back. Which I absolutely disagree with. But I'm just one man. \n\nEconomically, we are like Germany in the late 1920s and early 1930s. We do have the culture and foundations to improve far beyond the current state, but too ravaged by trade embargos and government stupidity. State controlled free market, next to no capitalism. There is no space for private businesses to take over and acutely get things done.\n\n1 US dollar is 70 tomans in Iran. It's like saying 1 Yuan is 70 dollars. And then imagine china owning the world (for Irans case, it would be the US). Everything is expensive. No buying power. It has been estimated that it would take two people a century of 9 to 5 jobs and no spending to be able to buy a house now.",
         "سلام.\n\n\nI mean Generation Z in Iran. They are increasingly supporting governments to help them. \n\nThey want a government to force reforms. They are becoming increasingly far left or far right. Pan Iranism is a good example. Or the Tudeh party.",
         "Thanks, there is no way of fixing this. Iran either breaks down and becomes a fragmented state or another authoritarian government like the son of shah comes around. No acutel Republic to support individual freedom. \n\nI personally don't know what happened or who did it  back in 79. But I blame the people of Iran the most. They could've brought an acutel Republic after the revolution.",
         "I live in NYC, it was definitely true.",
         "Maybe if he lived in China...",
         "It's not as much of a conspiracy when it's well known that there are political and state actors that use bots to push narratives on reddit. \n\nIf you were highlighting how terrible Sadam Husseins human rights abuses in the year 2002, you would be 100% correct from a libertarian perspective. You'd also be amplifying war propaganda. Doesn't have to be an either/or",
         "Pew research did a decent study about 10 years ago. Something like 80% favoring sharia law.",
         "That's an odd thing to say",
         "A video is as close to truth as we can get, absent manipulation of context, which does not seem to have occurred in this case.\n\nSo where is the propaganda, and why focus on those who would try to use this video that way when I, a libertarian, am using it to highlight the libertarian case for individual choice and freedom.",
         "I just wonder how accurately people answer research questions when living under an oppressive regime.  I am not questioning that those statistics exist, just if they can really be accurate.",
         "Wasn’t that in Michigan lol",
         "I think the post is 100% truthful, and your posting it here makes a coherent and consistent point about the abuses of the state and the Iranian regime in particular. \n\nHowever, it was also was posted in November of 2024, at a time when many in the US government and foreign policy establishment want to go to war with Iran. Who do you think benefits from social media posts that turn US public opinion against Iran? The people who want war with them of course. \n\nThat's the quandary, because again the point you're trying to make is completely correct. It unfortunately just benefits the war propagandists at the same time. Propaganda isn't always lies, in fact some of the best propaganda is strongly based in the truth. Iran is a very easy target for war propaganda because their regime commits many atrocities like the one highlighted in this video. Even so, it's no coincidence that these videos are coming out now, and the deserved criticism towards Iran has the side effect of conditioning the public into supporting war.",
         "No doubt, fair question. There's bound to be SOME fear driven skew towards the regime.",
         "My position is, we can't refuse to tell the truth because it might help the case for war. And this sub is the last place anyone's trying to propagandize into war. You'd be better off making that statement in the sub that this was cross posted from. \n\nIf the context was wrong I'd pull the post.",
         "> My position is, we can't refuse to tell the truth because it might help the case for war.\n\nSure, and I wouldn't advocate lying and saying that Iran is a libertarian country or anything like that. But outrage is a finite resource. Surely in November of 2024, there should be more libertarian energy towards calling out US attempts to start another war than calling out the same old Iranian morality police abuses no? Particularly when the people who support the former suddenly think it's very important to talk about the latter?\n\n\n> And this sub is the last place anyone's trying to propagandize into war. You'd be better off making that statement in the sub that this was cross posted from. \n\nEh it's reddit. Most of the main subs are a lost cause, and even the libertarian subs can only do so much to counter the influence operations. And while this subreddit has vastly improved under your watch, I think even you'd acknowledge there's plenty of non-libertarians here right? Sometimes the obvious libertarian point does need to be said, particularly when it comes to foreign policy given reddit's bias towards neoliberalism."
      ]
   },
   "1gio7h2": {
      "title": "Used to be ",
      "text": "",
      "comments": [
         "Not to be a buzz-kill but that painting depicts the opposite of what you're trying to convey. It's the British burning the white house in the war of 1812. That's the imperialist superpower government attacking the heart of a freedom loving minarchist republic.",
         "When Americans have had enough, they will rebel again. I hope I never get to see it full fledged….",
         "No, the gov never was. Governments by definition are parasites who feed upon the people's liberty.",
         "Well I for one am glad that we redefined \"people\" to include women and minorities, and that thanks to the ACLU we actually hold cops accountable to rules and can prosecute them for crimes, unlike the 1980's and 1990's and one or two centuries prior to that...so it's not all bad!",
         "I know what the painting is, but I didn’t feel like using a photo of the actual White House burning.",
         "The definition of government is: \n\nThe act or process of governing, especially the control and administration of public policy in a political unit\n\n#”Control”"
      ]
   },
   "1gjrloh": {
      "title": "Write-In Candidates for 2024",
      "text": "Does anyone know where to find write-in candidates for other positions besides president/vice? I am in NY, where even Chase and Mike are write-ins. If not I'll push Satoshi Nakamoto and Mick Mouse.",
      "comments": [
         " Real talk, if your write-in isn’t real, it’s a waste of a vote.",
         "I know this isn't answering your question, but it's absolutely fucked that candidates showing on the ballot is so inconsistent.\n\nLike, wow, I voted for a candidate that might not even show up in another state. Ridiculous.",
         "In NY - you can write in ANY candidate for any office except for President.   President has a small list that NY state has accepted for write-ind for president. The list does not include RFK Jr.  If you vote for anyone outside the list, the vote is made to be “VOID”.",
         "Harambe is real, I will vote for him, you can't gaslight me",
         "It's not a waste of a vote, it's an abstention.",
         "Asking for real names here",
         "Yah ballot access is extra tough here and got worse recently. They are only missing from four states at least.",
         "This I get. Just having a bit of trouble finding the names of candidates that want the job, outside of president.",
         "I do not believe any main party is running for US Senate seat.  The Green party and the Libertarians do not have a candidate for US Senate.  Working Families, Independence party, Conservative Party are largely just shell parties and rarely run their own candidate.   I can’t help with other local elections in your party of the state."
      ]
   },
   "1gj56oc": {
      "title": "The Federal Reserve and the Regime Are One and the Same",
      "text": "",
      "comments": []
   },
   "1giwmw1": {
      "title": "🌺🤙🏻🌺 glorious ",
      "text": "",
      "comments": [
         "Our conflict will always and forever be with those who force others.\n\nWe don't hate communism enough",
         "Just love the money communists pump into the Republican Party though!",
         "So we force our ideas+$+ mega military complex to counter them ? 🤔"
      ]
   },
   "1gjizgu": {
      "title": "The 'Will of the People' Post-Election Horror Show",
      "text": "",
      "comments": []
   },
   "1gj7a17": {
      "title": "Soviet Russia’s Merciless War for Grain",
      "text": "",
      "comments": []
   },
   "1gj56fu": {
      "title": "America Can’t Afford Global Hegemony",
      "text": "",
      "comments": []
   },
   "1gifyzh": {
      "title": "Send your kids to the tax slave farm so they can explain it to you.",
      "text": "",
      "comments": [
         "$8,000??? Wtf",
         "Normal Person: It's wild how high this tax is.\n\nReddit: LOL this person doesn't understand how taxes work!",
         "I love that people automatically assume that the government is just there to help you with every step of your life from cradle to dirt nap.",
         "You pay if you have no kids in school, send to private school, or never had kids...",
         "I am constantly in awe of how the statist thought processes works. They will demand your money, say its for a government service, provide you with a piss poor service, and act like you are the idiot for declining the service and asking for your money back.\n\nFriedman nailed it. When you have kids in school, you should get a \"voucher\" for the value of the funding your child would receive from going to public school. You can then use that funding towards whatever education you want for your child. This creates an incentive for public schools to not be trash and allows private schools to have access to kids who otherwise wouldn't have been able to afford their services. Easy as piss.\n\nTry explaining that to a statist, and they will unironically call you an alt right nazi and a conspiracy theorist.",
         "Damn, that would almost cover 2 of my kids' private school tuitions.",
         "What area and how much is your house worth?",
         "Damn, I get mad paying $600 a year. My mom pays 5k and has half the land I do, but she gets the “privilege” of living in California.",
         "Where is this?  I've never seen a school tax bill in my life.  Is it not just taken from the income/property taxes?",
         "Not to mention comprehensive homeschool curriculums can be pricey",
         "As if they would explain how public school is funded by the taxpayers at school. You might actually make some young libertarians that way.",
         "Now imagine not having kids while some section 8 lady has 4 and doesn’t pay a dime in taxes.",
         "Everyone benefits from living in an educated society, even people (such as myself) who didn't have children",
         "Go to \"real\" schools? You mean the ones who don't teach classes and society just expects you to understand them?",
         "I found it weird that our homeschool curriculum was not tax deductible either",
         "Luckily I'd have to be making $800k/year to pay that insane amount of school taxes",
         "Lol $8,000 per year.. I wish.",
         "Yeah it's not like your way of life is entirely dependent on having an educated society to support it.",
         "Yup! Every year except I’ve never had any kids.",
         "I'm a single childless homebody who lives within 2 miles of work, do I even want to know how much money I pay for public services I don't use or benefit from?",
         "Anyone know of any countries without public education that they would actually want to live in?",
         "BuT pUbLiC sChOoL iS fReE?!",
         "Everyone is arguing about public vs homeschooling...\n\nBut were any of you taught taxes in Middle school? Highschool?",
         "School taxable \"value\"",
         "It’s the same as “free” healthcare. You have your own private health insurance yet you have to contribute to everyone else’s",
         "Who else do you expect to pay for hiring all the ESL teachers to teach the kids who don’t speak English?",
         "Kinda wild how my taxes fund the school system when I’ve been out of school for 4 years and never plan on going back",
         "Why are y’all complaining about this? School tax funding is about the most localized form of government tax possible, it’s barely a step above an HOA. I thought the whole point of small government is you could move if you didn’t like it, and school taxes don’t even require you to move to a different city, just a different neighborhood. \n\nIf you wanna live in a neighborhood with good schools, then you gotta pay. If you don’t, there are plenty of nice neighborhoods with shitty school districts out there. There’s even a bonus, you don’t need to compete against the parents when it comes to pricing.",
         "We should abolish public schooling, and go back to a system where kids can go to the best school their parents can afford.\n\nIf cost is an issue, maybe we could consider some sort of a summer work-schooling program to help the kids pay it off. They could be assigned jobs of some sort starting as soon as the first grade, which would let them get appreciation for the workforce as well.",
         "Kamala would jail mothers for their kids being truant, don’t be surprised if more shit like this happens.",
         "Yea! Where are you living!?",
         "I’d love $8K. We are at $17K for our town, 70% of which goes to schools and the rest to police, fire, parks and roads, and town admin. New England.",
         "I have a $275000 house in a small town in Ohio and my property taxes are $5,200.",
         "I'd love $8k! Ours are $12k in north of Dallas, and that's down from $14k before the homestead exemption was increased from $40k to $100k.",
         "I mean, I'm paying close to 6000... with no kids in school. Fuck that shit.",
         "I was over 8K in nJ before I left.",
         "Ironic since this post is on Reddit but I'm guessing ur talking about the leftard part of it.",
         "Yeah, I was this on \"murdered by words\". They thought the comeback was so clever",
         "People love getting free stuff. As long as they think other people are paying the taxes for it, people will continue to support big government programs.",
         "\"Whenever the people are well-informed, they can be trusted with their own government.\" -Thomas Jefferson\n\nOr in other words you still derive benefits from living in an educated citizenry even if you personally do not have kids.",
         "It’s almost like they don’t care and just continue to treat citizens like a giant piggy bank for their friends, illegal immigrants, and foreign nations. Americans are the world’s piggy bank essential haha",
         "I'm honestly surprised this isn't everywhere, but it should be everywhere if it isn't; that you do get a tax credit if you homeschool exactly because so much of your taxes go toward education.  This would be like paying for any other municipal service, like garbage pickup, emergency services, etc., when you do not receive any of these services.\n\nOh, statists will argue that you're just paying your fair share of what benefits society as a whole, but if a parent does the same work as the entire public school system, should they really have to pay almost, and in some states way over, ten grand for doing the work themselves?\n\nI grew up in a state with a higher cost of living, and went to a private high school, and my parents got a tax credit for that because I wasn't using the public school system.  Back then private school was a tiny fraction of what it costs now, and it was still a lot, and it would have been almost impossible if they had to pay for it and a seat in public school that I wasn't using.",
         "I like vouchers but it still isn't as good as abolishing the dept of education. Your dollars are still being forced to go to education and will drive up costs just like any tax credit does.",
         "Competition between schools to be 1) Better, 2) More efficient, 3) Competitive between their neighboring school districts, 4) Offering better services/curriculum/programs to recruit and retain students?\n\nThat could never work. We all know that public schools need to have as little oversight as possible and to do what they want with the open checkbook we give them. They know what's best for us and our kids. We can't have competition in value that forces them to be fiscally and operationally responsible!\n\n*Edit... Wow, didnt think I'd need to add that this is sarcasm. I figured it was pretty obvious.",
         "Damn what kinda private school is only $8k a year? Cheapest I’ve found around me is $29k.",
         "And your private school probably produces 75+ percentile scores. Instead of these $16,000 per kid government schools who don’t teach anything",
         "Ours are broken down so you know what each entity is taking.",
         "In NYS there are \"school districts\" which are its own form of government. Typically school taxes wind up being about 2-5x your local government taxes. It's legit keeping my family from affording a home, and we're making $200K+ a year.",
         "Same, our tax bill shows the line items but it's not a separate bill in itself.",
         "As if? Are you saying they don’t teach this in school?\n\nIdk where you went but not explaining the tax system seems pretty ludicrous to me. We even had required government/economics classes.",
         "Funding public education is a net benefit for everyone even if you don’t have kids.",
         "I agree. Theres also various areas within NY that have a lower tax cap. Sure itd be ideal to not spend money, but imo this is why you learn more about the area before you buy a house.\n\nThis person complaining has 2 houses and they’re both in expensive school districts. I feel this is more of a failure of learning how those districts are getting taxed.",
         "This is probably related to property taxes rather than income. So yeah if you own an expensive house you gotta pay to play in the neighborhood.",
         "Yea I would really like the full context on this. An $8k property tax bill on an 800k house: Not bad at all. An $8k property tax on a $200k house: Pretty steep. \n\nWhich state is this in? One with low income tax? If so then this is peanuts. So much left out of this ragebait post.",
         "Yea but it was an elective",
         "Oh I didn't realize we had an official language here.",
         "Yeah that's the neat part of being in a society where the people before you built the school you attended when they weren't going there.",
         "before i left chicago my property tax went up to 19,500. I lived in a tiny suburb called northfield.",
         "They're in NY state somewhere because the STAR program mentioned there is new York.",
         "About the same here on Long Island",
         "Just my city sewer was 3k in an expensive town in CT.",
         "Yeah, he’s talking about the 99% of Reddit you might call Leftard. The type of redditor who is proud to pay as much tax as possible",
         "A government that robs Peter to pay Paul will always have the support of Paul.",
         "Most public schools are just glorified day care centers.",
         "If only public schools were worth a shit.",
         "The sole benefit in this instance being people are educated enough to want low to no taxes, and a minimal to non existent government. Unfortunately, being 'educated' at this point in history also tends to go hand in hand with not being 'well-informed' in ways that I would trust others with a government that is shared with me.",
         "That's an excuse for all kinds of rights violations",
         "This is something i dont agree with. Im happy to accept that i may be wrong, but i think raising the floor for all children is worth the inefficiency.\n\nIn my mind, it's better for a child to have access to sub-par schooling rather than no schooling at all. It's an \"ounce of prevention is worth a pound of cure\" argument to me.\n\nI will happily pay taxes to guarantee that low income kids or kids from familys that are indifferent to their success have at least a shot at bettering themselves. I think society as a whole (and therefore me individually) benefits from this.",
         "It's about $5k per kid plus I get to pay around $6k in property tax.  I'm sure it's more expensive elsewhere.  $29k for 12 years isn't happening...",
         "How's that factor into the total tax rate there?",
         "Omaha Public Schools, I went to a high school that had school shootings before it was cool, because they were all gang related no one cares. Still happens there every few years. Economics yes, but it wasn't required, government yes, I think it was required, but it wasn't called that. Something else, and no, I don't think we ever covered the tax system.",
         "That’s highly debatable. It’s incredibly had to build if there isn’t a solid foundation at home.",
         "My school district does an income tax, property taxes go to roads, police, fire, etc",
         "We pay 4.2% of our home's assessed value in taxes every year. Of that, 80% goes to our grade school and high school districts.\n\nI pay almost 13k and I paid 210k for my house 6 yrs ago that magically is worth 295k today. We had a 15% assessed \"value\" increase this year, and 22% last year.\n\nIt's getting ridiculous.",
         "This also looks like its only their school tax bill. My school taxes are my highest property tax, but only about half of my property taxes.",
         "You know that’s not the point. Let’s not be disingenuous here.",
         "Public schools are doo doo. Teacher salaries are horrible, student to teacher ratio doesn’t help, teachers are paying out of pocket to supply their classrooms sometimes (honestly more than once is too much).\nBut yes I’m so glad people in our society are forced to pay for this shit deal… like the people before us haha\n\nAdvocating for taxes? Are you in the right place or has this place just become more mind numbingly demorats?",
         "\\*Built with the money our parents paid because they made the choice to have a child and are the rightful bearers of the expenses for that child.",
         "If I had a choice, I would have dropped out and started working full time at 15.",
         "Wow! Thats a whole other home mortgage right there!",
         "Not sure if they're broke and bitter at people doing better financially or if they genuinely believe their ideal utopia can be accomplished by funding an already bloated government",
         "Proud to make others pay as much tax as possible*",
         "And the hatred of Peter! Unless, he can be kept convinced that he's not being robbed, because it's for a good cause...",
         "Because many lack proper funding.",
         "https://preview.redd.it/9kqcbn9shryd1.jpeg?width=1178&format=pjpg&auto=webp&s=0b680c14794c7c7d940deeef8abb5b68f85d7311\n\nThis is a random single family residential address from my town.",
         "Interesting. Well I was in school after school shootings were cool and we went over tax system in a required class. Also, I just think I’d be hard pressed to find anyone that doesn’t know that schools are funded by taxpayer money.",
         "That’s true",
         "Interesting, so it’s tied to your address but uses your income? Which state do you live in? I’ve only paid it in Texas where it’s tied to property valuation, but property valuation in itself is inversely tied to wealth there so it’s extra dumb.",
         "Our municipality functions on 1500/yr from my house in taxes. That's police, fire, public works, & Park district combined. Our schools make up almost all of the rest. (Minus the library district, the community college, the pension funds, the forest preserve district, the county government, and the other various 6700 layers of government in IL (I think we only have 13 where I live that all have their own taxing authority not affected by others)",
         "The point is you're complaining about people not speaking YOUR language. If you want to be against publicly funded schools at least make a valid argument against them.",
         "I'm not advocating for taxes, I'm just saying public schools are completely reasonable.",
         "How do you make it through the day?",
         "Well Northfield is a really nice part of chicago land. 1 bed 1 bath condos are worth like 350k there. And houses start at like half a million but most of them are $1 million-$3 million",
         "It's the former. When Obama was asked if he was going to raise taxes on the rich even if it leads to a reduction in tax revenues, he said yes because it would be more fair. This single sentence sums up the entire ideology of the progressive left, pure envy and pettiness.",
         "More like they think taking a tax break is morally reprehensible",
         "Yeah that's the issue.",
         "Get outta here ya statist!",
         "That's insane.  That's double what I pay in California on a 650k home.",
         "I mean, I do know that, but I don't believe I was taught that. I know for sure I had to figure out how the tax withholding/ refund system actually worked on my own later in life.",
         "Yeah 1% income to school district. No city or village income taxes otherwise",
         "i bought that house for 300k it wasnt no half million. but few years the taxes get re-assessed higher. lierally started at 6k a year, then went up and up till it got to 20. thats fucking insane.",
         "Still can’t believe that was his actual answer",
         "Yep. Unfortunately I'm married to my job here for at least 10 years, so I need to stay."
      ]
   },
   "1gj57jb": {
      "title": "Gitmo and Politics",
      "text": "",
      "comments": []
   },
   "1giftul": {
      "title": "“Those who produce nothing” = socialists ",
      "text": "",
      "comments": [
         "Reality check indeed",
         "...shes talking about politicians."
      ]
   },
   "1giv3jz": {
      "title": "Moldovan diaspora votes disproportionately pro-West. Today Russia calls in bomb threats to 4 overseas voting stations.",
      "text": "",
      "comments": []
   },
   "1gj587l": {
      "title": "Eliminating the Filibuster and the Problem with Democracy",
      "text": "",
      "comments": [
         "Democracy is tyranny of the majority. Read Hoppes [Democracy: The God That Failed](https://www.riosmauricio.com/wp-content/uploads/2013/04/Hoppe_Democracy_The_God_That_Failed.pdf), or other works by libertarians such as [Rothbard](https://mises.org/library/book/anatomy-state), [Spooner](https://oll-resources.s3.us-east-2.amazonaws.com/oll3/store/titles/2194/Spooner_1485_Bk.pdf), or [Hoppe](https://www.youtube.com/watch?v=qrl8YorTa1U) to learn about why so many libertarians [oppose democracy](https://www.youtube.com/watch?v=qrl8YorTa1U). Also check out r/EndDemocracy\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
         "How"
      ]
   },
   "1gjnrpi": {
      "title": "Reject Real ID, Avoid QR Codes",
      "text": "",
      "comments": [
         "How about we live in the real world and try to slowly shift people towards our views by compromising and acting normally?",
         "There are states where RealID is the *only* form of driver's license you can obtain, and thus, anyone who moves there, or has to renew every five years or so, automatically gets one.",
         "Avoid QR codes?",
         "Can you at least give us the tl;Dr. I'm not scrolling through that weird ass site.",
         "Did his answer satisfy and lingering curiosity of what kind of person he is? ",
         "Good luck with your life in the biometric control grid",
         "Yea unfortunately true, but that’s the minority of states",
         "Easily hacked and control your phone. Video discusses in the second half",
         "Lol i mean idk why i try",
         "I’ve written code many times that does QR codes and have a background in programming and security research.  QR codes don’t control your phone, they are a way of storing information. Anything they can do is written into the phone’s OS.",
         "When i say “control your phone” i mean the qr code presents a set of commands to your phone that you do not control once you scan the qr",
         "It doesn’t control your phone any more than a URI and link does.\n\nQR codes don’t contain commands they contain information.  The operating system and apps on your phone decide what to do with that information."
      ]
   },
   "1gi84qc": {
      "title": "My finger hurts from liking all the Ron Paul posts, so…KEEP THEM COMING!",
      "text": "",
      "comments": [
         "Lieve in Dom",
         "Scam post, don't click the links.",
         "He said that Trump should have been impeached lol did all of you forget that",
         "[removed]",
         "[removed]",
         "are you stupid where the scam?",
         ">account for 9 years\n\n>activated last month\n\nYeah, sure thing bud.",
         "[deleted]",
         "Lol you got called out in the NY Mets sub, too.",
         "Why are all your posts tagged brand affiliate?"
      ]
   }
}